
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ГиперссылкаURL.Заголовок = Запись.БазовыйURL + Запись.ОтносительныйURL;
	МобильноеУстройство = ПланыОбмена.SUI_МобильныеУстройства.НайтиПоКоду(Запись.ИдентификаторУстройства);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГиперссылкаURLНажатие(Элемент)
	ЗапуститьПриложение(Элемент.Заголовок);
КонецПроцедуры


&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.СтраницаЗапрос Тогда
		ОткрытьРедакторJSON(НСтр("ru = 'Запрос'"), Запись.ДанныеЗапроса);
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаОтвет Тогда
		ОткрытьРедакторJSON(НСтр("ru = 'Ответ'"), Запись.ДанныеОтвета);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьРедакторJSON(ЗаголовокРедактора, СтрокаJSON)
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("Заголовок", ЗаголовокРедактора);
	ПараметрыОткрытия.Вставить("СтрокаJSON", СтрокаJSON);
	ПараметрыОткрытия.Вставить("РежимПросмотраПриОткрытии", Истина);
	
	Оповещение = Новый ОписаниеОповещения("ОткрытьРедакторJSONЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Обработка.SUI_РедакторJSON.Форма", ПараметрыОткрытия, ЭтотОбъект, УникальныйИдентификатор, Окно, , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРедакторJSONЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОсновнаяИнформация;
	
КонецПроцедуры

#КонецОбласти
