
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ГиперссылкаURL.Заголовок = Запись.БазовыйURL + Запись.ОтносительныйURL;
	МобильноеУстройство = ПланыОбмена.SUI_МобильныеУстройства.НайтиПоКоду(Запись.ИдентификаторУстройства);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Отказ Или ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если Окно.Содержимое.Количество() > 1 Тогда
		Окно.Содержимое[Окно.Содержимое.ВГраница()].Закрыть();
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГиперссылкаURLНажатие(Элемент)
	ЗапуститьПриложение(Элемент.Заголовок);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказатьДанные(Команда)
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("Заголовок",
		СтрШаблон("%1 %2 %3 (%4)", Запись.КодСостояния, Запись.Метод, Запись.ОтносительныйURL, Запись.Период));
	ПараметрыОткрытия.Вставить("РежимПросмотраПриОткрытии", Истина);
	ПараметрыОткрытия.Вставить("СтрокиJSON", Новый СписокЗначений());
	
	ПараметрыОткрытия.СтрокиJSON.Добавить(Запись.ДанныеЗапроса, НСтр("ru = 'Запрос'"));
	ПараметрыОткрытия.СтрокиJSON.Добавить(Запись.ДанныеОтвета, НСтр("ru = 'Ответ'"));
	
	#Если ВебКлиент Тогда
		ОткрытьФорму("Обработка.SUI_РедакторJSON.Форма", ПараметрыОткрытия, ЭтотОбъект, УникальныйИдентификатор, , , , 
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	#Иначе
		ОткрытьФорму("Обработка.SUI_РедакторJSON.Форма", ПараметрыОткрытия, ЭтотОбъект, УникальныйИдентификатор, Окно);
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти
