
#Область ПрограммныйИнтерфейс

//Определяет является ли штрихкод внутренним штрих-кодом EAN.
//
//Параметры:
//   Штрихкод - Строка - штрихкод в формате EAN, GTIN или код маркировки.
//
//Возвращаемое значение:
//   Булево - Истина, если штрихкод является внутренним.
Функция ЭтоВнутреннийШтрихкод(Штрихкод) Экспорт
	
	Если СтрДлина(Штрихкод) = 13 Тогда
		Возврат Лев(Штрихкод, 1) = "2"; // Штрихкод EAN.
	ИначеЕсли СтрДлина(Штрихкод) = 14 Тогда
		Возврат Лев(Штрихкод, 2) = "02"; // Штрихкод GTIN.
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Функция определяет тип штрихкода по значение кода.
// 
// Параметры:
//  Штрихкод - Строка - значение штрихкода.
//
// Возвращаемое значение:
//  Строка.
//
Функция ОпределитьТипШтрихкода(Знач Штрихкод) Экспорт
	
	ТипШтрихкодаЗнач = "";	
	ДлинаШтрихкода = СтрДлина(Штрихкод);
	
	Если ДлинаШтрихкода = 0 Тогда
		Возврат ТипШтрихкодаЗнач;
	КонецЕсли;
	
	Если ДлинаШтрихкода = 14 Тогда // ITF14
		
		Если РассчитатьКонтрольныйСимволGTIN14(Штрихкод) = Прав(Штрихкод, 1) Тогда
			ТипШтрихкодаЗнач = "ITF14";
 		КонецЕсли;
		
	ИначеЕсли ДлинаШтрихкода = 13 Тогда // EAN13
		
		Если РассчитатьКонтрольныйСимволGTIN13(Штрихкод) = Прав(Штрихкод, 1) Тогда
			ТипШтрихкодаЗнач = "EAN13";
		КонецЕсли;
		
	ИначеЕсли ДлинаШтрихкода = 8 Тогда // EAN8
		
		Если РассчитатьКонтрольныйСимволGTIN8(Штрихкод) = Прав(Штрихкод, 1) Тогда
			ТипШтрихкодаЗнач = "EAN8";
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипШтрихкодаЗнач= "" Тогда // CODE39
		
		CODE39 = Истина;
		Для Сч = 1 По ДлинаШтрихкода Цикл
			ВремКодСимвола = КодСимвола(Штрихкод, Сч);
			Если (ВремКодСимвола <> 32)
				И (ВремКодСимвола < 36 Или ВремКодСимвола > 37)
				И (ВремКодСимвола <> 43)
				И (ВремКодСимвола < 45 Или ВремКодСимвола > 57)
				И (ВремКодСимвола < 65 Или ВремКодСимвола > 90) Тогда
				CODE39 = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если CODE39 Тогда
			ТипШтрихкодаЗнач = "CODE39";
		КонецЕсли                                                     
		
	КонецЕсли;
	
	Если ТипШтрихкодаЗнач= ""  Тогда // CODE128
		// CODE128 символы ASCII от 0 до 127 (цифры от «0» до «9», буквы от «A» до «Z» и от «a» до «z») и специальные символы;
		CODE128 = Истина;
		Для Сч = 1 По ДлинаШтрихкода Цикл
			ВремКодСимвола = КодСимвола(Штрихкод, Сч);
			Если (ВремКодСимвола > 127) Тогда
				CODE128 = Ложь;
			Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если CODE128 Тогда
			ТипШтрихкодаЗнач = "CODE128";
		КонецЕсли                                                     
		
	КонецЕсли;
	
	Если ТипШтрихкодаЗнач = "CODE128"  Тогда // EAN128
		// В коде EAN128 регламентирован словарь CODE128 но регламентированы группы кодов, и возможны разделители GS.
		Если КодСимвола(Штрихкод, 1) = 40 Или СтрНайти(Штрихкод, РазделительGS1()) > 0  Тогда
			ТипШтрихкодаЗнач = "EAN128";
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТипШтрихкодаЗнач;
	
КонецФункции

// Base64 в штрихкод.
// 
// Параметры:
//  ШтрихкодВBase64 - Строка - Штрихкод в base64
// 
// Возвращаемое значение:
//  Строка - Base64 в штрихкод
Функция Base64ВШтрихкод(ШтрихкодВBase64) Экспорт
	
	Штрихкод = "";
	
	Если ЗначениеЗаполнено(ШтрихкодВBase64) Тогда
		
		ДвоичныеДанные = Base64Значение(ШтрихкодВBase64);
		Если ДвоичныеДанные = Неопределено Тогда
			Штрихкод = ШтрихкодВBase64;
		Иначе
			Штрихкод = ПолучитьСтрокуИзДвоичныхДанных(ДвоичныеДанные);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Штрихкод;
	
КонецФункции

// Штрихкод в base64.
// 
// Параметры:
//  Штрихкод - Строка - Штрихкод
// 
// Возвращаемое значение:
//  Строка - Штрихкод в base64
Функция ШтрихкодВBase64(Штрихкод) Экспорт
	
	ШтрихкодBase64 = "";
	
	Если ЗначениеЗаполнено(Штрихкод) Тогда
		
		ДвоичныеДанныеСтроки = ПолучитьДвоичныеДанныеИзСтроки(Штрихкод);
		ШтрихкодBase64 = Base64Строка(ДвоичныеДанныеСтроки);
		ШтрихкодBase64 = СтрЗаменить(ШтрихкодBase64, Символы.ПС, "");
		ШтрихкодBase64 = СтрЗаменить(ШтрихкодBase64, Символы.ВК, "");
		
	КонецЕсли;
	
	Возврат ШтрихкодBase64; 
	
КонецФункции

// Расчет контрольной цифры для GTIN-14. 
//
// Параметры:
//  GTIN - Строка - Текстовая строка с GTIN-14. Может содержать числа от 0 до 9. 
// 
// Возвращаемое значение:
//  Число - Контрольный символ (число) рассчитанный по алгоритму для GTIN.
//
Функция РассчитатьКонтрольныйСимволGTIN14(Знач GTIN) Экспорт
	
	Сумма = 0;
	Коэффициент = 3;
	
	Для Сч = 1 По 13 Цикл
		ВремКодСимвола = КодСимвола(GTIN, Сч);
		Сумма  = Сумма + Коэффициент * (ВремКодСимвола - 48);
		Коэффициент = 4 - Коэффициент;
	КонецЦикла;
	Сумма = (10 - Сумма % 10) % 10;
	КонтрольныйСимвол = Символ(Сумма + 48);
	
	Возврат КонтрольныйСимвол;
	
КонецФункции

// Расчет контрольной цифры для GTIN-8. 
//
// Параметры:
//  GTIN - Строка - Текстовая строка с GTIN-8. Может содержать числа от 0 до 9. 
// 
// Возвращаемое значение:
//  Число - Контрольный символ (число) рассчитанный по алгоритму для GTIN.
//
Функция РассчитатьКонтрольныйСимволGTIN8(Знач GTIN) Экспорт
	
	Сумма = 0;
	Коэффициент = 3;
	
	Для Сч = 1 По 7 Цикл
		ВремКодСимвола = КодСимвола(GTIN, Сч);
		Сумма  = Сумма + Коэффициент * (ВремКодСимвола - 48);
		Коэффициент = 4 - Коэффициент;
	КонецЦикла;
	Сумма = (10 - Сумма % 10) % 10;
	КонтрольныйСимвол = Символ(Сумма + 48);
	
	Возврат КонтрольныйСимвол;
	
КонецФункции

// Расчет контрольной цифры для GTIN-13. 
//
// Параметры:
//  GTIN - Строка -Текстовая строка с GTIN-13. Может содержать числа от 0 до 9.
// 
// Возвращаемое значение:
//  Число - Контрольный символ (число) рассчитанный по алгоритму для GTIN.
//
Функция РассчитатьКонтрольныйСимволGTIN13(Знач GTIN) Экспорт
	
	Сумма = 0;
	Коэффициент = 1;
	
	Для Сч = 1 По 12 Цикл
		ВремКодСимвола = КодСимвола(GTIN, Сч);
		Сумма  = Сумма + Коэффициент * (ВремКодСимвола - 48);
		Коэффициент = 4 - Коэффициент;
	КонецЦикла;
	Сумма = (10 - Сумма % 10) % 10;
	КонтрольныйСимвол = Символ(Сумма + 48);
	
	Возврат КонтрольныйСимвол;
	
КонецФункции

// Функция возвращает разделитель GS1.
//
// Возвращаемое значение:
//  Строка.
//
Функция РазделительGS1() Экспорт
	
	Возврат Символ(29); // Dec 29
	
КонецФункции

Функция ЭтоШтрихкодКМ(Знач Штрихкод) Экспорт
	
	Штрихкод = ОбщегоНазначенияКлиентСервер.УдалитьНедопустимыеСимволыXML(Штрихкод);
	Штрихкод = СтрЗаменить(Штрихкод, " ", "");
	ДлинаШтрихкода = СтрДлина(Штрихкод);
	
	Если ДлинаШтрихкода > 23 И Лев(Штрихкод, 4) = "(01)" И Сред(Штрихкод, 19, 4) = "(21)" Тогда
		ШтрихкодСоСкобкой = Истина;
	ИначеЕсли ДлинаШтрихкода > 19 И Лев(Штрихкод, 2) = "01" И Сред(Штрихкод, 17, 2) = "21" Тогда
		ШтрихкодСоСкобкой = Ложь;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	GTIN = Сред(Штрихкод, ?(ШтрихкодСоСкобкой, 5, 3), 14);
	
	Для Позиция = 1 По СтрДлина(GTIN) Цикл
		
		ПроверяемыйКодСимвола = КодСимвола(GTIN, Позиция);
		
		Если (Позиция = 1 И ПроверяемыйКодСимвола <> 48) Или 
			ПроверяемыйКодСимвола < 48 Или ПроверяемыйКодСимвола > 57 Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ЭтоШтрихкодSSCC(Знач Штрихкод) Экспорт
	
	Штрихкод = ОбщегоНазначенияКлиентСервер.УдалитьНедопустимыеСимволыXML(Штрихкод);
	Штрихкод = СтрЗаменить(Штрихкод, " ", "");
	ДлинаШтрихкода = СтрДлина(Штрихкод);
	
	Если ДлинаШтрихкода = 20 И Лев(Штрихкод, 2) = "00" Тогда
		Штрихкод = Сред(Штрихкод, 3);
	ИначеЕсли ДлинаШтрихкода = 22 И Лев(Штрихкод, 4) = "(00)" Тогда
		Штрихкод = Сред(Штрихкод, 5);
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	Для Позиция = 1 По СтрДлина(Штрихкод) Цикл
		
		ПроверяемыйКодСимвола = КодСимвола(Штрихкод, Позиция);
		
		Если ПроверяемыйКодСимвола < 48 Или ПроверяемыйКодСимвола > 57 Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти
