
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьСписокУдалятьДокументыСоСтатусами(Объект) Экспорт
	
	СписокИзОбъекта = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(
		Объект.УдалятьДокументыСоСтатусамиСтрокой, ";", Истина, Истина);
	
	Список = Новый СписокЗначений();
	
	Список.Добавить("to_upload", "К выгрузке");
	Список.Добавить("to_processing", "К выполнению");
	Список.Добавить("uploaded", "Выгружен");
	Список.Добавить("is_completed", "Завершен");
	
	Для Каждого ЭлементСпискаИзОбъекта Из СписокИзОбъекта Цикл
		
		НайденноеЗначение = Список.НайтиПоЗначению(ЭлементСпискаИзОбъекта);
		
		Если НайденноеЗначение <> Неопределено Тогда
			НайденноеЗначение.Пометка = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Список;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
