
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура НазначитьОсновнойНастройкой(НастройкаСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НастройкаСсылка", НастройкаСсылка);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Ссылка
		|ИЗ
		|	Справочник.SUI_НастройкиМобильныхУстройств
		|ГДЕ
		|	Ссылка <> &НастройкаСсылка
		|	И ОсновнаяНастройка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Ссылка
		|ИЗ
		|	Справочник.SUI_НастройкиМобильныхУстройств
		|ГДЕ
		|	Ссылка = &НастройкаСсылка
		|	И ОсновнаяНастройка";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	НачатьТранзакцию();
	
	Попытка
		
		Если Не РезультатыЗапроса[0].Пустой() Тогда
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.SUI_НастройкиМобильныхУстройств");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = РезультатыЗапроса[0];
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Ссылка", "Ссылка");
			Блокировка.Заблокировать();
			
			Выборка = РезультатыЗапроса[0].Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				НастройкаОбъект = Выборка.Ссылка.ПолучитьОбъект();
				НастройкаОбъект.ОсновнаяНастройка = Ложь;
				НастройкаОбъект.ОбменДанными.Загрузка = Истина;
				НастройкаОбъект.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
				НастройкаОбъект.ОбменДанными.Получатели.Очистить();
				НастройкаОбъект.Записать();
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если РезультатыЗапроса[1].Пустой() Тогда
			
			НастройкаОбъект = НастройкаСсылка.ПолучитьОбъект();
			НастройкаОбъект.ОсновнаяНастройка = Истина;
			НастройкаОбъект.ОбменДанными.Загрузка = Истина;
			НастройкаОбъект.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
			НастройкаОбъект.ОбменДанными.Получатели.Очистить();
			НастройкаОбъект.Записать();
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Функция СформироватьДанныеДляВыгрузки(НастройкаСсылка) Экспорт
	
	Настройки = Новый Соответствие();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НастройкаСсылка", НастройкаСсылка);
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	*
		|ИЗ
		|	Справочник.SUI_НастройкиМобильныхУстройств
		|ГДЕ
		|	Ссылка = &НастройкаСсылка
		|	И НЕ ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		МакетНастройки = ПолучитьМакет("МакетНастройки");
		
		Для Каждого ОбластьМакетаНастройки Из МакетНастройки.Области Цикл
			
			Область = МакетНастройки.ПолучитьОбласть(ОбластьМакетаНастройки.Имя);
			
			ДанныеОбластиНастройки = Новый Соответствие();
			
			Для НомерСтроки = 1 По Область.ВысотаТаблицы Цикл
				
				КлючПараметраНастройки = Область.ПолучитьОбласть(СтрШаблон("R%1C1", НомерСтроки)).ТекущаяОбласть.Текст;
				
				Если ПустаяСтрока(КлючПараметраНастройки) Тогда
					Продолжить;
				КонецЕсли;
				
				КлючДанныхНастройки = Область.ПолучитьОбласть(СтрШаблон("R%1C2", НомерСтроки)).ТекущаяОбласть.Текст;
				
				Если ПустаяСтрока(КлючДанныхНастройки) Или 
					РезультатЗапроса.Колонки.Найти(КлючДанныхНастройки) = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				ДанныеОбластиНастройки.Вставить(КлючПараметраНастройки, Выборка[КлючДанныхНастройки]);
				
			КонецЦикла;
			
			Если ДанныеОбластиНастройки.Количество() > 0 Тогда
				Настройки.Вставить(ОбластьМакетаНастройки.Имя, ДанныеОбластиНастройки);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ?(Настройки.Количество() > 0, Настройки, Неопределено);
	
КонецФункции

Функция ПолучитьМобильныеУстройстваНастройки(НастройкаСсылка, ЗаполненоЕслиОсновная = Ложь) Экспорт
	
	ПривязанныеМобильныеУстройства = Новый Массив();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МобильныеУстройства.Ссылка КАК МобильноеУстройство
		|ИЗ
		|	Справочник.SUI_НастройкиМобильныхУстройств КАК НастройкиМобильныхУстройств
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланОбмена.SUI_МобильныеУстройства КАК МобильныеУстройства
		|		ПО НЕ МобильныеУстройства.ЭтотУзел
		|		И ВЫБОР
		|			КОГДА НастройкиМобильныхУстройств.ОсновнаяНастройка
		|				ТОГДА ВЫБОР
		|					КОГДА &ЗаполненоЕслиОсновная
		|						ТОГДА НастройкиМобильныхУстройств.Ссылка = МобильныеУстройства.Настройка
		|					ИНАЧЕ НастройкиМобильныхУстройств.Ссылка = МобильныеУстройства.Настройка
		|					ИЛИ МобильныеУстройства.Настройка = ЗНАЧЕНИЕ(Справочник.SUI_НастройкиМобильныхУстройств.ПустаяСсылка)
		|				КОНЕЦ
		|			ИНАЧЕ НастройкиМобильныхУстройств.Ссылка = МобильныеУстройства.Настройка
		|		КОНЕЦ
		|ГДЕ
		|	НастройкиМобильныхУстройств.Ссылка = &НастройкаСсылка";
	
	Запрос.УстановитьПараметр("НастройкаСсылка", НастройкаСсылка);
	Запрос.УстановитьПараметр("ЗаполненоЕслиОсновная", ЗаполненоЕслиОсновная);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ПривязанныеМобильныеУстройства = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("МобильноеУстройство");
	КонецЕсли;
	
	Возврат ПривязанныеМобильныеУстройства;
	
КонецФункции

Функция ЗарегистрироватьИзмененияНастройкиМобильногоУстройства(МобильноеУстройство) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	МобильныеУстройства.Ссылка КАК МобильноеУстройство,
		|	НастройкиМобильныхУстройств.Ссылка КАК НастройкаМобильногоУстройства
		|ИЗ
		|	ПланОбмена.SUI_МобильныеУстройства КАК МобильныеУстройства
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.SUI_НастройкиМобильныхУстройств КАК НастройкиМобильныхУстройств
		|		ПО ВЫБОР
		|			КОГДА МобильныеУстройства.Настройка = ЗНАЧЕНИЕ(Справочник.SUI_НастройкиМобильныхУстройств.ПустаяСсылка)
		|				ТОГДА НастройкиМобильныхУстройств.ОсновнаяНастройка
		|			ИНАЧЕ МобильныеУстройства.Настройка = НастройкиМобильныхУстройств.Ссылка
		|		КОНЕЦ
		|ГДЕ
		|	МобильныеУстройства.Ссылка = &МобильноеУстройство
		|	И НЕ МобильныеУстройства.ЭтотУзел
		|	И НЕ НастройкиМобильныхУстройств.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Ссылка
		|ИЗ
		|	Справочник.SUI_НастройкиМобильныхУстройств.Изменения
		|ГДЕ
		|	Узел = &МобильноеУстройство";
	
	Запрос.УстановитьПараметр("МобильноеУстройство", МобильноеУстройство);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	Если Не РезультатыЗапроса[1].Пустой() Тогда
		
		Выборка = РезультатыЗапроса[1].Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ПланыОбмена.УдалитьРегистрациюИзменений(МобильноеУстройство, Выборка.Ссылка);
		КонецЦикла;
		
	КонецЕсли;
	
	Если РезультатыЗапроса[0].Пустой() Тогда
		Возврат Ложь;
	Иначе
		
		Выборка = РезультатыЗапроса[0].Выбрать();
		Выборка.Следующий();
		
		ПланыОбмена.ЗарегистрироватьИзменения(Выборка.МобильноеУстройство, Выборка.НастройкаМобильногоУстройства);
		
		Возврат Истина;
		
	КонецЕсли;
			
КонецФункции

Функция ОсновнаяНастройкаСуществует(ИсключаемаяСсылка = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ИсключаемаяСсылка);
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Ссылка
		|ИЗ
		|	Справочник.SUI_НастройкиМобильныхУстройств
		|ГДЕ
		|	ОсновнаяНастройка
		|	И ВЫБОР
		|		КОГДА &Ссылка = НЕОПРЕДЕЛЕНО
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ Ссылка <> &Ссылка
		|	КОНЕЦ";
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия 			= "1.0.5.3";
	Обработчик.Процедура 		= "Справочники.SUI_НастройкиМобильныхУстройств.ИнициализироватьОсновнуюНастройку_1_0_5_3";
	Обработчик.РежимВыполнения 	= "Оперативно";
	Обработчик.Комментарий 		= НСтр("ru = 'Инициализация основной настройки мобильных устройств'");
	
КонецПроцедуры

Процедура ИнициализироватьОсновнуюНастройку_1_0_5_3() Экспорт
	
	Если ОсновнаяНастройкаСуществует() Тогда
		Возврат;
	КонецЕсли;
	
	НоваяНастройка = СоздатьЭлемент();
	НоваяНастройка.Наименование = НСтр("ru = 'Основная'");
	НоваяНастройка.Заполнить(Неопределено);
	
	Если НоваяНастройка.ПроверитьЗаполнение() Тогда
		НоваяНастройка.Записать();
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСписокУдалятьДокументыСоСтатусами(Объект) Экспорт
	
	СписокИзОбъекта = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(
		Объект.УдалятьДокументыСоСтатусамиСтрокой, ";", Истина, Истина);
	
	Список = Новый СписокЗначений();
	
	Список.Добавить("to_upload", "К выгрузке");
	Список.Добавить("to_processing", "К выполнению");
	Список.Добавить("uploaded", "Выгружен");
	Список.Добавить("is_completed", "Завершен");
	
	Для Каждого ЭлементСпискаИзОбъекта Из СписокИзОбъекта Цикл
		
		НайденноеЗначение = Список.НайтиПоЗначению(ЭлементСпискаИзОбъекта);
		
		Если НайденноеЗначение <> Неопределено Тогда
			НайденноеЗначение.Пометка = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Список;
	
КонецФункции

#КонецОбласти

#КонецЕсли
