
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура НазначитьОсновнойНастройкой(НастройкаСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НастройкаСсылка", НастройкаСсылка);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Ссылка
		|ИЗ
		|	Справочник.SUI_НастройкиМобильныхУстройств
		|ГДЕ
		|	Ссылка <> &НастройкаСсылка
		|	И ОсновнаяНастройка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Ссылка
		|ИЗ
		|	Справочник.SUI_НастройкиМобильныхУстройств
		|ГДЕ
		|	Ссылка = &НастройкаСсылка
		|	И ОсновнаяНастройка";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	НачатьТранзакцию();
	
	Попытка
		
		Если Не РезультатыЗапроса[0].Пустой() Тогда
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.SUI_НастройкиМобильныхУстройств");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = РезультатыЗапроса[0];
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Ссылка", "Ссылка");
			Блокировка.Заблокировать();
			
			Выборка = РезультатыЗапроса[0].Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				НастройкаОбъект = Выборка.Ссылка.ПолучитьОбъект();
				НастройкаОбъект.ОсновнаяНастройка = Ложь;
				НастройкаОбъект.ОбменДанными.Загрузка = Истина;
				НастройкаОбъект.Записать();
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если РезультатыЗапроса[1].Пустой() Тогда
			
			НастройкаОбъект = НастройкаСсылка.ПолучитьОбъект();
			НастройкаОбъект.ОсновнаяНастройка = Истина;
			НастройкаОбъект.ОбменДанными.Загрузка = Истина;
			НастройкаОбъект.Записать();
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Функция СформироватьНастройкиВJSON(НастройкаСсылка) Экспорт
	
	НастройкиВJSON = "";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НастройкаСсылка", НастройкаСсылка);
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	*
		|ИЗ
		|	Справочник.SUI_НастройкиМобильныхУстройств
		|ГДЕ
		|	Ссылка = &НастройкаСсылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		НастройкиПакет = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.mobile-settings.simple", "settings"));
		
		ЗаполнитьОбъектXDTOНастройкиРекурсивно(НастройкиПакет, Выборка, РезультатЗапроса.Колонки);
		
		НастройкиПакет.Проверить();
		
		ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(, Символы.Таб);
		
		ЗаписьJSON = Новый ЗаписьJSON();
		ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
		
		НастройкиПакет.Фабрика().ЗаписатьJSON(ЗаписьJSON, НастройкиПакет, НазначениеТипаXML.Неявное);
		
		НастройкиВJSON = ЗаписьJSON.Закрыть();
		
	КонецЕсли;
	
	Возврат НастройкиВJSON;
		
КонецФункции

Процедура ЗаполнитьОбъектXDTOНастройкиРекурсивно(ОбъектXDTO, Данные, КлючиДанных)
	
	Для Каждого СвойствоОбъектаXDTO Из ОбъектXDTO.Свойства() Цикл
		
		ТипЗначения = ТипЗнч(СвойствоОбъектаXDTO.Тип);
		
		Если ТипЗначения = Тип("ТипОбъектаXDTO") Тогда
			
			ОбъектXDTO[СвойствоОбъектаXDTO.Имя] = ФабрикаXDTO.Создать(СвойствоОбъектаXDTO.Тип);
			ЗаполнитьОбъектXDTOНастройкиРекурсивно(ОбъектXDTO[СвойствоОбъектаXDTO.Имя], Данные, КлючиДанных);
			ОбъектXDTO[СвойствоОбъектаXDTO.Имя].Проверить();
			
		ИначеЕсли ТипЗначения = Тип("ТипЗначенияXDTO") И
			КлючиДанных.Найти(СвойствоОбъектаXDTO.ЛокальноеИмя) <> Неопределено Тогда
			
			ОбъектXDTO[СвойствоОбъектаXDTO.Имя] = Данные[СвойствоОбъектаXDTO.ЛокальноеИмя];
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьСписокУдалятьДокументыСоСтатусами(Объект) Экспорт
	
	СписокИзОбъекта = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(
		Объект.УдалятьДокументыСоСтатусамиСтрокой, ";", Истина, Истина);
	
	Список = Новый СписокЗначений();
	
	Список.Добавить("to_upload", "К выгрузке");
	Список.Добавить("to_processing", "К выполнению");
	Список.Добавить("uploaded", "Выгружен");
	Список.Добавить("is_completed", "Завершен");
	
	Для Каждого ЭлементСпискаИзОбъекта Из СписокИзОбъекта Цикл
		
		НайденноеЗначение = Список.НайтиПоЗначению(ЭлементСпискаИзОбъекта);
		
		Если НайденноеЗначение <> Неопределено Тогда
			НайденноеЗначение.Пометка = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Список;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
