
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда
		
		Если ПустаяСтрока(АдресСервера) Тогда
			АдресСервера = SUI_SimpleВызовСервера.ПолучитьАдресПубликацииИнформационнойБазы();
		КонецЕсли;
		
		Если Не Справочники.SUI_НастройкиМобильныхУстройств.ОсновнаяНастройкаСуществует(Ссылка) Тогда
			ОсновнаяНастройка = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ОсновнаяНастройка = Ложь;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если АппаратныйСканерИспользованиеКомандИнтентов Тогда
		
		ПроверяемыеРеквизиты.Добавить("АппаратныйСканерIntentScannerMessage");
		ПроверяемыеРеквизиты.Добавить("АппаратныйСканерIntentScannerVariable");
		
	КонецЕсли;
	
	ПроверитьКоличествоЛоговНаСтранице(Отказ);
	ПроверитьУровеньЛогирования(Отказ);
	ПроверитьШаблонЭтикетки(Отказ);
	ПроверитьПротоколПечати(Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьСтрокуУдалятьДокументыСоСтатусамиСтрокой();
	
	Если Справочники.SUI_НастройкиМобильныхУстройств.ОсновнаяНастройкаСуществует(Ссылка) Тогда
		ОсновнаяНастройка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
	ОбменДанными.Получатели.Очистить();
	
	Если Не ПометкаУдаления Тогда
		
		ПривязанныеМобильныеУстройства = Справочники.SUI_НастройкиМобильныхУстройств
			.ПолучитьМобильныеУстройстваНастройки(Ссылка);
		
		Для индекс = 0 По ПривязанныеМобильныеУстройства.ВГраница() Цикл
			ОбменДанными.Получатели.Добавить(ПривязанныеМобильныеУстройства[индекс]);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ОсновнаяНастройка Тогда
		ТекстСообщения = НСтр("ru = 'Удаление основной настройки невозможно!
		|Перед удалением назначьте другую настройку в качестве основной.'");
		SUI_ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		Возврат;
	КонецЕсли;
	
	ПривязанныеМобильныеУстройства = Справочники.SUI_НастройкиМобильныхУстройств
		.ПолучитьМобильныеУстройстваНастройки(Ссылка, Истина);
	
	Если ПривязанныеМобильныеУстройства.Количество() > 0 Тогда
		
		ПредставлениеМобильныхУстройств = СтрСоединить(ПривязанныеМобильныеУстройства, ", ");
		
		Если СтрДлина(ПредставлениеМобильныхУстройств) > 50 Тогда
			ПредставлениеМобильныхУстройств = Лев(ПредставлениеМобильныхУстройств, 47) + "...";
		КонецЕсли;
		
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Удаление настройки невозможно!
		|К настройке привязаны мобильные устройства: %1.'"), ПредставлениеМобильныхУстройств);
		
		SUI_ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		Возврат;
		
	КонецЕсли;
	
	ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
	ОбменДанными.Получатели.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Узел
		|ИЗ
		|	Справочник.SUI_НастройкиМобильныхУстройств.Изменения
		|ГДЕ
		|	Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Узел"), Ссылка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПроверитьКоличествоЛоговНаСтранице(Отказ)
	
	ДоступныеЗначения = Новый Массив();
	ДоступныеЗначения.Добавить(20);
	ДоступныеЗначения.Добавить(50);
	ДоступныеЗначения.Добавить(100);
	
	Если ДоступныеЗначения.Найти(КоличествоЛоговНаСтранице) = Неопределено Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Количество логов на странице может принимать значения: %1.'"),
			СтрСоединить(ДоступныеЗначения, ", "));
		SUI_ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "КоличествоЛоговНаСтранице", "Объект", Отказ);
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПроверитьУровеньЛогирования(Отказ)
	
	ДоступныеЗначения = Новый Массив();
	ДоступныеЗначения.Добавить("OFF");
	ДоступныеЗначения.Добавить("DEBUG");
	ДоступныеЗначения.Добавить("INFO");
	ДоступныеЗначения.Добавить("ERROR");
	
	Если ДоступныеЗначения.Найти(УровеньЛогирования) = Неопределено Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Уровень логирования может принимать значения: %1.'"), 
			СтрСоединить(ДоступныеЗначения, ", "));
		SUI_ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "УровеньЛогирования", "Объект", Отказ);
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПроверитьШаблонЭтикетки(Отказ)
	
	ДоступныеЗначения = Новый Массив();
	ДоступныеЗначения.Добавить("ZPL");
	ДоступныеЗначения.Добавить("1C");
	
	Если ДоступныеЗначения.Найти(ШаблонЭтикетки) = Неопределено Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Шаблон этикетки может принимать значения: %1.'"), 
			СтрСоединить(ДоступныеЗначения, ", "));
		SUI_ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "ШаблонЭтикетки", "Объект", Отказ);
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПроверитьПротоколПечати(Отказ)
	
	ДоступныеЗначения = Новый Массив();
	ДоступныеЗначения.Добавить("BT");
	ДоступныеЗначения.Добавить("WiFi");
	
	Если ДоступныеЗначения.Найти(ТипСоединенияПринтера) = Неопределено Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Тип соединения печати может принимать значения: %1.'"), 
			СтрСоединить(ДоступныеЗначения, ", "));
		SUI_ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "ТипСоединенияПринтера", "Объект", Отказ);
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Процедура ОбработатьСтрокуУдалятьДокументыСоСтатусамиСтрокой()
	
	УдалятьДокументыСоСтатусамиСписок = Справочники.SUI_НастройкиМобильныхУстройств
		.ПолучитьСписокУдалятьДокументыСоСтатусами(ЭтотОбъект);
		
	УдалятьДокументыСоСтатусамиМассив = Новый Массив();
	
	Для Каждого ЭлементСписка Из УдалятьДокументыСоСтатусамиСписок Цикл
		
		Если ЭлементСписка.Пометка Тогда
			УдалятьДокументыСоСтатусамиМассив.Добавить(ЭлементСписка.Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	УдалятьДокументыСоСтатусамиСтрокой = НРег(СтрСоединить(УдалятьДокументыСоСтатусамиМассив, ";"));
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
