
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда
		
		Если ПустаяСтрока(АдресСервера) Тогда
			АдресСервера = SUI_SimpleВызовСервера.ПолучитьАдресПубликацииИнформационнойБазы();
		КонецЕсли;
		
		Если Не ОсновнаяНастройкаСуществует() Тогда
			ОсновнаяНастройка = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ОсновнаяНастройка = Ложь;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если АппаратныйСканерИспользовать И АппаратныйСканерИспользованиеКомандИнтентов Тогда
		
		ПроверяемыеРеквизиты.Добавить("АппаратныйСканерIntentScannerMessage");
		ПроверяемыеРеквизиты.Добавить("АппаратныйСканерIntentScannerVariable");
		ПроверяемыеРеквизиты.Добавить("АппаратныйСканерIntentScannerLength");
		
	КонецЕсли;
	
	ПроверитьКоличествоЛоговНаСтранице(Отказ);
	ПроверитьУровеньЛогирования(Отказ);
	ПроверитьШаблонЭтикетки(Отказ);
	ПроверитьПротоколПечати(Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьСтрокуУдалятьДокументыСоСтатусамиСтрокой();
	
	Если ОсновнаяНастройкаСуществует() Тогда
		ОсновнаяНастройка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПометкаУдаления Тогда
		
		ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
		ОбменДанными.Получатели.Очистить();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ОсновнаяНастройка Тогда
		ТекстСообщения = НСтр("ru = 'Невозможно удалить основную настройку!
		|Перед удалением назначьте другую настройку в качестве основной..'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		Возврат;
	КонецЕсли;
	
	ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
	ОбменДанными.Получатели.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Узел
		|ИЗ
		|	Справочник.SUI_НастройкиМобильныхУстройств.Изменения
		|ГДЕ
		|	Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Узел"), Ссылка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПроверитьКоличествоЛоговНаСтранице(Отказ)
	
	ДоступныеЗначения = Новый Массив();
	ДоступныеЗначения.Добавить(20);
	ДоступныеЗначения.Добавить(50);
	ДоступныеЗначения.Добавить(100);
	
	Если ДоступныеЗначения.Найти(КоличествоЛоговНаСтранице) = Неопределено Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Количество логов на странице может принимать значения: %1.'"),
			СтрСоединить(ДоступныеЗначения, ", "));
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "КоличествоЛоговНаСтранице", "Объект", Отказ);
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПроверитьУровеньЛогирования(Отказ)
	
	ДоступныеЗначения = Новый Массив();
	ДоступныеЗначения.Добавить("OFF");
	ДоступныеЗначения.Добавить("DEBUG");
	ДоступныеЗначения.Добавить("INFO");
	ДоступныеЗначения.Добавить("ERROR");
	
	Если ДоступныеЗначения.Найти(УровеньЛогирования) = Неопределено Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Уровень логирования может принимать значения: %1.'"), 
			СтрСоединить(ДоступныеЗначения, ", "));
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "УровеньЛогирования", "Объект", Отказ);
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПроверитьШаблонЭтикетки(Отказ)
	
	ДоступныеЗначения = Новый Массив();
	ДоступныеЗначения.Добавить("ZPL");
	ДоступныеЗначения.Добавить("1C");
	
	Если ДоступныеЗначения.Найти(ШаблонЭтикетки) = Неопределено Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Шаблон этикетки может принимать значения: %1.'"), 
			СтрСоединить(ДоступныеЗначения, ", "));
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "ШаблонЭтикетки", "Объект", Отказ);
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПроверитьПротоколПечати(Отказ)
	
	ДоступныеЗначения = Новый Массив();
	ДоступныеЗначения.Добавить("BT");
	ДоступныеЗначения.Добавить("WiFi");
	
	Если ДоступныеЗначения.Найти(ТипСоединенияПринтера) = Неопределено Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Тип соединения печати может принимать значения: %1.'"), 
			СтрСоединить(ДоступныеЗначения, ", "));
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "ТипСоединенияПринтера", "Объект", Отказ);
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Процедура ОбработатьСтрокуУдалятьДокументыСоСтатусамиСтрокой()
	
	УдалятьДокументыСоСтатусамиСписок = Справочники.SUI_НастройкиМобильныхУстройств
		.ПолучитьСписокУдалятьДокументыСоСтатусами(ЭтотОбъект);
		
	УдалятьДокументыСоСтатусамиМассив = Новый Массив();
	
	Для Каждого ЭлементСписка Из УдалятьДокументыСоСтатусамиСписок Цикл
		
		Если ЭлементСписка.Пометка Тогда
			УдалятьДокументыСоСтатусамиМассив.Добавить(ЭлементСписка.Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	УдалятьДокументыСоСтатусамиСтрокой = НРег(СтрСоединить(УдалятьДокументыСоСтатусамиМассив, ";"));
	
КонецПроцедуры

Функция ОсновнаяНастройкаСуществует()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	SUI_НастройкиМобильныхУстройств.Ссылка
		|ИЗ
		|	Справочник.SUI_НастройкиМобильныхУстройств КАК SUI_НастройкиМобильныхУстройств
		|ГДЕ
		|	SUI_НастройкиМобильныхУстройств.ОсновнаяНастройка
		|	И SUI_НастройкиМобильныхУстройств.Ссылка <> &Ссылка";
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
