
#Область ОписаниеПеременных

&НаКлиенте
Перем ЗагрузкаССайта;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбластьНастроек = Параметры.ОбластьНастроек;
	
	ОбластиНастроек = Обработки.SUI_ИмпортЭкспортНастроек.ОбластиНастроек();
	
	ИндексКартинкиФайла = Обработки.SUI_ИмпортЭкспортНастроек.ИндексКартинкиФайла();
	
	// Тест >>>
	ОбластьНастроек = ОбластиНастроек[0];
//	Параметры.РежимВыгрузки = Истина;
	// Тест <<<
	
	Если Параметры.РежимВыгрузки Тогда
		Заголовок = СтрШаблон(НСтр("ru = 'Экспорт: %1'"), ОбластьНастроек);
	Иначе
		Заголовок = СтрШаблон(НСтр("ru = 'Импорт: %1'"), ОбластьНастроек);
	КонецЕсли;
	
	Если ОбластиНастроек.Найти(ОбластьНастроек) = Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не задана область настройки'"), , , , Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗагрузкаССайта = Ложь;
	
	ОбновитьОтображениеЭлементов();
	
	ПодключитьОбработчикОжидания("НачатьЗаполнениеДереваНастроекДляВыгрузки", 0.1, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНастройки

&НаКлиенте
Процедура НастройкиПометкаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Настройки.ТекущаяСтрока;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		
		ЭлементДерева = Настройки.НайтиПоИдентификатору(ТекущаяСтрока);
		
		ЭлементДерева.Пометка = ЭлементДерева.Пометка % 2;
		
		ПроставитьПометкиВниз(ЭлементДерева);
		ПроставитьПометкиВверх(ЭлементДерева);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПометкиОтметитьВсе(Команда)
	
	Для Каждого ЭлементДерева Из Настройки.ПолучитьЭлементы() Цикл
		ЭлементДерева.Пометка = 1;
		ПроставитьПометкиВниз(ЭлементДерева);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПометкиСнятьВсе(Команда)
	
	Для Каждого ЭлементДерева Из Настройки.ПолучитьЭлементы() Цикл
		ЭлементДерева.Пометка = 0;
		ПроставитьПометкиВниз(ЭлементДерева);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсе(Команда)
	
	Если Элементы.Настройки.ТекущаяСтрока <> Неопределено Тогда
		РазвернутьУзлыДерева(Настройки.НайтиПоИдентификатору(Элементы.Настройки.ТекущаяСтрока), Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьВсе(Команда)
	
	Если Элементы.Настройки.ТекущиеДанные <> Неопределено Тогда
		Элементы.Настройки.Свернуть(Элементы.Настройки.ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВФайл(Команда)
	
	ЕстьПометки = Ложь;
	Для Каждого ЭлементДерева Из Настройки.ПолучитьЭлементы() Цикл
		
		Если ЭлементДерева.Пометка > 0 Тогда
			ЕстьПометки = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЕстьПометки Тогда
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.Заголовок = НСтр("ru = 'Подготовка файла выгружаемых настроек'");
		ПараметрыОжидания.ВыводитьСообщения = Истина;
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ВыгрузитьВФайлЗавершениеФормирования", ЭтотОбъект);
		
		ДлительнаяОперация = ВыгрузитьВФайлНаСервере();
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
		
	Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'Не выбраны настройки для выгрузки'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьИзФайлаЗавершениеВыбораФайла", ЭтотОбъект);
	
	ПараметрыЗагрузки = ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла();
	ПараметрыЗагрузки.ИдентификаторФормы = УникальныйИдентификатор;
	ПараметрыЗагрузки.Диалог.Заголовок = НСтр("ru = 'Выберите файл настроек'");
	ПараметрыЗагрузки.Диалог.МножественныйВыбор = Ложь;
	ПараметрыЗагрузки.Диалог.ПроверятьСуществованиеФайла = Истина;
	ПараметрыЗагрузки.Диалог.Фильтр = "Архив ZIP (*.zip)|*.zip";
	
	ФайловаяСистемаКлиент.ЗагрузитьФайл(Оповещение, ПараметрыЗагрузки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНастройки(Команда)
	
	ЕстьПометки = Ложь;
	Для Каждого ЭлементДерева Из Настройки.ПолучитьЭлементы() Цикл
		
		Если ЭлементДерева.Пометка > 0 Тогда
			ЕстьПометки = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЕстьПометки Тогда
		
		Оповещение = Новый ОписаниеОповещения("ЗаписатьНастройкиПодтверждение", ЭтотОбъект, Новый Структура());
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Выполнить запись настроек?'"), РежимДиалогаВопрос.ДаНет);
		
	Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'Не выбраны настройки для записи'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПредопределенные(Команда)
	
	НачатьПолучениеНастроекССайта();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПроставитьПометкиВниз(ДанныеСтроки)
	
	Значение = ДанныеСтроки.Пометка;
	
	Для Каждого Потомок Из ДанныеСтроки.ПолучитьЭлементы() Цикл
		
		Потомок.Пометка = Значение;
		
		ПроставитьПометкиВниз(Потомок);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроставитьПометкиВверх(ДанныеСтроки)
	
	РодительСтроки = ДанныеСтроки.ПолучитьРодителя();
	
	Если РодительСтроки <> Неопределено Тогда
		
		ВсеИстина = Истина;
		НеВсеЛожь = Ложь;
		
		Для Каждого Потомок Из РодительСтроки.ПолучитьЭлементы() Цикл
			ВсеИстина = ВсеИстина И (Потомок.Пометка = 1);
			НеВсеЛожь = НеВсеЛожь Или Булево(Потомок.Пометка);
		КонецЦикла;
		
		Если ВсеИстина Тогда
			РодительСтроки.Пометка = 1;
		ИначеЕсли НеВсеЛожь Тогда
			РодительСтроки.Пометка = 2;
		Иначе
			РодительСтроки.Пометка = 0;
		КонецЕсли;
		
		ПроставитьПометкиВверх(РодительСтроки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьУзлыДерева(Узел, КоличествоУровней = 1)
	
	Если Узел = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если КоличествоУровней = Неопределено Тогда
		Элементы.Настройки.Развернуть(Узел.ПолучитьИдентификатор(), Истина);
	Иначе
		
		Элементы.Настройки.Развернуть(Узел.ПолучитьИдентификатор(), Ложь);
		КоличествоУровней = КоличествоУровней - 1;
		
		Если КоличествоУровней > 0 Тогда
			
			ОстатокУровней = КоличествоУровней;
			
			Для Каждого ДочернийУзел Из Узел.ПолучитьЭлементы() Цикл
				
				РазвернутьУзлыДерева(ДочернийУзел, ОстатокУровней);
				ОстатокУровней = КоличествоУровней;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеЭлементов()
	
	Элементы.НастройкиВыгрузитьВФайл.Видимость = Параметры.РежимВыгрузки;
	Элементы.НастройкиЗагрузитьИзФайла.Видимость = Не Параметры.РежимВыгрузки;
	Элементы.НастройкиЗагрузитьПредопределенные.Видимость = Не Параметры.РежимВыгрузки;
	Элементы.НастройкиЗаписатьНастройки.Видимость = Не Параметры.РежимВыгрузки;
	
	Элементы.Настройкиdescription.РедактированиеТекста = Параметры.РежимВыгрузки;
	
	Если Параметры.РежимВыгрузки Тогда
		Элементы.НастройкиВыгрузитьВФайл.КнопкаПоУмолчанию = Истина;
	Иначе
		
		Если Настройки.ПолучитьЭлементы().Количество() > 0 Тогда
			Элементы.НастройкиЗаписатьНастройки.КнопкаПоУмолчанию = Истина;
		Иначе
			Элементы.НастройкиЗагрузитьИзФайла.КнопкаПоУмолчанию = Истина;
			Элементы.НастройкиЗаписатьНастройки.Видимость = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СменитьСтраницу(ДлительнаяОперация = Ложь, ИнформацияДлительнойОперации = "")
	
	Если ДлительнаяОперация Тогда
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаДлительнаяОперация;
		Элементы.НадписьДлительнаяОперация.Заголовок = ИнформацияДлительнойОперации;
		
		Если ПустаяСтрока(Элементы.НадписьДлительнаяОперация.Заголовок) Тогда
			Элементы.НадписьДлительнаяОперация.Заголовок = НСтр("ru = 'Пожалуйста подождите...'");
		КонецЕсли;
		
	Иначе
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОсновная;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьЗагружаемыйФайл()
	
	Если ЭтоАдресВременногоХранилища(ЗагружаемыйФайлАдрес) Тогда
		УдалитьИзВременногоХранилища(ЗагружаемыйФайлАдрес);
	КонецЕсли;
	
	ЗагружаемыйФайлАдрес = "";
	
КонецПроцедуры

#Область ЗагрузкаИзФайла

&НаКлиенте
Процедура ЗагрузитьИзФайлаЗавершениеВыбораФайла(ПомещенныйФайл, ДополнительныеПараметры) Экспорт
	
	Если ПомещенныйФайл = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьЗагружаемыйФайл();
	ЗагрузкаССайта = Ложь;
	Настройки.ПолучитьЭлементы().Очистить();
	
	ДлительнаяОперация = ЗагрузитьИзФайлаНаСервере(ПомещенныйФайл.Хранение);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Заголовок = НСтр("ru = 'Чтение файла загружаемых настроек'");
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаполнениеДереваНастроекЗавершение", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьИзФайлаНаСервере(АдресХранения)
	
	ЗагружаемыйФайлАдрес = АдресХранения;
	
	ПараметрыПроцедуры = Новый Структура();
	ПараметрыПроцедуры.Вставить("ДанныеФайла", ПолучитьИзВременногоХранилища(ЗагружаемыйФайлАдрес));
	ПараметрыПроцедуры.Вставить("НастройкиДерево", РеквизитФормыВЗначение("Настройки"));
	ПараметрыПроцедуры.Вставить("Область", ОбластьНастроек);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Обработки.SUI_ИмпортЭкспортНастроек.ЗаполнитьДеревоНастроек", 
		ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьИзФайлаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Результат.Сообщения) Тогда
		
		Для индекс = 0 По Результат.Сообщения.ВГраница() Цикл
			Результат.Сообщения[индекс].Сообщить();
		КонецЦикла;
		
	КонецЕсли;
	
	Если ПустаяСтрока(Результат.КраткоеПредставлениеОшибки) Тогда
		ЗагрузитьДеревоНастроекНаСервере(Результат.АдресРезультата);
	Иначе
		
		ОчиститьЗагружаемыйФайл();
		ПоказатьПредупреждение(, Результат.КраткоеПредставлениеОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ВыгрузкаВФайл

&НаСервере
Функция ВыгрузитьВФайлНаСервере()
	
	ПараметрыПроцедуры = Новый Структура();
	ПараметрыПроцедуры.Вставить("ДеревоНастройки", РеквизитФормыВЗначение("Настройки"));
	ПараметрыПроцедуры.Вставить("Область", ОбластьНастроек);
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Обработки.SUI_ИмпортЭкспортНастроек.ВыгрузитьВФайл", 
		ПараметрыПроцедуры, ПараметрыВыполненияВФоне);
	
КонецФункции

&НаКлиенте
Процедура ВыгрузитьВФайлЗавершениеФормирования(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Результат.Сообщения) Тогда
		
		Для индекс = 0 По Результат.Сообщения.ВГраница() Цикл
			Результат.Сообщения[индекс].Сообщить();
		КонецЦикла;
		
	КонецЕсли;
	
	Если ПустаяСтрока(Результат.КраткоеПредставлениеОшибки) Тогда
		
		Оповещение = Новый ОписаниеОповещения("ВыгрузитьВФайлЗавершение", ЭтотОбъект);
		
		ПараметрыСохраненияФайла = ФайловаяСистемаКлиент.ПараметрыСохраненияФайла();
		ПараметрыСохраненияФайла.Диалог.Фильтр = "Архив ZIP (*.zip)|*.zip";
		ПараметрыСохраненияФайла.Диалог.МножественныйВыбор = Ложь;
		ПараметрыСохраненияФайла.Диалог.Заголовок = НСтр("ru = 'Сохранить файл настроек'");
		
		ИмяФайла = СтрШаблон(НСтр("ru = 'Настройки%1_%2'"), 
			SUI_SimpleКлиентСервер.Представление(), 
			Формат(ОбщегоНазначенияКлиент.ДатаСеанса(), "ДФ=dd_MM_yy_HH_mm_ss;"));
		
		ФайловаяСистемаКлиент.СохранитьФайл(Оповещение, Результат.АдресРезультата, ИмяФайла, ПараметрыСохраненияФайла);
		
	Иначе
		ПоказатьПредупреждение(, Результат.КраткоеПредставлениеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВФайлЗавершение(ВыгруженныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыгруженныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Настройки выгружены'"));
	
	Если ВыгруженныеФайлы.Количество() > 0 Тогда
		
		ПолноеИмяВыгруженногоФайла = ВыгруженныеФайлы[0].ПолноеИмя;
		
		Если ПолноеИмяВыгруженногоФайла <> Неопределено Тогда
			ФайловаяСистемаКлиент.ОткрытьПроводник(ПолноеИмяВыгруженногоФайла);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеДереваНастроек

&НаКлиенте
Процедура НачатьЗаполнениеДереваНастроекДляВыгрузки() Экспорт
	
	Если Не Параметры.РежимВыгрузки Тогда
		Возврат;
	КонецЕсли;
	
	Настройки.ПолучитьЭлементы().Очистить();
	
	Если ОбластиНастроек.Найти(ОбластьНастроек) <> Неопределено Тогда
		
		ДлительнаяОперация = ЗаполнитьДеревоНастроекНаСервере();
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.Заголовок = НСтр("ru = 'Заполнение списка настроек доступных для выгрузки'");
		ПараметрыОжидания.ВыводитьСообщения = Истина;
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаполнениеДереваНастроекЗавершение", ЭтотОбъект);
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьДеревоНастроекНаСервере()
	
	ПараметрыПроцедуры = Новый Структура();
	ПараметрыПроцедуры.Вставить("НастройкиДерево", РеквизитФормыВЗначение("Настройки"));
	ПараметрыПроцедуры.Вставить("Область", ОбластьНастроек);
	ПараметрыПроцедуры.Вставить("ЭтоВыгрузка");
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Обработки.SUI_ИмпортЭкспортНастроек.ЗаполнитьДеревоНастроек", 
		ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ЗаполнениеДереваНастроекЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ДополнительныеПараметры.Свойство("ЗагруженноССайта") Тогда
		ОчиститьЗагружаемыйФайл();
	КонецЕсли;
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Результат.Сообщения) Тогда
		
		Для индекс = 0 По Результат.Сообщения.ВГраница() Цикл
			Результат.Сообщения[индекс].Сообщить();
		КонецЦикла;
		
	КонецЕсли;
	
	Если ПустаяСтрока(Результат.КраткоеПредставлениеОшибки) Тогда
		
		ЗагрузитьДеревоНастроекНаСервере(Результат.АдресРезультата);
		
		УровеньРазворачиванияУзлов = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, 
			"УровеньРазворачиванияУзлов", 2, Тип("Число"));
		
		Для Каждого ЭлементДерева Из Настройки.ПолучитьЭлементы() Цикл
			РазвернутьУзлыДерева(ЭлементДерева, УровеньРазворачиванияУзлов);
		КонецЦикла;
		
		ОбновитьОтображениеЭлементов();
		
	Иначе
		ПоказатьПредупреждение(, Результат.КраткоеПредставлениеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДеревоНастроекНаСервере(АдресРезультата)
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	ТипРезультата = ТипЗнч(Результат);
	
	Если ТипРезультата = Тип("ДеревоЗначений") Тогда
		Дерево = Результат;
	ИначеЕсли ТипРезультата = Тип("Структура") Тогда
		
		Дерево = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "НастройкиДерево");
		
	КонецЕсли;
	
	Если ТипЗнч(Дерево) = Тип("ДеревоЗначений") Тогда
		ЗначениеВРеквизитФормы(Дерево, "Настройки");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаписьНастроек

&НаКлиенте
Процедура ЗаписатьНастройкиПодтверждение(Ответ, Контекст) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоАдресВременногоХранилища(ЗагружаемыйФайлАдрес) Тогда
		СменитьСтраницу(Истина, НСтр("ru = 'Загрузка настроек с сайта...'"));
		ПодключитьОбработчикОжидания("ЗагрузитьНастройкиССайта", 0.1, Истина);
	Иначе
		ЗаписатьНастройкиПродолжить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНастройкиПродолжить(ЗагруженныйФайлССайта = Неопределено)
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Заголовок = НСтр("ru = 'Запись настроек'");
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	
	ДополнительныеПараметры = Новый Структура();
	
	Если ЗагруженныйФайлССайта <> Неопределено Тогда
		
		Если ТипЗнч(ЗагруженныйФайлССайта) = Тип("ДвоичныеДанные") Тогда
			ЗагружаемыйФайлАдрес = ПоместитьВоВременноеХранилище(ЗагруженныйФайлССайта, УникальныйИдентификатор);
		Иначе
			ПоказатьПредупреждение(, НСтр("ru = 'Не удалось получить получить загруженный файл с сайта.
			|Обратитесь к поставщику услуг.'"));
			Возврат;
		КонецЕсли;
		
		ДополнительныеПараметры.Вставить("ЗагруженноССайта");
		
	КонецЕсли;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаполнениеДереваНастроекЗавершение", ЭтотОбъект,
		ДополнительныеПараметры);
	
	ДлительнаяОперация = ЗаписатьНастройкиНаСервере(ДополнительныеПараметры.Свойство("ЗагруженноССайта"));
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьНастройкиНаСервере(ЗагруженноССайта)
	
	ПараметрыПроцедуры = Новый Структура();
	ПараметрыПроцедуры.Вставить("ДанныеФайла", ПолучитьИзВременногоХранилища(ЗагружаемыйФайлАдрес));
	ПараметрыПроцедуры.Вставить("НастройкиДерево", РеквизитФормыВЗначение("Настройки"));
	ПараметрыПроцедуры.Вставить("Область", ОбластьНастроек);
	ПараметрыПроцедуры.Вставить("ЗагруженноССайта", ЗагруженноССайта);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Обработки.SUI_ИмпортЭкспортНастроек.ЗаписатьНастройки", 
		ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

#КонецОбласти

#Область ЗагрузкаССайта

&НаКлиенте
Функция ПараметрыВыполненияЗапросаКСерверуНастроек(ПутьНаСервере = "")
	
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Accept", "application/json");
	Заголовки.Вставить("Content-Type", "application/json");
	
	ПараметрыВыполнения = Новый Структура();
	ПараметрыВыполнения.Вставить("Сервер", "simplesettingsstorage.onrender.com");
	ПараметрыВыполнения.Вставить("Порт", 443);
	ПараметрыВыполнения.Вставить("ЗащищенноеСоединение", ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение());
	ПараметрыВыполнения.Вставить("ПутьНаСервере", ПутьНаСервере);
	ПараметрыВыполнения.Вставить("Параметры", Новый Соответствие());
	ПараметрыВыполнения.Вставить("РезультатДвоичнымиДанными", Ложь);
	ПараметрыВыполнения.Вставить("Таймаут", 10);
	ПараметрыВыполнения.Вставить("Заголовки", Заголовки);
	ПараметрыВыполнения.Вставить("ДанныеЗапроса");
	ПараметрыВыполнения.Вставить("Метод", "GET");
	
	//TODO: artem - 13.01.2025 - Тест
	ПараметрыВыполнения.Сервер = "127.0.0.1";
	ПараметрыВыполнения.Порт = 3000;
	ПараметрыВыполнения.ЗащищенноеСоединение = Неопределено;
	
	Возврат ПараметрыВыполнения;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВыполнитьЗапросКСерверуНастроек(ПараметрыВыполнения)
	
	Результат = Новый Структура("Данные");
	
	ОшибкаОперации = Новый Структура();
	ОшибкаОперации.Вставить("КраткоеПредставление", "");
	ОшибкаОперации.Вставить("ПодробноеПредставление", "");
	
	#Если ВебКлиент Тогда
		ВызватьИсключение НСтр("ru = 'Недопустимый вызов в Web-клиенте.'");
	#Иначе
		
    	Соединение = Новый HTTPСоединение(ПараметрыВыполнения.Сервер, ПараметрыВыполнения.Порт, , , , 
    		ПараметрыВыполнения.Таймаут, ПараметрыВыполнения.ЗащищенноеСоединение);
    	
    	ПараметрыЗапроса = Новый Массив();
    	Для Каждого ПараметрЗапроса Из ПараметрыВыполнения.Параметры Цикл
    		ПараметрыЗапроса.Добавить(СтрШаблон("%1=%2", ПараметрЗапроса.Ключ, ПараметрЗапроса.Значение));
    	КонецЦикла;
    	ПараметрыЗапроса = ?(ПараметрыЗапроса.Количество() > 0, "?" + СтрСоединить(ПараметрыЗапроса, "&"), "");
    	
        Запрос = Новый HTTPЗапрос(ПараметрыВыполнения.ПутьНаСервере + ПараметрыЗапроса, ПараметрыВыполнения.Заголовки);
        
        ТипЗначенияДанныеЗапроса = ТипЗнч(ПараметрыВыполнения.ДанныеЗапроса);
        Если ТипЗначенияДанныеЗапроса = Тип("Массив") Или 
        	ТипЗначенияДанныеЗапроса = Тип("Соответствие") Или
        	ТипЗначенияДанныеЗапроса = Тип("Структура") Тогда
        	
        	Попытка
				ЗаписьJSON = Новый ЗаписьJSON();
				ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(, Символы.Таб));
				ЗаписатьJSON(ЗаписьJSON, ПараметрыВыполнения.ДанныеЗапроса);
	        	Запрос.УстановитьТелоИзСтроки(ЗаписьJSON.Закрыть());
        	Исключение
		    	Ошибка = ИнформацияОбОшибке();
		    	ОшибкаОперации.КраткоеПредставление = СтрШаблон(
			    	НСтр("ru = 'При формировании запроса к серверу настроек произошла непредвиденная ошибка:
			        |%1'"), ОбработкаОшибок.КраткоеПредставлениеОшибки(Ошибка));
		        ОшибкаОперации.ПодробноеПредставление = ОбработкаОшибок.ПодробноеПредставлениеОшибки(Ошибка);
        	КонецПопытки;
        	
        КонецЕсли;
        
        Если ПустаяСтрока(ОшибкаОперации.КраткоеПредставление) Тогда
        	
		    Попытка
		        РезультатЗапроса = Соединение.ВызватьHTTPМетод(ПараметрыВыполнения.Метод, Запрос);
		    Исключение
		    	Ошибка = ИнформацияОбОшибке();
		    	ОшибкаОперации.КраткоеПредставление = СтрШаблон(
			    	НСтр("ru = 'При выполнении запроса к серверу настроек произошла непредвиденная ошибка:
			        |%1'"), ОбработкаОшибок.КраткоеПредставлениеОшибки(Ошибка));
		        ОшибкаОперации.ПодробноеПредставление = ОбработкаОшибок.ПодробноеПредставлениеОшибки(Ошибка);
		    КонецПопытки;
		    
        КонецЕсли;
        
	    Если ПустаяСтрока(ОшибкаОперации.КраткоеПредставление) Тогда
	    	
	    	Попытка
	    		
		    	Если ПараметрыВыполнения.РезультатДвоичнымиДанными И РезультатЗапроса.КодСостояния = 200 Тогда
			    	Результат.Данные = РезультатЗапроса.ПолучитьТелоКакДвоичныеДанные();
			    ИначеЕсли РезультатЗапроса.КодСостояния < 501 Тогда
			    	Результат.Данные = ПолучитьДанныеИзСтрокиJSON(РезультатЗапроса.ПолучитьТелоКакСтроку());
		    	Иначе
		    		
		    		Попытка
		    			Результат.Данные = ПолучитьДанныеИзСтрокиJSON(РезультатЗапроса.ПолучитьТелоКакСтроку());
		    		Исключение
		    			Результат.Данные = Неопределено;
		    		КонецПопытки;
		    		
		    	КонецЕсли;
		    	
		    Исключение
		    	Ошибка = ИнформацияОбОшибке();
		    	ОшибкаОперации.КраткоеПредставление = СтрШаблон(
			    	НСтр("ru = 'Произошла непредвиденная ошибка при попытке получить данные запроса:
			        |%1'"), ОбработкаОшибок.КраткоеПредставлениеОшибки(Ошибка));
		        ОшибкаОперации.ПодробноеПредставление = ОбработкаОшибок.ПодробноеПредставлениеОшибки(Ошибка);
		        Результат.Данные = Неопределено;
	    	КонецПопытки;
	    	
			Если РезультатЗапроса.КодСостояния > 200 Тогда
				
	    		Если ТипЗнч(Результат.Данные) = Тип("Соответствие") Тогда
	    			ОшибкаОперации.КраткоеПредставление = Результат.Данные.Получить("message");
	    		КонецЕсли;
	    		
	    		Если Не ЗначениеЗаполнено(ОшибкаОперации.КраткоеПредставление) Тогда
	    			
	    			Если РезультатЗапроса.КодСостояния = 404 Тогда
			            ОшибкаОперации.КраткоеПредставление = НСтр("ru = 'Ресурс не найден.'");
	    			ИначеЕсли РезультатЗапроса.КодСостояния = 500 Тогда
	    				ОшибкаОперации.КраткоеПредставление = НСтр("ru = 'Внутренняя ошибка сервера.'");
	    			ИначеЕсли РезультатЗапроса.КодСостояния = 401 Тогда
	    				ОшибкаОперации.КраткоеПредставление = НСтр("ru = 'Требуется авторизация.'");
	    			ИначеЕсли РезультатЗапроса.КодСостояния = 403 Тогда
	    				ОшибкаОперации.КраткоеПредставление = НСтр("ru = 'Доступ запрещен.'");
	    			ИначеЕсли РезультатЗапроса.КодСостояния = 502 Тогда
	    				ОшибкаОперации.КраткоеПредставление = НСтр("ru = 'Ошибка шлюза.'");
	    			Иначе
	    				ОшибкаОперации.КраткоеПредставление = НСтр("ru = 'Неизвестная ошибка.'");
	    			КонецЕсли;
	    			
	    		КонецЕсли;
	    		
	    		ОшибкаОперации.ПодробноеПредставление = СтрШаблон("[%1]: %2", 
	    			РезультатЗапроса.КодСостояния, ОшибкаОперации.КраткоеПредставление);
	    		
	        КонецЕсли;

	    КонецЕсли;
	    
    #КонецЕсли
    
    Если Не ПустаяСтрока(ОшибкаОперации.КраткоеПредставление) Тогда
    	Результат.Вставить("Ошибка", ОшибкаОперации);
    КонецЕсли;
    
    Если Результат.Данные <> Неопределено Тогда
    	
    	ТипДанных = ТипЗнч(Результат.Данные); 
	    Если (Не ПараметрыВыполнения.РезультатДвоичнымиДанными И ТипДанных <> Тип("Соответствие") И ТипДанных <> Тип("Массив")) Или 
	    	(ПараметрыВыполнения.РезультатДвоичнымиДанными И ТипДанных <> Тип("ДвоичныеДанные")) Тогда
	    	Результат.Данные = Неопределено;
	    	
	    	Если Не Результат.Свойство("Ошибка") Тогда
	    		ОшибкаОперации.КраткоеПредставление = НСтр("ru = 'Неудалось получить данные с сайта.'");
	    		ОшибкаОперации.ПодробноеПредставление = СтрШаблон(НСтр("ru = '%1
				|Обратитесь к поставщику услуг.'"), ОшибкаОперации.КраткоеПредставление);
	    	КонецЕсли;
	    	
	    КонецЕсли;
	    
    КонецЕсли;
    
    Возврат Результат;
    
КонецФункции

&НаСервере
Функция ВыполнитьЗапросКСерверуНастроекЧерезСервер(ПараметрыВыполнения)
	
	Возврат ВыполнитьЗапросКСерверуНастроек(ПараметрыВыполнения);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьДанныеИзСтрокиJSON(СтрокаJSON)
	
	#Если ВебКлиент Тогда
		ВызватьИсключение НСтр("ru = 'Недопустимый вызов в Web-клиенте.'");
	#Иначе
		
		Если (СтрНачинаетсяС(СтрокаJSON, "{") И СтрЗаканчиваетсяНа(СтрокаJSON, "}")) Или
			(СтрНачинаетсяС(СтрокаJSON, "[") И СтрЗаканчиваетсяНа(СтрокаJSON, "]")) Тогда
			
			ЧтениеJSON = Новый ЧтениеJSON();
			ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
			Результат = ПрочитатьJSON(ЧтениеJSON, Истина);
			ЧтениеJSON.Закрыть();
			
			Возврат Результат;
			
		Иначе
			Возврат Неопределено;
		КонецЕсли;
		
	#КонецЕсли
	
КонецФункции

&НаКлиенте
Процедура НачатьПолучениеНастроекССайта()
	
	СменитьСтраницу(Истина, НСтр("ru = 'Получение списка конфигураций с сайта...'"));
	ПодключитьОбработчикОжидания("ПолучитьСписокКонфигурацийССайта", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСписокКонфигурацийССайта() Экспорт
	
	ПараметрыВыполненияЗапроса = ПараметрыВыполненияЗапросаКСерверуНастроек("/api/storage/scheme");
	ПараметрыВыполненияЗапроса.Параметры.Вставить("node", ОбластьНастроек);
	ПараметрыВыполненияЗапроса.Параметры.Вставить("depth", 0);
	ПараметрыВыполненияЗапроса.Параметры.Вставить("without_files", 1);
	
	#Если ВебКлиент Тогда
	Результат = ВыполнитьЗапросКСерверуНастроекЧерезСервер(ПараметрыВыполненияЗапроса);
	#Иначе
	Результат = ВыполнитьЗапросКСерверуНастроек(ПараметрыВыполненияЗапроса);
	#КонецЕсли
	
	Оповещение = Новый ОписаниеОповещения("ЗавершениеРаботыСДлительнойОперацией", ЭтотОбъект);
	
	Если Результат.Свойство("Ошибка") Тогда
		ПоказатьПредупреждение(Оповещение, Результат.Ошибка.КраткоеПредставление);
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.Ошибка.ПодробноеПредставление);
	Иначе
		
		ПараметрыВыбораКонфигурации = Новый Структура();
		ПараметрыВыбораКонфигурации.Вставить("СписокВыбора", Новый СписокЗначений());
		ПараметрыВыбораКонфигурации.Вставить("Заголовок", НСтр("ru = 'Выберите конфигурацию'"));
		
		Для Каждого ЭлементДанных Из Результат.Данные Цикл
			
			Если ЭлементДанных.Значение.Получить("type") = "directory" Тогда
				ПараметрыВыбораКонфигурации.СписокВыбора.Добавить(ЭлементДанных.Ключ);
			КонецЕсли;
			
		КонецЦикла;
		
		Если ПараметрыВыбораКонфигурации.СписокВыбора.Количество() = 0 Тогда
			ПоказатьПредупреждение(Оповещение, НСтр("ru = 'Отсутствуют доступные конфигурации.'"));
		Иначе
			
			Оповещение = Новый ОписаниеОповещения("ВыборКонфигурацииССайтаЗавершение", ЭтотОбъект);
			ОткрытьФорму("ОбщаяФорма.SUI_ВыборИзСписка", ПараметрыВыбораКонфигурации, ЭтотОбъект, , , , 
				Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеРаботыСДлительнойОперацией(ДополнительныеПараметры) Экспорт
	
	СменитьСтраницу();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборКонфигурацииССайтаЗавершение(ВыбраннаяКонфигурация, ДополнительныеПараметры) Экспорт
	
	Если ВыбраннаяКонфигурация = Неопределено Тогда
		ЗавершениеРаботыСДлительнойОперацией(Неопределено);
		Возврат;
	КонецЕсли;
	
	ОчиститьЗагружаемыйФайл();
	ЗагрузкаССайта = Истина;
	Настройки.ПолучитьЭлементы().Очистить();
	
	ПараметрыВыполненияЗапроса = ПараметрыВыполненияЗапросаКСерверуНастроек("/api/storage/scheme");
	ПараметрыВыполненияЗапроса.Параметры.Вставить("node", СтрШаблон("%1/%2", ОбластьНастроек, ВыбраннаяКонфигурация));
	
	#Если ВебКлиент Тогда
	Результат = ВыполнитьЗапросКСерверуНастроекЧерезСервер(ПараметрыВыполненияЗапроса);
	#Иначе
	Результат = ВыполнитьЗапросКСерверуНастроек(ПараметрыВыполненияЗапроса);
	#КонецЕсли
	
	Если Результат.Свойство("Ошибка") Тогда
		Оповещение = Новый ОписаниеОповещения("ЗавершениеРаботыСДлительнойОперацией", ЭтотОбъект);
		ПоказатьПредупреждение(Оповещение, Результат.Ошибка.КраткоеПредставление);
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.Ошибка.ПодробноеПредставление);
	Иначе
		
		ЗавершениеРаботыСДлительнойОперацией(Неопределено);
		
		ДлительнаяОперация = ЗагрузитьИзСхемыНаСервере(ВыбраннаяКонфигурация, Результат.Данные);
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.Заголовок = НСтр("ru = 'Чтение настроек с сайта'");
		ПараметрыОжидания.ВыводитьСообщения = Истина;
		
		ДополнительныеПараметры = Новый Структура();
		ДополнительныеПараметры.Вставить("УровеньРазворачиванияУзлов", 3);
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаполнениеДереваНастроекЗавершение", ЭтотОбъект,
			ДополнительныеПараметры);
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьИзСхемыНаСервере(ВыбраннаяКонфигурация, ДанныеСхемы)
	
	ПараметрыПроцедуры = Новый Структура();
	ПараметрыПроцедуры.Вставить("НастройкиДерево", РеквизитФормыВЗначение("Настройки"));
	ПараметрыПроцедуры.Вставить("Область", ОбластьНастроек);
	ПараметрыПроцедуры.Вставить("Конфигурация", ВыбраннаяКонфигурация);
	ПараметрыПроцедуры.Вставить("ДанныеСхемы", ДанныеСхемы);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Обработки.SUI_ИмпортЭкспортНастроек.ЗаполнитьДеревоНастроек", 
		ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьНастройкиССайта() Экспорт
	
	НастройкиКЗагрузке = ПолучитьСписокНастроекКЗагрузкеССайта();
	
	ПараметрыВыполненияЗапроса = ПараметрыВыполненияЗапросаКСерверуНастроек("/api/storage/files");
	ПараметрыВыполненияЗапроса.Таймаут = 25;
	ПараметрыВыполненияЗапроса.РезультатДвоичнымиДанными = Истина;
	ПараметрыВыполненияЗапроса.ДанныеЗапроса = НастройкиКЗагрузке;
	
	#Если ВебКлиент Тогда
	Результат = ВыполнитьЗапросКСерверуНастроекЧерезСервер(ПараметрыВыполненияЗапроса);
	#Иначе
	Результат = ВыполнитьЗапросКСерверуНастроек(ПараметрыВыполненияЗапроса);
	#КонецЕсли
	
	Оповещение = Новый ОписаниеОповещения("ЗавершениеРаботыСДлительнойОперацией", ЭтотОбъект);
	
	Если Результат.Свойство("Ошибка") Тогда
		ПоказатьПредупреждение(Оповещение, Результат.Ошибка.КраткоеПредставление);
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.Ошибка.ПодробноеПредставление);
	Иначе
		
		ЗавершениеРаботыСДлительнойОперацией(Неопределено);
		ЗаписатьНастройкиПродолжить(Результат.Данные);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокНастроекКЗагрузкеССайта()
	
	НастройкиКЗагрузке = Новый Массив();
	
	ДеревоНастроек = РеквизитФормыВЗначение("Настройки");
	
	НайденныеСтроки = ДеревоНастроек.Строки.НайтиСтроки(
		Обработки.SUI_ИмпортЭкспортНастроек.ПараметрыПоискаОтмеченныхНастроек(), Истина);
	
	Для индекс = 0 По НайденныеСтроки.ВГраница() Цикл
		НастройкиКЗагрузке.Добавить(СформироватьПутьНастройкиКЗагрузкеССайта(НайденныеСтроки[индекс]));
	КонецЦикла;
	
	Возврат НастройкиКЗагрузке;
	
КонецФункции

&НаСервереБезКонтекста
Функция СформироватьПутьНастройкиКЗагрузкеССайта(СтрокаДерева)
	
	РодительСтроки = СтрокаДерева.Родитель;
	
	Если РодительСтроки = Неопределено Тогда
		Возврат СтрокаДерева.name;
	Иначе
		Возврат СтрШаблон("%1/%2", СформироватьПутьНастройкиКЗагрузкеССайта(РодительСтроки), СтрокаДерева.name);
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти
