
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбластьНастроек = Параметры.ОбластьНастроек;
//	Параметры.ОбластьДействий;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНастройки

&НаКлиенте
Процедура НастройкиПометкаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Настройки.ТекущаяСтрока;
		
	Если ТекущаяСтрока <> Неопределено Тогда
		
		ЭлементДерева = Настройки.НайтиПоИдентификатору(ТекущаяСтрока);
		
		ЭлементДерева.Пометка = ЭлементДерева.Пометка % 2;
		
		ПроставитьПометкиВниз(ЭлементДерева);
		ПроставитьПометкиВверх(ЭлементДерева);
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПометкиОтметитьВсе(Команда)
	
	Для Каждого ЭлементДерева Из Настройки.ПолучитьЭлементы() Цикл
		ЭлементДерева.Пометка = 1;
		ПроставитьПометкиВниз(ЭлементДерева);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПометкиСнятьВсе(Команда)
	
	Для Каждого ЭлементДерева Из Настройки.ПолучитьЭлементы() Цикл
		ЭлементДерева.Пометка = 0;
		ПроставитьПометкиВниз(ЭлементДерева);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсе(Команда)
	
	Если Элементы.Настройки.ТекущиеДанные <> Неопределено Тогда
		Элементы.Настройки.Развернуть(Элементы.Настройки.ТекущаяСтрока, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьВсе(Команда)
	
	Если Элементы.Настройки.ТекущиеДанные <> Неопределено Тогда
		Элементы.Настройки.Свернуть(Элементы.Настройки.ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВФайл(Команда)
	
	ЕстьПометки = Ложь;
	Для Каждого ЭлементДерева Из Настройки.ПолучитьЭлементы() Цикл
		
		Если ЭлементДерева.Пометка > 0 Тогда
			ЕстьПометки = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЕстьПометки Тогда
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.Заголовок = НСтр("ru = 'Формирование данных выгружаемых настроек'");
		ПараметрыОжидания.ВыводитьСообщения = Истина;
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ВыгрузитьВФайлЗавершениеФормирования", ЭтотОбъект);
		
		ДлительнаяОперация = ВыгрузитьВФайлНаСервере();
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
		
	Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'Не выбраны настройки для выгрузки'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьИзФайлаЗавершениеВыбораФайла", ЭтотОбъект);
	
	ПараметрыЗагрузки = ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла();
	ПараметрыЗагрузки.ИдентификаторФормы = УникальныйИдентификатор;
	ПараметрыЗагрузки.Диалог.Заголовок = НСтр("ru = 'Выберите файл настроек'");
	ПараметрыЗагрузки.Диалог.МножественныйВыбор = Ложь;
	ПараметрыЗагрузки.Диалог.ПроверятьСуществованиеФайла = Истина;
	ПараметрыЗагрузки.Диалог.Фильтр = "Архив ZIP (*.zip)|*.zip";
	
	ФайловаяСистемаКлиент.ЗагрузитьФайл(Оповещение, ПараметрыЗагрузки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПредопределенные(Команда)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура Тест(Команда)
	
	ТестНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ТестНаСервере()
	
	Настройки.ПолучитьЭлементы().Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КонфигурацияИмя", Метаданные.Имя);
	Запрос.УстановитьПараметр("КонфигурацияПредставление", Метаданные.Представление());
	Запрос.УстановитьПараметр("КонфигурацияВерсия", Метаданные.Версия);
	Запрос.УстановитьПараметр("SimpleВерсия", SUI_Simple.Версия());
	Запрос.Текст =
		"ВЫБРАТЬ
		|	SUI_НастройкиДокументов.Ссылка КАК КлючДанных,
		|	SUI_НастройкиДокументов.Комментарий КАК Описание,
		|	SUI_НастройкиДокументов.Представление,
		|	10 КАК ИндексКартинки,
		|	&КонфигурацияИмя КАК КонфигурацияИмя,
		|	&КонфигурацияПредставление КАК КонфигурацияПредставление,
		|	&КонфигурацияВерсия КАК КонфигурацияВерсия,
		|	&SimpleВерсия КАК SimpleВерсия
		|ИЗ
		|	Справочник.SUI_НастройкиДокументов КАК SUI_НастройкиДокументов";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ЭлементыДерева = Настройки.ПолучитьЭлементы();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ЭлементДерева = ЭлементыДерева.Добавить();
			ЗаполнитьЗначенияСвойств(ЭлементДерева, Выборка);
			
			ЭлементДерева.Ключ = Выборка.КлючДанных.УникальныйИдентификатор();
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроставитьПометкиВниз(ДанныеСтроки)
	
	Значение = ДанныеСтроки.Пометка;
	
	Для Каждого Потомок Из ДанныеСтроки.ПолучитьЭлементы() Цикл
		
		Потомок.Пометка = Значение;
		
		ПроставитьПометкиВниз(Потомок);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроставитьПометкиВверх(ДанныеСтроки)
	
	РодительСтроки = ДанныеСтроки.ПолучитьРодителя();
	
	Если РодительСтроки <> Неопределено Тогда
		
		ВсеИстина = Истина;
		НеВсеЛожь = Ложь;
		
		Для Каждого Потомок Из РодительСтроки.ПолучитьЭлементы() Цикл
			ВсеИстина = ВсеИстина И (Потомок.Пометка = 1);
			НеВсеЛожь = НеВсеЛожь Или Булево(Потомок.Пометка);
		КонецЦикла;
		
		Если ВсеИстина Тогда
			РодительСтроки.Пометка = 1;
		ИначеЕсли НеВсеЛожь Тогда
			РодительСтроки.Пометка = 2;
		Иначе
			РодительСтроки.Пометка = 0;
		КонецЕсли;
		
		ПроставитьПометкиВверх(РодительСтроки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайлаЗавершениеВыбораФайла(ПомещенныйФайл, ДополнительныеПараметры) Экспорт
	
	Если ПомещенныйФайл = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = ЗагрузитьИзФайлаНаСервере(ПомещенныйФайл.Хранение);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Заголовок = НСтр("ru = 'Формирование данных загружаемых настроек'");
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗагрузитьИзФайлаЗавершение", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьИзФайлаНаСервере(АдресХранения)
	
	Настройки.ПолучитьЭлементы().Очистить();
	ЗагружаемыйФайлАдрес = АдресХранения;
	
	ПараметрыПроцедуры = Новый Структура();
	ПараметрыПроцедуры.Вставить("ДанныеФайла", ПолучитьИзВременногоХранилища(ЗагружаемыйФайлАдрес));
	ПараметрыПроцедуры.Вставить("НастройкиДерево", РеквизитФормыВЗначение("Настройки"));
	ПараметрыПроцедуры.Вставить("ТипНастроек", "НастройкиДокументов");
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Обработки.SUI_ИмпортЭкспортНастроек.ЗагрузитьИзФайла", 
		ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьИзФайлаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Результат.Сообщения) Тогда
		
		Для индекс = 0 По Результат.Сообщения.ВГраница() Цикл
			Результат.Сообщения[индекс].Сообщить();
		КонецЦикла;
		
	КонецЕсли;
	
	Если ПустаяСтрока(Результат.КраткоеПредставлениеОшибки) Тогда
		ЗагрузитьИзФайлаЗавершениеНаСервере(Результат.АдресРезультата);
	Иначе
		
		Если ЭтоАдресВременногоХранилища(ЗагружаемыйФайлАдрес) Тогда
			УдалитьИзВременногоХранилища(ЗагружаемыйФайлАдрес);
		КонецЕсли;
		
		ЗагружаемыйФайлАдрес = "";
		
		ПоказатьПредупреждение(, Результат.КраткоеПредставлениеОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзФайлаЗавершениеНаСервере(АдресРезультата)
	
	НастройкиДерево = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	ЗначениеВРеквизитФормы(НастройкиДерево, "Настройки");
	
КонецПроцедуры

&НаСервере
Функция ВыгрузитьВФайлНаСервере()
	
	ПараметрыПроцедуры = Новый Структура();
	ПараметрыПроцедуры.Вставить("ДеревоНастройки", РеквизитФормыВЗначение("Настройки"));
	ПараметрыПроцедуры.Вставить("ТипНастроек", "НастройкиДокументов");
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Обработки.SUI_ИмпортЭкспортНастроек.ВыгрузитьВФайл", 
		ПараметрыПроцедуры, ПараметрыВыполненияВФоне);
	
КонецФункции

&НаКлиенте
Процедура ВыгрузитьВФайлЗавершениеФормирования(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Результат.Сообщения) Тогда
		
		Для индекс = 0 По Результат.Сообщения.ВГраница() Цикл
			Результат.Сообщения[индекс].Сообщить();
		КонецЦикла;
		
	КонецЕсли;
	
	Если ПустаяСтрока(Результат.КраткоеПредставлениеОшибки) Тогда
		
		Оповещение = Новый ОписаниеОповещения("ВыгрузитьВФайлЗавершение", ЭтотОбъект);
		
		ПараметрыСохраненияФайла = ФайловаяСистемаКлиент.ПараметрыСохраненияФайла();
		ПараметрыСохраненияФайла.Диалог.Фильтр = "Архив ZIP (*.zip)|*.zip";
		ПараметрыСохраненияФайла.Диалог.МножественныйВыбор = Ложь;
		ПараметрыСохраненияФайла.Диалог.Заголовок = НСтр("ru = 'Сохранить файл настроек'");
		
		ИмяФайла = СтрШаблон(НСтр("ru = 'Настройки%1_%2'"), 
			SUI_SimpleКлиентСервер.Представление(), 
			Формат(ОбщегоНазначенияКлиент.ДатаСеанса(), "ДФ=dd_MM_yy_HH_mm_ss;"));
		
		ФайловаяСистемаКлиент.СохранитьФайл(Оповещение, Результат.АдресРезультата, ИмяФайла, ПараметрыСохраненияФайла);
		
	Иначе
		ПоказатьПредупреждение(, Результат.КраткоеПредставлениеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВФайлЗавершение(ВыгруженныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыгруженныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Настройки выгружены'"));
	
	Если ВыгруженныеФайлы.Количество() > 0 Тогда
		
		ПолноеИмяВыгруженногоФайла = ВыгруженныеФайлы[0].ПолноеИмя;
		
		Если ПолноеИмяВыгруженногоФайла <> Неопределено Тогда
			ФайловаяСистемаКлиент.ОткрытьПроводник(ПолноеИмяВыгруженногоФайла);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

//&НаКлиенте
//Процедура ВыбратьКаталогЗавершение(ПутьККаталогу, ДополнительныеПараметры) Экспорт
//	
//	Если ПустаяСтрока(ПутьККаталогу) Тогда
//		Возврат;
//	КонецЕсли;
//	
//	ЗаполнитьНастройкиИзФайла(ПутьККаталогу);
//	
//КонецПроцедуры
//
//&НаСервере
//Процедура ЗаполнитьНастройкиИзФайла(ПутьККаталогу)
//	
//	ПутьККаталогу = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьККаталогу);
//	РазделительПути = ПолучитьРазделительПути();
//	
//	Настройки.ПолучитьЭлементы().Очистить();
//	НастройкиДерево = РеквизитФормыВЗначение("Настройки");
//	
//	Для Каждого Файл Из НайтиФайлы(ПутьККаталогу, "*.xml", Истина) Цикл
//		
//		ПутьКФайлуВКаталоге = СтрЗаменить(Файл.ПолноеИмя, ПутьККаталогу, "");
//	    ДобавитьПутьФайлаВДерево(НастройкиДерево.Строки, ПутьКФайлуВКаталоге, РазделительПути);
//	    
//	КонецЦикла;
//	
//	ЗначениеВРеквизитФормы(НастройкиДерево, "Настройки");
//	
//КонецПроцедуры
//
//&НаСервере
//Процедура ДобавитьПутьФайлаВДерево(СтрокиДерева, Знач ПутьФайла, РазделительПути)
//	
//    ПозицияРазделителя = СтрНайти(ПутьФайла, РазделительПути);
//    
//    Если ПозицияРазделителя = 0 Тогда
//    	
//        ТекущееИмя = ПутьФайла;
//        ПутьФайла = "";
//        
//    Иначе
//    	
//        ТекущееИмя = Лев(ПутьФайла, ПозицияРазделителя - 1);
//        ПутьФайла = Прав(ПутьФайла, СтрДлина(ПутьФайла) - ПозицияРазделителя);
//        
//    КонецЕсли;
//	
//    СтрокаДерева = СтрокиДерева.Найти(ТекущееИмя, "Имя");
//    
//    Если СтрокаДерева = Неопределено Тогда
//    	
//        СтрокаДерева = СтрокиДерева.Добавить();
//        СтрокаДерева.Имя = ТекущееИмя;
//        
//    КонецЕсли;
//    
//    Если СтрДлина(ПутьФайла) = 0 Тогда
//    	СтрокаДерева.ЭтоКаталог = 10;
//    Иначе
//    	СтрокаДерева.ЭтоКаталог = 2;
//        ДобавитьПутьФайлаВДерево(СтрокаДерева.Строки, ПутьФайла, РазделительПути);
//    КонецЕсли;
//    
//КонецПроцедуры

#КонецОбласти
