
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбластьНастроек = Параметры.ОбластьНастроек;
	
	ОбластиНастроек = Обработки.SUI_ИмпортЭкспортНастроек.ОбластиНастроек();
	
	ИндексКартинкиФайла = Обработки.SUI_ИмпортЭкспортНастроек.ИндексКартинкиФайла();
	
	// Тест >>>
	ОбластьНастроек = ОбластиНастроек[1];
//	Параметры.РежимВыгрузки = Истина;
	// Тест <<<
	
	Если Параметры.РежимВыгрузки Тогда
		Заголовок = СтрШаблон(НСтр("ru = 'Экспорт: %1'"), ОбластьНастроек);
	Иначе
		Заголовок = СтрШаблон(НСтр("ru = 'Импорт: %1'"), ОбластьНастроек);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьОтображениеЭлементов();
	
	ПодключитьОбработчикОжидания("НачатьЗаполнениеДереваНастроекДляВыгрузки", 0.1, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНастройки

&НаКлиенте
Процедура НастройкиПометкаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Настройки.ТекущаяСтрока;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		
		ЭлементДерева = Настройки.НайтиПоИдентификатору(ТекущаяСтрока);
		
		ЭлементДерева.Пометка = ЭлементДерева.Пометка % 2;
		
		ПроставитьПометкиВниз(ЭлементДерева);
		ПроставитьПометкиВверх(ЭлементДерева);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПометкиОтметитьВсе(Команда)
	
	Для Каждого ЭлементДерева Из Настройки.ПолучитьЭлементы() Цикл
		ЭлементДерева.Пометка = 1;
		ПроставитьПометкиВниз(ЭлементДерева);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПометкиСнятьВсе(Команда)
	
	Для Каждого ЭлементДерева Из Настройки.ПолучитьЭлементы() Цикл
		ЭлементДерева.Пометка = 0;
		ПроставитьПометкиВниз(ЭлементДерева);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсе(Команда)
	
	Если Элементы.Настройки.ТекущаяСтрока <> Неопределено Тогда
		РазвернутьУзлыДерева(Настройки.НайтиПоИдентификатору(Элементы.Настройки.ТекущаяСтрока), Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьВсе(Команда)
	
	Если Элементы.Настройки.ТекущиеДанные <> Неопределено Тогда
		Элементы.Настройки.Свернуть(Элементы.Настройки.ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВФайл(Команда)
	
	ЕстьПометки = Ложь;
	Для Каждого ЭлементДерева Из Настройки.ПолучитьЭлементы() Цикл
		
		Если ЭлементДерева.Пометка > 0 Тогда
			ЕстьПометки = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЕстьПометки Тогда
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.Заголовок = НСтр("ru = 'Подготовка файла выгружаемых настроек'");
		ПараметрыОжидания.ВыводитьСообщения = Истина;
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ВыгрузитьВФайлЗавершениеФормирования", ЭтотОбъект);
		
		ДлительнаяОперация = ВыгрузитьВФайлНаСервере();
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
		
	Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'Не выбраны настройки для выгрузки'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьИзФайлаЗавершениеВыбораФайла", ЭтотОбъект);
	
	ПараметрыЗагрузки = ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла();
	ПараметрыЗагрузки.ИдентификаторФормы = УникальныйИдентификатор;
	ПараметрыЗагрузки.Диалог.Заголовок = НСтр("ru = 'Выберите файл настроек'");
	ПараметрыЗагрузки.Диалог.МножественныйВыбор = Ложь;
	ПараметрыЗагрузки.Диалог.ПроверятьСуществованиеФайла = Истина;
	ПараметрыЗагрузки.Диалог.Фильтр = "Архив ZIP (*.zip)|*.zip";
	
	ФайловаяСистемаКлиент.ЗагрузитьФайл(Оповещение, ПараметрыЗагрузки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНастройки(Команда)
	
	ЕстьПометки = Ложь;
	Для Каждого ЭлементДерева Из Настройки.ПолучитьЭлементы() Цикл
		
		Если ЭлементДерева.Пометка > 0 Тогда
			ЕстьПометки = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЕстьПометки Тогда
		
		Оповещение = Новый ОписаниеОповещения("ЗаписатьНастройкиПодтверждение", ЭтотОбъект, Новый Структура());
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Выполнить запись настроек?'"), РежимДиалогаВопрос.ДаНет);
		
	Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'Не выбраны настройки для записи'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПредопределенные(Команда)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПроставитьПометкиВниз(ДанныеСтроки)
	
	Значение = ДанныеСтроки.Пометка;
	
	Для Каждого Потомок Из ДанныеСтроки.ПолучитьЭлементы() Цикл
		
		Потомок.Пометка = Значение;
		
		ПроставитьПометкиВниз(Потомок);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроставитьПометкиВверх(ДанныеСтроки)
	
	РодительСтроки = ДанныеСтроки.ПолучитьРодителя();
	
	Если РодительСтроки <> Неопределено Тогда
		
		ВсеИстина = Истина;
		НеВсеЛожь = Ложь;
		
		Для Каждого Потомок Из РодительСтроки.ПолучитьЭлементы() Цикл
			ВсеИстина = ВсеИстина И (Потомок.Пометка = 1);
			НеВсеЛожь = НеВсеЛожь Или Булево(Потомок.Пометка);
		КонецЦикла;
		
		Если ВсеИстина Тогда
			РодительСтроки.Пометка = 1;
		ИначеЕсли НеВсеЛожь Тогда
			РодительСтроки.Пометка = 2;
		Иначе
			РодительСтроки.Пометка = 0;
		КонецЕсли;
		
		ПроставитьПометкиВверх(РодительСтроки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьУзлыДерева(Узел, КоличествоУровней = 1)
	
	Если Узел = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если КоличествоУровней = Неопределено Тогда
		Элементы.Настройки.Развернуть(Узел.ПолучитьИдентификатор(), Истина);
	Иначе
		
		Элементы.Настройки.Развернуть(Узел.ПолучитьИдентификатор(), Ложь);
		КоличествоУровней = КоличествоУровней - 1;
		
		Если КоличествоУровней > 0 Тогда
			
			ОстатокУровней = КоличествоУровней;
			
			Для Каждого ДочернийУзел Из Узел.ПолучитьЭлементы() Цикл
				
				РазвернутьУзлыДерева(ДочернийУзел, ОстатокУровней);
				ОстатокУровней = КоличествоУровней;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеЭлементов()
	
	Элементы.НастройкиВыгрузитьВФайл.Видимость = Параметры.РежимВыгрузки;
	Элементы.НастройкиЗагрузитьИзФайла.Видимость = Не Параметры.РежимВыгрузки;
	Элементы.НастройкиЗагрузитьПредопределенные.Видимость = Не Параметры.РежимВыгрузки;
	Элементы.НастройкиЗаписатьНастройки.Видимость = Не Параметры.РежимВыгрузки;
	
	Элементы.Настройкиdescription.РедактированиеТекста = Параметры.РежимВыгрузки;
	
	Если Параметры.РежимВыгрузки Тогда
		Элементы.НастройкиВыгрузитьВФайл.КнопкаПоУмолчанию = Истина;
	Иначе
		
		Если Настройки.ПолучитьЭлементы().Количество() > 0 Тогда
			Элементы.НастройкиЗаписатьНастройки.КнопкаПоУмолчанию = Истина;
		Иначе
			Элементы.НастройкиЗагрузитьИзФайла.КнопкаПоУмолчанию = Истина;
			Элементы.НастройкиЗаписатьНастройки.Видимость = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#Область ЗагрузкаИзФайла

&НаКлиенте
Процедура ЗагрузитьИзФайлаЗавершениеВыбораФайла(ПомещенныйФайл, ДополнительныеПараметры) Экспорт
	
	Если ПомещенныйФайл = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Настройки.ПолучитьЭлементы().Очистить();
	
	ДлительнаяОперация = ЗагрузитьИзФайлаНаСервере(ПомещенныйФайл.Хранение);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Заголовок = НСтр("ru = 'Чтение файла загружаемых настроек'");
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаполнениеДереваНастроекЗавершение", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьИзФайлаНаСервере(АдресХранения)
	
	ЗагружаемыйФайлАдрес = АдресХранения;
	
	ПараметрыПроцедуры = Новый Структура();
	ПараметрыПроцедуры.Вставить("ДанныеФайла", ПолучитьИзВременногоХранилища(ЗагружаемыйФайлАдрес));
	ПараметрыПроцедуры.Вставить("НастройкиДерево", РеквизитФормыВЗначение("Настройки"));
	ПараметрыПроцедуры.Вставить("Область", ОбластьНастроек);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Обработки.SUI_ИмпортЭкспортНастроек.ЗаполнитьДеревоНастроек", 
		ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьИзФайлаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Результат.Сообщения) Тогда
		
		Для индекс = 0 По Результат.Сообщения.ВГраница() Цикл
			Результат.Сообщения[индекс].Сообщить();
		КонецЦикла;
		
	КонецЕсли;
	
	Если ПустаяСтрока(Результат.КраткоеПредставлениеОшибки) Тогда
		ЗагрузитьДеревоНастроекНаСервере(Результат.АдресРезультата);
	Иначе
		
		Если ЭтоАдресВременногоХранилища(ЗагружаемыйФайлАдрес) Тогда
			УдалитьИзВременногоХранилища(ЗагружаемыйФайлАдрес);
		КонецЕсли;
		
		ЗагружаемыйФайлАдрес = "";
		
		ПоказатьПредупреждение(, Результат.КраткоеПредставлениеОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ВыгрузкаВФайл

&НаСервере
Функция ВыгрузитьВФайлНаСервере()
	
	ПараметрыПроцедуры = Новый Структура();
	ПараметрыПроцедуры.Вставить("ДеревоНастройки", РеквизитФормыВЗначение("Настройки"));
	ПараметрыПроцедуры.Вставить("Область", ОбластьНастроек);
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Обработки.SUI_ИмпортЭкспортНастроек.ВыгрузитьВФайл", 
		ПараметрыПроцедуры, ПараметрыВыполненияВФоне);
	
КонецФункции

&НаКлиенте
Процедура ВыгрузитьВФайлЗавершениеФормирования(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Результат.Сообщения) Тогда
		
		Для индекс = 0 По Результат.Сообщения.ВГраница() Цикл
			Результат.Сообщения[индекс].Сообщить();
		КонецЦикла;
		
	КонецЕсли;
	
	Если ПустаяСтрока(Результат.КраткоеПредставлениеОшибки) Тогда
		
		Оповещение = Новый ОписаниеОповещения("ВыгрузитьВФайлЗавершение", ЭтотОбъект);
		
		ПараметрыСохраненияФайла = ФайловаяСистемаКлиент.ПараметрыСохраненияФайла();
		ПараметрыСохраненияФайла.Диалог.Фильтр = "Архив ZIP (*.zip)|*.zip";
		ПараметрыСохраненияФайла.Диалог.МножественныйВыбор = Ложь;
		ПараметрыСохраненияФайла.Диалог.Заголовок = НСтр("ru = 'Сохранить файл настроек'");
		
		ИмяФайла = СтрШаблон(НСтр("ru = 'Настройки%1_%2'"), 
			SUI_SimpleКлиентСервер.Представление(), 
			Формат(ОбщегоНазначенияКлиент.ДатаСеанса(), "ДФ=dd_MM_yy_HH_mm_ss;"));
		
		ФайловаяСистемаКлиент.СохранитьФайл(Оповещение, Результат.АдресРезультата, ИмяФайла, ПараметрыСохраненияФайла);
		
	Иначе
		ПоказатьПредупреждение(, Результат.КраткоеПредставлениеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВФайлЗавершение(ВыгруженныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыгруженныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Настройки выгружены'"));
	
	Если ВыгруженныеФайлы.Количество() > 0 Тогда
		
		ПолноеИмяВыгруженногоФайла = ВыгруженныеФайлы[0].ПолноеИмя;
		
		Если ПолноеИмяВыгруженногоФайла <> Неопределено Тогда
			ФайловаяСистемаКлиент.ОткрытьПроводник(ПолноеИмяВыгруженногоФайла);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеДереваНастроек

&НаКлиенте
Процедура НачатьЗаполнениеДереваНастроекДляВыгрузки() Экспорт
	
	Если Не Параметры.РежимВыгрузки Тогда
		Возврат;
	КонецЕсли;
	
	Настройки.ПолучитьЭлементы().Очистить();
	
	Если ОбластиНастроек.Найти(ОбластьНастроек) <> Неопределено Тогда
		
		ДлительнаяОперация = ЗаполнитьДеревоНастроекНаСервере();
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.Заголовок = НСтр("ru = 'Заполнение списка настроек доступных для выгрузки'");
		ПараметрыОжидания.ВыводитьСообщения = Истина;
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаполнениеДереваНастроекЗавершение", ЭтотОбъект);
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьДеревоНастроекНаСервере()
	
	ПараметрыПроцедуры = Новый Структура();
	ПараметрыПроцедуры.Вставить("НастройкиДерево", РеквизитФормыВЗначение("Настройки"));
	ПараметрыПроцедуры.Вставить("Область", ОбластьНастроек);
	ПараметрыПроцедуры.Вставить("ЭтоВыгрузка");
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Обработки.SUI_ИмпортЭкспортНастроек.ЗаполнитьДеревоНастроек", 
		ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ЗаполнениеДереваНастроекЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Результат.Сообщения) Тогда
		
		Для индекс = 0 По Результат.Сообщения.ВГраница() Цикл
			Результат.Сообщения[индекс].Сообщить();
		КонецЦикла;
		
	КонецЕсли;
	
	Если ПустаяСтрока(Результат.КраткоеПредставлениеОшибки) Тогда
		
		ЗагрузитьДеревоНастроекНаСервере(Результат.АдресРезультата);
		
		Для Каждого ЭлементДерева Из Настройки.ПолучитьЭлементы() Цикл
			РазвернутьУзлыДерева(ЭлементДерева, 2);
		КонецЦикла;
		
		ОбновитьОтображениеЭлементов();
		
	Иначе
		ПоказатьПредупреждение(, Результат.КраткоеПредставлениеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДеревоНастроекНаСервере(АдресРезультата)
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	ТипРезультата = ТипЗнч(Результат);
	
	Если ТипРезультата = Тип("ДеревоЗначений") Тогда
		Дерево = Результат;
	ИначеЕсли ТипРезультата = Тип("Структура") Тогда
		
		Дерево = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "НастройкиДерево");
		
	КонецЕсли;
	
	Если ТипЗнч(Дерево) = Тип("ДеревоЗначений") Тогда
		ЗначениеВРеквизитФормы(Дерево, "Настройки");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаписьНастроек

&НаКлиенте
Процедура ЗаписатьНастройкиПодтверждение(Ответ, Контекст) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Заголовок = НСтр("ru = 'Запись настроек'");
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаполнениеДереваНастроекЗавершение", ЭтотОбъект);
	
	ДлительнаяОперация = ЗаписатьНастройкиНаСервере();
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьНастройкиНаСервере()
	
	ПараметрыПроцедуры = Новый Структура();
	ПараметрыПроцедуры.Вставить("ДанныеФайла", ПолучитьИзВременногоХранилища(ЗагружаемыйФайлАдрес));
	ПараметрыПроцедуры.Вставить("НастройкиДерево", РеквизитФормыВЗначение("Настройки"));
	ПараметрыПроцедуры.Вставить("Область", ОбластьНастроек);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Обработки.SUI_ИмпортЭкспортНастроек.ЗаписатьНастройки", 
		ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

#КонецОбласти

#КонецОбласти
