
#Область ПрограммныйИнтерфейс

// Имя события.
// 
// Параметры:
//  ВложенноеСобытие - Строка - Вложенное событие
// 
// Возвращаемое значение:
//  Строка - Имя события
Функция ИмяСобытия(ВложенноеСобытие = "") Экспорт
	Возврат НСтр("ru = 'HTTP сервис'") + ?(ЗначениеЗаполнено(ВложенноеСобытие), ". " + ВложенноеСобытие, "");
КонецФункции

// Параметры обработки входящего запроса.
// 
// Возвращаемое значение:
//  Структура - Параметры обработки входящего запроса:
// * ВосстанавливатьСсылкиИдентификаторов - Булево - 
// * ПроверятьСсылкиПриВосстановлении - Булево - 
// * ПрочитатьПараметрыИзТела - Булево - 
// * ИменаПараметровДатыВТеле - Произвольный -
Функция ПараметрыОбработкиВходящегоЗапроса() Экспорт
	
	ПараметрыОбработки = Новый Структура();
	
	ПараметрыОбработки.Вставить("ВосстанавливатьСсылкиИдентификаторов", Истина);
	ПараметрыОбработки.Вставить("ПроверятьСсылкиПриВосстановлении", Истина);
	ПараметрыОбработки.Вставить("ПрочитатьПараметрыИзТела", Ложь);
	ПараметрыОбработки.Вставить("ИменаПараметровДатыВТеле");
	
	//@skip-check constructor-function-return-section
	Возврат ПараметрыОбработки;
	
КонецФункции

Функция ИспользуетсяСжатие(Заголовки) Экспорт
	Возврат (СтрНайти(SUI_ОбщегоНазначенияКлиентСервер.ЗначениеСоответствия(Заголовки, "Content-Encoding", "", Тип("Строка")), "gzip") > 0
		Или СтрНайти(SUI_ОбщегоНазначенияКлиентСервер.ЗначениеСоответствия(Заголовки, "Simple-Content-Encoding", "", Тип("Строка")), "gzip") > 0);
КонецФункции

Функция ПолучитьТелоИзHTTPСервисЗапросОтвет(HTTPСервисЗапросОтвет) Экспорт
	
	Тело = HTTPСервисЗапросОтвет.ПолучитьТелоКакДвоичныеДанные();
	
	Если ЗначениеЗаполнено(Тело) И ИспользуетсяСжатие(HTTPСервисЗапросОтвет.Заголовки) Тогда
		
		#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
			Тело = SUI_HTTPСервис.ПрочитатьКакGZip(Тело, Истина);
		#Иначе
			Тело = SUI_HTTPСервисВызовСервера.ПрочитатьКакGZip(Тело, Истина);
		#КонецЕсли
		
	КонецЕсли;
	
	ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка");
	Если СтрНайти(ОписаниеТипаСтрока.ПривестиЗначение(HTTPСервисЗапросОтвет.Заголовки.Получить("Content-Type")), "application/json") > 0 Тогда
		Возврат ПолучитьСтрокуИзДвоичныхДанных(Тело, КодировкаТекста.UTF8);
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

#КонецОбласти
