
#Область ПрограммныйИнтерфейс

Процедура SUI_ОчередьЗаданийПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	Если Отказ Или
		Источник.Количество() = 0 Или
		Источник.ДополнительныеСвойства.Свойство("SUI_ЗаписьВРегламентномЗадании") Тогда
		Возврат;
	КонецЕсли;

	ЗапуститьРегламентноеЗадание = Ложь;
	Для Каждого Запись Из Источник Цикл
		Если Запись.ВнеОчереди И Запись.Статус = Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Открыто Тогда
			ЗапуститьРегламентноеЗадание = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ЗапуститьРегламентноеЗадание Тогда
		
		КлючРЗ = SUI_ОчередьЗаданийКлиентСервер.КлючиРегламентныхЗаданий().ОбработатьОчередь;
		SUI_РегламентныеЗадания.ВыполнитьРегламентноеЗаданиеВручную(КлючРЗ, Неопределено, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьЗадание(Знач ПараметрыЗадания) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	
	Попытка
		
		ОбработатьПараметрыСозданияЗадания(ПараметрыЗадания);
		
		Идентификатор = Новый УникальныйИдентификатор();
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.SUI_ОчередьЗаданий");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
		ЭлементБлокировки.УстановитьЗначение("Идентификатор", Идентификатор);
		ЭлементБлокировки.УстановитьЗначение("Хеш", ПараметрыЗадания.Хеш);
		Блокировка.Заблокировать();
			
		МенеджерЗаписи = РегистрыСведений.SUI_ОчередьЗаданий.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.Идентификатор 			= Идентификатор;
		МенеджерЗаписи.Хеш 						= ПараметрыЗадания.Хеш;
		МенеджерЗаписи.Наименование 			= ПараметрыЗадания.Наименование; 
		МенеджерЗаписи.ИдентификаторДокумента	= ПараметрыЗадания.ИдентификаторДокумента;
		МенеджерЗаписи.Статус 					= Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Открыто;
		МенеджерЗаписи.Обработчики 				= Новый ХранилищеЗначения(ПараметрыЗадания.Обработчики, Новый СжатиеДанных(9));
		МенеджерЗаписи.ВнеОчереди 				= ПараметрыЗадания.ВнеОчереди;
		МенеджерЗаписи.Создано 					= ТекущаяДатаСеанса();
		
		Если Не ПустаяСтрока(ПараметрыЗадания.ПроцедураЗавершения) Тогда
			ОбработчикЗавершения = Новый Структура();
			ОбработчикЗавершения.Вставить("ИмяМетода", ПараметрыЗадания.ПроцедураЗавершения);
			ОбработчикЗавершения.Вставить("Параметры", ПараметрыЗадания.ПараметрыПроцедурыЗавершения);
			МенеджерЗаписи.ОбработчикЗавершения = Новый ХранилищеЗначения(ОбработчикЗавершения, Новый СжатиеДанных(9));
		КонецЕсли;
		
		МенеджерЗаписи.Записать(Истина);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		Пока ТранзакцияАктивна() Цикл
			ОтменитьТранзакцию();
		КонецЦикла;
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(SUI_ОчередьЗаданийКлиентСервер.ИмяСобытия(), , 
			Метаданные.ОбщиеМодули.SUI_ОчередьЗаданий, , ИнформацияОбОшибке());
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

Процедура ОбработатьОчередь() Экспорт
	
	ИнформационнаяБазаФайловая = ОбщегоНазначения.ИнформационнаяБазаФайловая();
	
	КоличествоЗаданийВПотоке = Константы.SUI_КоличествоЗаданийВПотокеОчередиЗаданий.Получить();
	КоличествоЗаданийВПотоке = ?(КоличествоЗаданийВПотоке = 0, 1, КоличествоЗаданийВПотоке);
	
	ТаблицаЗаданий = ПолучитьЗадания(КоличествоЗаданийВПотоке, Истина);
	
	Пока Истина Цикл
		
		Если ТаблицаЗаданий.Количество() = 0 Тогда
			Прервать;
		КонецЕсли;
		
		ВыполнитьЗадания(ТаблицаЗаданий, Не ИнформационнаяБазаФайловая);
				
		ТаблицаЗаданий = ПолучитьЗадания(КоличествоЗаданийВПотоке, , ТаблицаЗаданий);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОчиститьОчередь() Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДатаНачала 			= Новый СтандартнаяДатаНачала;
	ДатаНачала.Вариант 	= ВариантСтандартнойДатыНачала.НачалоПрошлогоДня;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачальнаяДата", ДатаНачала.Дата);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	SUI_ОчередьЗаданий.Идентификатор КАК Идентификатор,
		|	SUI_ОчередьЗаданий.Хеш КАК Хеш
		|ИЗ
		|	РегистрСведений.SUI_ОчередьЗаданий КАК SUI_ОчередьЗаданий
		|ГДЕ
		|	SUI_ОчередьЗаданий.Создано < &НачальнаяДата";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
			
		Попытка
		
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.SUI_ОчередьЗаданий");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
			ЭлементБлокировки.УстановитьЗначение("Идентификатор", Выборка.Идентификатор);
			ЭлементБлокировки.УстановитьЗначение("Хеш", Выборка.Хеш);
			Блокировка.Заблокировать();
			
			НаборЗаписей = РегистрыСведений.SUI_ОчередьЗаданий.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Идентификатор.Установить(Выборка.Идентификатор);
			НаборЗаписей.Отбор.Хеш.Установить(Выборка.Хеш);
			
			НаборЗаписей.ДополнительныеСвойства.Вставить("SUI_ЗаписьВРегламентномЗадании");
			НаборЗаписей.Записать(Истина);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			Пока ТранзакцияАктивна() Цикл
				ОтменитьТранзакцию();
			КонецЦикла;
			SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(SUI_ОчередьЗаданийКлиентСервер.ИмяСобытия(), ,
				Метаданные.ОбщиеМодули.SUI_ОчередьЗаданий, , ИнформацияОбОшибке());
			ВызватьИсключение;
		КонецПопытки;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриДобавленииРегламентныхЗаданийПодсистемы(РегламентныеЗаданияПодсистемы) Экспорт
	
	// ОбработатьОчередь
	РегламентноеЗаданиеПодсистемы = РегламентныеЗаданияПодсистемы.Добавить();
	РегламентноеЗаданиеПодсистемы.Ключ = SUI_ОчередьЗаданийКлиентСервер.КлючиРегламентныхЗаданий().ОбработатьОчередь;
	РегламентноеЗаданиеПодсистемы.Наименование = НСтр("ru = 'Simple: Обработка очереди заданий'");
	РегламентноеЗаданиеПодсистемы.ИмяМетода = "SUI_ОчередьЗаданий.ОбработатьОчередь";
	РегламентноеЗаданиеПодсистемы.КоличествоПовторовПриАварийномЗавершении = 1;
	РегламентноеЗаданиеПодсистемы.ИнтервалПовтораПриАварийномЗавершении = 10;
	РегламентноеЗаданиеПодсистемы.Расписание.ПериодПовтораДней = 1;
	РегламентноеЗаданиеПодсистемы.Расписание.ПериодПовтораВТечениеДня = 60;
	
	// Очистка очереди заданий
	РегламентноеЗаданиеПодсистемы = РегламентныеЗаданияПодсистемы.Добавить();
	РегламентноеЗаданиеПодсистемы.Ключ = SUI_ОчередьЗаданийКлиентСервер.КлючиРегламентныхЗаданий().ОчиститьОчередь;
	РегламентноеЗаданиеПодсистемы.Наименование = НСтр("ru = 'Simple: Очистка очереди заданий'");
	РегламентноеЗаданиеПодсистемы.ИмяМетода = "SUI_ОчередьЗаданий.ОчиститьОчередь";
	РегламентноеЗаданиеПодсистемы.КоличествоПовторовПриАварийномЗавершении = 1;
	РегламентноеЗаданиеПодсистемы.ИнтервалПовтораПриАварийномЗавершении = 60;
	РегламентноеЗаданиеПодсистемы.Расписание.ПериодПовтораДней = 1;
	
КонецПроцедуры

Процедура ЗапуститьЗадание(ИдентификаторЗадания, Обработчики) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
		
	Для Индекс = 0 По Обработчики.ВГраница() Цикл
		ОбщегоНазначения.ВыполнитьМетодКонфигурации(Обработчики[Индекс].ИмяМетода, Обработчики[Индекс].Параметры);
	КонецЦикла;
		
КонецПроцедуры

Процедура ВыполнитьОбработчикЗавершения(Параметры, АдресРезультата = Неопределено) Экспорт 
	
	ОбработчикЗавершения 	= Параметры.ОбработчикЗавершения;
	Данные 					= Параметры.Данные;
	
	Если ОбработчикЗавершения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Данные.Статус <> Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Выполнено И
		Данные.Статус <> Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.ОшибкаОбработки Тогда
		Возврат;
	КонецЕсли;
	
	ИмяМетода = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ОбработчикЗавершения, "ИмяМетода", "", Тип("Строка"));
	Если ПустаяСтрока(ИмяМетода) Тогда
		Возврат;
	КонецЕсли;
	
	Результат = Новый Структура();
	Результат.Вставить("Статус", "");
	Результат.Вставить("КраткоеПредставлениеОшибки", "");
	Результат.Вставить("ПодробноеПредставлениеОшибки", "");
	
	ПараметрыМетода = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ОбработчикЗавершения, "Параметры");
	
	Если Данные.Статус = Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Выполнено Тогда
		Результат.Статус = "Выполнено";
	ИначеЕсли Данные.Статус = Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.ОшибкаОбработки Тогда
		Результат.Статус = "Ошибка";
		Результат.КраткоеПредставлениеОшибки = Данные.КраткоеОписаниеРезультата;
		Результат.ПодробноеПредставлениеОшибки = Данные.ПодробноеОписаниеРезультата;
	КонецЕсли;
	
	Попытка
		ОбщегоНазначения.ВыполнитьМетодКонфигурации(
			ИмяМетода, SUI_ОбщегоНазначенияКлиентСервер.МассивЗначений(Результат, ПараметрыМетода));
	Исключение
		Пока ТранзакцияАктивна() Цикл
			ОтменитьТранзакцию();
		КонецЦикла;
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьПараметрыСозданияЗадания(ПараметрыЗадания)

	ОписаниеТипаМассив 				= Новый ОписаниеТипов("Массив");
	
	ПараметрыЗадания.Наименование 	= ОбщегоНазначения.ОписаниеТипаСтрока(150).ПривестиЗначение(ПараметрыЗадания.Наименование);
	ПараметрыЗадания.ВнеОчереди 	= SUI_ОбщегоНазначенияКлиентСервер.ОписаниеТипаБулево().ПривестиЗначение(ПараметрыЗадания.ВнеОчереди);
	ПараметрыЗадания.Обработчики	= ОписаниеТипаМассив.ПривестиЗначение(ПараметрыЗадания.Обработчики);
		
	ОбщегоНазначенияКлиентСервер.Проверить(ПараметрыЗадания.Обработчики.Количество() > 0,
		НСтр("ru = 'Отсутствуют обработчики задания'"), "SUI_ОчередьЗаданий.ОбработатьПараметрыСозданияЗадания");
		
	СписокМетодов 			= Новый Массив();
	ОбработанныеОбработчики = Новый Массив();
	
	Для Каждого Обработчик Из ПараметрыЗадания.Обработчики Цикл
		
		НовыйОбработчик = SUI_ОчередьЗаданийКлиентСервер.СтруктураОбработчикаЗадания();
		
		НовыйОбработчик.ИмяМетода = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Обработчик, "ИмяМетода", "", Тип("Строка"));
		НовыйОбработчик.Параметры = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Обработчик, "Параметры", Новый Массив(), Тип("Массив"));
		
		мсвИмяМетода = СтрРазделить(НовыйОбработчик.ИмяМетода, ".", Ложь);
		
		ОбщегоНазначенияКлиентСервер.Проверить(мсвИмяМетода.Количество() = 2 Или мсвИмяМетода.Количество() = 3, 
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Неправильное имя метода %1'"), НовыйОбработчик.ИмяМетода), 
			"SUI_ОчередьЗаданий.ОбработатьПараметрыСозданияЗадания");
		
		СписокМетодов.Добавить(НовыйОбработчик.ИмяМетода);
		
		ОбработанныеОбработчики.Добавить(НовыйОбработчик);
	
	КонецЦикла;
	
	ПараметрыЗадания.Обработчики = ОбработанныеОбработчики;
	
	ПараметрыДляХЕШ = SUI_ОбщегоНазначенияКлиентСервер.МассивЗначений(ПараметрыЗадания.Обработчики,
		ПараметрыЗадания.ПроцедураЗавершения, ПараметрыЗадания.ПараметрыПроцедурыЗавершения);
		
	ПараметрыЗадания.Вставить("Хеш", НРег(ОбщегоНазначения.КонтрольнаяСуммаСтрокой(ПараметрыДляХЕШ, ХешФункция.SHA256)));
	
	Если ПустаяСтрока(ПараметрыЗадания.Наименование) Тогда
		ПараметрыЗадания.Наименование = СтрСоединить(СписокМетодов, ";");
	КонецЕсли;
	
	ПараметрыЗадания.Наименование = СокрЛП(ПараметрыЗадания.Наименование);
	
	Если СтрДлина(ПараметрыЗадания.Наименование) > 150 Тогда
		ПараметрыЗадания.Наименование = Лев(ПараметрыЗадания.Наименование, 147) + "...";
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьЗадания(Знач МаксимальноеКоличествоЗаданий, ПервыйЗапуск = Ложь, ТаблицаЗаданий = Неопределено)
	
	Если ТаблицаЗаданий <> Неопределено Тогда
		
		МаксимальноеКоличествоЗаданий = МаксимальноеКоличествоЗаданий - ТаблицаЗаданий.Количество();
		
		Если МаксимальноеКоличествоЗаданий <= 0 Тогда
			Возврат ТаблицаЗаданий;
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Статусы", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Открыто));
	
	Если ПервыйЗапуск Тогда
		Запрос.Параметры.Статусы.Добавить(Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Выполняется);
	КонецЕсли;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	SUI_ОчередьЗаданий.Идентификатор КАК Идентификатор,
		|	SUI_ОчередьЗаданий.Хеш КАК Хеш,
		|	SUI_ОчередьЗаданий.Статус КАК Статус,
		|	SUI_ОчередьЗаданий.ВнеОчереди КАК ВнеОчереди,
		|	SUI_ОчередьЗаданий.Создано КАК Создано,
		|	SUI_ОчередьЗаданий.Обновлено КАК Обновлено,
		|	SUI_ОчередьЗаданий.Наименование КАК Наименование
		|ПОМЕСТИТЬ втЗадания
		|ИЗ
		|	РегистрСведений.SUI_ОчередьЗаданий КАК SUI_ОчередьЗаданий
		|ГДЕ
		|	SUI_ОчередьЗаданий.Статус В(&Статусы)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Хеш,
		|	Создано
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втЗадания.Хеш КАК Хеш,
		|	МИНИМУМ(втЗадания.Создано) КАК Создано,
		|	ЗНАЧЕНИЕ(Перечисление.SUI_СтатусыОбработкиОчередиЗаданий.Выполняется) КАК НовыйСтатус
		|ПОМЕСТИТЬ втПервые
		|ИЗ
		|	втЗадания КАК втЗадания
		|ГДЕ
		|	втЗадания.Статус = ЗНАЧЕНИЕ(Перечисление.SUI_СтатусыОбработкиОчередиЗаданий.Открыто)
		|
		|СГРУППИРОВАТЬ ПО
		|	втЗадания.Хеш
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Хеш,
		|	Создано
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втЗадания.Идентификатор КАК Идентификатор,
		|	втЗадания.Хеш КАК Хеш,
		|	втЗадания.Статус КАК ТекущийСтатус,
		|	ЕСТЬNULL(втПервые.НовыйСтатус, ВЫБОР
		|			КОГДА втЗадания.Статус <> ЗНАЧЕНИЕ(Перечисление.SUI_СтатусыОбработкиОчередиЗаданий.Выполняется)
		|				ТОГДА ЗНАЧЕНИЕ(Перечисление.SUI_СтатусыОбработкиОчередиЗаданий.Закрыто)
		|			ИНАЧЕ втЗадания.Статус
		|		КОНЕЦ) КАК НовыйСтатус,
		|	втЗадания.Наименование КАК Наименование,
		|	SUI_ОчередьЗаданий.Обработчики КАК Обработчики,
		|	SUI_ОчередьЗаданий.ИдентификаторЗадания КАК ИдентификаторЗадания,
		|	SUI_ОчередьЗаданий.ВнеОчереди КАК ВнеОчереди,
		|	SUI_ОчередьЗаданий.Создано КАК Создано,
		|	SUI_ОчередьЗаданий.Обновлено КАК Обновлено
		|ПОМЕСТИТЬ втЗаданияКОбработке
		|ИЗ
		|	втЗадания КАК втЗадания
		|		ЛЕВОЕ СОЕДИНЕНИЕ втПервые КАК втПервые
		|		ПО втЗадания.Хеш = втПервые.Хеш
		|			И втЗадания.Создано = втПервые.Создано
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.SUI_ОчередьЗаданий КАК SUI_ОчередьЗаданий
		|		ПО втЗадания.Идентификатор = SUI_ОчередьЗаданий.Идентификатор
		|			И втЗадания.Хеш = SUI_ОчередьЗаданий.Хеш
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ втЗадания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ втПервые
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	втЗаданияКОбработке.Идентификатор КАК Идентификатор,
		|	втЗаданияКОбработке.Хеш КАК Хеш,
		|	втЗаданияКОбработке.ТекущийСтатус КАК ТекущийСтатус,
		|	втЗаданияКОбработке.НовыйСтатус КАК НовыйСтатус,
		|	втЗаданияКОбработке.Наименование КАК Наименование,
		|	1 КАК ПорядокЗапуска,
		|	втЗаданияКОбработке.Обработчики КАК Обработчики,
		|	втЗаданияКОбработке.ИдентификаторЗадания КАК ИдентификаторЗадания,
		|	втЗаданияКОбработке.ВнеОчереди КАК ВнеОчереди,
		|	втЗаданияКОбработке.Создано КАК Создано,
		|	втЗаданияКОбработке.Обновлено КАК Обновлено
		|ИЗ
		|	втЗаданияКОбработке КАК втЗаданияКОбработке
		|ГДЕ
		|	втЗаданияКОбработке.НовыйСтатус = ЗНАЧЕНИЕ(Перечисление.SUI_СтатусыОбработкиОчередиЗаданий.Выполняется)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втЗаданияКОбработке.Идентификатор,
		|	втЗаданияКОбработке.Хеш,
		|	втЗаданияКОбработке.ТекущийСтатус,
		|	втЗаданияКОбработке.НовыйСтатус,
		|	втЗаданияКОбработке.Наименование,
		|	2,
		|	втЗаданияКОбработке.Обработчики,
		|	втЗаданияКОбработке.ИдентификаторЗадания,
		|	втЗаданияКОбработке.ВнеОчереди,
		|	втЗаданияКОбработке.Создано,
		|	втЗаданияКОбработке.Обновлено
		|ИЗ
		|	втЗаданияКОбработке КАК втЗаданияКОбработке
		|ГДЕ
		|	втЗаданияКОбработке.НовыйСтатус = ЗНАЧЕНИЕ(Перечисление.SUI_СтатусыОбработкиОчередиЗаданий.Закрыто)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПорядокЗапуска,
		|	ВнеОчереди УБЫВ,
		|	Создано,
		|	Обновлено";
	
	Если МаксимальноеКоличествоЗаданий > 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1", "ПЕРВЫЕ " + Формат(МаксимальноеКоличествоЗаданий, "ЧДЦ=0; ЧГ=0"));
	Иначе 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1", "");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если ТаблицаЗаданий = Неопределено Тогда
		ТаблицаЗаданий = РезультатЗапроса.Выгрузить();
		
		Колонка_ПорядокЗапуска = ТаблицаЗаданий.Колонки.Найти("ПорядокЗапуска");
		Если Колонка_ПорядокЗапуска <> Неопределено Тогда
			ТаблицаЗаданий.Колонки.Удалить(Колонка_ПорядокЗапуска);
		КонецЕсли;
		
		Колонка_ВнеОчереди = ТаблицаЗаданий.Колонки.Найти("ВнеОчереди");
		Если Колонка_ВнеОчереди <> Неопределено Тогда
			ТаблицаЗаданий.Колонки.Удалить(Колонка_ВнеОчереди);
		КонецЕсли;
		
		Колонка_Создано = ТаблицаЗаданий.Колонки.Найти("Создано");
		Если Колонка_Создано <> Неопределено Тогда
			ТаблицаЗаданий.Колонки.Удалить(Колонка_Создано);
		КонецЕсли;
		
		Колонка_Обновлено = ТаблицаЗаданий.Колонки.Найти("Обновлено");
		Если Колонка_Обновлено <> Неопределено Тогда
			ТаблицаЗаданий.Колонки.Удалить(Колонка_Обновлено);
		КонецЕсли;
		
	Иначе 
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ТаблицаЗаданий.Добавить(), Выборка);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ТаблицаЗаданий;
	
КонецФункции

Процедура ВыполнитьЗадания(ТаблицаЗаданий, ВыполнятьВФоне = Истина)
	
	УстановитьПривилегированныйРежим(Истина);
	
	мсвСтрокиЗадания = Новый Массив();
	
	Для Каждого СтрокаТаблицыЗаданий Из ТаблицаЗаданий Цикл
		
		Если СтрокаТаблицыЗаданий.ТекущийСтатус = СтрокаТаблицыЗаданий.НовыйСтатус Тогда
			Если СтрокаТаблицыЗаданий.ТекущийСтатус = Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Выполняется Тогда
				мсвСтрокиЗадания.Добавить(СтрокаТаблицыЗаданий);
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		Идентификатор = СтрокаТаблицыЗаданий.Идентификатор;
		Хеш = СтрокаТаблицыЗаданий.Хеш;
		
		РезультатОбновленияЗаписи = ОбновитьЗаписьЗадания(Идентификатор, Хеш, Новый Структура("Статус", СтрокаТаблицыЗаданий.НовыйСтатус));
		Если РезультатОбновленияЗаписи.Выполнено Тогда
			СтрокаТаблицыЗаданий.ТекущийСтатус = СтрокаТаблицыЗаданий.НовыйСтатус;
		КонецЕсли;
		
		Если СтрокаТаблицыЗаданий.ТекущийСтатус <> Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Выполняется Тогда
			Если СтрокаТаблицыЗаданий.ТекущийСтатус <> Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Закрыто Тогда                
				ЗакрытьЗадание(Идентификатор, Хеш, Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Закрыто, , Ложь);
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		НачатьТранзакцию();
		
		Попытка
			
			ДанныеКОбновленииВЗаписи = Новый Структура();
			
			Если ВыполнятьВФоне Тогда
			
				ФоновоеЗадание = Неопределено;
				Если СтрокаТаблицыЗаданий.ИдентификаторЗадания <> ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор() Тогда
					ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(СтрокаТаблицыЗаданий.ИдентификаторЗадания);
				Иначе
					
					ПараметрыМетода = Новый Массив();
					ПараметрыМетода.Добавить(СтрокаТаблицыЗаданий.Идентификатор);
					ПараметрыМетода.Добавить(СтрокаТаблицыЗаданий.Обработчики.Получить());
					
					ФоновоеЗадание = ФоновыеЗадания.Выполнить("SUI_ОчередьЗаданий.ЗапуститьЗадание", 
						ПараметрыМетода, Идентификатор, СтрокаТаблицыЗаданий.Наименование);
						
				КонецЕсли;
				
				Если ФоновоеЗадание = Неопределено Тогда
					ЗакрытьЗадание(Идентификатор, Хеш, Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Закрыто,
						НСтр("ru = 'Фоновое задание не найдено.'"));
					Продолжить;
				КонецЕсли;
				
				СтрокаТаблицыЗаданий.ИдентификаторЗадания = ФоновоеЗадание.УникальныйИдентификатор;
				ДанныеКОбновленииВЗаписи.Вставить("ИдентификаторЗадания", СтрокаТаблицыЗаданий.ИдентификаторЗадания);
				
				мсвСтрокиЗадания.Добавить(СтрокаТаблицыЗаданий);
						
			Иначе
				ЗапуститьЗадание(СтрокаТаблицыЗаданий.Идентификатор, СтрокаТаблицыЗаданий.Обработчики.Получить());
				ДанныеКОбновленииВЗаписи.Вставить("Статус", Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Выполнено);
			КонецЕсли;
			
			ОбновитьЗаписьЗадания(Идентификатор, Хеш, ДанныеКОбновленииВЗаписи);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			Пока ТранзакцияАктивна() Цикл
				ОтменитьТранзакцию();
			КонецЦикла;
			ЗакрытьЗадание(Идентификатор, Хеш, Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.ОшибкаОбработки, ИнформацияОбОшибке());
			ВызватьИсключение;
		КонецПопытки;
		
	КонецЦикла;
	
	Если мсвСтрокиЗадания.Количество() = 0 Тогда
		ТаблицаЗаданий.Очистить();
	Иначе
		ТаблицаЗаданий = ТаблицаЗаданий.Скопировать(мсвСтрокиЗадания);
		ОбработатьЗапускЗаданий(ТаблицаЗаданий);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьЗапускЗаданий(ТаблицаЗаданий)
	
	УстановитьПривилегированныйРежим(Истина);
	
	мсвСтрокиЗадания = Новый Массив();
	
	Для Каждого СтрокаТаблицыЗаданий Из ТаблицаЗаданий Цикл
		
		Если СтрокаТаблицыЗаданий.ИдентификаторЗадания = ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор() Тогда
			ЗакрытьЗадание(СтрокаТаблицыЗаданий.Идентификатор, СтрокаТаблицыЗаданий.Хеш, 
				Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Закрыто, , Ложь);
		Иначе
			
			ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(СтрокаТаблицыЗаданий.ИдентификаторЗадания);
		
			Если ФоновоеЗадание = Неопределено Тогда
				ОписаниеРезультата = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Не удалось получить результат выполнения задания %1.'"), Строка(СтрокаТаблицыЗаданий.Идентификатор));
				ЗакрытьЗадание(СтрокаТаблицыЗаданий.Идентификатор, СтрокаТаблицыЗаданий.Хеш, 
					Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.ОшибкаОбработки, ОписаниеРезультата);
			Иначе
				
				Если ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
					ФоновоеЗадание = ФоновоеЗадание.ОжидатьЗавершенияВыполнения(10);
				КонецЕсли;
				
				Если ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Отменено Тогда
					ОписаниеРезультата = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Задание очереди %1 было отменено.'"), Строка(СтрокаТаблицыЗаданий.Идентификатор));
					ЗакрытьЗадание(СтрокаТаблицыЗаданий.Идентификатор, СтрокаТаблицыЗаданий.Хеш, 
						Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Закрыто, ОписаниеРезультата, Ложь);
				ИначеЕсли ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда	
					ЗакрытьЗадание(СтрокаТаблицыЗаданий.Идентификатор, СтрокаТаблицыЗаданий.Хеш, 
						Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.ОшибкаОбработки, ФоновоеЗадание.ИнформацияОбОшибке);
				ИначеЕсли ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
					ЗакрытьЗадание(СтрокаТаблицыЗаданий.Идентификатор, СтрокаТаблицыЗаданий.Хеш, 
						Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Выполнено, НСтр("ru = 'Выполнено'"), Ложь);		
				ИначеЕсли ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
					мсвСтрокиЗадания.Добавить(СтрокаТаблицыЗаданий);
				КонецЕсли;
				
			КонецЕсли;
		
		КонецЕсли;

	КонецЦикла;
	
	Если мсвСтрокиЗадания.Количество() = 0 Тогда
		ТаблицаЗаданий.Очистить();
	Иначе
		ТаблицаЗаданий = ТаблицаЗаданий.Скопировать(мсвСтрокиЗадания);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗакрытьЗадание(Идентификатор, Хеш, СтатусОбработки, ОписаниеРезультата = "", ЗаписатьВЖР = Истина, УровеньЖР = Неопределено)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(ОписаниеРезультата) = Тип("ИнформацияОбОшибке") Тогда
		КраткоеОписаниеРезультата = ОбработкаОшибок.КраткоеПредставлениеОшибки(ОписаниеРезультата);
		ПодробноеОписаниеРезультата = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ОписаниеРезультата);
		ЗаписатьВЖР = Истина;
		УровеньЖР = УровеньЖурналаРегистрации.Ошибка;
	Иначе
		КраткоеОписаниеРезультата = ОписаниеРезультата;
		ПодробноеОписаниеРезультата = ОписаниеРезультата;
	КонецЕсли;
	
	Если УровеньЖР = Неопределено Тогда
				
		УровеньЖР = УровеньЖурналаРегистрации.Информация;
		
		Если СтатусОбработки = Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.ОшибкаОбработки Тогда
			УровеньЖР = УровеньЖурналаРегистрации.Ошибка;
		КонецЕсли;
		
	КонецЕсли;
	
	Данные = Новый Структура("Статус, КраткоеОписаниеРезультата, ПодробноеОписаниеРезультата", 
		СтатусОбработки, КраткоеОписаниеРезультата, ПодробноеОписаниеРезультата);
		
	РезультатОбновленияЗаписи = ОбновитьЗаписьЗадания(Идентификатор, Хеш, Данные);
	Если РезультатОбновленияЗаписи.Выполнено Тогда
		
		Если ЗаписатьВЖР И Не ПустаяСтрока(ПодробноеОписаниеРезультата) Тогда
			SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(SUI_ОчередьЗаданийКлиентСервер.ИмяСобытия(), УровеньЖР,
				Метаданные.ОбщиеМодули.SUI_ОчередьЗаданий, , ПодробноеОписаниеРезультата);
		КонецЕсли;
			
	КонецЕсли;

	// Процедура завершения задания
	ПараметрыПроцедурыЗавершения = Новый Структура();
	ПараметрыПроцедурыЗавершения.Вставить("ОбработчикЗавершения", РезультатОбновленияЗаписи.ОбработчикЗавершения);
	ПараметрыПроцедурыЗавершения.Вставить("Данные", Данные);
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор());
	ДлительныеОперации.ВыполнитьВФоне("SUI_ОчередьЗаданий.ВыполнитьОбработчикЗавершения", 
		ПараметрыПроцедурыЗавершения, ПараметрыВыполненияВФоне);
	
КонецПроцедуры

Функция ОбновитьЗаписьЗадания(Идентификатор, Хеш, Знач Данные)
	
	Результат = Новый Структура("Выполнено, ОбработчикЗавершения", Ложь);
	
	Если Данные.Свойство("Идентификатор") Тогда
		Данные.Удалить("Идентификатор");
	КонецЕсли;
	
	Если Данные.Свойство("Хеш") Тогда
		Данные.Удалить("Хеш");
	КонецЕсли;
	
	НачатьТранзакцию();
		
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.SUI_ОчередьЗаданий");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
		ЭлементБлокировки.УстановитьЗначение("Идентификатор", Идентификатор);
		ЭлементБлокировки.УстановитьЗначение("Хеш", Хеш);
		Блокировка.Заблокировать();
		
		НаборЗаписей = РегистрыСведений.SUI_ОчередьЗаданий.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Идентификатор.Установить(Идентификатор);
		НаборЗаписей.Отбор.Хеш.Установить(Хеш);
		
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() = 1 Тогда
			
			ЗаполнитьЗначенияСвойств(НаборЗаписей[0], Данные);
			
			НаборЗаписей[0].Обновлено 	= ТекущаяДатаСеанса();
			НаборЗаписей[0].Сеанс 		= НомерСеансаИнформационнойБазы();
			
			Если НаборЗаписей[0].Статус <> Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Выполняется Тогда
				НаборЗаписей[0].ИдентификаторЗадания = Новый УникальныйИдентификатор(ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор());
			КонецЕсли;
			
			Если НаборЗаписей[0].Статус = Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Выполнено Или
				НаборЗаписей[0].Статус = Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.ОшибкаОбработки Тогда
				Результат.ОбработчикЗавершения = НаборЗаписей[0].ОбработчикЗавершения.Получить();
			КонецЕсли;
	
			НаборЗаписей.ДополнительныеСвойства.Вставить("SUI_ЗаписьВРегламентномЗадании");
			НаборЗаписей.Записать(Истина);
			
			Результат.Выполнено = Истина;
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		Пока ТранзакцияАктивна() Цикл
			ОтменитьТранзакцию();
		КонецЦикла;
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(SUI_ОчередьЗаданийКлиентСервер.ИмяСобытия(), ,
			Метаданные.ОбщиеМодули.SUI_ОчередьЗаданий, , ИнформацияОбОшибке());
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
