
#Область ПрограммныйИнтерфейс

#Область УстаревшиеПроцедурыИФункции

// Устарела. см. РегистрСведений.SUI_ОчередьЗаданий.СоздатьЗадание
//
Процедура СоздатьЗадание(Знач ПараметрыЗадания) Экспорт 
	
	РегистрыСведений.SUI_ОчередьЗаданий.СоздатьЗадание(ПараметрыЗадания);
	
КонецПроцедуры

// Устарела. см. РегистрСведений.SUI_ОчередьЗаданий.НачатьОбработкуОчередиЗаданий
//
Процедура ОбработатьОчередь() Экспорт
	
	РегистрыСведений.SUI_ОчередьЗаданий.НачатьОбработкуОчередиЗаданий();
	
КонецПроцедуры

// Устарела. см. РегистрСведений.SUI_ОчередьЗаданий.НачатьОчисткуОчередиЗаданий
//
Процедура ОчиститьОчередь() Экспорт 
	
	РегистрыСведений.SUI_ОчередьЗаданий.НачатьОчисткуОчередиЗаданий();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗапуститьОбработчикиЗадания(Идентификатор, Хеш, Обработчики) Экспорт
	
	РегистрыСведений.SUI_ОчередьЗаданий.ЗапуститьОбработчикиЗадания(Идентификатор, Хеш, Обработчики);
	
КонецПроцедуры

#КонецОбласти
