
#Область ПрограммныйИнтерфейс

#Область УстаревшиеПроцедурыИФункции

// Устарела. см. РегистрСведений.SUI_ОчередьЗаданий.СоздатьЗадание
//
Процедура СоздатьЗадание(Знач ПараметрыЗадания) Экспорт 
	
	РегистрыСведений.SUI_ОчередьЗаданий.СоздатьЗадание(ПараметрыЗадания);
	
КонецПроцедуры

// Устарела. см. РегистрСведений.SUI_ОчередьЗаданий.НачатьОбработкуОчередиЗаданий
//
Процедура ОбработатьОчередь() Экспорт
	
	РегистрыСведений.SUI_ОчередьЗаданий.НачатьОбработкуОчередиЗаданий();
	
КонецПроцедуры

// Устарела. см. РегистрСведений.SUI_ОчередьЗаданий.НачатьОчисткуОчередиЗаданий
//
Процедура ОчиститьОчередь() Экспорт 
	
	РегистрыСведений.SUI_ОчередьЗаданий.НачатьОчисткуОчередиЗаданий();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриДобавленииРегламентныхЗаданийПодсистемы(РегламентныеЗаданияПодсистемы) Экспорт
	
	// ОбработатьОчередь
	РегламентноеЗаданиеПодсистемы = РегламентныеЗаданияПодсистемы.Добавить();
	РегламентноеЗаданиеПодсистемы.Ключ = SUI_ОчередьЗаданийКлиентСервер.КлючиРегламентныхЗаданий().ОбработатьОчередь;
	РегламентноеЗаданиеПодсистемы.Наименование = НСтр("ru = 'Simple: Обработка очереди заданий'");
	РегламентноеЗаданиеПодсистемы.ИмяМетода = "SUI_ОчередьЗаданий.ОбработатьОчередь";
	РегламентноеЗаданиеПодсистемы.КоличествоПовторовПриАварийномЗавершении = 1;
	РегламентноеЗаданиеПодсистемы.ИнтервалПовтораПриАварийномЗавершении = 10;
	РегламентноеЗаданиеПодсистемы.Расписание.ПериодПовтораДней = 1;
	РегламентноеЗаданиеПодсистемы.Расписание.ПериодПовтораВТечениеДня = 60;
	
	// Очистка очереди заданий
	РегламентноеЗаданиеПодсистемы = РегламентныеЗаданияПодсистемы.Добавить();
	РегламентноеЗаданиеПодсистемы.Ключ = SUI_ОчередьЗаданийКлиентСервер.КлючиРегламентныхЗаданий().ОчиститьОчередь;
	РегламентноеЗаданиеПодсистемы.Наименование = НСтр("ru = 'Simple: Очистка очереди заданий'");
	РегламентноеЗаданиеПодсистемы.ИмяМетода = "SUI_ОчередьЗаданий.ОчиститьОчередь";
	РегламентноеЗаданиеПодсистемы.КоличествоПовторовПриАварийномЗавершении = 1;
	РегламентноеЗаданиеПодсистемы.ИнтервалПовтораПриАварийномЗавершении = 60;
	РегламентноеЗаданиеПодсистемы.Расписание.ПериодПовтораДней = 1;
	
КонецПроцедуры

Процедура ЗапуститьОбработчикиЗадания(Идентификатор, Хеш, Обработчики) Экспорт
	
	РегистрыСведений.SUI_ОчередьЗаданий.ЗапуститьОбработчикиЗадания(Идентификатор, Хеш, Обработчики);
	
КонецПроцедуры

#КонецОбласти
