
#Область ПрограммныйИнтерфейс

#Область ПодключаемыеКомандыSimple

Процедура ВыгрузитьВДокументОбмена(ДокументСсылка, ПараметрыВыполнения) Экспорт
	
	Контекст = Новый Структура();
	Контекст.Вставить("ДокументСсылка", ДокументСсылка);
	Контекст.Вставить("ПараметрыВыполнения", ПараметрыВыполнения);
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("ДокументОснование", ДокументСсылка);
	ПараметрыОткрытия.Вставить("ВыборМобильныхУстройств", Истина);
	ПараметрыОткрытия.Вставить("Заголовок", НСтр("ru = 'Выгрузка в документ обмена'"));
	
	Оповещение = Новый ОписаниеОповещения("ВыгрузитьВДокументОбменаЗавершениеВыбораНастроек", ЭтотОбъект, Контекст);
	
	ОткрытьФорму("Документ.SUI_ДокументОбмена.Форма.ФормаВыборИзДерева", ПараметрыОткрытия, 
		ПараметрыВыполнения.Форма, ПараметрыВыполнения.Форма.УникальныйИдентификатор, , , Оповещение);
	
КонецПроцедуры

Процедура ОткрытьДокументОбмена(ДокументСсылка, ПараметрыВыполнения) Экспорт
	
	ВыполнитьОткрытиеДокументаОбмена(ДокументСсылка, ПараметрыВыполнения, "ОткрытиеДокументаОбмена");
	
КонецПроцедуры

Процедура ОткрытьПросмотрРезультата(ДокументСсылка, ПараметрыВыполнения) Экспорт
	
	ВыполнитьОткрытиеДокументаОбмена(ДокументСсылка, ПараметрыВыполнения, "ПросмотрРезультатаДокументаОбмена");
	
КонецПроцедуры

Процедура ЗагрузитьДокументОбмена(ДокументСсылка, ПараметрыВыполнения) Экспорт
	
	Контекст = Новый Структура();
	Контекст.Вставить("ДокументСсылка", ДокументСсылка);
	Контекст.Вставить("ПараметрыВыполнения", ПараметрыВыполнения);
	
	ВыполнитьОткрытиеДокументаОбмена(ДокументСсылка, ПараметрыВыполнения, "ЗагрузкаДокументаОбмена");
	
КонецПроцедуры

Процедура УдалитьДокументОбмена(ДокументСсылка, ПараметрыВыполнения) Экспорт
	
	Контекст = Новый Структура();
	Контекст.Вставить("ДокументСсылка", ДокументСсылка);
	Контекст.Вставить("ПараметрыВыполнения", ПараметрыВыполнения);
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("ДокументОснование", ДокументСсылка);
	ПараметрыОткрытия.Вставить("ВыборТолькоДокументыОбмена", Истина);
	ПараметрыОткрытия.Вставить("Заголовок", НСтр("ru = 'Удаление документов обмена'"));
	
	Оповещение = Новый ОписаниеОповещения("УдалитьДокументОбменаЗавершениеВыбораДокументаОбмена", ЭтотОбъект, Контекст);
	
	ОткрытьФорму("Документ.SUI_ДокументОбмена.Форма.ФормаВыборИзДерева", ПараметрыОткрытия, 
		ПараметрыВыполнения.Форма, ПараметрыВыполнения.Форма.УникальныйИдентификатор, , , Оповещение);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ВыгрузитьВДокументОбменаЗавершениеВыбораНастроек(РезультатВыбора, Контекст) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	КонтекстОповещения = Новый Структура();
	
	Если Контекст.Свойство("ОповещениеОЗавершении") Тогда
		КонтекстОповещения.Вставить("ОповещениеОЗавершении", Контекст.ОповещениеОЗавершении);
	КонецЕсли;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ВыгрузитьДокументОбменаЗавершение", ЭтотОбъект, КонтекстОповещения);
	
	ДлительнаяОперация = SUI_ДокументыОбменаВызовСервера.ВыгрузитьДокументОбменаВФоне(
		Контекст.ДокументСсылка, РезультатВыбора, Контекст.ПараметрыВыполнения.Форма.УникальныйИдентификатор);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Контекст.ПараметрыВыполнения.Форма);
	
	ПараметрыОжидания.Заголовок 					= НСтр("ru = 'Выгрузка в документ обмена'");
	ПараметрыОжидания.ВыводитьПрогрессВыполнения 	= Истина;
	ПараметрыОжидания.ВыводитьСообщения 			= Истина;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

Процедура ВыгрузитьДокументОбменаЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РезультатВыполнения = Неопределено;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		РезультатВыполнения = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		
		Для индекс = 0 По РезультатВыполнения.СозданныеДокументыОбмена.ВГраница() Цикл
			ПоказатьОповещениеПользователя("Создание:", 
				ПолучитьНавигационнуюСсылку(РезультатВыполнения.СозданныеДокументыОбмена[индекс]),
				РезультатВыполнения.СозданныеДокументыОбмена[индекс], 
				БиблиотекаКартинок.SUI_ДокументОбменаДобавить, 
				СтатусОповещенияПользователя.Информация);
		КонецЦикла;
		
		Для индекс = 0 По РезультатВыполнения.ОбновленныеДокументыОбмена.ВГраница() Цикл
			ПоказатьОповещениеПользователя("Изменение:", 
				ПолучитьНавигационнуюСсылку(РезультатВыполнения.ОбновленныеДокументыОбмена[индекс]),
				РезультатВыполнения.ОбновленныеДокументыОбмена[индекс], 
				БиблиотекаКартинок.SUI_ДокументОбменаРедактировать, 
				СтатусОповещенияПользователя.Информация);
		КонецЦикла;
		
		Для индекс = 0 По РезультатВыполнения.ПропущенныеДокументыОбмена.ВГраница() Цикл
			ПоказатьОповещениеПользователя("Пропущено:", 
				ПолучитьНавигационнуюСсылку(РезультатВыполнения.ПропущенныеДокументыОбмена[индекс]),
				РезультатВыполнения.ПропущенныеДокументыОбмена[индекс], 
				БиблиотекаКартинок.SUI_ДокументОбмена, 
				СтатусОповещенияПользователя.Важное);
		КонецЦикла;
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение(, СтрШаблон(НСтр("ru = 'Возникла ошибка при выгрузке.
		|%1'"), Результат.КраткоеПредставлениеОшибки));
	Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'Не удалось получить результат выгрузки.'"));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Результат.Сообщения) Тогда
		
		Для индекс = 0 По Результат.Сообщения.ВГраница() Цикл
			ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.Сообщения[индекс]);
		КонецЦикла;
		
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("ОповещениеОЗавершении") Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеОЗавершении, РезультатВыполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьОткрытиеДокументаОбменаПродолжить(РезультатВыбора, Контекст) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеВыбора = Новый Структура("НастройкаДокумента,ДокументОбмена");
	
	Для Каждого ЭлементРезультатаВыбора Из РезультатВыбора Цикл
		ДанныеВыбора.НастройкаДокумента = ЭлементРезультатаВыбора.Ключ;
		Если ЭлементРезультатаВыбора.Значение.ВыбранныеДокументыОбмена.Количество() > 0 Тогда
			ДанныеВыбора.ДокументОбмена = ЭлементРезультатаВыбора.Значение.ВыбранныеДокументыОбмена[0];
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Контекст.Режим = "ОткрытиеДокументаОбмена" И ДанныеВыбора.ДокументОбмена <> Неопределено Тогда
		ПоказатьЗначение(Контекст.ОповещениеЗавершения, ДанныеВыбора.ДокументОбмена);
	ИначеЕсли Контекст.Режим = "ПросмотрРезультатаДокументаОбмена" Или Контекст.Режим = "ЗагрузкаДокументаОбмена" Тогда
		
		Если Контекст.Режим = "ПросмотрРезультатаДокументаОбмена" Тогда
			ДанныеВыбора.Вставить("ТолькоПросмотр", Истина);
		КонецЕсли;
		
		ОткрытьФорму("Документ.SUI_ДокументОбмена.Форма.ФормаЗагрузкиВДокумента1С", ДанныеВыбора, 
			Контекст.ПараметрыВыполнения.Форма, 
			Контекст.ПараметрыВыполнения.Форма.УникальныйИдентификатор, , , 
			Контекст.ОповещениеЗавершения);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьДокументОбменаЗавершениеВыбораДокументаОбмена(РезультатВыбора, Контекст) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДокументыОбменаКУдалению = Новый Массив();
	Для Каждого ЭлементРезультатаВыбора Из РезультатВыбора Цикл
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ДокументыОбменаКУдалению, 
			ЭлементРезультатаВыбора.Значение.ВыбранныеДокументыОбмена, Истина);
	КонецЦикла;
	
	Если ДокументыОбменаКУдалению.Количество() > 0 Тогда
		
		ОчиститьСообщения();
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("УдалитьДокументОбменаЗавершение", ЭтотОбъект);
		
		ДлительнаяОперация = SUI_ДокументыОбменаВызовСервера.УдалитьДокументыОбменаВФоне(
			ДокументыОбменаКУдалению, Контекст.ПараметрыВыполнения.Форма.УникальныйИдентификатор);
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Контекст.ПараметрыВыполнения.Форма);
		
		ПараметрыОжидания.Заголовок 					= НСтр("ru = 'Удаление документов обмена'");
		ПараметрыОжидания.ВыводитьПрогрессВыполнения 	= Истина;
		ПараметрыОжидания.ВыводитьСообщения 			= Истина;
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьДокументОбменаЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение(, СтрШаблон(НСтр("ru = 'Возникла ошибка при удалении.
		|%1'"), Результат.КраткоеПредставлениеОшибки));
	ИначеЕсли Результат.Статус <> "Выполнено" Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Не удалось получить результат удаления.'"));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Результат.Сообщения) Тогда
		
		Для индекс = 0 По Результат.Сообщения.ВГраница() Цикл
			ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.Сообщения[индекс]);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОткрытьФормуПроверкиДокументаОбмена(ДокументОбмена, Владелец = Неопределено, ИдентификаторВладельца = Неопределено, 
	ОкноВладельца = Неопределено, ОповещениеОЗавершении = Неопределено, РежимОткрытия = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ДокументОбмена", ДокументОбмена);
	
	ОткрытьФорму("Документ.SUI_ДокументОбмена.Форма.ФормаПроверкаДокументаОбмена", ПараметрыФормы, 
		Владелец, ИдентификаторВладельца, ОкноВладельца, , ОповещениеОЗавершении, РежимОткрытия);
		
КонецПроцедуры

Процедура ПоказатьИдентификаторДокументаОбмена(ДокументОбмена) Экспорт
	
	ОчиститьСообщения();
	ОбщегоНазначенияКлиент.СообщитьПользователю(ДокументОбмена.УникальныйИдентификатор());
		
КонецПроцедуры

Процедура ЗарегистрироватьДокументОбменаКВыгрузке(ДокументОбмена, Форма = Неопределено, ОповещениеОЗавершении = Неопределено) Экспорт
	
	Контекст = Новый Структура();
	Контекст.Вставить("ДокументОбмена", ДокументОбмена);
	Контекст.Вставить("ОповещениеОЗавершении", ОповещениеОЗавершении);
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("ДокументОбмена", ДокументОбмена);
	ПараметрыОткрытия.Вставить("ВыборМобильныхУстройств", Истина);
	ПараметрыОткрытия.Вставить("ОбязателенВыборМобильныхУстройств", Истина);
	ПараметрыОткрытия.Вставить("ИсключаемыеСостоянияДокументовОбмена", SUI_ОбщегоНазначенияКлиентСервер.МассивЗначений(
		ПредопределенноеЗначение("Перечисление.SUI_СостоянияДокументовОбмена.Новый")));
	ПараметрыОткрытия.Вставить("Заголовок", НСтр("ru = 'Выгрузка в мобильное устройство'"));
	
	Оповещение = Новый ОписаниеОповещения("ЗарегистрироватьДокументОбменаКВыгрузкеЗавершениеВыбораНастроек", ЭтотОбъект, Контекст);
	
	ОткрытьФорму("Документ.SUI_ДокументОбмена.Форма.ФормаВыборИзДерева", ПараметрыОткрытия, 
		Форма, ?(Форма = Неопределено, Неопределено, Форма.УникальныйИдентификатор), , , Оповещение);
	
КонецПроцедуры

Процедура ЗарегистрироватьДокументОбменаКВыгрузкеЗавершениеВыбораНастроек(РезультатВыбора, Контекст) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДокументыКРегистрации = Новый Соответствие();
	
	Для Каждого КлючЗначение Из РезультатВыбора Цикл
		
		Для Каждого ВыбранныйДокументОбмена Из КлючЗначение.Значение.ВыбранныеДокументыОбмена Цикл
			
			МобильныеУстройства = Новый Массив();
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МобильныеУстройства, КлючЗначение.Значение.ВыбранныеМобильныеУстройства);
			
			Если МобильныеУстройства.Количество() > 0 Тогда
				ДокументыКРегистрации.Вставить(ВыбранныйДокументОбмена, МобильныеУстройства);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если ДокументыКРегистрации.Количество() > 0 Тогда
		
		ОчиститьСообщения();
		
		SUI_ДокументыОбменаВызовСервера.ЗарегистрироватьДокументыОбменаКВыгрузке(ДокументыКРегистрации);
		
		Если Контекст.ОповещениеОЗавершении <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(Контекст.ОповещениеОЗавершении, ДокументыКРегистрации);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВыполнитьОткрытиеДокументаОбмена(ДокументСсылка, ПараметрыВыполнения, Режим, ОповещениеЗавершения = Неопределено)
	
	Контекст = Новый Структура();
	Контекст.Вставить("Режим", Режим);
	Контекст.Вставить("ОповещениеЗавершения", ОповещениеЗавершения);
	Контекст.Вставить("ДокументСсылка", ДокументСсылка);
	Контекст.Вставить("ПараметрыВыполнения", ПараметрыВыполнения);
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("ДокументОснование", ДокументСсылка);
	ПараметрыОткрытия.Вставить("ВыборТолькоДокументыОбмена", Истина);
	ПараметрыОткрытия.Вставить("ВыборОдного", Истина);
	ПараметрыОткрытия.Вставить("АвтоВыбор", Истина);
	
	Если Контекст.Режим = "ОткрытиеДокументаОбмена" Тогда
		ПараметрыОткрытия.Вставить("Заголовок", НСтр("ru = 'Открытие документа обмена'"));
	ИначеЕсли Контекст.Режим = "ПросмотрРезультатаДокументаОбмена" Тогда
		ПараметрыОткрытия.Вставить("Заголовок", НСтр("ru = 'Просмотр результата документа обмена'"));
	ИначеЕсли Контекст.Режим = "ЗагрузкаДокументаОбмена" Тогда
		ПараметрыОткрытия.Вставить("Заголовок", НСтр("ru = 'Загрузка из документа обмена'"));
	Иначе
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ВыполнитьОткрытиеДокументаОбменаПродолжить", ЭтотОбъект, Контекст);
	
	ОткрытьФорму("Документ.SUI_ДокументОбмена.Форма.ФормаВыборИзДерева", ПараметрыОткрытия, 
		ПараметрыВыполнения.Форма, ПараметрыВыполнения.Форма.УникальныйИдентификатор, , , Оповещение);
	
КонецПроцедуры

#КонецОбласти
