
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьЖурналРегистрации(Команда)

	Перем Сеанс, НачальнаяДата, КонечнаяДата;

	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		Сеанс = Элементы.Список.ТекущиеДанные.Сеанс;
		НачальнаяДата = Элементы.Список.ТекущиеДанные.Создано - 60;
		Если ЗначениеЗаполнено(Элементы.Список.ТекущиеДанные.Обновлено) Тогда
			КонечнаяДата = Элементы.Список.ТекущиеДанные.Обновлено + 60;
		КонецЕсли;
	КонецЕсли;
	
	SUI_ЖурналРегистрацииКлиент.ОткрытьЖурналРегистрации(
		SUI_ОчередьЗаданийКлиентСервер.ПараметрыОткрытияЖурналаРегистрации(Сеанс, , НачальнаяДата, КонечнаяДата), ЭтотОбъект);
		
КонецПроцедуры

#КонецОбласти
