
#Область ПрограммныйИнтерфейс

// Получить данные для ответа HTTP
//
// Параметры:
//  МобильноеУстройство	- СправочникСсылка.Удалить_SUI_МобильныеКлиенты, ПланОбменаСсылка.SUI_МобильныеУстройства - Ссылка на мобильное устройство
//  НСИ		 			- Булево - Признак получения данных НСИ
//  Документы 			- Булево - Признак получения данных документов обмена
// 
// Возвращаемое значение:
//  Структура - см. SUI_HTTPСервис.РезультатУспех
//
Функция ПолучитьДанные(МобильноеУстройство, НСИ = Истина, Документы = Истина, ОфлайнОбмен = Ложь) Экспорт
	
	Данные = SUI_СообщенияОбменаДанными.ПолучитьСообщениеДляМобильногоУстройства(МобильноеУстройство, Истина);
	
	Если ОфлайнОбмен Тогда
		Возврат Данные;
	Иначе
		Результат = SUI_HTTPСервис.РезультатУспех(Данные.Данные);
		SUI_HTTPСервис.ДобавитьЗаголовокВРезультат(Результат, "Remaining-Batches", Данные.ОстатокПакетов);
		Возврат Результат;
	КонецЕсли;

КонецФункции

Функция СоздатьДокумент(МобильноеУстройство, НастройкаДокумента) Экспорт
	
	НастройкиДокумента = SUI_НастройкиДокументовСервер.СформироватьНастройкиДокумента(НастройкаДокумента);
	
	SUI_ОбщегоНазначенияКлиентСервер.Проверить(НастройкиДокумента.Используется,
		СтрШаблон(НСтр("ru = 'Настройка %1 не используется'"), НастройкаДокумента));
	
	SUI_ОбщегоНазначенияКлиентСервер.Проверить(НастройкиДокумента.СоздаватьДокументыНаТСД,
		СтрШаблон(НСтр("ru = 'Для настройки %1 режим создания документов выключен'"), НастройкаДокумента));
	
	SUI_ОбщегоНазначенияКлиентСервер.Проверить(
		SUI_НастройкиДокументовСервер.НастройкаДокументаПринадлежитМобильномуКлиенту(НастройкаДокумента, МобильноеУстройство),
		СтрШаблон(НСтр("ru = 'Настройка %1 не принадлежит мобильному устройству %2'"), НастройкаДокумента, МобильноеУстройство));
	
	НачатьТранзакцию();
	
	Попытка
		
		УстановитьПривилегированныйРежим(Истина);
		
		НовыйДокумент = Документы[НастройкиДокумента.ИмяМетаданных].СоздатьДокумент();
		НовыйДокумент.Дата = ТекущаяДатаСеанса();
		НовыйДокумент.УстановитьНовыйНомер();
		
		Результат = Обработки.SUI_РедакторКода.ВыполнитьКодЧерезМетодКонфигурации(
			"SUI_ОбменДаннымиСервер.ВыполнитьАлгоритмСозданияДокумента",
			НастройкиДокумента.АлгоритмСозданияНовогоДокумента,
			SUI_ОбщегоНазначенияКлиентСервер.МассивЗначений(МобильноеУстройство, НовыйДокумент),
			Истина);
		
		НовыйДокумент = Результат[Результат.ВГраница()];
		
		Если НовыйДокумент.Ссылка.Пустая() Тогда
			НовыйДокумент.ОбменДанными.Загрузка = Истина;
			НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
		
		SUI_ОбщегоНазначенияКлиентСервер.Проверить(
			SUI_НастройкиДокументовСервер.ДокументСоответствуетОтборуНастройки(НастройкаДокумента, НовыйДокумент.Ссылка), 
			СтрШаблон(НСтр("ru = 'Сформированный документ не соответствует критериям отбора настройки документа ""%1"".'"), 
			НастройкаДокумента));
		
		// Выгрузить документ на ТСД
		ПараметрыВыгрузкиДокументаОбмена = SUI_ДокументыОбмена.ПараметрыВыгрузкиДокументаОбмена();
		ПараметрыВыгрузкиДокументаОбмена.МобильноеУстройство 	= МобильноеУстройство;
		ПараметрыВыгрузкиДокументаОбмена.НастройкаДокумента 	= НастройкаДокумента.Ссылка;
		ПараметрыВыгрузкиДокументаОбмена.ДокументСсылка 		= НовыйДокумент.Ссылка;
		ПараметрыВыгрузкиДокументаОбмена.Вставить("SUI_АдресноеХранение", НастройкиДокумента.ЭтоДокументАдресногоХранения);
		ПараметрыВыгрузкиДокументаОбмена.Вставить("НеРегистрироватьИзменения");
		
		ДанныеДокументаОбмена = SUI_ДокументыОбмена.ВыгрузитьИПолучитьДокументОбмена(ПараметрыВыгрузкиДокументаОбмена);
		
		SUI_ОбщегоНазначенияКлиентСервер.Проверить(ДанныеДокументаОбмена <> Неопределено, 
			НСтр("ru = 'Не удалось получить данные созданного документа.'"));
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат SUI_HTTPСервис.РезультатУспех(ДанныеДокументаОбмена);
	
КонецФункции

// Документ обмена обновить.
// 
// Параметры:
//  МобильноеУстройство - ПланОбменаСсылка.SUI_МобильныеУстройства - Мобильное устройство данных
//  ДанныеJSON - Строка - Данные документа обмена строкой JSON
// 
// Возвращаемое значение:
//  Структура - Документ обмена обновить:
// * Загружено - Булево - Загрузка выполнена
// * ВсегоДокументов - Число - Всего загружаемых документов
// * ЗагруженоДокументов - Число - Всего загружено документов
Функция ДокументОбменаОбновить(МобильноеУстройство, ДанныеJSON) Экспорт
	
	РезультатЗагрузки = Новый Структура();
	РезультатЗагрузки.Вставить("Загружено", Ложь);
	РезультатЗагрузки.Вставить("ВсегоДокументов", 0);
	РезультатЗагрузки.Вставить("ЗагруженоДокументов", 0);
	
	SUI_ОбщегоНазначенияКлиентСервер.ПроверитьПараметр("SUI_ОбменДаннымиСервер.ДокументОбменаОбновить", 
		"ДанныеJSON", ДанныеJSON, Тип("Строка"));
	
	Попытка
		Данные = SUI_ОбщегоНазначенияКлиентСервер.ДанныеИзСтрокиJSON(ДанныеJSON, Ложь, , ,
			"ВосстановлениеДанныхJSON_ДанныеДокумента", SUI_ОбменДаннымиСервер);
	Исключение
		ТекстОшибки = НСтр("ru = 'Ошибка восстановления данных документа обмена из строки JSON!'");
		ВызватьИсключение(ТекстОшибки, , , , ИнформацияОбОшибке());
	КонецПопытки;
	
	Если ТипЗнч(Данные) <> Тип("Массив") Тогда
		Данные = SUI_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Данные);
	КонецЕсли;
	
	РезультатЗагрузки.ВсегоДокументов = Данные.Количество();
	
	Для индекс = 0 По Данные.ВГраница() Цикл
		
		Загружено = ДокументОбменаОбновитьДанными(МобильноеУстройство, Данные[индекс]);
		
		Если Загружено Тогда
			РезультатЗагрузки.Загружено = Истина;
			РезультатЗагрузки.ЗагруженоДокументов = РезультатЗагрузки.ЗагруженоДокументов + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат РезультатЗагрузки;
	
КонецФункции

#Область ГрупповойПересчетДокумента

Функция ПолучитьДанныеГрупповогоПересчетаДокумента(МобильноеУстройство, ИдентификаторДокумента) Экспорт
	
	ДанныеПересчета = РегистрыСведений.SUI_docs_tbl_goods_delta.ПолучитьДанныеПересчетаСтрок(
		МобильноеУстройство, ИдентификаторДокумента);
	
	Возврат SUI_HTTPСервис.РезультатУспех(ДанныеПересчета);
	
КонецФункции

Функция ПараметрыЗагрузкиГрупповогоПересчета(МобильноеУстройство, ДанныеПересчета) Экспорт
	
	ПараметрыЗагрузки = Новый Структура();
	ПараметрыЗагрузки.Вставить("МобильноеУстройство", 		МобильноеУстройство);
	ПараметрыЗагрузки.Вставить("ДанныеПересчета", 			ДанныеПересчета);
	ПараметрыЗагрузки.Вставить("Перезаписать", 				Ложь);
	ПараметрыЗагрузки.Вставить("ЗагрузкаЧерезHTTPСервис", 	Истина);
	ПараметрыЗагрузки.Вставить("ИдентификаторДокумента", 	"");
	
	Возврат ПараметрыЗагрузки;
	
КонецФункции

Функция ЗагрузитьДанныеГрупповогоПересчетаДокумента(ПараметрыЗагрузки) Экспорт

	Результат = Ложь;
	
	Если ПараметрыЗагрузки.ЗагрузкаЧерезHTTPСервис И ПустаяСтрока(ПараметрыЗагрузки.ИдентификаторДокумента) Тогда
		ТекстОшибки = НСтр("ru = 'Не передан идентификатор документа в параметрах загрузки'");
		КонтекстПроверки = "SUI_ОбменДаннымиСервер.ЗагрузитьДанныеГрупповогоПересчетаДокумента";
		ОбщегоНазначенияКлиентСервер.Проверить(Ложь, ТекстОшибки, КонтекстПроверки);
	КонецЕсли;
	
	Для Каждого КлючЗначение Из ПараметрыЗагрузки.ДанныеПересчета Цикл
		
		Если Не ПустаяСтрока(ПараметрыЗагрузки.ИдентификаторДокумента) И
			ПараметрыЗагрузки.ИдентификаторДокумента <> КлючЗначение.Ключ Тогда
			Продолжить;
		КонецЕсли;
		
		РезультатЗагрузки = РегистрыСведений.SUI_docs_tbl_goods_delta.ЗагрузитьПересчет(
			ПараметрыЗагрузки.МобильноеУстройство, КлючЗначение.Ключ, КлючЗначение.Значение, 
			ПараметрыЗагрузки.Перезаписать);
		
		Если РезультатЗагрузки.Ошибки.Количество() > 0 Тогда
			ВызватьИсключение СтрШаблон(НСтр("ru = 'Не удалось загрузить данные пересчета!
			|%1'"), СтрСоединить(РезультатЗагрузки.Ошибки, Символы.ПС));
		КонецЕсли;
		
		Если РезультатЗагрузки.ДанныеЗагружены Тогда
			Результат = Истина;
		КонецЕсли;
		
	КонецЦикла;

	Если ПараметрыЗагрузки.ЗагрузкаЧерезHTTPСервис Тогда
		
		ДанныеПересчета = РегистрыСведений.SUI_docs_tbl_goods_delta.ПолучитьДанныеПересчетаСтрок(
			ПараметрыЗагрузки.МобильноеУстройство, ПараметрыЗагрузки.ИдентификаторДокумента);
		
		Результат = Новый Структура("result", Результат);
		Результат.Вставить("data", ДанныеПересчета);
		
		Результат = SUI_HTTPСервис.РезультатУспех(Результат);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗавершитьГрупповойПересчетДокумента(МобильноеУстройство, ИдентификаторДокумента, Знач ДополнительныеПараметры = Неопределено) Экспорт
	
	РегистрыСведений.SUI_docs_tbl_goods_delta.СоздатьЗаданиеЗавершенияПересчета(МобильноеУстройство, ИдентификаторДокумента);
	
	Результат = Новый Структура();
	Результат.Вставить("result", Истина);
	
	Возврат SUI_HTTPСервис.РезультатУспех(Результат);
	
КонецФункции

#КонецОбласти

Функция ПолучитьЦеныНоменклатуры(ПараметрыПолучения) Экспорт

	мсвДанныеЦенНоменклатуры = Новый Массив();

	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Номенклатура", SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыПолучения, 
		"Номенклатура", Справочники.Номенклатура.ПустаяСсылка(), Тип("СправочникСсылка.Номенклатура")));
	Запрос.УстановитьПараметр("Характеристика", SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыПолучения, 
		"Характеристика", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(), Тип("СправочникСсылка.ХарактеристикиНоменклатуры")));
	Запрос.УстановитьПараметр("Упаковка", SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыПолучения, 
		"Упаковка", Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка(), Тип("СправочникСсылка.УпаковкиЕдиницыИзмерения")));
	Запрос.УстановитьПараметр("ВидЦены", SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыПолучения, 
		"ВидЦены", Справочники.ВидыЦен.ПустаяСсылка(), Тип("СправочникСсылка.ВидыЦен")));
	
	SUI_ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(Запрос.Параметры.Номенклатура), 
		НСтр("ru = 'Передано пустое значение параметра номенклатуры'"), 
		КонтекстВызова("ПолучитьЦеныНоменклатуры"));

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатуры.Номенклатура КАК id_good,
		|	ЕСТЬNULL(ЦеныНоменклатуры.Номенклатура.Представление, """") КАК name_good,
		|	ЦеныНоменклатуры.Характеристика КАК id_property,
		|	ЕСТЬNULL(ЦеныНоменклатуры.Характеристика.Представление, """") КАК name_property,
		|	ЦеныНоменклатуры.ВидЦены КАК id_price_type,
		|	ЕСТЬNULL(ЦеныНоменклатуры.ВидЦены.Представление, """") КАК name_price_type,
		|	ЦеныНоменклатуры.Упаковка КАК id_unit,
		|	ЕСТЬNULL(ЦеныНоменклатуры.Упаковка.Представление, """") КАК name_unit,
		|	ЦеныНоменклатуры.Цена КАК price
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			,
		|			Номенклатура = &Номенклатура
		|				И ВЫБОР
		|					КОГДА &Характеристика <> ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|						ТОГДА Характеристика = &Характеристика
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ
		|				И ВЫБОР
		|					КОГДА &ВидЦены <> ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
		|						ТОГДА ВидЦены = &ВидЦены
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ
		|				И ВЫБОР
		|					КОГДА &Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|						ТОГДА Упаковка = &Упаковка
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ) КАК ЦеныНоменклатуры";

	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();

	Если Не РезультатЗапроса.Пустой() Тогда
		
		ИменаКолонок = SUI_ОбщегоНазначения.ПолучитьИменаКолонокРезультатаЗапроса(РезультатЗапроса);

		Выборка = РезультатЗапроса.Выбрать();

		Пока Выборка.Следующий() Цикл
			
			сткДанныеЦеныНоменклатуры = Новый Структура(ИменаКолонок);
			ЗаполнитьЗначенияСвойств(сткДанныеЦеныНоменклатуры, Выборка);
			мсвДанныеЦенНоменклатуры.Добавить(сткДанныеЦеныНоменклатуры);
	
		КонецЦикла;
	
	КонецЕсли;

	Возврат SUI_HTTPСервис.РезультатУспех(мсвДанныеЦенНоменклатуры);

КонецФункции

Функция ПолучитьОстаткиНоменклатурыВЯчейке(ПараметрыПолучения) Экспорт

	мсвДанныеОстатков = Новый Массив();
	
	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Номенклатура", SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыПолучения, 
		"Номенклатура", Справочники.Номенклатура.ПустаяСсылка(), Тип("СправочникСсылка.Номенклатура")));
	Запрос.УстановитьПараметр("Ячейка", SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыПолучения, 
		"Ячейка", Справочники.СкладскиеЯчейки.ПустаяСсылка(), Тип("СправочникСсылка.СкладскиеЯчейки")));
	
	SUI_ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(Запрос.Параметры.Номенклатура), 
		НСтр("ru = 'Передано пустое значение параметра номенклатуры'"), 
		КонтекстВызова("ПолучитьОстаткиНоменклатурыВЯчейке"));

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыВЯчейкахОстатки.Номенклатура КАК id_good,
		|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Номенклатура.Представление, """") КАК name_good,
		|	ТоварыВЯчейкахОстатки.Характеристика КАК id_property,
		|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Характеристика.Представление, """") КАК name_property,
		|	ТоварыВЯчейкахОстатки.Упаковка КАК id_unit,
		|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Упаковка.Представление, """") КАК name_unit,
		|	ТоварыВЯчейкахОстатки.Ячейка КАК id_cell,
		|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Ячейка.Код, """") КАК name_cell,
		|	ТоварыВЯчейкахОстатки.Серия КАК id_series,
		|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Серия.Представление, """") КАК name_series,
		|	ТоварыВЯчейкахОстатки.ВНаличииОстаток КАК qtty
		|ИЗ
		|	РегистрНакопления.ТоварыВЯчейках.Остатки(
		|			,
		|			Номенклатура = &Номенклатура
		|				И ВЫБОР
		|					КОГДА &Ячейка <> ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяСсылка)
		|						ТОГДА Ячейка = &Ячейка
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ) КАК ТоварыВЯчейкахОстатки";

	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();

	Если Не РезультатЗапроса.Пустой() Тогда
		
		ИменаКолонок = SUI_ОбщегоНазначения.ПолучитьИменаКолонокРезультатаЗапроса(РезультатЗапроса);
		
		Выборка = РезультатЗапроса.Выбрать();
	
		Пока Выборка.Следующий() Цикл
			
			сткДанныеОстатка = Новый Структура(ИменаКолонок);
			ЗаполнитьЗначенияСвойств(сткДанныеОстатка, Выборка);
			мсвДанныеОстатков.Добавить(сткДанныеОстатка);
	
		КонецЦикла;
		
	КонецЕсли;

	Возврат SUI_HTTPСервис.РезультатУспех(мсвДанныеОстатков);

КонецФункции

Функция ПолучитьОстаткиНоменклатурыНаСкладах(ПараметрыПолучения) Экспорт

	мсвДанныеОстатков = Новый Массив();

	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Номенклатура", SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыПолучения, 
		"Номенклатура", Справочники.Номенклатура.ПустаяСсылка(), Тип("СправочникСсылка.Номенклатура")));
	Запрос.УстановитьПараметр("Склад", SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыПолучения, 
		"Склад", Справочники.Склады.ПустаяСсылка(), Тип("СправочникСсылка.Склады")));
	
	SUI_ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(Запрос.Параметры.Номенклатура), 
		НСтр("ru = 'Передано пустое значение параметра номенклатуры'"), 
		КонтекстВызова("ПолучитьОстаткиНоменклатурыНаСкладах"));

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Номенклатура КАК id_good,
		|	ЕСТЬNULL(ТоварыНаСкладахОстатки.Номенклатура.Представление, """") КАК name_good,
		|	ТоварыНаСкладахОстатки.Характеристика КАК id_property,
		|	ЕСТЬNULL(ТоварыНаСкладахОстатки.Характеристика.Представление, """") КАК name_property,
		|	ТоварыНаСкладахОстатки.Склад КАК id_warehouse,
		|	ЕСТЬNULL(ТоварыНаСкладахОстатки.Склад.Представление, """") КАК name_warehouse,
		|	ТоварыНаСкладахОстатки.Серия КАК id_series,
		|	ЕСТЬNULL(ТоварыНаСкладахОстатки.Серия.Представление, """") КАК name_series,
		|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК qtty
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(
		|			,
		|			Номенклатура = &Номенклатура
		|				И ВЫБОР
		|					КОГДА &Склад <> ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|						ТОГДА Склад = &Склад
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ) КАК ТоварыНаСкладахОстатки";

	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ИменаКолонок = SUI_ОбщегоНазначения.ПолучитьИменаКолонокРезультатаЗапроса(РезультатЗапроса);

		Выборка = РезультатЗапроса.Выбрать();
	
		Пока Выборка.Следующий() Цикл
			
			сткДанныеОстатка = Новый Структура(ИменаКолонок);
			ЗаполнитьЗначенияСвойств(сткДанныеОстатка, Выборка);
			мсвДанныеОстатков.Добавить(сткДанныеОстатка);
	
		КонецЦикла;
		
	КонецЕсли;

	Возврат SUI_HTTPСервис.РезультатУспех(мсвДанныеОстатков);

КонецФункции

Функция ПолучитьШаблоныЭтикеток() Экспорт

	ШаблоныЭтикеток = Новый Массив();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	SUI_tbl_label_templates.name КАК name,
		|	SUI_tbl_label_templates.layout КАК html,
		|	SUI_tbl_label_templates.height КАК height,
		|	SUI_tbl_label_templates.width КАК width,
		|	SUI_tbl_label_templates.isZPL КАК isZPL,
		|	SUI_tbl_label_templates.containsDM
		|ИЗ
		|	РегистрСведений.SUI_tbl_label_templates КАК SUI_tbl_label_templates";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ИменаКолонок = SUI_ОбщегоНазначения.ПолучитьИменаКолонокРезультатаЗапроса(РезультатЗапроса);
		
		Выборка = РезультатЗапроса.Выбрать();
	
		Пока Выборка.Следующий() Цикл
			
			ДанныеШаблона = Новый Структура(ИменаКолонок);
			
			ЗаполнитьЗначенияСвойств(ДанныеШаблона, Выборка);
			
			ДанныеШаблона.html = ДанныеШаблона.html.Получить();
			
			Если Не ЗначениеЗаполнено(ДанныеШаблона.html) Тогда
				Продолжить;
			КонецЕсли;
			
			ШаблоныЭтикеток.Добавить(ДанныеШаблона);
			
		КонецЦикла;
	
	КонецЕсли;

	Возврат SUI_HTTPСервис.РезультатУспех(ШаблоныЭтикеток);
	
КонецФункции

Функция СоздатьШтрихкодыНоменклатуры(МобильноеУстройство, ДанныеШтрихкодов, ОфлайнОбмен = Ложь) Экспорт
	
	SUI_ОбщегоНазначенияКлиентСервер.Проверить(ПолучитьФункциональнуюОпцию("SUI_ИспользоватьТаблицу_ШтрихкодыНоменклатуры"),
		НСтр("ru = 'Таблица штрихкоды номенклатуры не используется.'"));
	
	ЗагруженоОбъектов = 0;
	
	НачатьТранзакцию();
	
	Попытка
		
		НастройкаИнтеграции = SUI_НастройкиМетаданныхСервер.ПолучитьДополнительныеНастройки(
			Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыНоменклатуры, Ложь);
		
		АлгоритмСозданияШтрихкодаНоменклатуры = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НастройкаИнтеграции, 
			"АлгоритмСозданияШтрихкодаНоменклатуры.Алгоритм", "", Тип("Строка"));
		
		SUI_ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(АлгоритмСозданияШтрихкодаНоменклатуры), 
			НСтр("ru = 'Отсутствует алгоритм создания штрихкода номенклатуры.'"));

		Для Каждого СтрокаДанныхШтрихкода Из ДанныеШтрихкодов Цикл
			
			//@skip-check structure-consructor-too-many-keys
			ДанныеШтрихкода = Новый Структура("barcode,id_good,id_property,id_unit");
			
			ЗаполнитьЗначенияСвойств(ДанныеШтрихкода, СтрокаДанныхШтрихкода);
			
			SUI_ИнтеграцияВКонфигурацию.ВосстановитьСсылкиИдентификаторовSimple(ДанныеШтрихкода, , Ложь);
			
			// Создать через произвольный алгоритм
			Результат = SUI_ШтрихкодыНоменклатуры.СоздатьШтрихкодНоменклатуры(АлгоритмСозданияШтрихкодаНоменклатуры, 
				ДанныеШтрихкода.barcode, 
				ДанныеШтрихкода.id_good, 
				ДанныеШтрихкода.id_property, 
				ДанныеШтрихкода.id_unit);
			
			Если Результат Тогда
				ЗагруженоОбъектов = ЗагруженоОбъектов + 1;
			КонецЕсли;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	РезультатЗагрузки = Новый Структура();

	РезультатЗагрузки.Вставить("result", 			(ДанныеШтрихкодов.Количество() > 0 И ЗагруженоОбъектов > 0));
	РезультатЗагрузки.Вставить("total", 			ДанныеШтрихкодов.Количество());
	РезультатЗагрузки.Вставить("quantity_uploaded", ЗагруженоОбъектов);

	//@skip-check constructor-function-return-section 
	Если ОфлайнОбмен Тогда  
		Возврат (РезультатЗагрузки);		
	Иначе
		Возврат SUI_HTTPСервис.РезультатУспех(РезультатЗагрузки);
	КонецЕсли; 
	
КонецФункции

Функция ВыполнитьПользовательскийЗапрос(МобильноеУстройство, НастройкиЗапроса) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Оценка производительности
	ОценкаПроизводительности_НачалоЗамера = SUI_ОценкаПроизводительности.НачатьЗамерВремени();
	ОценкаПроизводительности_КлючеваяОперация = "ВыполнитьПользовательскийЗапрос";
	ОценкаПроизводительности_Комментарий = "";
	
	ДанныеШаблонаЭтикетки = Новый Структура("id, name");
	ЗаполнитьЗначенияСвойств(ДанныеШаблонаЭтикетки, SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		НастройкиЗапроса, "label_template", Новый Структура(), Тип("Структура")));
	
	Если ДанныеШаблонаЭтикетки.id = Неопределено И ДанныеШаблонаЭтикетки.name = Неопределено Тогда
		ДанныеШаблонаЭтикетки.name = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НастройкиЗапроса, "name", "", Тип("Строка"));
		Если ПустаяСтрока(ДанныеШаблонаЭтикетки.name) Тогда
			ДанныеШаблонаЭтикетки.name = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Если ДанныеШаблонаЭтикетки.id <> Неопределено Или ДанныеШаблонаЭтикетки.name <> Неопределено Тогда

		ТекстОшибки = "";
		
		Если ДанныеШаблонаЭтикетки.id <> Неопределено Тогда
			РезультатПоЗначению = SUI_ИнтеграцияВКонфигурацию.НайтиВТаблицеПоЗначению(
				Перечисления.SUI_ТаблицыИнтеграции.ШаблоныЭтикеток, "id", ДанныеШаблонаЭтикетки.id);
		ИначеЕсли ДанныеШаблонаЭтикетки.name <> Неопределено Тогда
			РезультатПоЗначению = SUI_ИнтеграцияВКонфигурацию.НайтиВТаблицеПоЗначению(
				Перечисления.SUI_ТаблицыИнтеграции.ШаблоныЭтикеток, "name", ДанныеШаблонаЭтикетки.name);
		Иначе
			РезультатПоЗначению = Неопределено;
		КонецЕсли;
		
		Если РезультатПоЗначению = Неопределено Тогда
			
			СообщенияПользователю = ПолучитьСообщенияПользователю();
			
			Если СообщенияПользователю.Количество() = 0 Тогда
				ТекстОшибки = СтрШаблон(НСтр("ru = 'Не удалось получить данные из таблицы ""%1""'"), 
					Перечисления.SUI_ТаблицыИнтеграции.ШаблоныЭтикеток);
			Иначе
				ТекстОшибки = СтрСоединить(СообщенияПользователю, Символы.ПС);
			КонецЕсли;
			
		ИначеЕсли РезультатПоЗначению.Пустой() Тогда
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Шаблон этикетки по наименованию ""%1"" не найден'"), 
					Перечисления.SUI_ТаблицыИнтеграции.ШаблоныЭтикеток);
		Иначе
			
			ВыборкаШаблоныЭтикеток = РезультатПоЗначению.Выбрать();
			ВыборкаШаблоныЭтикеток.Следующий();
			
			ШаблонЭтикеткиСсылка = SUI_ИнтеграцияВКонфигурацию.СсылкаПоИдентификаторуSimple(ВыборкаШаблоныЭтикеток.id);
			
			ДанныеКонструктора = Справочники.SUI_ШаблоныЭтикетокZPL.ПолучитьДанныеКонструктораЗапроса(ШаблонЭтикеткиСсылка);
			
			Если ДанныеКонструктора = Неопределено Тогда
				ТекстОшибки = СтрШаблон(НСтр("ru = 'Для шаблона этикетки ""%1"" отсутствуют данные для выполнения запроса'"), 
						ШаблонЭтикеткиСсылка);
			КонецЕсли;
			
		КонецЕсли;
		
		SUI_ОбщегоНазначенияКлиентСервер.Проверить(ПустаяСтрока(ТекстОшибки), ТекстОшибки);
		
		ОценкаПроизводительности_Комментарий = СтрШаблон(НСтр("ru = 'Запрос из шаблона этикетки ""%1""'"), ШаблонЭтикеткиСсылка);
	
	Иначе
		
		SUI_ОбщегоНазначенияКлиентСервер.Проверить(
			ПолучитьФункциональнуюОпцию("SUI_ИспользоватьПользовательскийЗапрос"),
			НСтр("ru = 'Выполнение пользовательских запросов недоступно'"));
		
		УстановитьПривилегированныйРежим(Истина);
		ДанныеКонструктора = SUI_НастройкиМетаданныхСервер.ПолучитьПользовательскийЗапрос();
		УстановитьПривилегированныйРежим(Ложь);
		
		SUI_ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(ДанныеКонструктора.ТекстЗапроса),
			НСтр("ru = 'Не заполнен текст запроса для выполнения пользовательского запроса.'"));
		
		ОценкаПроизводительности_Комментарий = НСтр("ru = 'Пользовательский запрос'");
		
	КонецЕсли;
	
	ПараметрыЗапроса = Новый Структура();
	
	ПараметрыИзТелаЗапроса = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НастройкиЗапроса, "params", Новый Массив(), Тип("Массив"));
	Для индекс = 0 По ПараметрыИзТелаЗапроса.ВГраница() Цикл
		
		ИмяПараметра = SUI_СтроковыеФункцииКлиентСервер.ПривестиСтрокуКРазрешеннымСимволам(
			СокрЛП(SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыИзТелаЗапроса[индекс], "name", "", Тип("Строка"))), 
			"_" + SUI_СтроковыеФункцииКлиентСервер.АлфавитЦифры()
			+ SUI_СтроковыеФункцииКлиентСервер.АлфавитБуквыЛатинские()
			+ SUI_СтроковыеФункцииКлиентСервер.АлфавитБуквыРусские());
		
		SUI_ОбщегоНазначенияКлиентСервер.Проверить(
			ЗначениеЗаполнено(ИмяПараметра),
			СтрШаблон(НСтр("ru = 'Не верное имя параметра [%1]'"), индекс));
		
		ПараметрыЗапроса.Вставить(ИмяПараметра, SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыИзТелаЗапроса[индекс], "value"));
		
	КонецЦикла;
	
	// Установка параметра запроса ДатаЗапроса (query_date)
	Если Не ПараметрыЗапроса.Свойство("ДатаЗапроса") Тогда
		ПараметрыЗапроса.Вставить("ДатаЗапроса", ТекущаяДатаСеанса());
	КонецЕсли;
	
	// Установка параметра запроса Пользователя
	Если Не ПараметрыЗапроса.Свойство("МобильноеУстройство") Тогда
		ПараметрыЗапроса.Вставить("МобильноеУстройство", МобильноеУстройство);
	КонецЕсли;
	
	Попытка
		Результат = SUI_КонструкторЗапроса.ВыполнитьЗапросКонструктораЗапроса(ДанныеКонструктора, ПараметрыЗапроса);
	Исключение
		SUI_ОценкаПроизводительности.ЗакончитьЗамерВремени(ОценкаПроизводительности_КлючеваяОперация, 
			ОценкаПроизводительности_НачалоЗамера, , ОценкаПроизводительности_Комментарий, Истина);
		ВызватьИсключение;
	КонецПопытки;
	
	// Оценка производительности
	SUI_ОценкаПроизводительности.ЗакончитьЗамерВремени(ОценкаПроизводительности_КлючеваяОперация, 
		ОценкаПроизводительности_НачалоЗамера, Результат.Количество(), ОценкаПроизводительности_Комментарий);
	
	Если ДанныеКонструктора.ВыполнятьВПакетномРежиме Тогда
		Возврат SUI_HTTPСервис.РезультатУспех(Результат);
	Иначе
		
		Если ЗначениеЗаполнено(Результат) Тогда
			Возврат SUI_HTTPСервис.РезультатУспех(
				SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "package_0", Новый Массив(), Тип("Массив")));
		Иначе
			Возврат SUI_HTTPСервис.РезультатУспех(Результат);
		КонецЕсли;

	КонецЕсли;
	
КонецФункции

Функция СоздатьДокументПеремещенияЗапасов(МобильноеУстройство, ПараметрыСоздания) Экспорт
	
	Перем ДанныеДокументаОбмена, НастройкаДокумента;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	SUI_НастройкиДокументов.ПометкаУдаления,
		|	SUI_НастройкиДокументов.ИмяОбъектаМетаданных,
		|	SUI_НастройкиДокументов.Ссылка,
		|   SUI_НастройкиДокументов.Используется
		|ИЗ
		|	Справочник.SUI_НастройкиДокументов КАК SUI_НастройкиДокументов
		|ГДЕ
		|	SUI_НастройкиДокументов.Ссылка = &НастройкаДокумента";
	
	Запрос.УстановитьПараметр("НастройкаДокумента", ПолучитьФункциональнуюОпцию("SUI_НастройкаДокументаПеремещенияЗапасов"));
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		НастройкаДокумента = SUI_ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Выборка);
	КонецЕсли;

	Если НастройкаДокумента = Неопределено Или Не ЗначениеЗаполнено(НастройкаДокумента.Ссылка) Тогда
		Возврат SUI_HTTPСервис.РезультатОшибка(НСтр("ru = 'Не удалось создать документ.
		|В центре настроек не выбрана настройка документа для создания документа перемещения запасов.'"));
	КонецЕсли;
	
	Если Не SUI_НастройкиДокументовСервер.НастройкаДокументаПринадлежитМобильномуКлиенту(НастройкаДокумента.Ссылка, МобильноеУстройство) Тогда
		Возврат SUI_HTTPСервис.РезультатОшибка(СтрШаблон(НСтр("ru = 'Не удалось создать документ.
		|Настройка документа ""%1"" не доступна мобильному клиенту.'"), НастройкаДокумента.Ссылка));
	КонецЕсли;
	
	Организация = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыСоздания, "Организация");
	Отправитель = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыСоздания, "Отправитель");
	Получатель = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыСоздания, "Получатель");

	НачатьТранзакцию();
	
	Попытка
		
		ДанныеМУ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(МобильноеУстройство, "Код,Наименование");
		
		SUI_ОбщегоНазначенияКлиентСервер.Проверить(Не НастройкаДокумента.ПометкаУдаления, 
			СтрШаблон(НСтр("ru = 'Настройка документа ""%1"" помечена на удаление.'"), НастройкаДокумента.Ссылка));
		
		SUI_ОбщегоНазначенияКлиентСервер.Проверить(НастройкаДокумента.Используется, 
			СтрШаблон(НСтр("ru = 'Настройка документа ""%1"" не используется.'"), НастройкаДокумента.Ссылка));
			
		МетаданныеДокумента = Метаданные.Документы.Найти(НастройкаДокумента.ИмяОбъектаМетаданных);
		SUI_ОбщегоНазначенияКлиентСервер.Проверить(МетаданныеДокумента <> Неопределено, 
			СтрШаблон(НСтр("ru = 'По настройке ""%1"" не удалось определить метаданные документа.'"), НастройкаДокумента.Ссылка));
		
		ДокументОбъект = SUI_ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(МетаданныеДокумента.ПолноеИмя()).СоздатьДокумент();
		ДокументОбъект.Дата = ТекущаяДатаСеанса();
		
		Если Организация <> Неопределено И ОбщегоНазначения.ЕстьРеквизитОбъекта("Организация", МетаданныеДокумента) Тогда
			ДокументОбъект["Организация"] = Организация;
		КонецЕсли;
		
		Если Отправитель <> Неопределено И ОбщегоНазначения.ЕстьРеквизитОбъекта("Отправитель", МетаданныеДокумента) Тогда
			ДокументОбъект["Отправитель"] = Отправитель;
		ИначеЕсли Отправитель <> Неопределено И ОбщегоНазначения.ЕстьРеквизитОбъекта("СкладОтправитель", МетаданныеДокумента) Тогда
			ДокументОбъект["СкладОтправитель"] = Отправитель;
		КонецЕсли;
		
		Если Получатель <> Неопределено И ОбщегоНазначения.ЕстьРеквизитОбъекта("Получатель", МетаданныеДокумента) Тогда
			ДокументОбъект["Получатель"] = Получатель;
		ИначеЕсли Получатель <> Неопределено И ОбщегоНазначения.ЕстьРеквизитОбъекта("СкладПолучатель", МетаданныеДокумента) Тогда
			ДокументОбъект["СкладПолучатель"] = Получатель;
		КонецЕсли;
		
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Комментарий", МетаданныеДокумента) Тогда
			ДокументОбъект["Комментарий"] = СтрШаблон(НСтр("ru = ' #Simple. Создано из мобильного клиента: %1 (%2).'"), 
				ДанныеМУ.Наименование, ДанныеМУ.Код);
		КонецЕсли;
		
		// Отключить выгрузки при записи документа
		ДокументОбъект.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		
		// Получить настройки для созданного документа и проверить вхождение настройки из константы
		SUI_ОбщегоНазначенияКлиентСервер.Проверить(
			SUI_НастройкиДокументовСервер.ДокументСоответствуетОтборуНастройки(НастройкаДокумента.Ссылка, ДокументОбъект.Ссылка), 
			СтрШаблон(НСтр("ru = 'Сформированный документ не соответствует критериям отбора настройки документа ""%1"".'"), НастройкаДокумента.Ссылка));
		
		НастройкиДокумента = SUI_НастройкиДокументовСервер.СформироватьНастройкиДокумента(НастройкаДокумента.Ссылка);
		АдресноеХранение = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НастройкиДокумента, "ЭтоДокументАдресногоХранения");
		
		SUI_ОбщегоНазначенияКлиентСервер.Проверить(АдресноеХранение <> Неопределено, 
			СтрШаблон(НСтр("ru = 'Не удалось определить тип документа по настройке ""%1"".'"), НастройкаДокумента.Ссылка));
		
		// Выгрузить документ на ТСД
		ПараметрыВыгрузкиДокументаОбмена = SUI_ДокументыОбмена.ПараметрыВыгрузкиДокументаОбмена();
		ПараметрыВыгрузкиДокументаОбмена.МобильноеУстройство 	= МобильноеУстройство;
		ПараметрыВыгрузкиДокументаОбмена.НастройкаДокумента 	= НастройкаДокумента.Ссылка;
		ПараметрыВыгрузкиДокументаОбмена.ДокументСсылка 		= ДокументОбъект.Ссылка;
		ПараметрыВыгрузкиДокументаОбмена.Вставить("SUI_АдресноеХранение", АдресноеХранение);
		ДанныеДокументаОбмена = SUI_ДокументыОбмена.ВыгрузитьИПолучитьДокументОбмена(ПараметрыВыгрузкиДокументаОбмена);
		
		SUI_ОбщегоНазначенияКлиентСервер.Проверить(ДанныеДокументаОбмена <> Неопределено, 
			НСтр("ru = 'Не удалось получить данные выгруженного документа.'"));
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(), , 
			Метаданные.ОбщиеМодули.SUI_ОбменДаннымиСервер, , ИнформацияОбОшибке());
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось создать документ.
			|%1'"), КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

	Возврат SUI_HTTPСервис.РезультатУспех(ДанныеДокументаОбмена);
	
КонецФункции

Функция ПолучитьОстаткиИЦены(МобильноеУстройство, Параметры) Экспорт
	
	Результат = Новый Массив();

	ДанныеКонструктора = SUI_НастройкиМетаданныхСервер.ПолучитьЗапросПолученияОстатковИЦен();
	
	ТекстЗапроса = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеКонструктора, "ТекстЗапроса", "", Тип("Строка"));
	Если ПустаяСтрока(ТекстЗапроса) Тогда
		ВызватьИсключение НСтр("ru = 'Отсутсвует текст запроса для получения остатков и цен'");
	КонецЕсли;
	
	сткПустойОбъект = Новый Структура();
	сткПустойОбъект.Вставить("id_good");
	сткПустойОбъект.Вставить("good_name");
	сткПустойОбъект.Вставить("article");
	сткПустойОбъект.Вставить("id_property");
	сткПустойОбъект.Вставить("property_name");
	сткПустойОбъект.Вставить("representation");
	сткПустойОбъект.Вставить("purpose");
	сткПустойОбъект.Вставить("qtty");
	сткПустойОбъект.Вставить("price_new");
	сткПустойОбъект.Вставить("price_old");
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Для Каждого Параметр Из Параметры Цикл
		Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();

	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			сткНовыйОбъект = SUI_ОбщегоНазначения.СкопироватьРекурсивно(сткПустойОбъект, Ложь);
			ЗаполнитьЗначенияСвойств(сткНовыйОбъект, SUI_ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Выборка));
			Если Не ОбщегоНазначения.КоллекцииИдентичны(сткПустойОбъект, сткНовыйОбъект) Тогда
				Результат.Добавить(сткНовыйОбъект);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат SUI_HTTPСервис.РезультатУспех(Результат);
	
КонецФункции

Функция ПолучитьСоставКодовМаркировок(МобильноеУстройство, КодыМаркировкиКЗапросу, ИдентификаторДокумента, ИдентификаторНастройки) Экспорт
	
	ПодключеннаяИнтеграционнаяОбработка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту(
		"ИмяОбъекта", "SimpleИнтеграцияГИСМТ");
		
	ВыполнитьПроверкиПередЗапускомВнешнейОбработки(КодыМаркировкиКЗапросу, ПодключеннаяИнтеграционнаяОбработка);
	
	ПараметрыКоманды = Новый Структура();
	ПараметрыКоманды.Вставить("ДополнительнаяОбработкаСсылка", ПодключеннаяИнтеграционнаяОбработка);
	ПараметрыКоманды.Вставить("ИдентификаторКоманды", "ЗапросСоставаКодовМаркировки");
	ПараметрыКоманды.Вставить("ОбъектыНазначения", Новый Массив());
	ПараметрыКоманды.Вставить("Штрихкоды", КодыМаркировкиКЗапросу);
	
	РезультатВыполнения = ДополнительныеОтчетыИОбработки.ВыполнитьКоманду(ПараметрыКоманды);
	
	ПроверкаИННВладельцаИСтатуса(ИдентификаторДокумента, ИдентификаторНастройки, РезультатВыполнения.СоставКодовМаркировки);
	
	Возврат SUI_HTTPСервис.РезультатУспех(РезультатВыполнения.СоставКодовМаркировки);
	
КонецФункции

Функция ДанныеПолученныеПоКодамМаркировки(ДанныеЗапроса) Экспорт
	
	ИдентификаторЗапроса = ДанныеЗапроса.Параметры.Получить("request_id");
	МобильноеУстройство = ДанныеЗапроса.МобильноеУстройство.Ссылка;
	КодыМаркировкиКЗапросу = SUI_ОбщегоНазначенияКлиентСервер.ДанныеИзСтрокиJSON(ДанныеЗапроса.Тело, Ложь);

	ДанныеПоЗапросу = ДанныеПоЗапросуСоставаКМ(ИдентификаторЗапроса, МобильноеУстройство);

	Если ДанныеПоЗапросу = Неопределено Тогда

		ИдентификаторФоновогоЗадания = Новый УникальныйИдентификатор;

		НачатьТранзакцию();

		РегистрыСведений.SUI_ДанныеКодовМаркировки.СоздатьЗапись(МобильноеУстройство, ИдентификаторЗапроса,
			КодыМаркировкиКЗапросу, ИдентификаторФоновогоЗадания);

		ВыполнитьОбработкуСоставовКодовМаркировокВФоне(МобильноеУстройство, КодыМаркировкиКЗапросу,
			ИдентификаторЗапроса, ИдентификаторФоновогоЗадания);

		ЗафиксироватьТранзакцию();

		Результат = SUI_HTTPСервис.РезультатУспех("Коды маркировки находятся в работе");

	Иначе

		Если ДанныеПоЗапросу.Выполнено Тогда

			Результат = SUI_HTTPСервис.РезультатУспех(ДанныеПоЗапросу.Результат.Получить());

			Запись = РегистрыСведений.SUI_ДанныеКодовМаркировки.СоздатьМенеджерЗаписи();
			Запись.МобильноеУстройство = МобильноеУстройство;
			Запись.УникальныйИдентификатор = ИдентификаторЗапроса;
			Запись.Удалить();

		Иначе

			ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(
						Новый УникальныйИдентификатор(ДанныеПоЗапросу.ИдентификаторФоновогоЗадания));
						
			Ошибка = "";
			
			Если ФоновоеЗадание = Неопределено ИЛИ ФоновоеЗадание.Состояние <> СостояниеФоновогоЗадания.Активно Тогда

				Если ЗначениеЗаполнено(ДанныеПоЗапросу.ТекстОшибки) Тогда
					Ошибка = ДанныеПоЗапросу.ТекстОшибки;
				Иначе
					ВыполнитьОбработкуСоставовКодовМаркировокВФоне(МобильноеУстройство, КодыМаркировкиКЗапросу,
						ИдентификаторЗапроса, ДанныеПоЗапросу.ИдентификаторФоновогоЗадания);
				КонецЕсли;

			КонецЕсли;

			Результат = ?(ЗначениеЗаполнено(Ошибка), SUI_HTTPСервис.РезультатОшибка(Ошибка),
				SUI_HTTPСервис.РезультатУспех("Коды маркировки находятся в работе"));

		КонецЕсли;

	КонецЕсли;

	Возврат Результат;
	
КонецФункции
			
Процедура ОбработатьСоставКодовМаркировокВФоне(МобильноеУстройство, КодыМаркировкиКЗапросу, ИдентификаторЗапроса) Экспорт
	
	Попытка

		ПодключеннаяИнтеграционнаяОбработка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту(
		"ИмяОбъекта", "SimpleИнтеграцияГИСМТ");

		ВыполнитьПроверкиПередЗапускомВнешнейОбработки(КодыМаркировкиКЗапросу, ПодключеннаяИнтеграционнаяОбработка);

		ПараметрыКоманды = Новый Структура;
		ПараметрыКоманды.Вставить("ДополнительнаяОбработкаСсылка", ПодключеннаяИнтеграционнаяОбработка);
		ПараметрыКоманды.Вставить("ИдентификаторКоманды", "ЗапросСоставаКодовМаркировки");
		ПараметрыКоманды.Вставить("ОбъектыНазначения", Новый Массив);
		ПараметрыКоманды.Вставить("Штрихкоды", КодыМаркировкиКЗапросу);

		РезультатВыполнения = ДополнительныеОтчетыИОбработки.ВыполнитьКоманду(ПараметрыКоманды);

		Запись = РегистрыСведений.SUI_ДанныеКодовМаркировки.СоздатьМенеджерЗаписи();
		Запись.МобильноеУстройство = МобильноеУстройство;
		Запись.УникальныйИдентификатор = ИдентификаторЗапроса;
		Запись.Прочитать();

		Запись.Результат = Новый ХранилищеЗначения(РезультатВыполнения);
		Запись.Выполнено = Истина;
		Запись.ДатаОбновления = ТекущаяДатаСеанса();
		Запись.Записать();
		
	Исключение
		
		Запись = РегистрыСведений.SUI_ДанныеКодовМаркировки.СоздатьМенеджерЗаписи();
		Запись.МобильноеУстройство = МобильноеУстройство;
		Запись.УникальныйИдентификатор = ИдентификаторЗапроса;
		Запись.Прочитать();

		Запись.ТекстОшибки = ОписаниеОшибки();
		Запись.Выполнено = Ложь;
		Запись.ДатаОбновления = ТекущаяДатаСеанса();
		Запись.Записать();
		
	КонецПопытки
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ВосстановлениеДанныхJSON

Функция ВосстановлениеДанныхJSON_ДанныеДокумента(Свойство, Значение, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Свойство) Тогда
		Возврат Значение;
	КонецЕсли;
	
	ОписаниеСтруктура = Новый ОписаниеТипов("Структура");   
	
	ПараметрыСвойства = ОписаниеСтруктура.ПривестиЗначение(ДополнительныеПараметры);
	
	Если ПараметрыСвойства.Свойство(Свойство) Тогда
		ПараметрыСвойства = ОписаниеСтруктура.ПривестиЗначение(ПараметрыСвойства[Свойство]);	
	Иначе
		ПараметрыСвойства = Новый Структура();	
	КонецЕсли;
	
	АдресХранения = Неопределено;
	ПараметрыСвойства.Свойство("АдресХранения", АдресХранения);
	
	ИмяСвойства = НРег(Свойство);
	
	Если Не ПустаяСтрока(ИмяСвойства) Тогда
		
		Попытка
			
			Если ИмяСвойства = "rs_docs_table" Или ИмяСвойства = "rs_adr_docs_table" Тогда
				Возврат ВосстановлениеДанныхJSON_ДанныеДокумента_ТоварыДокумента(Значение, АдресХранения);
			ИначеЕсли ИмяСвойства = "rs_docs_barcodes" Тогда
				Возврат ВосстановлениеДанныхJSON_ДанныеДокумента_ШтрихкодыДокумента(Значение, АдресХранения);	
			ИначеЕсли ИмяСвойства = "rs_barc_flow" Тогда
				Возврат ВосстановлениеДанныхJSON_ДанныеДокумента_ПотокШтрихкодов(Значение, АдресХранения);
			ИначеЕсли ИмяСвойства = "rs_docs_series" Тогда
				Возврат ВосстановлениеДанныхJSON_ДанныеДокумента_СерииДокумента(Значение, АдресХранения);
			КонецЕсли;
			
		Исключение
			Ошибка = ИнформацияОбОшибке();
			ТекстОшибки = НСтр("ru = '[%1] Ошибка восстановления данных!'");
			ТекстОшибки = СтрШаблон(ТекстОшибки, Свойство);
			ВызватьИсключение(ТекстОшибки, , , , Ошибка);
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

Функция ВосстановлениеДанныхJSON_ПересчетТоваровДокумента(Свойство, Значение, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Свойство) Тогда
		
		ИмяСвойства = НРег(Свойство);
		
		Если ЗначениеЗаполнено(Значение) Тогда
				
			Если (ИмяСвойства = "id_good" Или ИмяСвойства = "id_properties" Или 
				ИмяСвойства = "id_series" Или ИмяСвойства = "id_unit" Или 
				ИмяСвойства = "id_cell" Или ИмяСвойства = "id_price") И
				Не SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(Значение) Тогда
				
				ТекстОшибки = НСтр("ru = 'Значение ""%1"" ключа ""%2"" не является идентификатором Simple.'");
				ТекстОшибки = СтрШаблон(ТекстОшибки, Значение, Свойство);
				ВызватьИсключение ТекстОшибки;
				
			КонецЕсли;
			
		ИначеЕсли ИмяСвойства = "id_good" Тогда
			ВызватьИсключение СтрШаблон(НСтр("ru = 'Не заполнен идентификатор номенклатуры (%1).'"), Свойство);
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Значение) = Тип("Массив") Тогда
		
		Таблица = SUI_ДокументыОбмена.ТаблицаПересчетТоваровДокументаОбмена();
		
		Если Таблица.Колонки.Найти("id_doc") = Неопределено Тогда
			Таблица.Колонки.Добавить("id_doc", SUI_ОбщегоНазначения.ОписаниеТипаСтрока(69));
		КонецЕсли;
		
		ИдентификаторДокумента = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			ДополнительныеПараметры, "ИдентификаторДокумента", "", Тип("Строка"));
		
		Если Не SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(ИдентификаторДокумента) Тогда
			ИдентификаторДокумента = "";
		КонецЕсли;
		
		Для индекс = 0 По Значение.ВГраница() Цикл
			
			Если Не Значение[индекс].Свойство("table_type") Тогда
				ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары;
			ИначеЕсли Значение[индекс].table_type = "in" Тогда
				ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение;
			ИначеЕсли Значение[индекс].table_type = "out" Тогда
				ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор;
			Иначе
				ТекстОшибки = НСтр("ru = 'Строка пересчета ""%1"" содержит ошибку:
				|Передан неизвестный тип таблицы ""%2"".'");
				ВызватьИсключение СтрШаблон(ТекстОшибки, индекс, Значение[индекс].table_type);
			КонецЕсли;
			
			СтрокаТаблицы = Таблица.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Значение[индекс]);
			
			СтрокаТаблицы.ТипТаблицы = ТипТаблицы;
			
			Если Не ПустаяСтрока(ИдентификаторДокумента) Тогда
				
				Если Не ПустаяСтрока(СтрокаТаблицы.id_doc) И
					СтрокаТаблицы.id_doc <> ИдентификаторДокумента Тогда
						
					ТекстОшибки = НСтр("ru = 'Строка пересчета ""%1"" содержит ошибку:
					|Идентификатор документа ""%2"" отличается от переданного в запросе ""%3"".'");
					ВызватьИсключение СтрШаблон(ТекстОшибки, индекс, СтрокаТаблицы.id_doc, ИдентификаторДокумента);
					
				Иначе
					СтрокаТаблицы.id_doc = ИдентификаторДокумента;
				КонецЕсли;
				
			ИначеЕсли ПустаяСтрока(СтрокаТаблицы.id_doc) Тогда
				
				ТекстОшибки = НСтр("ru = 'Строка пересчета ""%1"" содержит ошибку:
				|Не передан идентификатор документа.'");
				ВызватьИсключение СтрШаблон(ТекстОшибки, индекс);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ПересчетПоДокументам = Новый Соответствие();
		
		Если ПустаяСтрока(ИдентификаторДокумента) Тогда
			
			ИдентификаторыДокументов = SUI_ОбщегоНазначенияКлиентСервер.СвернутьМассив(Таблица.ВыгрузитьКолонку("id_doc"));
			
			Для индекс = 0 По ИдентификаторыДокументов.ВГраница() Цикл
				
				Отбор = Новый Структура("id_doc", ИдентификаторыДокументов[индекс]);
				ПересчетПоДокументам.Вставить(Отбор.id_doc, Таблица.Скопировать(Отбор));
				
			КонецЦикла;
			
		Иначе
			ПересчетПоДокументам.Вставить(ИдентификаторДокумента, Таблица);
		КонецЕсли;
		
		Значение = ПересчетПоДокументам;
		
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

Функция ВосстановлениеДанныхJSON_СоздатьШтрихкодыНоменклатуры(Свойство, Значение, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Свойство) Тогда
		Если ТипЗнч(Значение) = Тип("Массив") Тогда
			Возврат ВосстановлениеДанныхJSON_ДанныеШтрихкодов_СоздатьШтрихкодыНоменклатуры(Значение);
		Иначе
			Возврат Значение;
		КонецЕсли;
	КонецЕсли;

	ИмяСвойства = НРег(Свойство);

	Если ЗначениеЗаполнено(Значение) Тогда
			
		Если ИмяСвойства = "id_good" Или ИмяСвойства = "id_property" Или ИмяСвойства = "id_unit" Тогда
			SUI_ОбщегоНазначенияКлиентСервер.Проверить(SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(Значение),
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Значение ""%1"" ключа ""%2"" не является идентификатором Simple.'"), Значение, Свойство));
		КонецЕсли;
		
	Иначе
		
		Если ИмяСвойства = "barcode" Тогда
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Передано пустое значение штрихкода номенклатуры (%1).'"), Свойство);
		КонецЕсли;
		
		Если ИмяСвойства = "id_good" Тогда
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не заполнен идентификатор номенклатуры (%1).'"), Свойство);
		КонецЕсли;

	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

Функция ВосстановлениеДанныхJSON_НастройкиПользовательскогоЗапроса(Свойство, Значение, ДополнительныеПараметры) Экспорт
	
	Если Свойство = Неопределено И ТипЗнч(Значение) = Тип("Структура") И
		Значение.Количество() = 3 И
		Значение.Свойство("isID") И Значение.Свойство("name") И Значение.Свойство("value") Тогда
		
		Значение.Вставить("isID", SUI_ОбщегоНазначенияКлиентСервер.ОписаниеТипаБулево().ПривестиЗначение(Значение.isID));
		Значение.Вставить("name", SUI_ОбщегоНазначения.ОписаниеТипаСтрока(0).ПривестиЗначение(Значение.name));
		
		ОписаниеТипаИД = SUI_ОбщегоНазначения.ОписаниеТипаСтрока(69);
		
		Если ТипЗнч(Значение.value) = Тип("Массив") Тогда
			
			Если Значение.isID Тогда
				
				МассивЗначений = Новый Массив();
				Для Каждого value Из Значение.value Цикл
					Ссылка = SUI_ИнтеграцияВКонфигурацию.СсылкаПоИдентификаторуSimple(
						ОписаниеТипаИД.ПривестиЗначение(value));
					Если ЗначениеЗаполнено(Ссылка) Тогда
						МассивЗначений.Добавить(Ссылка);
					КонецЕсли;
				КонецЦикла;
				Значение.Вставить("value", SUI_ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивЗначений));
				
			Иначе
				Значение.Вставить("value", SUI_ОбщегоНазначенияКлиентСервер.СвернутьМассив(Значение.value));
			КонецЕсли;
			
		Иначе 
			
			Если Значение.isID Тогда
				Значение.Вставить("value", SUI_ИнтеграцияВКонфигурацию.СсылкаПоИдентификаторуSimple(
					ОписаниеТипаИД.ПривестиЗначение(Значение.value)));
			КонецЕсли;
			
		КонецЕсли;
			
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

Процедура ВыполнитьАлгоритмСозданияДокумента(Алгоритм, МобильноеУстройство, ДокументОбъект) Экспорт
	
	УстановитьБезопасныйРежим(Истина);
	
	Если SUI_ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.БазоваяФункциональность") Тогда
		МодульРаботаВМоделиСервиса = SUI_ОбщегоНазначения.ОбщийМодуль("РаботаВМоделиСервиса");
		МассивРазделителей = МодульРаботаВМоделиСервиса.РазделителиКонфигурации();
	Иначе
		МассивРазделителей = Новый Массив;
	КонецЕсли;
	
	Для Каждого ИмяРазделителя Из МассивРазделителей Цикл
		
		УстановитьБезопасныйРежимРазделенияДанных(ИмяРазделителя, Истина);
		
	КонецЦикла;
	
	Выполнить(Алгоритм);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

Функция ДанныеПоЗапросуСоставаКМ(ИдентификаторЗапроса, МобильноеУстройство)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	SUI_ДанныеКодовМаркировки.Результат,
	|	SUI_ДанныеКодовМаркировки.Выполнено,
	|	SUI_ДанныеКодовМаркировки.ИдентификаторФоновогоЗадания,
	|	SUI_ДанныеКодовМаркировки.ТекстОшибки
	|ИЗ
	|	РегистрСведений.SUI_ДанныеКодовМаркировки КАК SUI_ДанныеКодовМаркировки
	|ГДЕ
	|	SUI_ДанныеКодовМаркировки.МобильноеУстройство = &МобильноеУстройство
	|	И SUI_ДанныеКодовМаркировки.УникальныйИдентификатор = &УникальныйИдентификатор";

	Запрос.УстановитьПараметр("МобильноеУстройство", МобильноеУстройство);
	Запрос.УстановитьПараметр("УникальныйИдентификатор", ИдентификаторЗапроса);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда

		Результат = Новый Структура;

		Результат.Вставить("Результат", ВыборкаДетальныеЗаписи.Результат);
		Результат.Вставить("Выполнено", ВыборкаДетальныеЗаписи.Выполнено);
		Результат.Вставить("ИдентификаторФоновогоЗадания", ВыборкаДетальныеЗаписи.ИдентификаторФоновогоЗадания);
		Результат.Вставить("ТекстОшибки", ВыборкаДетальныеЗаписи.ТекстОшибки);
		
		Возврат ВыборкаДетальныеЗаписи;

	Иначе

		Возврат Неопределено;

	КонецЕсли;

КонецФункции

Процедура ВыполнитьОбработкуСоставовКодовМаркировокВФоне(МобильноеУстройство, КодыМаркировкиКЗапросу,
	ИдентификаторЗапроса, ИдентификаторФоновогоЗадания)

	ПараметрыВыполнения = Новый Массив;

	ПараметрыВыполнения.Добавить(МобильноеУстройство);
	ПараметрыВыполнения.Добавить(КодыМаркировкиКЗапросу);
	ПараметрыВыполнения.Добавить(ИдентификаторЗапроса);

	ФоновыеЗадания.Выполнить("ОбработатьСоставКодовМаркировокВФоне", ПараметрыВыполнения,
		ИдентификаторФоновогоЗадания);

КонецПроцедуры

// Функция - Имя события журнала регистрации
// 
// Возвращаемое значение:
//  Строка - имя события журнала регистрации
//
Функция ИмяСобытия()
	Возврат НСтр("ru = 'Обмен данными'");
КонецФункции

Функция КонтекстВызова(ВложенныйКонтекстВызова = "")
	
	Если ЗначениеЗаполнено(ВложенныйКонтекстВызова) Тогда
		Возврат ВложенныйКонтекстВызова + " (" + Метаданные.ОбщиеМодули.SUI_ОбменДаннымиСервер.ПолноеИмя() + ")";
	Иначе
		Возврат Метаданные.ОбщиеМодули.SUI_ОбменДаннымиСервер.ПолноеИмя();
	КонецЕсли;
	
КонецФункции

Функция ДокументОбменаОбновитьДанными(МобильноеУстройство, Данные)
	
	Загружено = Ложь;
	
	SUI_ОбщегоНазначенияКлиентСервер.ПроверитьПараметр("SUI_ОбменДаннымиСервер.ДокументОбменаОбновитьДанными", 
		"Данные", Данные, Тип("Структура"));
	
	ИдентификаторДокумента = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Данные, "id_doc", "", Тип("Строка"));
	
	Если Не SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(ИдентификаторДокумента) Тогда
		
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Передан неизвестный идентификатор документа ""%1""'"), ИдентификаторДокумента);
		ОбщегоНазначенияКлиентСервер.Проверить(Ложь, ТекстОшибки,
			"SUI_ОбменДаннымиСерверПереопределяемый.ЗагрузитьДанныеДокументов");
		
	КонецЕсли;
	
	ДанныеДляЗагрузки = РегистрыСведений.SUI_docs.ДанныеДляЗагрузкиИзМобильногоУстройства(
		ИдентификаторДокумента, МобильноеУстройство);
	
	Если Данные.Свойство("RS_docs_table") Тогда
		ДанныеДляЗагрузки.Таблицы.Товары = Данные.RS_docs_table;
	ИначеЕсли Данные.Свойство("RS_adr_docs_table") Тогда
		ДанныеДляЗагрузки.Таблицы.Товары = Данные.RS_adr_docs_table;
	КонецЕсли;
	
	Если Данные.Свойство("RS_docs_series") Тогда
		ДанныеДляЗагрузки.Таблицы.Серии = Данные.RS_docs_series;
	КонецЕсли;
	
	Если Данные.Свойство("RS_docs_barcodes") Тогда
		ДанныеДляЗагрузки.Таблицы.ШтрихкодыУпаковок = Данные.RS_docs_barcodes;
	КонецЕсли;
	
	Если Данные.Свойство("RS_barc_flow") Тогда
		ДанныеДляЗагрузки.Таблицы.ПотокШтрихкодов = Данные.RS_barc_flow;
	КонецЕсли;
	
	Если ДанныеДляЗагрузки.Таблицы.Количество() > 0 Тогда
		
		Результат = РегистрыСведений.SUI_docs.ЗагрузитьИзМобильногоУстройства(ДанныеДляЗагрузки);
		
		Если Результат Тогда
			Загружено = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Загружено;
	
КонецФункции

#Область ВосстановлениеДанныхJSON_ДанныеДокументов

Функция ВосстановлениеДанныхJSON_ДанныеДокумента_ТоварыДокумента(мсвДанные, АдресХранения = Неопределено)
	
	Таблица = SUI_ДокументыОбмена.ТаблицаТоварыДокументаОбмена();
	
	Если ТипЗнч(мсвДанные) = Тип("Массив") Тогда
		
		ПроверяемыеКлючи = Новый Соответствие();
		ПроверяемыеКлючи.Вставить("id_good", 		Истина);
		ПроверяемыеКлючи.Вставить("id_properties", 	Ложь);
		ПроверяемыеКлючи.Вставить("id_unit", 		Ложь);
		ПроверяемыеКлючи.Вставить("id_series", 		Ложь);
		ПроверяемыеКлючи.Вставить("id_cell", 		Ложь);
		ПроверяемыеКлючи.Вставить("id_price", 		Ложь);
		
		Для индекс = 0 По мсвДанные.ВГраница() Цикл
			
			Если Не мсвДанные[индекс].Свойство("table_type") Тогда
				ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары;
			Иначе
				
				Если мсвДанные[индекс].table_type = "in" Тогда
					ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение;
				ИначеЕсли мсвДанные[индекс].table_type = "out" Тогда
					ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор;
				Иначе
					ТекстОшибки = НСтр("ru = '[%1] Не удалось определить тип таблицы %2!'");
					ТекстОшибки = СтрШаблон(ТекстОшибки, индекс, мсвДанные[индекс].table_type);
					ВызватьИсключение ТекстОшибки;
				КонецЕсли;
			
			КонецЕсли;
			
			СтрокаТаблицы = Таблица.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, мсвДанные[индекс]);
			СтрокаТаблицы.ТипТаблицы = ТипТаблицы;
			
			Попытка
				ПроверитьЗаполнениеИдентификаторовПриВосстановленииДанныхJSON(СтрокаТаблицы, ПроверяемыеКлючи);
			Исключение
				ТекстОшибки = СтрШаблон("[%1] %2", индекс, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
				ВызватьИсключение ТекстОшибки;
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(АдресХранения) Тогда
		Возврат ПоместитьВоВременноеХранилище(Таблица, АдресХранения);	
	Иначе 
		Возврат Таблица;	
	КонецЕсли;

КонецФункции

Функция ВосстановлениеДанныхJSON_ДанныеДокумента_СерииДокумента(мсвДанные, АдресХранения = Неопределено)
	
	Таблица = SUI_ДокументыОбмена.ТаблицаСерииДокументаОбмена();
	
	Если ТипЗнч(мсвДанные) = Тип("Массив") Тогда
		
		ПроверяемыеКлючи = Новый Соответствие();
		ПроверяемыеКлючи.Вставить("id_good", 		Истина);
		ПроверяемыеКлючи.Вставить("id_properties", 	Ложь);
		ПроверяемыеКлючи.Вставить("id_series", 		Ложь);
		ПроверяемыеКлючи.Вставить("id_warehouse", 	Ложь);
		
		ОписаниеСтрокиДаты = SUI_ОбщегоНазначения.ОписаниеТипаСтрока(50);
		
		Для индекс = 0 По мсвДанные.ВГраница() Цикл
			
			ДанныеДат = Новый Структура("production_date,best_before");
			ЗаполнитьЗначенияСвойств(ДанныеДат, мсвДанные[индекс]);
			
			ДанныеДат.production_date = ОписаниеСтрокиДаты.ПривестиЗначение(ДанныеДат.production_date);
			ДанныеДат.best_before = ОписаниеСтрокиДаты.ПривестиЗначение(ДанныеДат.best_before);
			
			Если Не ПустаяСтрока(ДанныеДат.production_date) Тогда
				ДанныеДат.production_date = SUI_ОбщегоНазначения.ВосстановлениеДанныхJSON_ВосстановитьДату(
					ДанныеДат.production_date);
			КонецЕсли;
			
			Если Не ПустаяСтрока(ДанныеДат.best_before) Тогда
				ДанныеДат.best_before = SUI_ОбщегоНазначения.ВосстановлениеДанныхJSON_ВосстановитьДату(
					ДанныеДат.best_before);
			КонецЕсли;
			
			СтрокаТаблицы = Таблица.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, мсвДанные[индекс]);
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ДанныеДат);
			
			СтрокаТаблицы.name = SUI_ОбщегоНазначенияКлиентСервер.УдалитьНедопустимыеСимволыВXML(СтрокаТаблицы.name);
			СтрокаТаблицы.number = SUI_ОбщегоНазначенияКлиентСервер.УдалитьНедопустимыеСимволыВXML(СтрокаТаблицы.number);
			
			Попытка
				ПроверитьЗаполнениеИдентификаторовПриВосстановленииДанныхJSON(СтрокаТаблицы, ПроверяемыеКлючи);
			Исключение
				ТекстОшибки = СтрШаблон("[%1] %2", индекс, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
				ВызватьИсключение ТекстОшибки;
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЕсли;

	Если ЭтоАдресВременногоХранилища(АдресХранения) Тогда
		Возврат ПоместитьВоВременноеХранилище(Таблица, АдресХранения);
	Иначе 
		Возврат Таблица;	
	КонецЕсли;

КонецФункции

Функция ВосстановлениеДанныхJSON_ДанныеДокумента_ШтрихкодыДокумента(мсвДанные, АдресХранения = Неопределено)
	
	Таблица = РегистрыСведений.SUI_ОтсканированныеШтрихкодыУпаковокДокументовОбмена.ПолучитьТаблицуЭталон();
	
	Если SUI_НастройкиМетаданныхСервер.ТаблицаИспользуется(Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыУпаковок) И
		ТипЗнч(мсвДанные) = Тип("Массив") Тогда
		
		АлгоритмНормализации = РегистрыСведений.SUI_ОтсканированныеШтрихкодыУпаковокДокументовОбмена
			.ПолучитьАлгоритмНормализацииШтрихкода();
		
		ОписаниеТипаШтрихкод = SUI_ОбщегоНазначения.ОписаниеТипаСтрока(200);
		
		ПроверяемыеКлючи = Новый Соответствие();
		ПроверяемыеКлючи.Вставить("id_good", 		Ложь);
		ПроверяемыеКлючи.Вставить("id_property", 	Ложь);
		ПроверяемыеКлючи.Вставить("id_unit", 		Ложь);
		ПроверяемыеКлючи.Вставить("id_series", 		Ложь);
		ПроверяемыеКлючи.Вставить("id_cell", 		Ложь);
		
		Для индекс = 0 По мсвДанные.ВГраница() Цикл
			
			ШтрихкодПолный = СокрЛП(ОписаниеТипаШтрихкод.ПривестиЗначение(мсвДанные[индекс].barcode));
			
			Если ПустаяСтрока(ШтрихкодПолный) Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаТаблицы = Таблица.Добавить();
			СтрокаТаблицы.barcode_base64 = SUI_ШтрихкодированиеКлиентСервер.ШтрихкодВBase64(ШтрихкодПолный);
			СтрокаТаблицы.barcode_full = SUI_ОбщегоНазначенияКлиентСервер.УдалитьНедопустимыеСимволыВXML(ШтрихкодПолный);
			
			//@skip-check structure-consructor-too-many-keys
			ДополнительныеДанные = Новый Структура("id_good,id_property,id_unit,id_cell,id_series,series_number");
			ЗаполнитьЗначенияСвойств(ДополнительныеДанные, мсвДанные[индекс]);
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ДополнительныеДанные);
			
			Номенклатура = SUI_ИнтеграцияВКонфигурацию.СсылкаПоИдентификаторуSimple(СтрокаТаблицы.id_good, Истина);
			
			Если Не ЗначениеЗаполнено(Номенклатура) И Не ПустаяСтрока(СтрокаТаблицы.id_good) Тогда
				Номенклатура = СтрокаТаблицы.id_good;
			КонецЕсли;
			
			СтрокаТаблицы.barcode = SUI_ШтрихкодыУпаковок.НормализоватьЗначениеШтрихкода(
				АлгоритмНормализации, СтрокаТаблицы.barcode_full, Номенклатура);
			СтрокаТаблицы.hash = SUI_Штрихкодирование.РасчитатьХешШтрихкода(СтрокаТаблицы.barcode);
			
			Если ПустаяСтрока(СтрокаТаблицы.hash) Тогда
				ТекстОшибки = НСтр("ru = '[%1] Не удалось вычислить хеш сумму штрихкода %2 (%3)!'");
				ТекстОшибки = СтрШаблон(ТекстОшибки, индекс, СтрокаТаблицы.barcode, СтрокаТаблицы.barcode_full);
				ВызватьИсключение ТекстОшибки;
			КонецЕсли;
			
			ШтрихкодВладельцаПолный = СокрЛП(ОписаниеТипаШтрихкод.ПривестиЗначение(мсвДанные[индекс].barcode_owner));
			
			Если Не ПустаяСтрока(ШтрихкодВладельцаПолный) Тогда
				
				ШтрихкодВладельцаПолный = SUI_ОбщегоНазначенияКлиентСервер.УдалитьНедопустимыеСимволыВXML(ШтрихкодВладельцаПолный);
				
				СтрокаТаблицы.barcode_owner = SUI_ШтрихкодыУпаковок.НормализоватьЗначениеШтрихкода(
					АлгоритмНормализации, ШтрихкодВладельцаПолный, Номенклатура);
				СтрокаТаблицы.hash_owner = SUI_Штрихкодирование.РасчитатьХешШтрихкода(СтрокаТаблицы.barcode_owner);
				
			КонецЕсли;
			
			СтрокаТаблицы.series_number = SUI_ОбщегоНазначенияКлиентСервер.УдалитьНедопустимыеСимволыВXML(СтрокаТаблицы.series_number);
			
			Попытка
				ПроверитьЗаполнениеИдентификаторовПриВосстановленииДанныхJSON(СтрокаТаблицы, ПроверяемыеКлючи);
			Исключение
				ТекстОшибки = СтрШаблон("[%1] %2", индекс, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
				ВызватьИсключение ТекстОшибки;
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(АдресХранения) Тогда
		Возврат ПоместитьВоВременноеХранилище(Таблица, АдресХранения);	
	Иначе 
		Возврат Таблица;	
	КонецЕсли;

КонецФункции

Функция ВосстановлениеДанныхJSON_ДанныеДокумента_ПотокШтрихкодов(мсвДанные, АдресХранения = Неопределено)
	
	Таблица = SUI_ДокументыОбмена.ТаблицаПотокШтрихкодовОбмена();
	
	Если ТипЗнч(мсвДанные) = Тип("Массив") Тогда

		Для Каждого Элемент Из мсвДанные Цикл
			
			Если ТипЗнч(Элемент) <> Тип("Структура") Тогда
				Продолжить;	
			КонецЕсли;
			
			НоваяСтрока = Таблица.Добавить();
			НоваяСтрока.ШтрихкодBase64 = SUI_ШтрихкодированиеКлиентСервер.ШтрихкодВBase64(Элемент.barcode);
			НоваяСтрока.ЭтоШтрихкодКМ = SUI_ШтрихкодированиеКлиентСервер.ЭтоШтрихкодКМ(Элемент.barcode);
			
			Если Не НоваяСтрока.ЭтоШтрихкодКМ Тогда
				НоваяСтрока.ЭтоШтрихкодSSCC = SUI_ШтрихкодированиеКлиентСервер.ЭтоШтрихкодSSCC(Элемент.barcode);
			КонецЕсли;
			
			НоваяСтрока.barcode = SUI_ОбщегоНазначенияКлиентСервер.УдалитьНедопустимыеСимволыВXML(Элемент.barcode);
			
		КонецЦикла;

	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(АдресХранения) Тогда
		Возврат ПоместитьВоВременноеХранилище(Таблица, АдресХранения);	
	Иначе 
		Возврат Таблица;
	КонецЕсли;

КонецФункции

Функция ВосстановлениеДанныхJSON_ДанныеШтрихкодов_СоздатьШтрихкодыНоменклатуры(мсвДанные) 
	
	Таблица = Новый ТаблицаЗначений();
	Таблица.Колонки.Добавить("barcode", SUI_ОбщегоНазначения.ОписаниеТипаСтрока(200));
	Таблица.Колонки.Добавить("id_good", SUI_ОбщегоНазначения.ОписаниеТипаСтрока(69));
	Таблица.Колонки.Добавить("id_property", SUI_ОбщегоНазначения.ОписаниеТипаСтрока(69));
	Таблица.Колонки.Добавить("id_unit", SUI_ОбщегоНазначения.ОписаниеТипаСтрока(69));

	Для Каждого Элемент Из мсвДанные Цикл
		
		НоваяСтрока = Таблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Элемент);
		
		НоваяСтрока.barcode = SUI_ОбщегоНазначенияКлиентСервер.УдалитьНедопустимыеСимволыВXML(НоваяСтрока.barcode);

		SUI_ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(НоваяСтрока.barcode),
			НСтр("ru = 'Передано пустое значение штрихкода номенклатуры.'"));
			
		SUI_ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(НоваяСтрока.id_good),
			НСтр("ru = 'Не заполнен идентификатор номенклатуры.'"));
		
	КонецЦикла;
	
	Таблица.Свернуть("barcode,id_good,id_property,id_unit");

	Возврат Таблица;
	
КонецФункции

Процедура ПроверитьЗаполнениеИдентификаторовПриВосстановленииДанныхJSON(СтрокаТаблицы, ПроверяемыеКлючи)
	
	Для Каждого КлючЗначение Из ПроверяемыеКлючи Цикл
		
		Если ЗначениеЗаполнено(СтрокаТаблицы[КлючЗначение.Ключ]) Тогда
			
			Если Не SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(СтрокаТаблицы[КлючЗначение.Ключ]) Тогда
				ТекстОшибки = НСтр("ru = 'Значение ""%1"" ключа ""%2"" не является идентификатором Simple!'");
				ТекстОшибки = СтрШаблон(ТекстОшибки, СтрокаТаблицы[КлючЗначение.Ключ], КлючЗначение.Ключ);
				ВызватьИсключение ТекстОшибки;
			КонецЕсли;
			
		Иначе
			
			Если КлючЗначение.Значение Тогда
				
				ТекстОшибки = НСтр("ru = 'Не заполнен идентификатор в ключе ""%1""!'");
				ТекстОшибки = СтрШаблон(ТекстОшибки, КлючЗначение.Ключ);
				ВызватьИсключение ТекстОшибки;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверкаИННВладельцаИСтатуса(ИдентификаторДокумента, ИдентификаторНастройки, СоставКодовМаркировки)
	
	ОбрабатываемыйДокумент = SUI_ИнтеграцияВКонфигурацию.СсылкаПоИдентификаторуSimple(ИдентификаторДокумента, Истина);
	НастройкаДокумента = SUI_ИнтеграцияВКонфигурацию.СсылкаПоИдентификаторуSimple(ИдентификаторНастройки, Истина);
	ЗапрещенныеСтатусы = НастройкаДокумента.СписокСтатусовКодовМаркировок.Выгрузить().ВыгрузитьКолонку("КодСтатуса");
	
	Для Каждого СоставКодаМаркировки Из СоставКодовМаркировки Цикл
		
		Если НастройкаДокумента.ПроверятьCтатусКИ И ЗапрещенныеСтатусы.Найти(СоставКодаМаркировки.status) <> Неопределено Тогда
			ВызватьИсключение "Код маркировки " + СоставКодаМаркировки.cis + " находится в запрещенном статусе " + СоставКодаМаркировки.status;
		КонецЕсли;
		
		Если НастройкаДокумента.ПроверятьВладельца И СоставКодаМаркировки.ownerInn <> ОбрабатываемыйДокумент[НастройкаДокумента.ИННВладельца] Тогда
			ВызватьИсключение "У кода маркировки " + СоставКодаМаркировки.cis + " не совпадает ИНН с данными из ""Чистого знака""";
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыполнитьПроверкиПередЗапускомВнешнейОбработки(КодыМаркировкиКЗапросу, ПодключеннаяИнтеграционнаяОбработка)
	
	SUI_ОбщегоНазначенияКлиентСервер.ПроверитьПараметр("SUI_ОбменДаннымиСервер.ПолучитьСоставКодовМаркировок",
		"КодыМаркировкиКЗапросу", КодыМаркировкиКЗапросу, Тип("Массив"));
	
	SUI_ОбщегоНазначенияКлиентСервер.Проверить(
		SUI_ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки"),
		НСтр("ru = 'Отсутствует подсистема ""СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки"".'"));
	
	SUI_ОбщегоНазначенияКлиентСервер.Проверить(Не ПодключеннаяИнтеграционнаяОбработка.Пустая(),
		НСтр("ru = 'Не подключена внешняя обработка ""SimpleИнтеграцияГИСМТ"".'"));
		
КонецПроцедуры

#КонецОбласти

#КонецОбласти
