
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Алгоритм = ПолучитьФункциональнуюОпцию("SUI_АлгоритмПолученияШтрихкодаДокумента");

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

	Если Отказ Или ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		Оповещение = Новый ОписаниеОповещения("СохранитьПриЗакрытииПослеПодтверждения", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Алгоритм был модифицирован. Хотите сохранить изменения?'"), 
			РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	СохранитьАлгоритмНаСервере(Алгоритм);
	Модифицированность = Ложь;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПредопределенным(Команда)

	Оповещение = Новый ОписаниеОповещения("ЗаполнитьПредопределеннымПослеПодтверждения", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, НСтр("ru = 'Вы действительно хотите перезаполнить текущий алгоритм предопределенным?'"), 
		РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СохранитьПриЗакрытииПослеПодтверждения(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		СохранитьАлгоритмНаСервере(Алгоритм);
	ИначеЕсли Ответ <> КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Ложь;
	
	Закрыть();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьАлгоритмНаСервере(Алгоритм)
	УстановитьПривилегированныйРежим(Истина);
	Константы.SUI_АлгоритмПолученияШтрихкодаДокумента.Установить(СокрЛП(Алгоритм));
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПредопределеннымПослеПодтверждения(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	 
	Алгоритм = "Если ПолучитьФункциональнуюОпцию(""ИспользоватьШтрихкодированиеПечатныхФормОбъектов"") Тогда
	|	Штрихкод = ШтрихкодированиеПечатныхФорм.ЧисловойКодПоСсылке(Ссылка);
	|КонецЕсли;";
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти
