
#Область ПрограммныйИнтерфейс

// Получить код служебного устройства.
// 
// Возвращаемое значение:
//  Строка - Код служебного устройства
Функция КодСлужебногоУстройства() Экспорт
	Возврат "SUI0000000000001";
КонецФункции

// Получить наименование служебного устройства.
// 
// Возвращаемое значение:
//  Строка - Наименование служебного устройства
Функция НаименованиеСлужебногоУстройства() Экспорт
	Возврат НСтр("ru = 'Simple (служебный)'");
КонецФункции

Функция ИмяСобытия(ВложенноеСобытие = "") Экспорт 
	Возврат НСтр("ru = 'Мобильные устройства'") + ?(ЗначениеЗаполнено(ВложенноеСобытие), ". " + ВложенноеСобытие, "");
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
