
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПолноеИмяМетаданных = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ПолноеИмяМетаданных", "");
	МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ПолноеИмяМетаданных);
	
	Если Не ОбщегоНазначения.ЭтоСправочник(МетаданныеОбъекта) И 
		Не ОбщегоНазначения.ЭтоРегистр(МетаданныеОбъекта) И 
		Не ОбщегоНазначения.ЭтоДокумент(МетаданныеОбъекта) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Выбор объектов доступен только для справочников, документов и регистров'"), , , , Отказ);
		Возврат;
	КонецЕсли;
	
	Заголовок = СтрШаблон(НСтр("ru = 'Выбор из: %1'"), МетаданныеОбъекта.Представление());

	Список.ПроизвольныйЗапрос = Ложь;
	Список.ОсновнаяТаблица = МетаданныеОбъекта.ПолноеИмя();

	Для Каждого Поле Из Список.УсловноеОформление.ДоступныеПоляПолей.Элементы Цикл
		
		Если Поле.Папка Или Поле.ТипЗначения.СодержитТип(Тип("ХранилищеЗначения")) Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяПоля = Строка(Поле.Поле);
		
		Если ИмяПоля = "МоментВремени" Тогда
			Продолжить;
		КонецЕсли;
		
		ПолеСписка = Элементы.Вставить("Список" + ИмяПоля, Тип("ПолеФормы"), Элементы.Список);
		ПолеСписка.Вид = ВидПоляФормы.ПолеНадписи;
		ПолеСписка.ПутьКДанным = "Список." + ИмяПоля;
		ПолеСписка.Заголовок = Поле.Заголовок;
		
	КонецЦикла;

	Список.ОсновнаяТаблица = Неопределено;
	Список.ПроизвольныйЗапрос = Истина;
	Список.ТекстЗапроса = "ВЫБРАТЬ * ИЗ " + МетаданныеОбъекта.ПолноеИмя() + " КАК ТаблицаБД";
	
	Запрос = Новый Запрос("ВЫБРАТЬ * ИЗ " + МетаданныеОбъекта.ПолноеИмя() + ".Изменения ГДЕ ЛОЖЬ");
	УстановитьПривилегированныйРежим(Истина);
	ПустойРезультат = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Для Каждого КолонкаРезультата Из ПустойРезультат.Колонки Цикл
		Если КолонкаРезультата.Имя <> "НомерСообщения" И КолонкаРезультата.Имя <> "Узел" Тогда
			ОсновныеКолонки.Добавить("Список" + КолонкаРезультата.Имя, КолонкаРезультата.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Если Параметры.Свойство("ТолькоИзменения") Тогда
		
		СоединенияПО = Новый Массив();
		Для Каждого Колонка Из ОсновныеКолонки Цикл
			СоединенияПО.Добавить("ТаблицаБД." + Колонка.Представление + " = Изменения." + Колонка.Представление);
		КонецЦикла;

		Если СоединенияПО.Количество() = 0 Тогда
			СоединенияПО.Добавить("ЛОЖЬ");
		КонецЕсли;
		
		Список.ТекстЗапроса = Список.ТекстЗапроса + "
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ " + МетаданныеОбъекта.ПолноеИмя() + ".Изменения КАК Изменения
		|	ПО " + СтрСоединить(СоединенияПО, Символы.ПС + Символы.Таб + " И") + "
		|ГДЕ
		|	Изменения.Узел = &МобильноеУстройство";
		
		Список.Параметры.УстановитьЗначениеПараметра("МобильноеУстройство", 
			SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "МобильноеУстройство"));
		
	КонецЕсли;

	Список.ДинамическоеСчитываниеДанных = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьВидимостьКолонокСписка();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Закрыть(ПодготовитьДанныеЗакрытия());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказатьВсеКолонки(Команда)
	ОтображатьВсеКолонки = Не ОтображатьВсеКолонки;
	ОбновитьВидимостьКолонокСписка();
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)

	Закрыть(ПодготовитьДанныеЗакрытия());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьВидимостьКолонокСписка()
	
	Элементы.СписокПоказатьВсеКолонки.Пометка = ОтображатьВсеКолонки;
	
	Для Каждого Элемент Из Элементы.Список.ПодчиненныеЭлементы Цикл
		
		Если Элемент.Вид <> ВидПоляФормы.ПолеНадписи Тогда
			Продолжить;
		КонецЕсли;
		
		Если ОсновныеКолонки.НайтиПоЗначению(Элемент.Имя) = Неопределено Тогда
			Элемент.Видимость = Элементы.СписокПоказатьВсеКолонки.Пометка;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ПодготовитьДанныеЗакрытия()
	
	ВыбранныеЗначения = Новый Массив();
	
	ОсновныеКлючи = Новый Массив();
	Для Каждого ОсновнаяКолонка Из ОсновныеКолонки Цикл
		ОсновныеКлючи.Добавить(ОсновнаяКолонка.Представление);
	КонецЦикла;
	ОсновныеКлючи = СтрСоединить(ОсновныеКлючи, ",");
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;

	Для Каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		
		ТекущаяСтрока = Элементы.Список.ДанныеСтроки(ВыделеннаяСтрока);
		Если ТекущаяСтрока <> Неопределено Тогда
			ВыбранноеЗначение = Новый Структура(ОсновныеКлючи);
			ЗаполнитьЗначенияСвойств(ВыбранноеЗначение, ТекущаяСтрока);
			ВыбранныеЗначения.Добавить(Новый ФиксированнаяСтруктура(ВыбранноеЗначение));
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ВыбранныеЗначения;
	
КонецФункции

#КонецОбласти
