
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Установить признак проверки обновлений при старте.
// 
// Параметры:
//  Значение - Булево - Признак проверки обновлений при старте
Процедура УстановитьПризнакПроверкиОбновленийПриСтарте(Значение) Экспорт
	
	ОписаниеТипаБулево = Новый ОписаниеТипов("Булево");
	SUI_ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
		КлючОбщейНастройкиПроверкаОбновленийПриСтарте(), ОписаниеТипаБулево.ПривестиЗначение(Значение));
	
КонецПроцедуры

// Получить признак проверки обновлений при старте.
// 
// Возвращаемое значение:
//  Булево - Получить признак проверки обновлений при старте
Функция ПолучитьПризнакПроверкиОбновленийПриСтарте() Экспорт
	
	Возврат SUI_ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		КлючОбщейНастройкиПроверкаОбновленийПриСтарте(), Ложь);
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция КлючОбщейНастройкиПроверкаОбновленийПриСтарте() Экспорт
	
	Возврат "ПроверкаОбновленийПриСтарте";
	
КонецФункции

#КонецОбласти

#КонецЕсли
