
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.СерииНоменклатуры;
	
	ЗагрузитьДанныеОписанияПеременных();
	
	ЗагрузитьДополнительныеНастройки();

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Отказ Или ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		
		Отказ = Истина;
		СтандартнаяОбработка = Ложь;
		
		ПоказатьВопрос(
			ПолучитьОповещениеСохраненияНастроек(), 
			НСтр("ru = 'Дополнительные настройки были модифицированы.
			|Сохранить настройки?'"), 
			РежимДиалогаВопрос.ДаНетОтмена);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОписаниеПеременныхАлгоритмаСозданияСерий

&НаКлиенте
Процедура ОписаниеПеременныхАлгоритмаСозданияСерийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПоказатьОписаниеПеременнойПриВыборе(Элемент, Поле);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаСохранитьИЗакрыть(Команда)
	
	ВыполнитьОбработкуОповещения(ПолучитьОповещениеСохраненияНастроек(), КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранить(Команда)
	
	ВыполнитьОбработкуОповещения(ПолучитьОповещениеСохраненияНастроек(Ложь), КодВозвратаДиалога.Да);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбщиеСлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьДополнительныеНастройки()
	
	ТипыОписания = SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.МассивЗначений(
		Тип("Структура"), 
		Тип("ФиксированнаяСтруктура"));
		
	ОписаниеТипаСтруктура = Новый ОписаниеТипов(ТипыОписания);
	
	ДополнительныеНастройки = ОписаниеТипаСтруктура.ПривестиЗначение(
		SUI_НастройкиМетаданныхСервер.ПолучитьДополнительныеНастройки(ТаблицаИнтеграции, Ложь));
	
	Возврат ?(ДополнительныеНастройки = Неопределено, Новый Структура(), ДополнительныеНастройки);
	
КонецФункции

&НаСервере
Процедура СохранитьДополнительныеНастройки()
	
	SUI_НастройкиМетаданныхСервер.СохранитьДополнительныеНастройки(ТаблицаИнтеграции, ПолучитьДополнительныеНастройкиДляСохранения());
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьОповещениеСохраненияНастроек(ЗакрытиеФормы = Истина)
	
	ПараметрыОповещения =  Новый Структура();
	
	Если ЗакрытиеФормы Тогда
		ПараметрыОповещения.Вставить("ЗакрытиеФормы");
	КонецЕсли;
	
	Возврат Новый ОписаниеОповещения("СохранениеНастроекПослеПодтверждения", ЭтотОбъект, ПараметрыОповещения);
	
КонецФункции

&НаКлиенте
Процедура СохранениеНастроекПослеПодтверждения(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		СохранитьДополнительныеНастройки();
		//@skip-check wrong-string-literal-content
		ОписаниеОповещенияОЗакрытии.Модуль["НастройкиЗаписаны"] = Истина;
	ИначеЕсли Ответ <> КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("ЗакрытиеФормы") Тогда
		
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Модифицированность = Ложь;
		КонецЕсли;
		
		Если Открыта() Тогда
			Закрыть();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДеревоОписанияПеременных()
	
	Дерево = Новый ДеревоЗначений();
	
	Дерево.Колонки.Добавить("Имя", 		ОбщегоНазначения.ОписаниеТипаСтрока(0));
	Дерево.Колонки.Добавить("Тип", 		ОбщегоНазначения.ОписаниеТипаСтрока(0));
	Дерево.Колонки.Добавить("Описание", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	
	Возврат Дерево;
	 
КонецФункции

&НаСервереБезКонтекста
Функция ДобавитьСтрокуВДеревоОписанияПеременных(Приемник, ИмяПеременной, Знач ТипПеременной, ОписаниеПеременной)
	
	ТипЗначенияТипПеременной = ТипЗнч(ТипПеременной);
	Если ТипЗначенияТипПеременной = Тип("Тип") Тогда
		ТипПеременной = Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТипПеременной));
	ИначеЕсли ТипЗначенияТипПеременной = Тип("Строка") Тогда
		
		Если ПустаяСтрока(ТипПеременной) Тогда
			ТипПеременной = НСтр("ru = 'Произвольный'");
		КонецЕсли;
		
	ИначеЕсли ТипЗначенияТипПеременной <> Тип("ОписаниеТипов") Тогда
		ВызватьИсключение НСтр("ru = 'Недопустимый тип'");
	КонецЕсли;
	
	НоваяСтрокаПриемника = Приемник.Строки.Добавить();
	
	НоваяСтрокаПриемника.Имя 		= СокрЛП(ИмяПеременной);
	НоваяСтрокаПриемника.Тип 		= Строка(ТипПеременной);
	НоваяСтрокаПриемника.Описание 	= СокрЛП(ОписаниеПеременной);
	
	Возврат НоваяСтрокаПриемника;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьОписаниеПеременнойПриВыборе(Элемент, Поле)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрЗаканчиваетсяНа(Поле.Имя, "Описание") Тогда
		ПоказатьЗначение(, Элемент.ТекущиеДанные.Описание);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ЗагрузитьДополнительныеНастройки()
	
	ДополнительныеНастройки = ПолучитьДополнительныеНастройки();
	
	// Алгоритм создания серий
	АлгоритмСозданияСерий = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеНастройки, 
		"АлгоритмСозданияСерииНоменклатуры.Алгоритм", "", Тип("Строка"));
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДополнительныеНастройкиДляСохранения()
	
	ДополнительныеНастройки = Новый Структура();
	
	// Алгоритм создания серий
	ДополнительныеНастройки.Вставить("АлгоритмСозданияСерииНоменклатуры", Новый Структура());
	ДополнительныеНастройки.АлгоритмСозданияСерииНоменклатуры.Вставить("Алгоритм", АлгоритмСозданияСерий);
	
	Возврат Новый ФиксированнаяСтруктура(ДополнительныеНастройки);
	
КонецФункции

&НаСервере
Процедура ЗагрузитьДанныеОписанияПеременных()
	
	// Описание переменных создания серий
	ЗначениеВРеквизитФормы(ПолучитьДеревоОписаниеПеременныхСозданияСерий(), "ОписаниеПеременныхАлгоритмаСозданияСерий");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДеревоОписаниеПеременныхСозданияСерий()
	
	Дерево = ПолучитьДеревоОписанияПеременных();
	
	СтрокаТаблицаСерий = ДобавитьСтрокуВДеревоОписанияПеременных(Дерево, "ТаблицаСерий", Тип("ТаблицаЗначений"), 
		НСтр("ru = 'Таблица серий полученная из ТСД'"));
		
	ДобавитьСтрокуВДеревоОписанияПеременных(СтрокаТаблицаСерий, "ИдентификаторСтроки", Тип("Строка"), 
		НСтр("ru = 'Идентификатор строки таблицы (Регистр сведений) Серии документов обмена'"));
		
	ДобавитьСтрокуВДеревоОписанияПеременных(СтрокаТаблицаСерий, "Номенклатура", "", 
		НСтр("ru = 'Значение номенклатуры серии полученное из ТСД'"));
		
	ДобавитьСтрокуВДеревоОписанияПеременных(СтрокаТаблицаСерий, "Серия", "", 
		НСтр("ru = 'Колонка для вставки созданной ссылки серии номенклатуры для дальнейшей обработки'"));
	
	ДобавитьСтрокуВДеревоОписанияПеременных(СтрокаТаблицаСерий, "Наименование", Тип("Строка"), 
		НСтр("ru = 'Наименование серии полученное из ТСД'"));
		
	ДобавитьСтрокуВДеревоОписанияПеременных(СтрокаТаблицаСерий, "Номер", Тип("Строка"), 
		НСтр("ru = 'Номер серии полученный из ТСД'"));
		
	ДобавитьСтрокуВДеревоОписанияПеременных(СтрокаТаблицаСерий, "ДатаПроизводства", Тип("Дата"), 
		НСтр("ru = 'Дата производства полученная из ТСД'"));
		
	ДобавитьСтрокуВДеревоОписанияПеременных(СтрокаТаблицаСерий, "ГоденДо", Тип("Дата"), 
		НСтр("ru = 'Дата окончания срока годности полученная из ТСД'"));
	
	Возврат Дерево;
	
КонецФункции

#КонецОбласти
