
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если Отказ Или ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДатаОбновленияЗаписи = ТекущаяДатаСеанса();
	ПолноеИмяМетаданных = Метаданные().ПолноеИмя();
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		// Проверить SID
		ОбщегоНазначенияКлиентСервер.Проверить(СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(Запись.sid),
			СтрШаблон(НСтр("ru = 'Служебный идентификатор строки (%1) не является идентификатором'"), Запись.sid),
			ПолноеИмяМетаданных);
			
		// Проверить SID документа
		ОбщегоНазначенияКлиентСервер.Проверить(
			СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(Запись.sid_doc),
			СтрШаблон(НСтр("ru = 'Служебный идентификатор документа (%1) не является идентификатором'"), Запись.sid_doc),
			ПолноеИмяМетаданных);
		
		// Проверить ID номенклатуры
		ОбщегоНазначенияКлиентСервер.Проверить(
			SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(Запись.id_good),
			СтрШаблон(НСтр("ru = 'Идентификатор номенклатуры (%1) не является идентификатором Simple'"), Запись.id_good),
			ПолноеИмяМетаданных);
		
		// Проверить ID характеристики
		Если Не SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(Запись.id_properties) Тогда
			Запись.id_properties = "";
		КонецЕсли;
		
		// Проверить ID серии
		Если Не SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(Запись.id_series) Тогда
			Запись.id_series = "";
		КонецЕсли;
		
		// Проверить ID виды цены
		Если Не SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(Запись.id_warehouse) Тогда
			Запись.id_warehouse = "";
		КонецЕсли;
		
		// Обновить значение Дата обновления
		Если Не ДополнительныеСвойства.Свойство("НеОбновлятьМеткуВремени") Тогда
			Запись.ДатаОбновления = ДатаОбновленияЗаписи;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
