
#Область ПрограммныйИнтерфейс

Процедура ВыполнитьПроверкуОбновленийВРепозитории() Экспорт
	
	Если Не SUI_ПараметрыПриложения.Получить("ПроверкаОбновленийПриСтарте") Тогда
		Возврат;
	КонецЕсли;
	
	УстановкаПредварительныхВерсий = SUI_ПараметрыПриложения.Получить("УстановкаПредварительныхВерсий");
	
	Результат = SUI_ОбновлениеSimpleКлиентСервер.ПолучитьСписокОбновленийИзРепозитория(УстановкаПредварительныхВерсий, 5);
	
	Если Результат.СписокВерсий.Количество() > 0 Тогда
		
		Заголовок = СтрШаблон(НСтр("ru = 'Обновление %1'"), SUI_SimpleКлиентСервер.Представление());
		Пояснение = СтрШаблон(НСтр("ru = 'Доступна новая версия %1'"), Результат.СписокВерсий[0].tag_name);
		НавигационнаяСсылка = "e1cib/app/Обработка.SUI_ОбновлениеSimple";
		Картинка = БиблиотекаКартинок.SUI_ПодсистемаSimple;
		Статус = СтатусОповещенияПользователя.Важное;
		
		ПоказатьОповещениеПользователя(Заголовок, НавигационнаяСсылка, Пояснение, Картинка, Статус);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьОбновлениеИнформационнойБазы(ОповещениеПродолжения, Параметры) Экспорт
	
	ИмяПараметра = "Simple.ОбновлениеВерсииИБ.ФормаИндикацияХодаОбновленияИБ";
	Форма = ПараметрыПриложения.Получить(ИмяПараметра);
	
	Если Форма = Неопределено Тогда
		ОповещениеЗавершения = Новый ОписаниеОповещения("ПослеЗакрытияФормыИндикацияХодаОбновленияИБ", 
			ЭтотОбъект, Новый Структура("ОповещениеПродолжения, Параметры", ОповещениеПродолжения, Параметры));
		Форма = ОткрытьФорму("Обработка.SUI_ОбновлениеSimple.Форма.ОбновлениеВерсииSimple", , , , , , ОповещениеЗавершения);
		ПараметрыПриложения.Вставить(ИмяПараметра, Форма);
	КонецЕсли;
	
	Форма.ОбновитьИнформационнуюБазу(
		SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "НачальныйНомерВерсии", "", Тип("Строка")));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПослеЗакрытияФормыИндикацияХодаОбновленияИБ(Результат, ДополнительныеПараметры) Экспорт
	
	Если SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "ЗавершитьРаботу", Ложь, Тип("Булево")) Тогда
		
		ПараметрыЗавершенияРаботы = SUI_ОбщегоНазначенияКлиентСервер.ПараметрыЗавершенияРаботы();
		ПараметрыЗавершенияРаботы.ПерезапуститьПриЗавершении = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			Результат, "Перезапустить", Ложь, Тип("Булево"));
			
		Если ПараметрыЗавершенияРаботы.ПерезапуститьПриЗавершении Тогда
			ПараметрыЗавершенияРаботы.ДополнительныеПараметрыКоманднойСтроки = ПараметрЗапуска;
		КонецЕсли;
		
		SUI_ОбщегоНазначенияКлиент.ВыполнитьПрекращениеРаботыСистемы(ПараметрыЗавершенияРаботы);

	ИначеЕсли ТипЗнч(ДополнительныеПараметры.ОповещениеПродолжения) = Тип("ОписаниеОповещения") Тогда
		
		SUI_ПараметрыПриложения.Вставить("ВерсияДанных", SUI_ОбновлениеSimpleВызовСервера.ТекущаяВерсияДанных());
		
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеПродолжения, Неопределено);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
