#Область ПрограммныйИнтерфейс

Функция ИдентификаторПодменю() Экспорт
	
	Возврат СтрШаблон("%1Подменю", SUI_SimpleКлиентСервер.Префикс());
	
КонецФункции

Функция ИмяСобытия(ВложенноеСобытие = "") Экспорт
	Возврат НСтр("ru = 'Интеграция в конфигурацию'") + ?(ЗначениеЗаполнено(ВложенноеСобытие), ". " + ВложенноеСобытие, "");
КонецФункции

Функция ПустойИдентификаторSimple() Экспорт 
	Возврат "00000000-0000-0000-0000-000000000000-00000000000000000000000000000000";
КонецФункции

// Это идентификатор Simple.
// 
// Параметры:
//  Идентификатор - Строка - Проверяемый идентификатор
// 
// Возвращаемое значение:
//  Булево - Истина, если проверяемый идентификатор является идентификатором Simple
Функция ЭтоИдентификаторSimple(Знач Идентификатор) Экспорт
	
	Если ТипЗнч(Идентификатор) <> Тип("Строка") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если СтрДлина(Идентификатор) <> 69 Или Сред(Идентификатор, 37, 1) <> "-" Или 
		Не СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(Лев(Идентификатор, 36)) Тогда
		Возврат Ложь;
	КонецЕсли;

	Для Позиция = 38 По 69 Цикл
		Если (КодСимвола(Идентификатор, Позиция) < 48 Или КодСимвола(Идентификатор, Позиция) > 57) // 0..9
			И (КодСимвола(Идентификатор, Позиция) < 97 Или КодСимвола(Идентификатор, Позиция) > 102) // a..f
			И (КодСимвола(Идентификатор, Позиция) < 65 Или КодСимвола(Идентификатор, Позиция) > 70) Тогда // A..F
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ШаблонИдентификатораSimple() Экспорт
	
	ЧастиШаблона = Новый Массив();
	
	Для Индекс = 1 По 32 Цикл
		ЧастиШаблона.Добавить("[A-Fa-f0-9]");
	КонецЦикла;
	
	Возврат SUI_ОбщегоНазначенияКлиентСервер.ШаблонУникальногоИдентификатора() + "-" + СтрСоединить(ЧастиШаблона);
	
КонецФункции

#КонецОбласти
