
#Область ПрограммныйИнтерфейс  

// Выполнить прекращение работы системы.
// 
// Параметры:
//  ПараметрыЗавершения - Структура - см. SUI_ОбщегоНазначенияКлиентСервер.ПараметрыЗавершенияРаботы
Процедура ВыполнитьПрекращениеРаботыСистемы(ПараметрыЗавершения) Экспорт
	
	ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка");
	ПрекратитьРаботуСистемы(
		ПараметрыЗавершения.ПерезапуститьПриЗавершении, 
		ОписаниеТипаСтрока.ПривестиЗначение(ПараметрыЗавершения.ДополнительныеПараметрыКоманднойСтроки));
	
КонецПроцедуры

// Выполнить завершение работы системы.
// 
// Параметры:
//  ПараметрыЗавершения - Структура - см. SUI_ОбщегоНазначенияКлиентСервер.ПараметрыЗавершенияРаботы
Процедура ВыполнитьЗавершениеРаботыСистемы(ПараметрыЗавершения) Экспорт
	
	Если ЗначениеЗаполнено(ПараметрыЗавершения.ТекстПредупреждения) Тогда
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ВыполнитьЗавершениеРаботыСистемыПродолжить", 
			ЭтотОбъект, ПараметрыЗавершения);
		ПоказатьПредупреждение(ОповещениеОЗавершении, ПараметрыЗавершения.ТекстПредупреждения);
	Иначе
		ВыполнитьЗавершениеРаботыСистемыПродолжить(ПараметрыЗавершения);
	КонецЕсли;

КонецПроцедуры

#Область ПараметрыПриложения

Функция НомерСеанса() Экспорт
	Возврат SUI_ПараметрыПриложения["НомерСеанса"];
КонецФункции

Функция ВерсияРасширения() Экспорт
	Возврат SUI_ПараметрыПриложения["ВерсияРасширения"];
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ВыполнитьЗавершениеРаботыСистемыПродолжить(ПараметрыЗавершения) Экспорт
	
	Если Не ПараметрыЗавершения.ПерезапуститьПриЗавершении Тогда
		ПараметрыЗавершения.Вставить("ДополнительныеПараметрыКоманднойСтроки");
	КонецЕсли;
	
	ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка");
	ЗавершитьРаботуСистемы(
		ПараметрыЗавершения.ЗапрашиватьВозможность, 
		ПараметрыЗавершения.ПерезапуститьПриЗавершении, 
		ОписаниеТипаСтрока.ПривестиЗначение(ПараметрыЗавершения.ДополнительныеПараметрыКоманднойСтроки));
		
КонецПроцедуры

#КонецОбласти
