
#Область ПрограммныйИнтерфейс  

// Выполнить прекращение работы системы.
// 
// Параметры:
//  ПараметрыЗавершения - Структура - см. SUI_ОбщегоНазначенияКлиентСервер.ПараметрыЗавершенияРаботы
Процедура ВыполнитьПрекращениеРаботыСистемы(ПараметрыЗавершения) Экспорт
	
	ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка");
	ПрекратитьРаботуСистемы(
		ПараметрыЗавершения.ПерезапуститьПриЗавершении, 
		ОписаниеТипаСтрока.ПривестиЗначение(ПараметрыЗавершения.ДополнительныеПараметрыКоманднойСтроки));
	
КонецПроцедуры

// Выполнить завершение работы системы.
// 
// Параметры:
//  ПараметрыЗавершения - Структура - см. SUI_ОбщегоНазначенияКлиентСервер.ПараметрыЗавершенияРаботы
Процедура ВыполнитьЗавершениеРаботыСистемы(ПараметрыЗавершения) Экспорт
	
	Если ЗначениеЗаполнено(ПараметрыЗавершения.ТекстПредупреждения) Тогда
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ВыполнитьЗавершениеРаботыСистемыПродолжить", 
			ЭтотОбъект, ПараметрыЗавершения);
		ПоказатьПредупреждение(ОповещениеОЗавершении, ПараметрыЗавершения.ТекстПредупреждения);
	Иначе
		ВыполнитьЗавершениеРаботыСистемыПродолжить(ПараметрыЗавершения);
	КонецЕсли;

КонецПроцедуры

#Область ПараметрыПриложения

Функция НомерСеанса() Экспорт
	Возврат SUI_ПараметрыПриложения["НомерСеанса"];
КонецФункции

Функция ВерсияРасширения() Экспорт
	Возврат SUI_ПараметрыПриложения["ВерсияРасширения"];
КонецФункции

#КонецОбласти

#Область УсловныеВызовы

// Возвращает Истина, если функциональная подсистема существует в конфигурации.
// Предназначена для вызова необязательной подсистемы (условного вызова) совместно 
// с функцией SUI_ОбщегоНазначенияКлиент.ПодсистемаСуществует.
//
// У функциональной подсистемы снят флажок "Включать в командный интерфейс".
// См. также ОбщегоНазначенияПереопределяемый.ПриОпределенииОтключенныхПодсистем,
// и SUI_ОбщегоНазначения.ПодсистемаСуществует для вызова из серверного кода.
//
// Параметры:
//  ПолноеИмяПодсистемы - Строка - полное имя объекта метаданных подсистема
//                        без слов "Подсистема." и с учетом регистра символов.
//                        Например: "СтандартныеПодсистемы.ВариантыОтчетов".
//
// Пример:
//  Если SUI_ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ВариантыОтчетов") Тогда
//  	МодульВариантыОтчетовКлиент = SUI_ОбщегоНазначенияКлиент.ОбщийМодуль("ВариантыОтчетовКлиент");
//  	МодульВариантыОтчетовКлиент.<Имя процедуры>();
//  КонецЕсли;
//
// Возвращаемое значение:
//  Булево
//
Функция ПодсистемаСуществует(ПолноеИмяПодсистемы) Экспорт
	
	Попытка
		Модуль = ОбщийМодуль("ОбщегоНазначенияКлиент");
		Возврат Модуль.ПодсистемаСуществует(ПолноеИмяПодсистемы);
	Исключение
		Возврат SUI_ОбщегоНазначенияКлиентПовтИсп.ИменаПодсистем().Получить(ПолноеИмяПодсистемы) <> Неопределено;
	КонецПопытки;
	
КонецФункции

// Возвращает ссылку на общий модуль по имени. 
// Применяется для условного вызова процедуры или функции совместно с SUI_ОбщегоНазначения.ПодсистемаСуществует.
// См. также SUI_ОбщегоНазначения.ОбщийМодуль для вызова серверного кода.
//
// Параметры:
//  Имя - Строка - имя общего модуля, например "ОбновлениеКонфигурацииКлиент", "ОтчетыВызовСервера".
//
// Возвращаемое значение:
//  ОбщийМодуль
//
// Пример:
//	Если SUI_ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ОбновлениеКонфигурации") Тогда
//		МодульОбновлениеКонфигурацииКлиент = SUI_ОбщегоНазначенияКлиент.ОбщийМодуль("ОбновлениеКонфигурацииКлиент");
//		МодульОбновлениеКонфигурацииКлиент.<Имя процедуры>();
//	КонецЕсли;
//
Функция ОбщийМодуль(Имя) Экспорт
	
	Модуль = Вычислить(Имя);
	
#Если Не ВебКлиент Тогда
	
	// В веб-клиенте не проверяется,
	// т.к. при обращении к модулям с вызовом сервера типа такого модуля в веб-клиенте не существует.
	Если ТипЗнч(Модуль) <> Тип("ОбщийМодуль") Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Общий модуль ""%1"" не существует.'"), Имя);
	КонецЕсли;
	
#КонецЕсли
	
	Возврат Модуль;
	
КонецФункции

#КонецОбласти

#Область Данные

// Создает полную копию структуры, соответствия, массива, списка или таблицы значений, рекурсивно,
// с учетом типов дочерних элементов. При этом содержимое значений объектных типов
// (СправочникОбъект, ДокументОбъект и т.п.) не копируются, а возвращаются ссылки на исходный объект.
//
// См. SUI_ОбщегоНазначения.СкопироватьРекурсивно
//
// Параметры:
//  Источник - Структура
//           - ФиксированнаяСтруктура
//           - Соответствие
//           - ФиксированноеСоответствие
//           - Массив
//           - ФиксированныйМассив
//           - СписокЗначений - объект, который необходимо скопировать.
//  ФиксироватьДанные - Булево
//                    - Неопределено - если Истина - фиксировать,
//                          если Ложь - снять фиксацию, если Неопределено - не изменять.
//
// Возвращаемое значение:
//  Структура
//  ФиксированнаяСтруктура
//  Соответствие
//  ФиксированноеСоответствие
//  Массив
//  ФиксированныйМассив
//  СписокЗначений - копия объекта, переданного в параметре Источник.
//
Функция СкопироватьРекурсивно(Источник, ФиксироватьДанные = Неопределено) Экспорт
	
	Перем Приемник;
	
	ТипИсточника = ТипЗнч(Источник);
	
	Если ТипИсточника = Тип("Структура")
		Или ТипИсточника = Тип("ФиксированнаяСтруктура") Тогда
		Приемник = SUI_ОбщегоНазначенияСлужебныйКлиент.СкопироватьСтруктуру(Источник, ФиксироватьДанные);
	ИначеЕсли ТипИсточника = Тип("Соответствие")
		Или ТипИсточника = Тип("ФиксированноеСоответствие") Тогда
		Приемник = SUI_ОбщегоНазначенияСлужебныйКлиент.СкопироватьСоответствие(Источник, ФиксироватьДанные);
	ИначеЕсли ТипИсточника = Тип("Массив")
		Или ТипИсточника = Тип("ФиксированныйМассив") Тогда
		Приемник = SUI_ОбщегоНазначенияСлужебныйКлиент.СкопироватьМассив(Источник, ФиксироватьДанные);
	ИначеЕсли ТипИсточника = Тип("СписокЗначений") Тогда
		Приемник = SUI_ОбщегоНазначенияСлужебныйКлиент.СкопироватьСписокЗначений(Источник, ФиксироватьДанные);
	Иначе
		Приемник = Источник;
	КонецЕсли;
	
	Возврат Приемник;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ВыполнитьЗавершениеРаботыСистемыПродолжить(ПараметрыЗавершения) Экспорт
	
	Если Не ПараметрыЗавершения.ПерезапуститьПриЗавершении Тогда
		ПараметрыЗавершения.Вставить("ДополнительныеПараметрыКоманднойСтроки");
	КонецЕсли;
	
	ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка");
	ЗавершитьРаботуСистемы(
		ПараметрыЗавершения.ЗапрашиватьВозможность, 
		ПараметрыЗавершения.ПерезапуститьПриЗавершении, 
		ОписаниеТипаСтрока.ПривестиЗначение(ПараметрыЗавершения.ДополнительныеПараметрыКоманднойСтроки));
		
КонецПроцедуры

#КонецОбласти
