
#Область ПрограммныйИнтерфейс  

// Выполнить прекращение работы системы.
// 
// Параметры:
//  ПараметрыЗавершения - Структура - см. SUI_ОбщегоНазначенияКлиентСервер.ПараметрыЗавершенияРаботы
Процедура ВыполнитьПрекращениеРаботыСистемы(ПараметрыЗавершения) Экспорт
	
	ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка");
	ПрекратитьРаботуСистемы(
		ПараметрыЗавершения.ПерезапуститьПриЗавершении, 
		ОписаниеТипаСтрока.ПривестиЗначение(ПараметрыЗавершения.ДополнительныеПараметрыКоманднойСтроки));
	
КонецПроцедуры

// Выполнить завершение работы системы.
// 
// Параметры:
//  ПараметрыЗавершения - Структура - см. SUI_ОбщегоНазначенияКлиентСервер.ПараметрыЗавершенияРаботы
Процедура ВыполнитьЗавершениеРаботыСистемы(ПараметрыЗавершения) Экспорт
	
	Если ЗначениеЗаполнено(ПараметрыЗавершения.ТекстПредупреждения) Тогда
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ВыполнитьЗавершениеРаботыСистемыПродолжить", 
			ЭтотОбъект, ПараметрыЗавершения);
		ПоказатьПредупреждение(ОповещениеОЗавершении, ПараметрыЗавершения.ТекстПредупреждения);
	Иначе
		ВыполнитьЗавершениеРаботыСистемыПродолжить(ПараметрыЗавершения);
	КонецЕсли;

КонецПроцедуры

#Область ПараметрыПриложения

Функция НомерСеанса() Экспорт
	Возврат SUI_ПараметрыПриложения["НомерСеанса"];
КонецФункции

Функция ВерсияРасширения() Экспорт
	Возврат SUI_ПараметрыПриложения["ВерсияРасширения"];
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ВыполнитьЗавершениеРаботыСистемыПродолжить(ПараметрыЗавершения) Экспорт
	
	Если Не ПараметрыЗавершения.ПерезапуститьПриЗавершении Тогда
		ПараметрыЗавершения.Вставить("ДополнительныеПараметрыКоманднойСтроки");
	КонецЕсли;
	
	ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка");
	ЗавершитьРаботуСистемы(
		ПараметрыЗавершения.ЗапрашиватьВозможность, 
		ПараметрыЗавершения.ПерезапуститьПриЗавершении, 
		ОписаниеТипаСтрока.ПривестиЗначение(ПараметрыЗавершения.ДополнительныеПараметрыКоманднойСтроки));
		
КонецПроцедуры

Функция КаталогВспомогательныхБиблиотекSimple() Экспорт
	
	СтруктураФайловыхПеременных = СтруктураФайловыхПеременныхСеанса();
	
	Если СтруктураФайловыхПеременных.Свойство("РабочийКаталогДанныхПользователя") Тогда
		Возврат SUI_ОбщегоНазначенияКлиентСервер.КаталогВспомогательныхБиблиотекSimple(
			СтруктураФайловыхПеременных.РабочийКаталогДанныхПользователя, ВерсияРасширения());
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

Функция ИмяПараметраФайловыхПеременныхСеанса() Экспорт
	Возврат "ФАЙЛОВЫЕ_ПЕРЕМЕННЫЕ";
КонецФункции

Функция СтруктураФайловыхПеременныхСеанса() Экспорт
	
	ТекущиеПараметрыПриложения = SUI_ПараметрыПриложения;

	СтруктураФайловыхПеременных = ТекущиеПараметрыПриложения[ИмяПараметраФайловыхПеременныхСеанса()];
	Если СтруктураФайловыхПеременных = Неопределено Тогда
		ТекущиеПараметрыПриложения[ИмяПараметраФайловыхПеременныхСеанса()] = Новый Структура();
		СтруктураФайловыхПеременных = ТекущиеПараметрыПриложения[ИмяПараметраФайловыхПеременныхСеанса()];
	КонецЕсли;

	Возврат СтруктураФайловыхПеременных;
	
КонецФункции

#Область ПодключениеИУстановкаРасширенияРаботыСФайлами

Процедура ПодключитьРасширениеРаботыСФайламиСВозможнойУстановкой(ОповещениеОЗавершении, ТекстПредложения = "") Экспорт
	
	Контекст = Новый Структура();
	Контекст.Вставить("ОповещениеОЗавершении", ОповещениеОЗавершении);
	
	Оповещение = Новый ОписаниеОповещения("ПодключитьРасширениеРаботыСФайламиЗавершение", ЭтотОбъект, Контекст);
	ФайловаяСистемаКлиент.ПодключитьРасширениеДляРаботыСФайлами(Оповещение, ТекстПредложения);

КонецПроцедуры

Процедура ПодключитьРасширениеРаботыСФайламиЗавершение(РасширениеПодключено, Контекст) Экспорт

	Если РасширениеПодключено Тогда
		
		СтруктураФайловыхПеременныхСеанса = SUI_ПараметрыПриложения[ИмяПараметраФайловыхПеременныхСеанса()];
		
		Если СтруктураФайловыхПеременныхСеанса = Неопределено Тогда
			
			Оповещение = Новый ОписаниеОповещения("ПодключитьРасширениеРаботыСФайламиЗавершениеПослеПолученияКаталогаВременныхФайлов", 
				ЭтотОбъект, Контекст);
			НачатьПолучениеКаталогаВременныхФайлов(Оповещение);
			
		Иначе
			ВыполнитьОбработкуОповещения(Контекст.ОповещениеОЗавершении, Истина);
		КонецЕсли;
		
	Иначе
		ВыполнитьОбработкуОповещения(Контекст.ОповещениеОЗавершении, Ложь);
	КонецЕсли;

КонецПроцедуры

Процедура ПодключитьРасширениеРаботыСФайламиЗавершениеПослеПолученияКаталогаВременныхФайлов(ИмяКаталога, Контекст) Экспорт
	
	СтруктураФайловыхПеременных = СтруктураФайловыхПеременныхСеанса();
	СтруктураФайловыхПеременных.Вставить("КаталогВременныхФайлов", ИмяКаталога);
	
	Оповещение = Новый ОписаниеОповещения("ПодключитьРасширениеРаботыСФайламиЗавершениеПолучениеРабочегоКаталогаДанныхПользователя", 
		ЭтотОбъект, Контекст);
	НачатьПолучениеРабочегоКаталогаДанныхПользователя(Оповещение);
		
КонецПроцедуры

Процедура ПодключитьРасширениеРаботыСФайламиЗавершениеПолучениеРабочегоКаталогаДанныхПользователя(ИмяКаталога, Контекст) Экспорт
	
	СтруктураФайловыхПеременных = СтруктураФайловыхПеременныхСеанса();
	СтруктураФайловыхПеременных.Вставить("РабочийКаталогДанныхПользователя", ИмяКаталога);
	
	ВыполнитьОбработкуОповещения(Контекст.ОповещениеОЗавершении, Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
