
#Область ПрограммныйИнтерфейс  

// Выполнить прекращение работы системы.
// 
// Параметры:
//  ПараметрыЗавершения - Структура - см. SUI_ОбщегоНазначенияКлиентСервер.ПараметрыЗавершенияРаботы
Процедура ВыполнитьПрекращениеРаботыСистемы(ПараметрыЗавершения) Экспорт
	
	ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка");
	ПрекратитьРаботуСистемы(
		ПараметрыЗавершения.ПерезапуститьПриЗавершении, 
		ОписаниеТипаСтрока.ПривестиЗначение(ПараметрыЗавершения.ДополнительныеПараметрыКоманднойСтроки));
	
КонецПроцедуры

// Выполнить завершение работы системы.
// 
// Параметры:
//  ПараметрыЗавершения - Структура - см. SUI_ОбщегоНазначенияКлиентСервер.ПараметрыЗавершенияРаботы
Процедура ВыполнитьЗавершениеРаботыСистемы(ПараметрыЗавершения) Экспорт
	
	Если ЗначениеЗаполнено(ПараметрыЗавершения.ТекстПредупреждения) Тогда
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ВыполнитьЗавершениеРаботыСистемыПродолжить", 
			ЭтотОбъект, ПараметрыЗавершения);
		ПоказатьПредупреждение(ОповещениеОЗавершении, ПараметрыЗавершения.ТекстПредупреждения);
	Иначе
		ВыполнитьЗавершениеРаботыСистемыПродолжить(ПараметрыЗавершения);
	КонецЕсли;

КонецПроцедуры

#Область ПодключениеИУстановкаРасширенияРаботыСФайлами

Процедура ПодключитьРасширениеРаботыСФайламиСВозможнойУстановкой(ОписаниеОповещенияОЗавершении, ПослеУстановки = Ложь) Экспорт
	
	ДополнительныеПараметрыОповещения = Новый Структура();
	ДополнительныеПараметрыОповещения.Вставить("ОписаниеОповещенияОЗавершении", ОписаниеОповещенияОЗавершении);
	ДополнительныеПараметрыОповещения.Вставить("ПослеУстановки", ПослеУстановки);

	НачатьПодключениеРасширенияРаботыСФайлами(
		Новый ОписаниеОповещения("ПодключитьРасширениеРаботыСФайламиСВозможнойУстановкойЗавершениеПодключенияРасширения",
		ЭтотОбъект, ДополнительныеПараметрыОповещения));

КонецПроцедуры

Процедура ПодключитьРасширениеРаботыСФайламиСВозможнойУстановкойЗавершениеПодключенияРасширения(Подключено,
	ДополнительныеПараметры) Экспорт

	Если Подключено Тогда
		СтруктураФайловыхПеременныхСеанса = SUI_ПараметрыПриложения[ИмяПараметраФайловыхПеременныхСеанса()];
		Если СтруктураФайловыхПеременныхСеанса = Неопределено Тогда
			ПрочитатьОсновныеФайловыеПеременныеСеансаВПараметрыПриложения(
				Новый ОписаниеОповещения("ПодключитьРасширениеРаботыСФайламиСВозможнойУстановкойЗавершениеЧтенияФайловыхПеременныхСеанса",
				ЭтотОбъект, ДополнительныеПараметры));
		Иначе
			ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОписаниеОповещенияОЗавершении, Истина);
		КонецЕсли;
	ИначеЕсли Не ДополнительныеПараметры.ПослеУстановки Тогда
		НачатьУстановкуРасширенияРаботыСФайлами(
			Новый ОписаниеОповещения("ПодключитьРасширениеРаботыСФайламиСВозможнойУстановкойЗавершениеУстановкиРасширения",
			ЭтотОбъект, ДополнительныеПараметры));
	Иначе
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОписаниеОповещенияОЗавершении, Ложь);
	КонецЕсли;

КонецПроцедуры

Процедура ПодключитьРасширениеРаботыСФайламиСВозможнойУстановкойЗавершениеЧтенияФайловыхПеременныхСеанса(Результат,
	ДополнительныеПараметры) Экспорт

	ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОписаниеОповещенияОЗавершении, Истина);

КонецПроцедуры

Процедура ПодключитьРасширениеРаботыСФайламиСВозможнойУстановкойЗавершениеУстановкиРасширения(ДополнительныеПараметры) Экспорт
	
	ПодключитьРасширениеРаботыСФайламиСВозможнойУстановкой(ДополнительныеПараметры.ОписаниеОповещенияОЗавершении, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ПараметрыПриложения

Функция НомерСеанса() Экспорт
	Возврат SUI_ПараметрыПриложения["НомерСеанса"];
КонецФункции

#КонецОбласти

#Область ЧтениеФайловыхПараметровСеансаВПараметрыПриложения

Функция ИмяПараметраФайловыхПеременныхСеанса() Экспорт
	Возврат "ФАЙЛОВЫЕ_ПЕРЕМЕННЫЕ";
КонецФункции

Функция СтруктураФайловыхПеременныхСеанса() Экспорт
	
	ТекущиеПараметрыПриложения = SUI_ПараметрыПриложения;

	СтруктураФайловыхПеременных = ТекущиеПараметрыПриложения[ИмяПараметраФайловыхПеременныхСеанса()];
	Если СтруктураФайловыхПеременных = Неопределено Тогда
		ТекущиеПараметрыПриложения[ИмяПараметраФайловыхПеременныхСеанса()] = Новый Структура();
		СтруктураФайловыхПеременных = ТекущиеПараметрыПриложения[ИмяПараметраФайловыхПеременныхСеанса()];
	КонецЕсли;

	Возврат СтруктураФайловыхПеременных;
	
КонецФункции

Процедура ПрочитатьОсновныеФайловыеПеременныеСеансаВПараметрыПриложения(ОписаниеОповещенияОЗавершении) Экспорт
	
	ДополнительныеПараметрыОповещения=Новый Структура();
	ДополнительныеПараметрыОповещения.Вставить("ОписаниеОповещенияОЗавершении", ОписаниеОповещенияОЗавершении);

	//1. каталог временных файлов
	НачатьПолучениеКаталогаВременныхФайлов(
		Новый ОписаниеОповещения("ПрочитатьОсновныеФайловыеПеременныеСеансаВПараметрыПриложенияПолучениеКаталогаВременныхФайловЗавершение",
		ЭтотОбъект, ДополнительныеПараметрыОповещения));
		
КонецПроцедуры

Процедура ПрочитатьОсновныеФайловыеПеременныеСеансаВПараметрыПриложенияПолучениеКаталогаВременныхФайловЗавершение(ИмяКаталога,
	ДополнительныеПараметры) Экспорт
	
	СтруктураФайловыхПеременных = СтруктураФайловыхПеременныхСеанса();
	СтруктураФайловыхПеременных.Вставить("КаталогВременныхФайлов", ИмяКаталога);

	НачатьПолучениеРабочегоКаталогаДанныхПользователя(
		Новый ОписаниеОповещения("ПрочитатьОсновныеФайловыеПеременныеСеансаВПараметрыПриложенияПолучениеРабочегоКаталогаДанныхПользователяЗавершение",
		ЭтотОбъект, ДополнительныеПараметры));
		
КонецПроцедуры

Процедура ПрочитатьОсновныеФайловыеПеременныеСеансаВПараметрыПриложенияПолучениеРабочегоКаталогаДанныхПользователяЗавершение(ИмяКаталога,
	ДополнительныеПараметры) Экспорт
	
	СтруктураФайловыхПеременных = СтруктураФайловыхПеременныхСеанса();
	СтруктураФайловыхПеременных.Вставить("РабочийКаталогДанныхПользователя", ИмяКаталога);

	ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОписаниеОповещенияОЗавершении, Истина);
	
КонецПроцедуры

Функция КаталогВспомогательныхБиблиотекИнструментов() Экспорт
	
	СтруктураФайловыхПеременных = СтруктураФайловыхПеременныхСеанса();
	
	Если Не СтруктураФайловыхПеременных.Свойство("КаталогВременныхФайлов") Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат СтруктураФайловыхПеременных.КаталогВременныхФайлов + ПолучитьРазделительПути() + "sui_simple" + ПолучитьРазделительПути();
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ВыполнитьЗавершениеРаботыСистемыПродолжить(ПараметрыЗавершения) Экспорт
	
	Если Не ПараметрыЗавершения.ПерезапуститьПриЗавершении Тогда
		ПараметрыЗавершения.Вставить("ДополнительныеПараметрыКоманднойСтроки");
	КонецЕсли;
	
	ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка");
	ЗавершитьРаботуСистемы(
		ПараметрыЗавершения.ЗапрашиватьВозможность, 
		ПараметрыЗавершения.ПерезапуститьПриЗавершении, 
		ОписаниеТипаСтрока.ПривестиЗначение(ПараметрыЗавершения.ДополнительныеПараметрыКоманднойСтроки));
		
КонецПроцедуры

#КонецОбласти
