
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	//TODO: Врем. выкл.
	ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Функционал отключен'"), , , , Отказ);
	Возврат;
	
	ДатаОтсутствияСеанса = ТекущаяДатаСеанса() - SUI_МобильныеУстройстваСервер.СрокДействительностиСеансаВСекундах();
	SUI_КомпоновкаДанныхКлиентСервер.УстановитьПараметр(Список.КомпоновщикНастроек, "ДатаОтсутствияСеанса", ДатаОтсутствияСеанса);
	
КонецПроцедуры

#КонецОбласти
