
#Область ПрограммныйИнтерфейс

Функция СоздатьСерииНоменклатуры(Алгоритм, ТаблицаСерий) Экспорт
	
	Если ЗначениеЗаполнено(Алгоритм) Тогда
		
		Попытка
			УстановитьБезопасныйРежим(Истина);
			Выполнить(Алгоритм);
		Исключение
			SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(SUI_СерииНоменклатурыКлиентСервер.ИмяСобытия(), , 
				Метаданные.ОбщиеМодули.SUI_СерииНоменклатуры, Алгоритм, ИнформацияОбОшибке());
			ВызватьИсключение;
		КонецПопытки;
		
		Возврат ТаблицаСерий;
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
