
#Область ПрограммныйИнтерфейс

Функция СоздатьСерииНоменклатуры(Алгоритм, ТаблицаСерий) Экспорт
	
	Если ЗначениеЗаполнено(Алгоритм) Тогда
		
		Попытка
			УстановитьБезопасныйРежим(Истина);
			Выполнить(Алгоритм);
		Исключение
			SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(SUI_СерииНоменклатурыКлиентСервер.ИмяСобытия(), , 
				Метаданные.ОбщиеМодули.SUI_СерииНоменклатуры, Алгоритм, ИнформацияОбОшибке());
			ВызватьИсключение СтрШаблон(НСтр("ru = 'При выполнении алгоритма ""Создания серии номенклатуры"" возникла исключительная ошибка:
			|%1.
			|Проверьте алгоритм создания серии номенклатуры в настройках подсистемы Simple.'"), 
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
		Возврат ТаблицаСерий;
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура СоздатьСерииНоменклатурыПоАлгоритму(Алгоритм, Серия, Номенклатура, Характеристика, Наименование, Номер, 
	ДатаПроизводства, ГоденДо, КоличествоФакт) Экспорт
	
	Если ЗначениеЗаполнено(Алгоритм) Тогда
			
		Попытка
			УстановитьБезопасныйРежим(Истина);
			SUI_ОбщегоНазначения.ПередВыполнениемПроизвольногоАлгоритма();
			Выполнить(Алгоритм);
			УстановитьБезопасныйРежим(Ложь);
		Исключение
			ШаблонСообщения = НСтр("ru = 'Ошибка выполнения алгоритма создания серии номенклатуры.
			|Проверьте алгоритм в настройках серий подсистемы %1.
			|
			|%2'");
			ВызватьИсключение СтрШаблон(ШаблонСообщения, SUI_SimpleКлиентСервер.Представление(), 
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	Иначе
		Серия = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
