
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.ЗагрузкаПредопределенных И 
		Параметры.ОтключитьРежимВыгрузки И 
		Параметры.ОтключитьРежимЗагрузки Тогда
		ВызватьИсключение НСтр("ru = 'Возникла ошибка определения режима работы'");
	КонецЕсли;
	
	ИнициализироватьОбластиНастроек(Параметры.ОбластиНастроек.ВыгрузитьЗначения());
	
	Если Параметры.ЗагрузкаПредопределенных Тогда
		
		РежимВыгрузки = Ложь;
		Элементы.РежимВыгрузки.Видимость = Ложь;
		
		Если Метаданные.Обработки.SUI_ВыгрузкаЗагрузкаНастроек.Макеты.Найти("ПредопределенныеНастройки") <> Неопределено Тогда
			ПредопределенныеНастройки = Обработки.SUI_ВыгрузкаЗагрузкаНастроек.ПолучитьМакет("ПредопределенныеНастройки");
			АдресЗагружаемыйФайл = ПоместитьВоВременноеХранилище(ПредопределенныеНастройки, УникальныйИдентификатор);
		КонецЕсли;
		
	Иначе
		РежимВыгрузки = Параметры.ОтключитьРежимЗагрузки;
		Элементы.РежимВыгрузки.Видимость = (Не Параметры.ОтключитьРежимВыгрузки И Не Параметры.ОтключитьРежимЗагрузки);
		Элементы.ЗагрузитьИзРепозитория.Видимость = Ложь;
	КонецЕсли;
	
	Если ОбластиНастроек.НайтиПоЗначению(КлючОбластиНастройкиДокументов()) = Неопределено Тогда
		Элементы.ДеревоНастройкиНастройкиДокументовЗаполнитьПоОтбору.Видимость = Ложь;
	ИначеЕсли РежимВыгрузки Тогда
		АдресСхемыНастроекДокументов = ИнициализироватьАдресСхемыНастроекДокументов(УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Окно = Неопределено Тогда
		Элементы.ДеревоНастройки.Высота = 10;
		Элементы.ДеревоНастройки.Ширина = 100;
		Элементы.Закрыть.Видимость = Ложь;
	КонецЕсли;
	
	ОбновитьВидимостьЭлементовФормы();
	
	Если Параметры.ЗагрузкаПредопределенных Тогда
		
		Если ЭтоАдресВременногоХранилища(АдресЗагружаемыйФайл) Тогда
		
			ВыбранныйФайл = Новый Структура("Хранение", АдресЗагружаемыйФайл);
			АдресЗагружаемыйФайл = "";
			
			Оповещение = Новый ОписаниеОповещения("ЗагрузитьИзФайлаПослеВыбораФайла", ЭтотОбъект);
			ВыполнитьОбработкуОповещения(Оповещение, ВыбранныйФайл);
		
		КонецЕсли;
		
	Иначе
		
		Если РежимВыгрузки Тогда
			
			Если Параметры.ЗаполнитьВсеПриОткрытииВыгрузки Тогда
			
				Контекст = Новый Структура();
				Контекст.Вставить("ЭлементыДерева", ДеревоНастройки.ПолучитьЭлементы());
				ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаполнитьВсеПодтверждение", ЭтотОбъект, Контекст);
				ВыполнитьОбработкуОповещения(ОповещениеОЗавершении, КодВозвратаДиалога.Да);
			
			КонецЕсли;
			
		Иначе
			
			Если Параметры.ВыборФайлаПриОткрытииВыгрузки Тогда
				ЗагрузитьИзФайлаВыбратьФайл();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РежимВыгрузкиПриИзменении(Элемент)
	
	Контекст = Новый Структура();
	Контекст.Вставить("ЭлементыДерева", ДеревоНастройки.ПолучитьЭлементы());
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("РежимВыгрузкиПриИзмененииПослеПодтверждения", ЭтотОбъект, Контекст);
	
	Если Контекст.ЭлементыДерева.Количество() = 0 Тогда
		ВыполнитьОбработкуОповещения(ОповещениеОЗавершении, КодВозвратаДиалога.Да);
	Иначе
		ПоказатьВопрос(ОповещениеОЗавершении, НСтр("ru = 'Таблица настроек будет очищена.
		|Продолжить?'"), РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоНастройки

&НаКлиенте
Процедура ДеревоНастройкиПометкаПриИзменении(Элемент)
	
	Если Элементы.ДеревоНастройки.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементДерева = ДеревоНастройки.НайтиПоИдентификатору(Элементы.ДеревоНастройки.ТекущаяСтрока);
	
	ЭлементыДерева = ДеревоНастройки.ПолучитьЭлементы();
	
	Если ЭлементыДерева.Количество() > 1 Тогда
		
		Родитель = ПолучитьРодителяЭлементаДерева(ЭлементДерева);
		
		Для Каждого ЭлементДереваРодитель Из ЭлементыДерева Цикл
			
			Если ЭлементДереваРодитель <> Родитель И 
				Не ПустаяСтрока(ЭлементДереваРодитель.КонфигурацияИмя) И 
				ЭлементДереваРодитель.Пометка <> 0 Тогда
				ЭлементДереваРодитель.Пометка = 0;
				ПроставитьПометкиВниз(ЭлементДереваРодитель);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ЭлементДерева.Пометка = ЭлементДерева.Пометка % 2;
	
	ПроставитьПометкиВниз(ЭлементДерева);
	ПроставитьПометкиВверх(ЭлементДерева);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНастройкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	Отказ = Истина;
	
	Контекст = Новый Структура("ТекущийИдентификаторСтроки", Элемент.ТекущаяСтрока);
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ДеревоНастройкиПередНачаломДобавленияПослеВыбораОбласти", ЭтотОбъект, Контекст);
	
	Если ОбластиНастроек.Количество() = 1 Тогда
		ВыполнитьОбработкуОповещения(ОповещениеОЗавершении, ОбластиНастроек[0]);
	Иначе
		ПоказатьВыборИзМеню(ОповещениеОЗавершении, ОбластиНастроек, Элемент);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПометкиОтметитьВсе(Команда)
	
	Для Каждого ЭлементДерева Из ДеревоНастройки.ПолучитьЭлементы() Цикл
		ЭлементДерева.Пометка = 1;
		ПроставитьПометкиВниз(ЭлементДерева);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПометкиСнятьВсе(Команда)
	
	Для Каждого ЭлементДерева Из ДеревоНастройки.ПолучитьЭлементы() Цикл
		ЭлементДерева.Пометка = 0;
		ПроставитьПометкиВниз(ЭлементДерева);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиДокументовЗаполнитьПоОтбору(Команда)
	
	Если ОбластиНастроек.НайтиПоЗначению(КлючОбластиНастройкиДокументов()) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Контекст = Новый Структура();
	Контекст.Вставить("ЭлементОбласть", НайтиЭлементВДеревеПоЗначениюВКолонке("Область", 
		ОбластиНастроек.НайтиПоЗначению(КлючОбластиНастройкиДокументов()).Значение, 
		ДеревоНастройки.ПолучитьЭлементы()));
	
	Оповещение = Новый ОписаниеОповещения("НастройкиДокументовЗаполнитьПоОтборуПодтверждение", ЭтотОбъект, Контекст);
	
	Если Контекст.ЭлементОбласть = Неопределено Тогда
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
	Иначе
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Таблица содержит данные настроек документов.
		|Продолжить?'"), РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВсе(Команда)
	
	Контекст = Новый Структура();
	Контекст.Вставить("ЭлементыДерева", ДеревоНастройки.ПолучитьЭлементы());
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаполнитьВсеПодтверждение", ЭтотОбъект, Контекст);
	
	Если Контекст.ЭлементыДерева.Количество() = 0 Тогда
		ВыполнитьОбработкуОповещения(ОповещениеОЗавершении, КодВозвратаДиалога.Да);
	Иначе
		ПоказатьВопрос(ОповещениеОЗавершении, НСтр("ru = 'Таблица содержит данные настроек документов.
		|Продолжить?'"), РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВФайл(Команда)
	
	Если Не РежимВыгрузки Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементыДерева = ДеревоНастройки.ПолучитьЭлементы();
	
	Если ЭлементыДерева.Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Не загружен список настроек'"));
	Иначе
		
		ЕстьПометки = Ложь;
		Для Каждого ЭлементДерева Из ДеревоНастройки.ПолучитьЭлементы() Цикл
			
			Если ЭлементДерева.Пометка > 0 Тогда
				ЕстьПометки = Истина;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЕстьПометки Тогда
			
			ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
			ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
			ПараметрыОжидания.ВыводитьСообщения = Истина;
			ПараметрыОжидания.Заголовок = НСтр("ru = 'Подготовка данных к выгрузке'");
			
			ДлительнаяОперация = ПодготовкаФайлаКВыгрузкеНаСервере();
			
			ОповещениеОЗавершении = Новый ОписаниеОповещения("ПодготовкаФайлаКВыгрузкеЗавершение", ЭтотОбъект);
			ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
			
		Иначе
			ПоказатьПредупреждение(, НСтр("ru = 'Не выбраны настройки'"));
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	
	Если РежимВыгрузки Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьИзФайлаВыбратьФайл();
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсе(Команда)
	
	Если Элементы.ДеревоНастройки.ТекущиеДанные <> Неопределено Тогда
		Элементы.ДеревоНастройки.Развернуть(Элементы.ДеревоНастройки.ТекущаяСтрока, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьВсе(Команда)
	
	Если Элементы.ДеревоНастройки.ТекущиеДанные <> Неопределено Тогда
		Элементы.ДеревоНастройки.Свернуть(Элементы.ДеревоНастройки.ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНастройки(Команда)
	
	ЭлементыДерева = ДеревоНастройки.ПолучитьЭлементы();
	
	Если ЭлементыДерева.Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Не загружен список настроек'"));
	Иначе
		
		ЕстьПометки = Ложь;
		Для Каждого ЭлементДерева Из ДеревоНастройки.ПолучитьЭлементы() Цикл
			
			Если ЭлементДерева.Пометка > 0 Тогда
				ЕстьПометки = Истина;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЕстьПометки Тогда
			
			Оповещение = Новый ОписаниеОповещения("ЗаписатьНастройкиПродолжить", ЭтотОбъект);
			
			Если ФайлПолученИзРепозитория Тогда
				ЗагрузитьОтмеченныеНастройкиИзРепозитория(Оповещение);
			Иначе
				ВыполнитьОбработкуОповещения(Оповещение);
			КонецЕсли;
			
		Иначе
			ПоказатьПредупреждение(, НСтр("ru = 'Не выбраны настройки'"));
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзРепозитория(Команда)
	
	Если ЭтоАдресВременногоХранилища(АдресЗагружаемыйФайл) Тогда
		УдалитьИзВременногоХранилища(АдресЗагружаемыйФайл);
	КонецЕсли;
	
	АдресЗагружаемыйФайл = "";
	
	Результат = Новый Структура();
	Результат.Вставить("Хранение", ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор));
	
	#Если ВебКлиент Тогда
	Результат = ПолучитьМанифестПредопределенныхНастроекИзРепозиторияЧерезСервер(
		КаталогПредопределенныхНастроек(), Результат.Хранение);
	#Иначе
	Результат = ПолучитьМанифестПредопределенныхНастроекИзРепозитория(
		КаталогПредопределенныхНастроек(), Результат.Хранение);
	#КонецЕсли
	
	Если Не ПустаяСтрока(Результат.Ошибка) Тогда
		ПоказатьПредупреждение(, Результат.Ошибка);
	ИначеЕсли ЭтоАдресВременногоХранилища(Результат.Хранение) Тогда
		
		Контекст = Новый Структура();
		Контекст.Вставить("ИзРепозитория", Истина);
		
		Оповещение = Новый ОписаниеОповещения("ЗагрузитьИзФайлаПослеВыбораФайла", ЭтотОбъект, Контекст);
		ВыполнитьОбработкуОповещения(Оповещение, Результат);
		
	Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'Не удалось получить результат обращения к репозиторию.'"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияФормы

&НаСервере
Процедура ИнициализироватьОбластиНастроек(ОбластиИзПараметров)
	
	Обработки.SUI_ВыгрузкаЗагрузкаНастроек.ИнициализироватьОбластиНастроек(ОбластиНастроек, ОбластиИзПараметров);
	
	ТекстОшибки = НСтр("ru = 'Возникла ошибка определения областей %1'");
	
	Если Параметры.ЗагрузкаПредопределенных Тогда
		ТекстОшибки = СтрШаблон(ТекстОшибки, НСтр("ru = 'предопределенных настроек.'"));
	ИначеЕсли РежимВыгрузки Тогда
		ТекстОшибки = СтрШаблон(ТекстОшибки, НСтр("ru = 'выгрузки настроек.'"));
	Иначе
		ТекстОшибки = СтрШаблон(ТекстОшибки, НСтр("ru = 'загрузки настроек.'"));
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.Проверить(ОбластиНастроек.Количество() > 0, ТекстОшибки);
	
КонецПроцедуры

&НаКлиенте
Процедура РежимВыгрузкиПриИзмененииПослеПодтверждения(Подтверждение, Контекст) Экспорт
	
	Если Подтверждение = КодВозвратаДиалога.Да Тогда
		Контекст.ЭлементыДерева.Очистить();
		ОбновитьВидимостьЭлементовФормы();
	Иначе
		РежимВыгрузки = Не РежимВыгрузки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьЭлементовФормы()
	
	Если Параметры.ЗагрузкаПредопределенных Тогда
		
		Заголовок = НСтр("ru = 'Загрузка предопределенных настроек'");
		
		Элементы.ФормаВыгрузитьВФайл.Видимость = Ложь;
		Элементы.ФормаЗагрузитьИзФайла.Видимость = Ложь;
		Элементы.ФормаЗаписатьНастройки.Видимость = (ДеревоНастройки.ПолучитьЭлементы().Количество() > 0);
		
		Элементы.ДеревоНастройки.ИзменятьСоставСтрок = Ложь;
		Элементы.ДеревоНастройкиКоманднаяПанельГруппаРежимаВыгрузки.Видимость = Ложь;
		Элементы.ДеревоНастройкиКоманднаяПанельГруппаРежимаВыгрузки.Видимость = Ложь;
		
		Элементы.ДеревоНастройкиСопоставленнаяНастройка.Видимость = Истина;
		
	Иначе
		
		Заголовок = ?(РежимВыгрузки, НСтр("ru = 'Выгрузка настроек'"), НСтр("ru = 'Загрузка настроек'"));
		
		Элементы.ФормаВыгрузитьВФайл.Видимость = РежимВыгрузки;
		Элементы.ФормаЗагрузитьИзФайла.Видимость = Не РежимВыгрузки;
		Элементы.ФормаЗаписатьНастройки.Видимость = Не РежимВыгрузки И ДеревоНастройки.ПолучитьЭлементы().Количество() > 0;
		
		Элементы.ДеревоНастройки.ИзменятьСоставСтрок = РежимВыгрузки;
		Элементы.ДеревоНастройкиКоманднаяПанельГруппаРежимаВыгрузки.Видимость = РежимВыгрузки;
		Элементы.ДеревоНастройкиКонтекстноеМенюГруппаРежимаВыгрузки.Видимость = РежимВыгрузки;
		
		Элементы.ДеревоНастройкиСопоставленнаяНастройка.Видимость = Не РежимВыгрузки;
		
	КонецЕсли;
	
	Если Элементы.ФормаВыгрузитьВФайл.Видимость Тогда
		Элементы.ФормаВыгрузитьВФайл.КнопкаПоУмолчанию = Истина;
	ИначеЕсли Элементы.ФормаЗаписатьНастройки.Видимость Тогда
		Элементы.ФормаЗаписатьНастройки.КнопкаПоУмолчанию = Истина;
	Иначе
		Элементы.ФормаЗагрузитьИзФайла.КнопкаПоУмолчанию = Истина;
	КонецЕсли;
	
	Элементы.ДеревоНастройкиПредставление.Заголовок = НСтр("ru = 'Область / Настройка'");
	Если Параметры.ЗагрузкаПредопределенных Или Не РежимВыгрузки Тогда
		Элементы.ДеревоНастройкиПредставление.Заголовок = СтрШаблон(НСтр("ru = 'Конфигурация / %1'"),
			Элементы.ДеревоНастройкиПредставление.Заголовок);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция КлючОбластиНастройкиДокументов()
	Возврат "Documents";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция КлючОбластиНастройкиТаблиц()
	Возврат "IntegrationTables";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция КлючОбластиДополнительныхНастроекТаблиц()
	Возврат "IntegrationAdditional";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция КлючОбластиПользовательскиеЗапросы()
	Возврат "IntegrationQuery";
КонецФункции

#КонецОбласти

#Область РаботаСДеревом

&НаКлиенте
Процедура ПроставитьПометкиВниз(ДанныеСтроки)
	
	Значение = ДанныеСтроки.Пометка;
	
	Для Каждого Потомок Из ДанныеСтроки.ПолучитьЭлементы() Цикл
		
		Потомок.Пометка = Значение;
		
		ПроставитьПометкиВниз(Потомок);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроставитьПометкиВверх(ДанныеСтроки)
	
	РодительСтроки = ДанныеСтроки.ПолучитьРодителя();
	
	Если РодительСтроки <> Неопределено Тогда
		
		ВсеИстина = Истина;
		НеВсеЛожь = Ложь;
		
		Для Каждого Потомок Из РодительСтроки.ПолучитьЭлементы() Цикл
			ВсеИстина = ВсеИстина И (Потомок.Пометка = 1);
			НеВсеЛожь = НеВсеЛожь Или Булево(Потомок.Пометка);
		КонецЦикла;
		
		Если ВсеИстина Тогда
			РодительСтроки.Пометка = 1;
		ИначеЕсли НеВсеЛожь Тогда
			РодительСтроки.Пометка = 2;
		Иначе
			РодительСтроки.Пометка = 0;
		КонецЕсли;
		
		ПроставитьПометкиВверх(РодительСтроки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция НайтиЭлементВДеревеПоЗначениюВКолонке(Колонка, Значение, ТекущийЭлементДерева)
	
	Результат = Неопределено;
	
	Для Каждого ЭлементДерева Из ТекущийЭлементДерева Цикл
		
		Если Результат <> Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		Если ЭлементДерева[Колонка] = Значение Тогда
			Результат = ЭлементДерева;
			Прервать;
		КонецЕсли;
		
		Потомки = ЭлементДерева.ПолучитьЭлементы();
		
		Если Потомки.Количество() > 0 Тогда
			Результат = НайтиЭлементВДеревеПоЗначениюВКолонке(Колонка, Значение, Потомки);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьПредствлениеЭлементаДерева(ЭлементДерева, Знач КолонкиДанных, Знач ШаблонСтроки = "")
	
	КолонкиДанных = СтрРазделить(КолонкиДанных, ",");
	ДанныеДляПредставления = Новый Массив();
	АвтоШаблонСтроки = Новый Массив();
	
	Для индекс = 0 По КолонкиДанных.ВГраница() Цикл
		ДанныеДляПредставления.Добавить(ЭлементДерева[СокрЛП(КолонкиДанных[индекс])]);
		АвтоШаблонСтроки.Добавить("%" + Формат(индекс+1, "ЧГ=0;"));
	КонецЦикла;
	
	ЭлементДерева.Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтрокуИзМассива(
		?(ПустаяСтрока(ШаблонСтроки), СтрСоединить(АвтоШаблонСтроки, ", "), ШаблонСтроки), ДанныеДляПредставления);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьОбластьСтроки(Знач ТекущийЭлементДерева)
	
	Если ТекущийЭлементДерева = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ПустаяСтрока(ТекущийЭлементДерева.Область) Тогда
		Возврат ПолучитьОбластьСтроки(ТекущийЭлементДерева.ПолучитьРодителя());
	Иначе
		Возврат ТекущийЭлементДерева;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ПолучитьРодителяСтрокиПоУровню(Знач ТекущийЭлементДерева, Знач Уровень, СтрокиПоУровням = Неопределено)
	
	Если СтрокиПоУровням = Неопределено Тогда
		СтрокиПоУровням = Новый Массив();
	КонецЕсли;
	
	РодительСтроки = ТекущийЭлементДерева.ПолучитьРодителя();
	
	Если РодительСтроки = Неопределено Тогда
		
		Если СтрокиПоУровням.Количество() = 0 Тогда
			Возврат РодительСтроки;
		Иначе
			
			РодительПоУровнюНайден = Ложь;
			ТекущаяГраница = СтрокиПоУровням.ВГраница();
			Пока ТекущаяГраница >= 0 Цикл
				
				Если Уровень = 0 Тогда
					РодительСтроки = ДеревоНастройки.НайтиПоИдентификатору(СтрокиПоУровням[ТекущаяГраница]);
					РодительПоУровнюНайден = Истина;
					Прервать;
				КонецЕсли;
				
				ТекущаяГраница = ТекущаяГраница-1;
				Уровень = Уровень-1;
				
			КонецЦикла;
			
			Если Не РодительПоУровнюНайден Тогда
				РодительСтроки = ДеревоНастройки.НайтиПоИдентификатору(СтрокиПоУровням[СтрокиПоУровням.ВГраница()]);
			КонецЕсли;
			
			Возврат РодительСтроки;
			
		КонецЕсли;
		
	Иначе
		СтрокиПоУровням.Добавить(РодительСтроки.ПолучитьИдентификатор());
		Возврат ПолучитьРодителяСтрокиПоУровню(РодительСтроки, Уровень, СтрокиПоУровням);
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ПолучитьРодителяЭлементаДерева(ТекущийЭлемент)
	
	Родитель = ТекущийЭлемент.ПолучитьРодителя();
	
	Если Родитель = Неопределено Тогда
		Возврат ТекущийЭлемент;
	Иначе
		Возврат ПолучитьРодителяЭлементаДерева(Родитель);
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ЗаполнениеДерева

&НаКлиенте
Процедура ЗаполнитьВсеПодтверждение(Подтверждение, Контекст) Экспорт
	
	Если Подтверждение <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Контекст.ЭлементыДерева.Очистить();
	
	Если ОбластиНастроек.НайтиПоЗначению(КлючОбластиНастройкиДокументов()) <> Неопределено Тогда
		
		Контекст = Новый Структура();
		Контекст.Вставить("ПропуститьОтбор");
		Оповещение = Новый ОписаниеОповещения("НастройкиДокументовЗаполнитьПоОтборуПодтверждение", ЭтотОбъект, Контекст);
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
		
	КонецЕсли;
	
	ЗаполнитьВсеНастройкиТаблиц();
	ЗаполнитьВсеДополнительныеНастройкиТаблиц();
	ЗаполнитьВсеПользовательскиеЗапросы();
	
КонецПроцедуры

#Область ЗаполнениеНастроекДокументов

&НаСервереБезКонтекста
Функция ИнициализироватьАдресСхемыНастроекДокументов(Идентификатор)
	
	Схема = SUI_КомпоновкаДанныхСервер.ПустаяСхема();
	
	Набор = SUI_КомпоновкаДанныхСервер.ДобавитьПустойНаборДанных(Схема);
	Набор.Запрос = "ВЫБРАТЬ * ИЗ Справочник.SUI_НастройкиДокументовОбмена";
	
	Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных();
	SUI_КомпоновкаДанныхСервер.ИнициализироватьКомпоновщикНастроек(Компоновщик, Схема);
	
	SUI_КомпоновкаДанныхКлиентСервер.ДобавитьГруппировку(Компоновщик);
	SUI_КомпоновкаДанныхКлиентСервер.ДобавитьВыбранноеПоле(Компоновщик, "Ссылка");
	SUI_КомпоновкаДанныхКлиентСервер.ДобавитьВыбранноеПоле(Компоновщик, "Наименование");
	SUI_КомпоновкаДанныхКлиентСервер.ДобавитьВыбранноеПоле(Компоновщик, "ИмяМетаданныхДокумента");
	SUI_КомпоновкаДанныхКлиентСервер.ДобавитьВыбранноеПоле(Компоновщик, "СинонимМетаданныхДокумента");
	SUI_КомпоновкаДанныхКлиентСервер.ДобавитьВыбранноеПоле(Компоновщик, "Комментарий");
	
	SUI_КомпоновкаДанныхКлиентСервер.СкопироватьНастройкиКомпоновкиДанных(Схема.НастройкиПоУмолчанию, Компоновщик.ПолучитьНастройки());
	
	Возврат ПоместитьВоВременноеХранилище(Схема, Идентификатор);
	
КонецФункции

&НаКлиенте
Процедура НастройкиДокументовЗаполнитьПоОтборуПодтверждение(Подтверждение, Контекст) Экспорт
	
	Если Подтверждение <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоАдресВременногоХранилища(АдресСхемыНастроекДокументов) Тогда
		АдресСхемыНастроекДокументов = ИнициализироватьАдресСхемыНастроекДокументов(УникальныйИдентификатор);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.Проверить(ЭтоАдресВременногоХранилища(АдресСхемыНастроекДокументов),
		НСтр("ru = 'Схема компоновки данных не инициализирована'"));
	
	Оповещение = Новый ОписаниеОповещения("НастройкиДокументовЗаполнитьПоОтборуПродолжить", ЭтотОбъект, Контекст);
	
	Если Контекст.Свойство("ПропуститьОтбор") Тогда
		ВыполнитьОбработкуОповещения(Оповещение);
	Иначе
		
		ПараметрыОткрытияНастройкиСКД = SUI_КомпоновкаДанныхКлиент.ПараметрыОткрытияНастройкиСхемыКомпоновкиДанных(Оповещение, ЭтотОбъект);
		ПараметрыОткрытияНастройкиСКД.Окно = Окно;
		ПараметрыОткрытияНастройкиСКД.Уникальность = УникальныйИдентификатор;
		
		ПараметрыНастройкиСКД = SUI_КомпоновкаДанныхКлиент.ПараметрыНастройкиСхемыКомпоновкиДанных(
			АдресСхемыНастроекДокументов, , УникальныйИдентификатор);
		
		ПараметрыНастройкиСКД.НеНастраиватьВыбор = Истина;
		ПараметрыНастройкиСКД.НеНастраиватьПараметры = Истина;
		ПараметрыНастройкиСКД.НеНастраиватьПользовательскиеПоля = Истина;
		ПараметрыНастройкиСКД.НеНастраиватьПорядок = Истина;
		ПараметрыНастройкиСКД.НеРедактироватьСхемуКомпоновкиДанных = Истина;
		ПараметрыНастройкиСКД.НеЗагружатьСхемуКомпоновкиДанныхИзФайла = Истина;
		ПараметрыНастройкиСКД.НеПомещатьНастройкиВСхемуКомпоновкиДанных = Ложь;
		
		SUI_КомпоновкаДанныхКлиент.ОткрытьНастройкиКомпоновкиДанных(ПараметрыОткрытияНастройкиСКД, ПараметрыНастройкиСКД);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиДокументовЗаполнитьПоОтборуПродолжить(АдресНастройкиКомпоновкиДанных, Контекст) Экспорт
	
	Если АдресНастройкиКомпоновкиДанных = Неопределено И Не Контекст.Свойство("ПропуститьОтбор") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Контекст.Свойство("ЭлементОбласть") Или Контекст.ЭлементОбласть = Неопределено Тогда
		
		ОбластьИзСписка = ОбластиНастроек.НайтиПоЗначению(КлючОбластиНастройкиДокументов());
		
		Контекст.Вставить("ЭлементОбласть", ДеревоНастройки.ПолучитьЭлементы().Добавить());
		Контекст.ЭлементОбласть.Область = ОбластьИзСписка.Значение;
		Контекст.ЭлементОбласть.Представление = ОбластьИзСписка.Представление;
		
	КонецЕсли;
	
	ИдентификаторОбласти = Контекст.ЭлементОбласть.ПолучитьИдентификатор();
	
	НастройкиДокументовЗаполнитьПоОтборуНаСервере(ИдентификаторОбласти);
	
	Контекст.ЭлементОбласть.Пометка = 1;
	
	ПроставитьПометкиВниз(Контекст.ЭлементОбласть);
	ПроставитьПометкиВверх(Контекст.ЭлементОбласть);
	
	Элементы.ДеревоНастройки.Развернуть(ИдентификаторОбласти, Истина);
	
КонецПроцедуры

&НаСервере
Процедура НастройкиДокументовЗаполнитьПоОтборуНаСервере(ИдентификаторЭлементаДерева)
	
	ЭлементДереваОбласть = ДеревоНастройки.НайтиПоИдентификатору(ИдентификаторЭлементаДерева);
	
	Если ЭлементДереваОбласть = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементыОбласти = ЭлементДереваОбласть.ПолучитьЭлементы();
	ЭлементыОбласти.Очистить();
	
	ПараметрыРезультатСКД = SUI_КомпоновкаДанныхСервер.ПараметрыРезультатСхемыКомпоновкиДанных(АдресСхемыНастроекДокументов);
	ПараметрыРезультатСКД.ВыполнятьВПривилегированномРежиме = Истина;
	
	Для Каждого СтрокаРезультат Из SUI_КомпоновкаДанныхСервер.ВыгрузитьРезультатСхемыКомпоновкиДанных(ПараметрыРезультатСКД) Цикл
		
		НовыйЭлементОбласти = ЭлементыОбласти.Добавить();
		
		НовыйЭлементОбласти.НастройкаID = СтрокаРезультат.Ссылка.УникальныйИдентификатор();
		НовыйЭлементОбласти.НастройкаКлюч = СтрокаРезультат.Ссылка;
		НовыйЭлементОбласти.НастройкаНаименование = СтрокаРезультат.Наименование;
		НовыйЭлементОбласти.НастройкаОписание = СтрокаРезультат.Комментарий;
		НовыйЭлементОбласти.СопоставленнаяНастройка = СтрокаРезультат.Ссылка;
		НовыйЭлементОбласти.ЭтоНастройкаДокумента = Истина;
		
		ЗаполнитьПредствлениеЭлементаДерева(НовыйЭлементОбласти, "НастройкаКлюч");
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеНастроекТаблиц

&НаКлиенте
Процедура ЗаполнитьВсеНастройкиТаблиц()
	
	ОбластьИзСписка = ОбластиНастроек.НайтиПоЗначению(КлючОбластиНастройкиТаблиц());
	
	Если ОбластьИзСписка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементОбласть = НайтиЭлементВДеревеПоЗначениюВКолонке("Область", ОбластьИзСписка.Значение, ДеревоНастройки.ПолучитьЭлементы());
	
	Если ЭлементОбласть = Неопределено Тогда
		
		ЭлементОбласть = ДеревоНастройки.ПолучитьЭлементы().Добавить();
		ЭлементОбласть.Область = ОбластьИзСписка.Значение;
		ЭлементОбласть.Представление = ОбластьИзСписка.Представление;
		
	КонецЕсли;
	
	ИдентификаторОбласти = ЭлементОбласть.ПолучитьИдентификатор();
	
	ЗаполнитьВсеНастройкиТаблицНаСервере(ИдентификаторОбласти);
	
	ЭлементОбласть.Пометка = 1;
	
	ПроставитьПометкиВниз(ЭлементОбласть);
	ПроставитьПометкиВверх(ЭлементОбласть);
	
	Элементы.ДеревоНастройки.Развернуть(ИдентификаторОбласти, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВсеНастройкиТаблицНаСервере(ИдентификаторОбласти)
	
	ЭлементОбласть = ДеревоНастройки.НайтиПоИдентификатору(ИдентификаторОбласти);
	
	Если ЭлементОбласть = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементыОбласти = ЭлементОбласть.ПолучитьЭлементы();
	ЭлементыОбласти.Очистить();
	
	ПараметрыПолученияНастроек = РегистрыСведений.SUI_НастройкиТаблицИнтеграции.ПараметрыПолученияНастроек();
	ПараметрыПолученияНастроек.Используется = Неопределено;
	
	НастройкиТаблиц = РегистрыСведений.SUI_НастройкиТаблицИнтеграции.ПолучитьНастройки(ПараметрыПолученияНастроек);
	НастройкиТаблиц.Свернуть("ТаблицаИнтеграции,ИмяОбъекта");
	
	ТаблицыИнтеграцииНастройки = ОбщегоНазначенияКлиентСервер.СвернутьМассив(НастройкиТаблиц.ВыгрузитьКолонку("ТаблицаИнтеграции"));
	
	Для индекс = 0 По ТаблицыИнтеграцииНастройки.ВГраница() Цикл
		
		ОтборСтрок = Новый Структура("ТаблицаИнтеграции", ТаблицыИнтеграцииНастройки[индекс]);
		НайденныеСтроки = НастройкиТаблиц.НайтиСтроки(ОтборСтрок);
		
		Для ИндексНайденныхСтрок = 0 По НайденныеСтроки.ВГраница() Цикл
			
			КлючЭлемента = Новый Структура("ТаблицаИнтеграции,ИмяОбъектаКонфигурации");
			КлючЭлемента.Вставить("ТаблицаИнтеграции", НайденныеСтроки[ИндексНайденныхСтрок].ТаблицаИнтеграции);
			КлючЭлемента.Вставить("ИмяОбъектаКонфигурации", НайденныеСтроки[ИндексНайденныхСтрок].ИмяОбъекта);
			
			НовыйЭлемент = ЭлементыОбласти.Добавить();
			НовыйЭлемент.НастройкаID = Новый УникальныйИдентификатор();
			НовыйЭлемент.НастройкаКлюч = КлючЭлемента;
			НовыйЭлемент.НастройкаНаименование = СтрШаблон("%1 (%2)", КлючЭлемента.ТаблицаИнтеграции, КлючЭлемента.ИмяОбъектаКонфигурации);
			
			ЗаполнитьПредствлениеЭлементаДерева(НовыйЭлемент, "НастройкаНаименование");
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеДополнительныхНастроекТаблиц

&НаКлиенте
Процедура ЗаполнитьВсеДополнительныеНастройкиТаблиц()
	
	ОбластьИзСписка = ОбластиНастроек.НайтиПоЗначению(КлючОбластиДополнительныхНастроекТаблиц());
	
	Если ОбластьИзСписка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементОбласть = НайтиЭлементВДеревеПоЗначениюВКолонке("Область", ОбластьИзСписка.Значение, ДеревоНастройки.ПолучитьЭлементы());
	
	Если ЭлементОбласть = Неопределено Тогда
		
		ЭлементОбласть = ДеревоНастройки.ПолучитьЭлементы().Добавить();
		ЭлементОбласть.Область = ОбластьИзСписка.Значение;
		ЭлементОбласть.Представление = ОбластьИзСписка.Представление;
		
	КонецЕсли;
	
	ИдентификаторОбласти = ЭлементОбласть.ПолучитьИдентификатор();
	
	ЗаполнитьВсеДополнительныеНастройкиТаблицНаСервере(ИдентификаторОбласти);
	
	ЭлементОбласть.Пометка = 1;
	
	ПроставитьПометкиВниз(ЭлементОбласть);
	ПроставитьПометкиВверх(ЭлементОбласть);
	
	Элементы.ДеревоНастройки.Развернуть(ИдентификаторОбласти, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВсеДополнительныеНастройкиТаблицНаСервере(ИдентификаторОбласти)
	
	ЭлементОбласть = ДеревоНастройки.НайтиПоИдентификатору(ИдентификаторОбласти);
	
	Если ЭлементОбласть = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементыОбласти = ЭлементОбласть.ПолучитьЭлементы();
	ЭлементыОбласти.Очистить();
	
	ДополнительныеНастройки = РегистрыСведений.SUI_ДополнительныеНастройкиТаблицИнтеграции.ПолучитьНастройки();
	
	Для Каждого ДополнительнаяНастройка Из ДополнительныеНастройки Цикл
		
		НовыйЭлемент = ЭлементыОбласти.Добавить();
		НовыйЭлемент.НастройкаID = Новый УникальныйИдентификатор();
		НовыйЭлемент.НастройкаКлюч = Новый Структура("ТаблицаИнтеграции", ДополнительнаяНастройка.ТаблицаИнтеграции);
		НовыйЭлемент.НастройкаНаименование = ДополнительнаяНастройка.ТаблицаИнтеграции;
		
		ЗаполнитьПредствлениеЭлементаДерева(НовыйЭлемент, "НастройкаНаименование");
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеПользовательскихЗапросов

&НаКлиенте
Процедура ЗаполнитьВсеПользовательскиеЗапросы()
	
	ОбластьИзСписка = ОбластиНастроек.НайтиПоЗначению(КлючОбластиПользовательскиеЗапросы());
	
	Если ОбластьИзСписка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементОбласть = НайтиЭлементВДеревеПоЗначениюВКолонке("Область", ОбластьИзСписка.Значение, ДеревоНастройки.ПолучитьЭлементы());
	
	Если ЭлементОбласть = Неопределено Тогда
		
		ЭлементОбласть = ДеревоНастройки.ПолучитьЭлементы().Добавить();
		ЭлементОбласть.Область = ОбластьИзСписка.Значение;
		ЭлементОбласть.Представление = ОбластьИзСписка.Представление;
		
	КонецЕсли;
	
	ЭлементыОбласти = ЭлементОбласть.ПолучитьЭлементы();
	ЭлементыОбласти.Очистить();
	
	НовыйЭлемент = ЭлементыОбласти.Добавить();
	НовыйЭлемент.НастройкаID = Новый УникальныйИдентификатор();
	НовыйЭлемент.НастройкаКлюч = "ПользовательскийЗапрос";
	НовыйЭлемент.НастройкаНаименование = НСтр("ru = 'Пользовательский запрос'");
	
	ЗаполнитьПредствлениеЭлементаДерева(НовыйЭлемент, "НастройкаНаименование");
	
	НовыйЭлемент = ЭлементыОбласти.Добавить();
	НовыйЭлемент.НастройкаID = Новый УникальныйИдентификатор();
	НовыйЭлемент.НастройкаКлюч = "ЗапросПолученияОстатковИЦен";
	НовыйЭлемент.НастройкаНаименование = НСтр("ru = 'Запрос получения остатков и цен'");
	
	ЗаполнитьПредствлениеЭлементаДерева(НовыйЭлемент, "НастройкаНаименование");
	
	ЭлементОбласть.Пометка = 1;
	
	ПроставитьПометкиВниз(ЭлементОбласть);
	ПроставитьПометкиВверх(ЭлементОбласть);
	
	Элементы.ДеревоНастройки.Развернуть(ЭлементОбласть.ПолучитьИдентификатор(), Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ВыгрузкаНастроек

&НаСервере
Функция ПодготовкаФайлаКВыгрузкеНаСервере()
	
	ПараметрыПроцедуры = Новый Структура();
	ПараметрыПроцедуры.Вставить("ДеревоНастройки", РеквизитФормыВЗначение("ДеревоНастройки"));
	ПараметрыПроцедуры.Вставить("ОбластиНастроек", ОбластиНастроек);
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Обработки.SUI_ВыгрузкаЗагрузкаНастроек.ПодготовитьФайлВыгрузкиНастроекВФоне", 
		ПараметрыПроцедуры, ПараметрыВыполненияВФоне);
	
КонецФункции

&НаКлиенте
Процедура ПодготовкаФайлаКВыгрузкеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Результат.Сообщения) Тогда
		
		Для индекс = 0 По Результат.Сообщения.ВГраница() Цикл
			Результат.Сообщения[индекс].Сообщить();
		КонецЦикла;
		
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		Оповещение = Новый ОписаниеОповещения("ВыгрузкаВФайлЗавершениеПослеСохранения", ЭтотОбъект);
		
		ПараметрыСохраненияФайла = ФайловаяСистемаКлиент.ПараметрыСохраненияФайла();
		ПараметрыСохраненияФайла.Диалог.Фильтр = "Архив ZIP (*.zip)|*.zip";
		ПараметрыСохраненияФайла.Диалог.МножественныйВыбор = Ложь;
		ПараметрыСохраненияФайла.Диалог.Заголовок = СтрШаблон(
			НСтр("ru = 'Сохранение настроек %1'"), 
			SUI_SimpleКлиентСервер.Представление());
		
		ИмяФайла = СтрШаблон(НСтр("ru = 'Настройки%1_%2'"), 
			SUI_SimpleКлиентСервер.Представление(), 
			Формат(ОбщегоНазначенияКлиент.ДатаСеанса(), "ДФ=dd_MM_yy_HH_mm_ss;"));
		
		ФайловаяСистемаКлиент.СохранитьФайл(Оповещение, Результат.АдресРезультата, ИмяФайла, ПараметрыСохраненияФайла);
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение(, СтрШаблон(НСтр("ru = 'Возникла ошибка при подготовке файла настроек.
		|%1'"), Результат.КраткоеПредставлениеОшибки));
	Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'Не удалось получить результат подготовки файла настроек.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузкаВФайлЗавершениеПослеСохранения(ВыгруженныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыгруженныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПолноеИмяВыгруженногоФайла = Неопределено;
	
	Если ВыгруженныеФайлы.Количество() > 0 Тогда
		ПолноеИмяВыгруженногоФайла = ВыгруженныеФайлы[0].ПолноеИмя;
	КонецЕсли;
	
	Если Параметры.ЗакрытьПослеВыгрузки Тогда
		Закрыть(ПолноеИмяВыгруженногоФайла);
	Иначе
		
		ЭлементыДерева = ДеревоНастройки.ПолучитьЭлементы();
		
		ЭлементыДерева[0].Пометка = 0;
		ПроставитьПометкиВниз(ЭлементыДерева[0]);
		ПроставитьПометкиВверх(ЭлементыДерева[0]);
		
		ОбновитьВидимостьЭлементовФормы();
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Настройки выгружены'"));
		
		Если ПолноеИмяВыгруженногоФайла <> Неопределено Тогда
			ФайловаяСистемаКлиент.ОткрытьПроводник(ПолноеИмяВыгруженногоФайла);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаНастроек

&НаКлиенте
Процедура ЗагрузитьИзФайлаВыбратьФайл()
	
	Контекст = Новый Структура();
	Контекст.Вставить("ИзРепозитория", Ложь);
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьИзФайлаПослеВыбораФайла", ЭтотОбъект, Контекст);
	
	ПараметрыЗагрузкиФайла = ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла();
	ПараметрыЗагрузкиФайла.ИдентификаторФормы = УникальныйИдентификатор;
	ПараметрыЗагрузкиФайла.Диалог.Заголовок = НСтр("ru = 'Загрузка настроек из файла'");
	ПараметрыЗагрузкиФайла.Диалог.МножественныйВыбор = Ложь;
	ПараметрыЗагрузкиФайла.Диалог.Фильтр = "Архив ZIP (*.zip)|*.zip";
	
	ФайловаяСистемаКлиент.ЗагрузитьФайл(Оповещение, ПараметрыЗагрузкиФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайлаПослеВыбораФайла(ВыбранныйФайл, Контекст) Экспорт
	
	Если ВыбранныйФайл = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ФайлПолученИзРепозитория = Контекст.ИзРепозитория;
	
	АдресЗагружаемыйФайл = ВыбранныйФайл.Хранение;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	ПараметрыОжидания.Заголовок = НСтр("ru = 'Чтение файла настроек'");
	
	ДлительнаяОперация = ЗагрузитьИзФайлаНаСервере(ВыбранныйФайл.Хранение, ВыбранныйФайл.Имя);
	
	Если ДлительнаяОперация <> Неопределено Тогда
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗагрузитьИзФайлаЗавершение", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьИзФайлаНаСервере(АдресХраненияФайла, ИмяФайла)
	
	ПараметрыПроцедуры = Новый Структура();
	ПараметрыПроцедуры.Вставить("ДеревоНастройки", РеквизитФормыВЗначение("ДеревоНастройки"));
	ПараметрыПроцедуры.Вставить("ОбластиНастроек", ОбластиНастроек);
	ПараметрыПроцедуры.Вставить("АдресРезультатаДерева", 
		ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор));
	
	Если Параметры.ЗагрузкаПредопределенных Тогда
		ПараметрыПроцедуры.Вставить("КлючНастроекДокументов", ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор());
	КонецЕсли;
	
	ПараметрыПроцедуры.Вставить("ДанныеФайла", ПолучитьИзВременногоХранилища(АдресХраненияФайла));
	
	СтруктураИмениФайла = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ИмяФайла);
	
	Если ФайлПолученИзРепозитория И СтруктураИмениФайла.Расширение <> ".zip" Тогда
		
		ВременныйКаталог = Неопределено;
		
		Попытка
			
			ВременныйКаталог = ФайловаяСистема.СоздатьВременныйКаталог();
			
			ИмяФайла = SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(ВременныйКаталог, ИмяФайла);
			ПараметрыПроцедуры.ДанныеФайла.Записать(ИмяФайла);
			
			ФайлАрхив = Новый ЗаписьZipФайла();
			ФайлАрхив.Добавить(ИмяФайла, 
				РежимСохраненияПутейZIP.СохранятьОтносительныеПути, 
				РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
			ПараметрыПроцедуры.ДанныеФайла = ФайлАрхив.ПолучитьДвоичныеДанные(, , 
				МетодСжатияZIP.Сжатие, УровеньСжатияZIP.Максимальный);
			
			ФайловаяСистема.УдалитьВременныйКаталог(ВременныйКаталог);
			ВременныйКаталог = Неопределено;
			
		Исключение
			Если ЗначениеЗаполнено(ВременныйКаталог) Тогда
				ФайловаяСистема.УдалитьВременныйКаталог(ВременныйКаталог);
			КонецЕсли;
			ВызватьИсключение;
		КонецПопытки;
		
	КонецЕсли;
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"Обработки.SUI_ВыгрузкаЗагрузкаНастроек.ЗагрузитьМанифестНастроекВДеревоВФоне", 
		ПараметрыПроцедуры, ПараметрыВыполненияВФоне);
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьИзФайлаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Результат.Сообщения) Тогда
		
		Для индекс = 0 По Результат.Сообщения.ВГраница() Цикл
			Результат.Сообщения[индекс].Сообщить();
		КонецЦикла;
		
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		РезультатВыполнения = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		
		Контекст = Новый Структура();
		Контекст.Вставить("КонфигурацииСписок", РезультатВыполнения.КонфигурацииСписок);
		Контекст.Вставить("АдресДереваНастроек", РезультатВыполнения.АдресДереваНастроек);
		
		Оповещение = Новый ОписаниеОповещения("ЗагрузитьИзФайлаПослеВыбораКонфигурации", ЭтотОбъект, Контекст);
		
		Если Контекст.КонфигурацииСписок.Количество() = 1 Тогда
			ВыполнитьОбработкуОповещения(Оповещение, Контекст.КонфигурацииСписок[0]);
		Иначе
			ЗаголовокВыбора = НСтр("ru = 'Выберите конфигурацию для загрузки'");
			Контекст.КонфигурацииСписок.ПоказатьВыборЭлемента(Оповещение, ЗаголовокВыбора, Элементы.ДеревоНастройки);
		КонецЕсли;
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение(, СтрШаблон(НСтр("ru = 'Возникла ошибка при чтении файла настроек.
		|%1'"), Результат.КраткоеПредставлениеОшибки));
	Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'Не удалось получить результат чтения файла настроек.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайлаПослеВыбораКонфигурации(ВыбранныйЭлемент, Контекст) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьИзФайлаЗавершениеНаСервере(ВыбранныйЭлемент.Значение, Контекст.АдресДереваНастроек);
	
	ЭлементыДерева = ДеревоНастройки.ПолучитьЭлементы();
	
	ЭлементыДерева[0].Пометка = 1;
	ПроставитьПометкиВниз(ЭлементыДерева[0]);
	ПроставитьПометкиВверх(ЭлементыДерева[0]);
	Элементы.ДеревоНастройки.Развернуть(ЭлементыДерева[0].ПолучитьИдентификатор(), Истина);
	
	ОбновитьВидимостьЭлементовФормы();
	
	Элементы.РежимВыгрузки.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзФайлаЗавершениеНаСервере(ВыбранныйКонфигурацияHEX, АдресДереваНастроек)
	
	Дерево = ПолучитьИзВременногоХранилища(АдресДереваНастроек);
	
	УдалитьИзВременногоХранилища(АдресДереваНастроек);
	
	Для Каждого СтрокаДерева Из Дерево.Строки Цикл
		
		Если СтрокаДерева.КонфигурацияHEX <> ВыбранныйКонфигурацияHEX Тогда
			Дерево.Строки.Удалить(СтрокаДерева);
		КонецЕсли;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Дерево, "ДеревоНастройки");
	
КонецПроцедуры

#КонецОбласти

#Область ЗаписьНастроек

&НаКлиенте
Процедура ЗаписатьНастройкиПродолжить(Результат, Контекст) Экспорт
	
	Если Не ЭтоАдресВременногоХранилища(АдресЗагружаемыйФайл) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	ПараметрыОжидания.Заголовок = НСтр("ru = 'Запись настроек'");
	
	ДлительнаяОперация = ЗаписатьНастройкиНаСервере();
	
	ОписаниеТипаМассив = Новый ОписаниеТипов("Массив");
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаписатьНастройкиЗавершение", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьНастройкиНаСервере()
	
	ПараметрыПроцедуры = Новый Структура();
	ПараметрыПроцедуры.Вставить("ДеревоНастройки", РеквизитФормыВЗначение("ДеревоНастройки"));
	ПараметрыПроцедуры.Вставить("ДанныеФайла", ПолучитьИзВременногоХранилища(АдресЗагружаемыйФайл));
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Обработки.SUI_ВыгрузкаЗагрузкаНастроек.ЗаписатьВыбранныеНастройкиВФоне", 
		ПараметрыПроцедуры, ПараметрыВыполненияВФоне);
	
КонецФункции

&НаКлиенте
Процедура ЗаписатьНастройкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Результат.Сообщения) Тогда
		
		Для индекс = 0 По Результат.Сообщения.ВГраница() Цикл
			Результат.Сообщения[индекс].Сообщить();
		КонецЦикла;
		
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		ЗаписатьНастройкиЗавершениеНаСервере(Результат.АдресРезультата);
		
		ЭлементыДерева = ДеревоНастройки.ПолучитьЭлементы();
		
		ОбластьНастроекДокументов = НайтиЭлементВДеревеПоЗначениюВКолонке(
			"Область", КлючОбластиНастройкиДокументов(), ЭлементыДерева);
		
		Если ОбластьНастроекДокументов <> Неопределено И ОбластьНастроекДокументов.Пометка > 0 Тогда
			ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъектов(Тип("СправочникСсылка.SUI_НастройкиДокументовОбмена"));
		КонецЕсли;
		
		Если Параметры.ЗакрытьПослеЗаписи Тогда
			Закрыть(ПодготовитьРезультатЗакрытияПослеЗаписи(ЭлементыДерева));
		Иначе
			
			ЭлементыДерева[0].Пометка = 0;
			ПроставитьПометкиВниз(ЭлементыДерева[0]);
			ПроставитьПометкиВверх(ЭлементыДерева[0]);
			Элементы.ДеревоНастройки.Развернуть(ЭлементыДерева[0].ПолучитьИдентификатор(), Истина);
			
			ОбновитьВидимостьЭлементовФормы();
			
		КонецЕсли;
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение(, СтрШаблон(НСтр("ru = 'Возникла ошибка при записи настроек.
		|%1'"), Результат.КраткоеПредставлениеОшибки));
	Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'Не удалось получить результат записи настроек.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкиЗавершениеНаСервере(АдресРезультата)
	
	ЗначениеВРеквизитФормы(ПолучитьИзВременногоХранилища(АдресРезультата), "ДеревоНастройки");
	
КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаНастроекИзРепозитория

&НаКлиентеНаСервереБезКонтекста
Функция КаталогПредопределенныхНастроек()
	Возврат "SettingsStorage/Predefined";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьМанифестПредопределенныхНастроекИзРепозитория(КаталогПредопределенных, АдресХранения)
	
	#Если ВебКлиент Тогда
		ВызватьИсключение НСтр("ru = 'Недопустимый вызов в веб клиенте'");
	#Иначе
		
		Результат = Новый Структура();
		Результат.Вставить("Ошибка", "");
		Результат.Вставить("Хранение", "");
		Результат.Вставить("Имя", "");
		
		Попытка
			
			РезультатПолучения = SUI_РепозиторийРасширенияКлиентСервер.ПолучитьФайлРепозитория(
				КаталогПредопределенных + "/manifest.xml");
			
			ОбщегоНазначенияКлиентСервер.Проверить(Не ПустаяСтрока(РезультатПолучения.Имя),
				НСтр("ru = 'Файл манифест поврежден.'"),
				"Обработка.SUI_ВыгрузкаЗагрузкаНастроек.Форма");
			
			ФайлМанифест = ПолучитьДвоичныеДанныеИзBase64Строки(РезультатПолучения.Данные);
			
			Результат.Имя = РезультатПолучения.Имя;
			Результат.Хранение = ПоместитьВоВременноеХранилище(ФайлМанифест, АдресХранения);
			
		Исключение
			Ошибка = ИнформацияОбОшибке();
			SUI_РепозиторийРасширенияКлиентСервер.ЗаписатьОшибкуОбращенияКРепозиторию(
				Ошибка, НСтр("ru = 'Получение настроек'"));
			Результат.Ошибка = СтрШаблон(НСтр("ru = 'Не удалось получить предопределенные настройки из репозитория.
			|Обратитесь к поставщику обновлений %1'"), SUI_SimpleКлиентСервер.Представление());
		КонецПопытки;
		
		Возврат Результат;
		
	#КонецЕсли
	
КонецФункции

&НаСервере
Функция ПолучитьМанифестПредопределенныхНастроекИзРепозиторияЧерезСервер(КаталогПредопределенных, АдресХранения)
	
	Возврат ПолучитьМанифестПредопределенныхНастроекИзРепозитория(КаталогПредопределенных, АдресХранения);
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьОтмеченныеНастройкиИзРепозитория(ОповещениеОЗавершении)
	
	Файлы = Новый Соответствие();
	НеПолученныеНастройки = Новый Массив();
	
	РезультатПолучения = SUI_РепозиторийРасширенияКлиентСервер.ПолучитьФайлРепозитория(
		КаталогПредопределенныхНастроек() + "/manifest.xml");
	ОбщегоНазначенияКлиентСервер.Проверить(Не ПустаяСтрока(РезультатПолучения.Имя),
		НСтр("ru = 'Файл манифест поврежден.'"),
		"Обработка.SUI_ВыгрузкаЗагрузкаНастроек.Форма");	
	Файлы.Вставить("manifest.xml", РезультатПолучения.Данные);
	
	Для Каждого ЭлементКонфигурация Из ДеревоНастройки.ПолучитьЭлементы() Цикл
		
		Если ЭлементКонфигурация.Пометка = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		КонфигурацияПуть = SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(
			ЭлементКонфигурация.КонфигурацияИмяEN, ЭлементКонфигурация.КонфигурацияВерсия);
		
		Для Каждого ЭлементОбласть Из ЭлементКонфигурация.ПолучитьЭлементы() Цикл
			
			Если ЭлементОбласть.Пометка = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ОбластьПуть = SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(КонфигурацияПуть, ЭлементОбласть.Область);
			
			Для Каждого ЭлементНастройка Из ЭлементОбласть.ПолучитьЭлементы() Цикл
				
				Если ЭлементНастройка.Пометка <> 1 Тогда
					Продолжить;
				КонецЕсли;
				
				ПутьКФайлу = SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(
					ОбластьПуть, Строка(ЭлементНастройка.НастройкаID) + ".xml");
				
				Попытка
					РезультатПолучения = SUI_РепозиторийРасширенияКлиентСервер.ПолучитьФайлРепозитория(
						КаталогПредопределенныхНастроек() + "/" + ПутьКФайлу);
					Файлы.Вставить(ПутьКФайлу, РезультатПолучения.Данные);
				Исключение
					ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(
						НСтр("ru = 'Не удалось получить настройку %1 (%2) из репозитория.'"),
						ЭлементНастройка.НастройкаНаименование, ЭлементНастройка.КонфигурацияСиноним), , 
						"ДеревоНастройки");
					ЭлементНастройка.Пометка = 0;
				КонецПопытки;
				
			КонецЦикла;
			
		КонецЦикла;
		
		Прервать;
		
	КонецЦикла;
	
	АдресХранения = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	АдресЗагружаемыйФайл = СформироватьАрхивНастроекПослеЗагрузкиФайловИзРепозитория(Файлы, АдресХранения);
	
	ВыполнитьОбработкуОповещения(ОповещениеОЗавершении);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьАрхивНастроекПослеЗагрузкиФайловИзРепозитория(Файлы, АдресХранения)
	
	Перем ВременныйКаталог;
	
	Попытка
		
		ВременныйКаталог = ФайловаяСистема.СоздатьВременныйКаталог();
		
		Для Каждого ЭлементФайл Из Файлы Цикл
			
			ДанныеФайла = ПолучитьДвоичныеДанныеИзBase64Строки(ЭлементФайл.Значение);
			Путь = SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(ВременныйКаталог, ЭлементФайл.Ключ);
			ДанныеФайла.Записать(Путь);
			
		КонецЦикла;
		
		ФайлАрхив = Новый ЗаписьZipФайла();
		ФайлАрхив.Добавить(SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(ВременныйКаталог, "*.*"), 
			РежимСохраненияПутейZIP.СохранятьОтносительныеПути, 
			РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
		ФайлАрхив = ФайлАрхив.ПолучитьДвоичныеДанные(, , МетодСжатияZIP.Сжатие, УровеньСжатияZIP.Максимальный);
		
		ПоместитьВоВременноеХранилище(ФайлАрхив, АдресХранения);
		
		ФайловаяСистема.УдалитьВременныйКаталог(ВременныйКаталог);
		ВременныйКаталог = Неопределено;
		
	Исключение
		Если ЗначениеЗаполнено(ВременныйКаталог) Тогда
			ФайловаяСистема.УдалитьВременныйКаталог(ВременныйКаталог);
		КонецЕсли;
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат АдресХранения;
	
КонецФункции

#КонецОбласти

&НаКлиенте
Процедура ДеревоНастройкиПередНачаломДобавленияПослеВыбораОбласти(ВыбраннаяОбласть, Контекст) Экспорт
	
	Если ВыбраннаяОбласть = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбраннаяОбласть.Значение = КлючОбластиПользовательскиеЗапросы() Тогда
		ЗаполнитьВсеПользовательскиеЗапросы();
		Возврат;
	КонецЕсли;
	
	Контекст.Вставить("ОбластьИзСписка", ВыбраннаяОбласть);
	ИмяФормыВыбора = ПолучитьИмяФормыВыбораЗначенияПоКлючуОбласти(ВыбраннаяОбласть.Значение);
	
	Если ИмяФормыВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормыВыбора = Новый Структура();
	ПараметрыФормыВыбора.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормыВыбора.Вставить("МножественныйВыбор", Ложь);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ДеревоНастройкиПередНачаломДобавленияПослеВыбораЗначения", ЭтотОбъект, Контекст);
	
	ОткрытьФорму(ИмяФормыВыбора, ПараметрыФормыВыбора, ЭтотОбъект, УникальныйИдентификатор, , , ОповещениеОЗавершении, 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНастройкиПередНачаломДобавленияПослеВыбораЗначения(ВыбранноеЗначение, Контекст) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбластьИзСписка = Неопределено;
	
	Если Контекст.Свойство("ОбластьИзСписка") Тогда
		
		ОбластьИзСписка = Контекст.ОбластьИзСписка;
		ОбластьЭлемент = НайтиЭлементВДеревеПоЗначениюВКолонке("Область", ОбластьИзСписка.Значение, 
			ДеревоНастройки.ПолучитьЭлементы());
		
		Если ОбластьЭлемент = Неопределено Тогда
			
			ОбластьЭлемент = ДеревоНастройки.ПолучитьЭлементы().Добавить();
			ОбластьЭлемент.Область = ОбластьИзСписка.Значение;
			ОбластьЭлемент.Представление = ОбластьИзСписка.Представление;
			
		КонецЕсли;
		
	Иначе
		Возврат;
	КонецЕсли;
	
	ЭлементыОбласти = ОбластьЭлемент.ПолучитьЭлементы();
	
	Если ОбластьИзСписка = Неопределено Тогда
		Возврат;
	ИначеЕсли ОбластьИзСписка.Значение = КлючОбластиНастройкиДокументов() Тогда
		
		НайденныйЭлемент = НайтиЭлементВДеревеПоЗначениюВКолонке("НастройкаID", ВыбранноеЗначение.УникальныйИдентификатор(), ЭлементыОбласти);
		
		Если НайденныйЭлемент <> Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		РеквизитыВыбранногоЗначения = ПолучитьЗначенияРеквизитовОбъекта(ВыбранноеЗначение, "Наименование,ИмяМетаданныхДокумента,Комментарий");
		
		НовыйЭлемент = ЭлементыОбласти.Добавить();
		
		НовыйЭлемент.НастройкаID = ВыбранноеЗначение.УникальныйИдентификатор();
		НовыйЭлемент.НастройкаКлюч = ВыбранноеЗначение;
		НовыйЭлемент.НастройкаНаименование = РеквизитыВыбранногоЗначения.Наименование;
		НовыйЭлемент.НастройкаОписание = РеквизитыВыбранногоЗначения.Комментарий;
		НовыйЭлемент.ЭтоНастройкаДокумента = Истина;
		НовыйЭлемент.СопоставленнаяНастройка = ВыбранноеЗначение;
		
		ЗаполнитьПредствлениеЭлементаДерева(НовыйЭлемент, "НастройкаКлюч");
		
	ИначеЕсли ОбластьИзСписка.Значение = КлючОбластиНастройкиТаблиц() Тогда
		
		НайденныйЭлемент = НайтиЭлементВДеревеПоЗначениюВКолонке("НастройкаКлюч", ВыбранноеЗначение, ЭлементыОбласти);
		
		Если НайденныйЭлемент <> Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		НовыйЭлемент = ЭлементыОбласти.Добавить();
		НовыйЭлемент.НастройкаID = Новый УникальныйИдентификатор();
		НовыйЭлемент.НастройкаКлюч = ВыбранноеЗначение;
		НовыйЭлемент.НастройкаНаименование = СтрШаблон("%1 (%2)", ВыбранноеЗначение.ТаблицаИнтеграции, ВыбранноеЗначение.ИмяОбъектаКонфигурации);
		
		ЗаполнитьПредствлениеЭлементаДерева(НовыйЭлемент, "НастройкаНаименование");
		
	ИначеЕсли ОбластьИзСписка.Значение = КлючОбластиДополнительныхНастроекТаблиц() Тогда
		
		НайденныйЭлемент = НайтиЭлементВДеревеПоЗначениюВКолонке("НастройкаКлюч", ВыбранноеЗначение, ЭлементыОбласти);
		
		Если НайденныйЭлемент <> Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		НовыйЭлемент = ЭлементыОбласти.Добавить();
		НовыйЭлемент.НастройкаID = Новый УникальныйИдентификатор();
		НовыйЭлемент.НастройкаКлюч = ВыбранноеЗначение;
		НовыйЭлемент.НастройкаНаименование = ВыбранноеЗначение.ТаблицаИнтеграции;
		
		ЗаполнитьПредствлениеЭлементаДерева(НовыйЭлемент, "НастройкаНаименование");
		
	Иначе
		Возврат;
	КонецЕсли;
	
	НовыйЭлемент.Пометка = 1;
	
	ПроставитьПометкиВниз(НовыйЭлемент);
	ПроставитьПометкиВверх(НовыйЭлемент);
	
	Элементы.ДеревоНастройки.Развернуть(ОбластьЭлемент.ПолучитьИдентификатор(), Истина);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьИмяФормыВыбораЗначенияПоКлючуОбласти(КлючОбласти)
	
	Если КлючОбласти = КлючОбластиНастройкиДокументов() Тогда
		Возврат "Справочник.SUI_НастройкиДокументовОбмена.ФормаВыбора";
	ИначеЕсли КлючОбласти = КлючОбластиНастройкиТаблиц() Тогда
		Возврат "РегистрСведений.SUI_НастройкиТаблицИнтеграции.Форма.ФормаВыбора";
	ИначеЕсли КлючОбласти = КлючОбластиДополнительныхНастроекТаблиц() Тогда
		Возврат "РегистрСведений.SUI_ДополнительныеНастройкиТаблицИнтеграции.Форма.ФормаВыбора";
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЗначенияРеквизитовОбъекта(ОбъектСсылка, Реквизиты)
	УстановитьПривилегированныйРежим(Истина);
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОбъектСсылка, Реквизиты)
КонецФункции

&НаКлиенте
Функция ПодготовитьРезультатЗакрытияПослеЗаписи(ЭлементыДерева = Неопределено)
	
	Результат = Неопределено;
	
	Если ЭлементыДерева = Неопределено Тогда
		ЭлементыДерева = ДеревоНастройки.ПолучитьЭлементы();
	КонецЕсли;
	
	Для Каждого ЭлементОписаниеКонфигурации Из ЭлементыДерева Цикл
		
		Если ЭлементОписаниеКонфигурации.Пометка = 0 Тогда
			Продолжить;
		ИначеЕсли Результат = Неопределено Тогда
			Результат = Новый Структура();
		КонецЕсли;
		
		Для Каждого ЭлементОбласть Из ЭлементОписаниеКонфигурации.ПолучитьЭлементы() Цикл
			
			Если ЭлементОбласть.Пометка = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Если Не Результат.Свойство(ЭлементОбласть.Область) Тогда
				Результат.Вставить(ЭлементОбласть.Область, Новый Структура());
			КонецЕсли;
			
			Для Каждого ЭлементОбласти Из ЭлементОбласть.ПолучитьЭлементы() Цикл
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
