
#Область ОписаниеПеременных

&НаСервере
Перем МетаданныеТЧ, ПараметрыИдентификацииТЧ;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МетаданныеДокумента = Метаданные.Документы.Найти(SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		Параметры, "ИмяОбъектаМетаданных", "", Тип("Строка")));
		
	Если МетаданныеДокумента <> Неопределено Тогда
		
		НаименованиеДокумента = МетаданныеДокумента.Синоним;
		
		МетаданныеТЧ = МетаданныеДокумента.ТабличныеЧасти.Найти(SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			Параметры, "ИмяТабличнойЧасти", "", Тип("Строка")));
			
	КонецЕсли;
	
	ПараметрыИдентификацииТЧ = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			Параметры, "ПараметрыИдентификацииСтрокТЧ", Новый Структура(), Тип("Структура"));
	
	ИнициализироватьФормуПриСоздании(Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СменитьСтраницуНастройкиРеквизитовИдентификацииСтрок();
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)

	Если ТипИдентификацииСтроки = Перечисления.SUI_ТипыИдентификацииСтрокТЧ.ПоРеквизиту Тогда
		ПроверяемыеРеквизиты.Добавить("РеквизитИдентификацииСтроки");
	ИначеЕсли ТипИдентификацииСтроки = Перечисления.SUI_ТипыИдентификацииСтрокТЧ.ПоСовокупностиРеквизитов Тогда
		ПроверяемыеРеквизиты.Добавить("ВыбранныеРеквизитыИдентификацииСтроки");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипИдентификацииСтрокиПриИзменении(Элемент)
	СменитьСтраницуНастройкиРеквизитовИдентификацииСтрок();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВыбранныеРеквизитыИдентификацииСтроки

&НаКлиенте
Процедура ВыбранныеРеквизитыИдентификацииСтрокиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыИдентификацииСтрокиВыбор(Элемент.ТекущиеДанные.Значение, Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДоступныеРеквизитыИдентификацииСтрок

&НаКлиенте
Процедура ДоступныеРеквизитыИдентификацииСтрокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыИдентификацииСтрокиВыбор(Элемент.ТекущиеДанные.Значение);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьВВыбранныеРеквизитыИдентификацииСтроки(Команда)
	
	Если Команда.ИспользуемаяТаблица.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыИдентификацииСтрокиВыбор(Команда.ИспользуемаяТаблица.ТекущиеДанные.Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьИзВыбранныхРеквизитовИдентификацииСтроки(Команда)
	
	Если Команда.ИспользуемаяТаблица.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыИдентификацииСтрокиВыбор(Команда.ИспользуемаяТаблица.ТекущиеДанные.Значение, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранить(Команда)

	Если ПроверитьЗаполнение() Тогда
		
		ПараметрыЗакрытия = Новый Структура();
		ПараметрыЗакрытия.Вставить("ТипИдентификацииСтроки", ТипИдентификацииСтроки);
		ПараметрыЗакрытия.Вставить("РеквизитИдентификацииСтроки", РеквизитИдентификацииСтроки);
		ПараметрыЗакрытия.Вставить("РеквизитыИдентификацииСтроки", ВыбранныеРеквизитыИдентификацииСтроки.ВыгрузитьЗначения());
		
		Закрыть(ПараметрыЗакрытия);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьФормуПриСоздании(Отказ)
	
	Если МетаданныеТЧ = Неопределено Тогда
		SUI_ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не удалось определить метаданные табличной части документа.
		|Выполните настройку табличной части.'"), , , , Отказ);
		Возврат;
	КонецЕсли;
	
	НаименованиеТабличнойЧасти = МетаданныеТЧ.Синоним;
	
	ТипИдентификацииСтроки = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ПараметрыИдентификацииТЧ, "ТипИдентификацииСтроки");
	РеквизитИдентификацииСтроки = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ПараметрыИдентификацииТЧ, "РеквизитИдентификацииСтроки");
	РеквизитыИдентификацииСтроки = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ПараметрыИдентификацииТЧ, "РеквизитыИдентификацииСтроки", Новый Массив(), Тип("Массив"));
		
	Для Каждого МетаданныеРеквизитаТЧ Из МетаданныеТЧ.Реквизиты Цикл
		
		Элементы.РеквизитИдентификацииСтроки.СписокВыбора.Добавить(МетаданныеРеквизитаТЧ.Имя, МетаданныеРеквизитаТЧ.Синоним);
		
		Если РеквизитыИдентификацииСтроки.Найти(МетаданныеРеквизитаТЧ.Имя) <> Неопределено Тогда
			ВыбранныеРеквизитыИдентификацииСтроки.Добавить(МетаданныеРеквизитаТЧ.Имя, МетаданныеРеквизитаТЧ.Синоним);
		Иначе
			ДоступныеРеквизитыИдентификацииСтрок.Добавить(МетаданныеРеквизитаТЧ.Имя, МетаданныеРеквизитаТЧ.Синоним);
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы.РеквизитИдентификацииСтроки.СписокВыбора.СортироватьПоПредставлению();
	ВыбранныеРеквизитыИдентификацииСтроки.СортироватьПоПредставлению();
	ДоступныеРеквизитыИдентификацииСтрок.СортироватьПоПредставлению();
	
КонецПроцедуры

&НаКлиенте
Процедура СменитьСтраницуНастройкиРеквизитовИдентификацииСтрок()
	
	Если ТипИдентификацииСтроки = ПредопределенноеЗначение("Перечисление.SUI_ТипыИдентификацииСтрокТЧ.ПоРеквизиту") Тогда
		Элементы.СтраницыНастройкиРеквизитовИдентификации.ТекущаяСтраница = Элементы.СтраницыНастройкиРеквизитовИдентификацииПоРеквизиту;
	ИначеЕсли ТипИдентификацииСтроки = ПредопределенноеЗначение("Перечисление.SUI_ТипыИдентификацииСтрокТЧ.ПоСовокупностиРеквизитов") Тогда
		Элементы.СтраницыНастройкиРеквизитовИдентификации.ТекущаяСтраница = Элементы.СтраницыНастройкиРеквизитовИдентификацииПоСовокупностиРеквизитов;
	Иначе
		Элементы.СтраницыНастройкиРеквизитовИдентификации.ТекущаяСтраница = Элементы.СтраницыНастройкиРеквизитовИдентификацииПустая;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыИдентификацииСтрокиВыбор(Значение, ДобавитьВВыбор = Истина)
	
	ТаблицаИсточник = ?(ДобавитьВВыбор, "ДоступныеРеквизитыИдентификацииСтрок", "ВыбранныеРеквизитыИдентификацииСтроки");
	ТаблицаПриемник = ?(ДобавитьВВыбор, "ВыбранныеРеквизитыИдентификацииСтроки", "ДоступныеРеквизитыИдентификацииСтрок");
	
	НайденноеЗначение = ЭтотОбъект[ТаблицаИсточник].НайтиПоЗначению(Значение);
	Если НайденноеЗначение <> Неопределено Тогда
		
		ЭтотОбъект[ТаблицаПриемник].Добавить(НайденноеЗначение.Значение, НайденноеЗначение.Представление);
		ЭтотОбъект[ТаблицаИсточник].Удалить(НайденноеЗначение);
		
		ВыбранныеРеквизитыИдентификацииСтроки.СортироватьПоПредставлению();
		ДоступныеРеквизитыИдентификацииСтрок.СортироватьПоПредставлению();
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
