
#Область ОписаниеПеременных

&НаКлиенте
Перем РазрешенныеСимволы;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЭтоНовый = Параметры.Ключ.Пустая();
	
	Если ЭтоНовый Тогда
		Параметры.Свойство("ИмяОбъектаМетаданных", Объект.ИмяОбъектаМетаданных);
		Объект.Используется = Истина;
	КонецЕсли;
	
	ИнициализироватьФормуОбъекта();
	
	Элементы.ОткрытьАлгоритмПолученияПризнакаМаркировки.Видимость = Объект.ИспользуетсяМаркировка;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РазрешенныеСимволы = SUI_СтроковыеФункцииКлиентСервер.АлфавитБуквыЛатинские() 
		+ SUI_СтроковыеФункцииКлиентСервер.АлфавитБуквыРусские() 
		+ SUI_СтроковыеФункцииКлиентСервер.АлфавитЦифры() 
		+ "_";
	 
	ОбновитьОтображениеЭлементовФормыОбъекта();
	ОбновитьНадписьГиперссылкиАлгоритмОбработкиСтрок();
	ОбновитьНадписьГиперссылкиДополнительныйОбработчикДокументов();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Для Каждого СтрокаНастройкиТабличныхЧастей Из Объект.НастройкиТабличныхЧастей Цикл 
		
		НайденныеСтроки = Объект.СопоставлениеРеквизитовТабличныхЧастей.НайтиСтроки(
			Новый Структура("КлючСвязи", СтрокаНастройкиТабличныхЧастей.КлючСвязи));
			
		Если НайденныеСтроки.Количество() = 0 Тогда
			ОбщегоНазначения.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Для таблицы %1 не настроено сопоставление реквизитов.'"), СтрокаНастройкиТабличныхЧастей.ТипТаблицы), , 
				"НастройкиТабличныхЧастей", , Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
	// 20.09.2024 - artem - B119267 -
	Если Объект.ComputerVision Тогда
		
		ТекстОшибки = НСтр("ru = 'Документы адресного хранения не поддерживаются в процессе ""CV""'");
		
		ОтборСтрок = Новый Структура();
		ОтборСтрок.Вставить("ТипТаблицы", Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор);
		Если Объект.НастройкиТабличныхЧастей.НайтиСтроки(ОтборСтрок).Количество() > 0 Тогда
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "Объект.ComputerVision", , Отказ);
		КонецЕсли;
		
		Если Не Отказ Тогда
			ОтборСтрок.ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение;
			Если Объект.НастройкиТабличныхЧастей.НайтиСтроки(ОтборСтрок).Количество() > 0 Тогда
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "Объект.ComputerVision", , Отказ);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Объект.СоответствияРеквизитов.Очистить();
		
	Если ЗначениеЗаполнено(ИмяРеквизитаКонтрагент) Тогда
		
		НоваяСтрокаСоответствияРеквизитов = Объект.СоответствияРеквизитов.Добавить();
		
		НоваяСтрокаСоответствияРеквизитов.Ключ = "id_countragents";
		НоваяСтрокаСоответствияРеквизитов.Значение = ИмяРеквизитаКонтрагент;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИмяРеквизитаСклад) Тогда
		
		НоваяСтрокаСоответствияРеквизитов = Объект.СоответствияРеквизитов.Добавить();
		
		НоваяСтрокаСоответствияРеквизитов.Ключ = "id_warehouse";
		НоваяСтрокаСоответствияРеквизитов.Значение = ИмяРеквизитаСклад;
		
	КонецЕсли;
	
	Если ЭтоНовый Тогда
		
		Если Не ПараметрыЗаписи.Свойство("SUI_ЗаполнитьМобильныеУстройстваПриЗаписи") Тогда
			
			Отказ = Истина;
			ОповещениеОЗавершении = Новый ОписаниеОповещения("ВопросПередЗаписьюЗаполнитьМобильныхКлиентовЗавершение", 
				ЭтотОбъект, ПараметрыЗаписи);
			ПоказатьВопрос(ОповещениеОЗавершении, НСтр("ru = 'Заполнить мобильные устройства?'"), РежимДиалогаВопрос.ДаНет);
			
		КонецЕсли;
		
	Иначе
		
		Если Не ПараметрыЗаписи.Свойство("SUI_ВопросПроверкиВыгруженныхДанныхЗадан") Тогда
		
			Если КлючевыеПараметрыНастройкиИзменены() Тогда
				
				Если ЕстьВыгруженныеДокументыПоНастройке(Объект.Ссылка) Тогда
					
					Отказ = Истина;
			
					ОповещениеОЗавершении = Новый ОписаниеОповещения("ВопросПередЗаписьюЗавершение", ЭтотОбъект, ПараметрыЗаписи);
					
					ТекстВопроса = НСтр("ru = 'Были изменены ключевые параметры настройки. Перед сохранением будут удалены выгруженные данные связанные с текущей настройкой!
					|
					|Вы действительно хотите продолжить?'");
					
					ПоказатьВопрос(ОповещениеОЗавершении, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Нет, , КодВозвратаДиалога.Нет);
				
				КонецЕсли;
				
			КонецЕсли;

		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если КомпоновщикНастроек.Настройки.Отбор.Элементы.Количество() > 0 Тогда
		ТекущийОбъект.НастройкиСхемыКомпоновкиДанных = Новый ХранилищеЗначения(КомпоновщикНастроек.ПолучитьНастройки());
	Иначе
		ТекущийОбъект.НастройкиСхемыКомпоновкиДанных = Неопределено;
	КонецЕсли;

	ТекущийОбъект.ДополнительныеНастройки = Новый ХранилищеЗначения(ДополнительныеНастройки);
	
	ТекущийОбъект.НастройкиЗаполненияРеквизитовПередЗаписью.Очистить();
	
	Если УстановкаРеквизитов.Количество() Тогда
		
		Для Каждого РеквизитЗначение Из УстановкаРеквизитов Цикл
			Если РеквизитЗначение.РеквизитДокумента <> "" Тогда
				НоваяСтрокаНастройкиЗаполненияРеквизитовПередЗаписью = ТекущийОбъект.НастройкиЗаполненияРеквизитовПередЗаписью.Добавить();
				
				НоваяСтрокаНастройкиЗаполненияРеквизитовПередЗаписью.Ключ = РеквизитЗначение.РеквизитДокумента;
				НоваяСтрокаНастройкиЗаполненияРеквизитовПередЗаписью.Значение = Новый ХранилищеЗначения(РеквизитЗначение.Значение);		
				НоваяСтрокаНастройкиЗаполненияРеквизитовПередЗаписью.ПриРасхождении = РеквизитЗначение.ПриРасхождении;	
			КонецЕсли;
		КонецЦикла;	
		
	КонецЕсли;
	
	ТекущийОбъект.НастройкиСозданияДокументовНаОснованииПослеЗаписи.Очистить();
	
	Если СозданиеДокументов.Количество() Тогда
		
		Для Каждого РеквизитЗначение Из СозданиеДокументов Цикл 
			Если РеквизитЗначение.Документ <> "" И  РеквизитЗначение.ИмяМетаданныхДокумента <> ""   Тогда 
				НоваяСтрокаНастройкиСозданияДокументовНаОснованииПослеЗаписи = ТекущийОбъект.НастройкиСозданияДокументовНаОснованииПослеЗаписи.Добавить();		
				НоваяСтрокаНастройкиСозданияДокументовНаОснованииПослеЗаписи.Ключ = РеквизитЗначение.Документ;								
				НоваяСтрокаНастройкиСозданияДокументовНаОснованииПослеЗаписи.Значение = РеквизитЗначение.ИмяМетаданныхДокумента;
				НоваяСтрокаНастройкиСозданияДокументовНаОснованииПослеЗаписи.ПриРасхождении = РеквизитЗначение.ПриРасхождении;
				НоваяСтрокаНастройкиСозданияДокументовНаОснованииПослеЗаписи.Проводить = РеквизитЗначение.Проводить;
			КонецЕсли;	
		КонецЦикла;	
		
	КонецЕсли;
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("SUI_ЗаполнитьМобильныеУстройстваПриЗаписи",
		SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗаписи, "SUI_ЗаполнитьМобильныеУстройстваПриЗаписи", Ложь, Тип("Булево")));
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Окно.Содержимое.Количество() > 1 Тогда
		
		Окно.Содержимое[Окно.Содержимое.ВГраница()].Закрыть();
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		
	ИначеЕсли Модифицированность Тогда
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ПодтверждениеЗакрытияЗавершение", ЭтотОбъект);
		ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(ОповещениеОЗавершении, Отказ, ЗавершениеРаботы);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СинонимОбъектаМетаданныхОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	СинонимОбъектаМетаданныхОбработкаВыбораНаСервере(ВыбранноеЗначение);

	Элемент.ОбновитьТекстРедактирования();
	
КонецПроцедуры

&НаКлиенте
Процедура СинонимОбъектаМетаданныхПриИзменении(Элемент)

	Объект.СоответствияРеквизитов.Очистить();
	Объект.НастройкиТабличныхЧастей.Очистить();
	Объект.СопоставлениеРеквизитовТабличныхЧастей.Очистить();

	ИнициализироватьДополнительныеНастройки(Истина);
	
	ИмяРеквизитаКонтрагент = "";
	ИмяРеквизитаСклад = "";
	
	Модифицированность = Истина;
	
	ОбновитьОтображениеЭлементовФормыОбъекта();
	
КонецПроцедуры

&НаКлиенте
Процедура СостояниеДокументаПоУмолчаниюНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	СостояниеДокументаПоУмолчаниюНачалоВыбораНаСервере(ДанныеВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяРеквизитаКонтрагентПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяРеквизитаСкладПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользуетсяМаркировкаПриИзменении(Элемент)
	
	Элементы.ОткрытьАлгоритмПолученияПризнакаМаркировки.Видимость = Объект.ИспользуетсяМаркировка; 
	
	Если Объект.ИспользуетсяМаркировка И АлгоритмПолученияПризнакаМаркировки("ИзДокумента") = Неопределено Тогда
		АлгоритмПолученияПризнакаМаркировки("ИзДокумента", "Параметры.Результат = Истина;");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ComputerVisionПриИзменении(Элемент)
	
	// 20.09.2024 - artem - B119267 - 
	ОбновитьОтображениеЭлементовФормыОбъекта();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагружатьВДокумент1СПослеПолученияИзТСДПриИзменении(Элемент)
	
	ОбновитьОтображениеЭлементовФормыОбъекта();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздаватьДокументыНаТСДПриИзменении(Элемент)
	
	// 30.09.2024 - artem - В120927
	ОбновитьОтображениеЭлементовФормыОбъекта();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНастройкиТабличныхЧастей

&НаКлиенте
Процедура НастройкиТабличныхЧастейПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Не ЗначениеЗаполнено(Объект.ИмяОбъектаМетаданных) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбрано имя документа 1С'"), , 
			"Объект.СинонимОбъектаМетаданных", , Отказ);
	Иначе
		Отказ = Истина;
		ОткрытьНастройкиТабличнойЧасти(Строка(Новый УникальныйИдентификатор));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиТабличныхЧастейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элемент.ТекущиеДанные;
	
	Если Поле.Имя = "АлгоритмОбработкиСтрокПредставление" Тогда
		
		Если Не ЗначениеЗаполнено(Объект.ИмяОбъектаМетаданных) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				НСтр("ru = 'Не выбрано имя документа'"), , 
				"Объект.СинонимОбъектаМетаданных");
			Возврат;
		КонецЕсли;
		
		ПараметрыОткрытияРедактора = SUI_РедакторКодаКлиент.ПараметрыОткрытия(
			ДополнительныеНастройки.АлгоритмыОбработкиСтрокТабличныхЧастей.Получить(ТекДанные.ТипТаблицы));
		
		ПараметрыОткрытияРедактора.ЗапретРедактированияПриОткрытии = Не Модифицированность;
		ПараметрыОткрытияРедактора.Заголовок = СтрШаблон(НСтр("ru = 'Обработка строки табличной части ""%1""'"),
			ТекДанные.ИмяТабличнойЧасти);
		ПараметрыОткрытияРедактора.Описание = СтроковыеФункцииКлиент.ФорматированнаяСтрока(
			НСтр("ru = 'Алгоритм выполняемый после обновления данных в строке табличной части <span style=""color: ГиперссылкаЦвет"">%1</span> документа <span style=""color: ГиперссылкаЦвет"">%2</span>
			|или заполните предопределенным по кнопке <span style=""color: ГиперссылкаЦвет"">Предопределенный</span>'"), 
			ТекДанные.ИмяТабличнойЧасти, Объект.СинонимОбъектаМетаданных);
			
		ПараметрыПредопределенногоАлгоритма = Новый Структура();
		ПараметрыПредопределенногоАлгоритма.Вставить("ИмяОбъектаМетаданных", Объект.ИмяОбъектаМетаданных);
		
		Если ТекДанные.ТипТаблицы = ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.Товары") Тогда
			ПараметрыПредопределенногоАлгоритма.Вставить("ЭтоТовары");
		ИначеЕсли ТекДанные.ТипТаблицы = ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.Отбор") Тогда
			ПараметрыПредопределенногоАлгоритма.Вставить("ЭтоОтбор");
		ИначеЕсли ТекДанные.ТипТаблицы = ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.Размещение") Тогда
			ПараметрыПредопределенногоАлгоритма.Вставить("ЭтоРазмещение");
		ИначеЕсли ТекДанные.ТипТаблицы = ПредопределенноеЗначение("Перечисление.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок") Тогда
			ПараметрыПредопределенногоАлгоритма.Вставить("ЭтоШтрихкодыУпаковок");
		КонецЕсли;
		
		ПараметрыОткрытияРедактора.ПредопределенныйТекст = SUI_НастройкиДокументовКлиентСервер
			.ПолучитьПроизвольныйАлгоритмОбработкиСтрокДокумента(ПараметрыПредопределенногоАлгоритма);
		
		ДобавитьОписаниеПеременныхАлгоритмаОбработкиСтрок(
			ПараметрыОткрытияРедактора.ПользовательскиеОбъекты, 
			Объект.ИмяОбъектаМетаданных, 
			Объект.СинонимОбъектаМетаданных,
			ТекДанные.ИмяТабличнойЧасти);
		
		Контекст = Новый Структура();
		Контекст.Вставить("ТипТаблицы", ТекДанные.ТипТаблицы);
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ОткрытьАлгоритмОбработкиСтрокЗавершение", ЭтотОбъект, Контекст);
		ОткрытьРедакторКода(ОповещениеОЗавершении, ПараметрыОткрытияРедактора);
		
	ИначеЕсли Поле.Имя = "НастройкиТабличныхЧастейТипТаблицы" Или
		Поле.Имя = "НастройкиТабличныхЧастейИмяТабличнойЧасти" Тогда
		ОткрытьНастройкиТабличнойЧасти(ТекДанные.КлючСвязи);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НастройкиТабличныхЧастейПередУдалением(Элемент, Отказ)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НайденныйАлгоритм = ДополнительныеНастройки.АлгоритмыОбработкиСтрокТабличныхЧастей.Получить(
		Элемент.ТекущиеДанные.ТипТаблицы);
	
	Если НайденныйАлгоритм <> Неопределено Тогда
		ДополнительныеНастройки.АлгоритмыОбработкиСтрокТабличныхЧастей.Удалить(НайденныйАлгоритм);
		Модифицированность = Истина;
	КонецЕсли; 
	
	
	ПараметрИдентификацииСтрокТЧ = ДополнительныеНастройки.ПараметрыИдентификацииСтрокТЧ.Получить(
		Элемент.ТекущиеДанные.ТипТаблицы);
	
	Если ПараметрИдентификацииСтрокТЧ <> Неопределено Тогда
		ДополнительныеНастройки.ПараметрыИдентификацииСтрокТЧ.Удалить(ПараметрИдентификацииСтрокТЧ);
		Модифицированность = Истина;
	КонецЕсли;
	
	ПолучениеДопРеквизитовТЧ = ДополнительныеНастройки.ПолучениеДополнительныхРеквизитов.ИзТабличныхЧастей.Получить(
		Элемент.ТекущиеДанные.ТипТаблицы);
	Если ПолучениеДопРеквизитовТЧ <> Неопределено Тогда
		ДополнительныеНастройки.ПолучениеДополнительныхРеквизитов.ИзТабличныхЧастей.Удалить(ПолучениеДопРеквизитовТЧ);
		Модифицированность = Истина;
	КонецЕсли;
	
	НайденныйПризнакЗаписи = ДополнительныеНастройки.ПропускатьПриЗаписи.Получить(Элемент.ТекущиеДанные.ИмяТабличнойЧасти);
	
	Если НайденныйПризнакЗаписи <> Неопределено Тогда
		ДополнительныеНастройки.ПропускатьПриЗаписи.Удалить(НайденныйПризнакЗаписи);
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиТабличныхЧастейПослеУдаления(Элемент)
	НастройкиТабличныхЧастейПослеУдаленияНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура НастройкиТабличныхЧастейПропускатьПриЗаписиПриИзменении(Элемент)
	
	Если Элементы.НастройкиТабличныхЧастей.ТекущиеДанные <> Неопределено Тогда
		ДополнительныеНастройки.ПропускатьПриЗаписи.Вставить(Элементы.НастройкиТабличныхЧастей.ТекущиеДанные.ТипТаблицы, Элементы.НастройкиТабличныхЧастей.ТекущиеДанные.ПропускатьПриЗаписи);			
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановкаРеквизитовРеквизитДокументаОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	УстановитьТипЗначенияПоРеквизиту(ВыбранноеЗначение); 
КонецПроцедуры          

&НаКлиенте
Процедура СозданиеДокументовДокументОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	Если Элементы.СозданиеДокументов.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВыбранногоДокумента = СозданиеДокументовДокументОбработкаВыбораНаСервере(ВыбранноеЗначение);
	
	Модифицированность = Истина;
	
	Элементы.СозданиеДокументов.ТекущиеДанные.ИмяМетаданныхДокумента = СтруктураВыбранногоДокумента.Имя;	
	Элементы.СозданиеДокументов.ТекущиеДанные.Документ = СтруктураВыбранногоДокумента.Синоним;
	ДополнительныеНастройки.АлгоритмыОбработкиСозданияДокументаНаОсновании.Вставить(СтруктураВыбранногоДокумента.Имя, "");
    Элемент.ОбновитьТекстРедактирования();
	ОбновитьНадписьГиперссылкиДополнительныйОбработчикДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура СозданиеДокументовПередУдалением(Элемент, Отказ)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НайденныйОбработчик = ДополнительныеНастройки.АлгоритмыОбработкиСозданияДокументаНаОсновании.Получить(
		Элемент.ТекущиеДанные.ИмяМетаданныхДокумента);
	
	Если НайденныйОбработчик <> Неопределено Тогда
		ДополнительныеНастройки.АлгоритмыОбработкиСозданияДокументаНаОсновании.Удалить(Элемент.ТекущиеДанные.Документ);
		Модифицированность = Истина;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СозданиеДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элемент.ТекущиеДанные;
	
	Если Поле.Имя = "СозданиеДокументовОбработчик" Тогда
		
		Если Не ЗначениеЗаполнено(Объект.ИмяОбъектаМетаданных) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				НСтр("ru = 'Не выбрано имя документа'"), , 
				"Объект.СинонимОбъектаМетаданных");
			Возврат;
		КонецЕсли;
		
		ПараметрыОткрытияРедактора = SUI_РедакторКодаКлиент.ПараметрыОткрытия(
			ДополнительныеНастройки.АлгоритмыОбработкиСозданияДокументаНаОсновании.Получить(ТекДанные.Документ));
		
		ПараметрыОткрытияРедактора.ЗапретРедактированияПриОткрытии = Не Модифицированность;
		ПараметрыОткрытияРедактора.Заголовок = СтрШаблон(НСтр("ru = 'Создание на основании ""%1""'"),
			ТекДанные.Документ);
		ПараметрыОткрытияРедактора.Описание = СтроковыеФункцииКлиент.ФорматированнаяСтрока(
			НСтр("ru = 'Алгоритм заполнения документа <span style=""color: ГиперссылкаЦвет"">%1</span> созданного на основании документа <span style=""color: ГиперссылкаЦвет"">%2</span>.'"), 
				ТекДанные.Документ, Объект.СинонимОбъектаМетаданных);
		
		ДобавитьОписаниеПеременныхАлгоритмаСозданияНаОсновании(
			ПараметрыОткрытияРедактора.ПользовательскиеОбъекты, 
			ТекДанные.Документ, 
			ТекДанные.Документ);
		
		Контекст = Новый Структура();
		Контекст.Вставить("ИмяМетаданныхСоздаваемогоДокумента", ТекДанные.Документ);
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ОткрытьАлгоритмСозданиеНаОснованииЗавершение", 
			ЭтотОбъект, Контекст);
		ОткрытьРедакторКода(ОповещениеОЗавершении, ПараметрыОткрытияРедактора);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаВыводаДополнительныхПолейИмяНаУстройствеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка) 
	
	Элементы.НастройкаВыводаДополнительныхПолей.ТекущиеДанные.ИмяНаУстройстве = SUI_СтроковыеФункцииКлиентСервер.ПривестиСтрокуКРазрешеннымСимволам(Текст, РазрешенныеСимволы);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область ПереопределениеСтандартныхКоманад

//@skip-check module-structure-form-event-regions
//@skip-check module-unused-method
&НаКлиенте
Процедура SUI_ЗаписатьИЗакрыть(Команда)
 
	ПараметрыЗаписи = Новый Структура();
	ПараметрыЗаписи.Вставить("SUI_Закрыть");
	        
	Если Записать(ПараметрыЗаписи) Тогда
		Закрыть();
	КонецЕсли;
        
КонецПроцедуры

//@skip-check module-structure-form-event-regions
//@skip-check module-unused-method
&НаКлиенте
Процедура SUI_Записать(Команда)
 
	ПараметрыЗаписи = Новый Структура();
	
	Записать(ПараметрыЗаписи);
        
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОткрытьНастройкиОтбора(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ИмяОбъектаМетаданных) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо заполнить имя документа 1С'"), , 
			"СинонимОбъектаМетаданных", "Объект");
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытияНастроекОтбора = ПолучитьПараметрыОткрытияНастроекОтбора();
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("НастройкиОтбораПослеЗакрытия", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.SUI_НастройкиДокументов.Форма.ФормаНастройкиСхемыКомпоновкиДанных", ПараметрыОткрытияНастроекОтбора, ЭтотОбъект,,,,
		ОповещениеОЗавершении, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАлгоритмПередЗаписью(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ИмяОбъектаМетаданных) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Не выбрано имя документа'"), , 
			"Объект.СинонимОбъектаМетаданных");
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытияРедактора = SUI_РедакторКодаКлиент.ПараметрыОткрытия(
		ДополнительныеНастройки.ОбработчикиСобытий.ПередЗаписью);
	
	ПараметрыОткрытияРедактора.ЗапретРедактированияПриОткрытии = Не Модифицированность;
	ПараметрыОткрытияРедактора.Заголовок = СтрШаблон(НСтр("ru = 'Перед записью ""%1""'"),
		Объект.СинонимОбъектаМетаданных);
	ПараметрыОткрытияРедактора.Описание = СтроковыеФункцииКлиент.ФорматированнаяСтрока(
		НСтр("ru = 'Алгоритм выполняемый перед записью документа <span style=""color: ГиперссылкаЦвет"">%1</span>'"), 
		Объект.СинонимОбъектаМетаданных);
	
	ДобавитьОписаниеПеременныхАлгоритмаПередЗаписью(
		ПараметрыОткрытияРедактора.ПользовательскиеОбъекты, 
		Объект.ИмяОбъектаМетаданных, 
		Объект.СинонимОбъектаМетаданных);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОткрытьАлгоритмПередЗаписьюЗавершение", ЭтотОбъект);
	ОткрытьРедакторКода(ОповещениеОЗавершении, ПараметрыОткрытияРедактора);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАлгоритмПослеЗаписи(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ИмяОбъектаМетаданных) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Не выбрано имя документа'"), , 
			"Объект.СинонимОбъектаМетаданных");
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытияРедактора = SUI_РедакторКодаКлиент.ПараметрыОткрытия(
		ДополнительныеНастройки.ОбработчикиСобытий.ПослеЗаписи);
	
	ПараметрыОткрытияРедактора.ЗапретРедактированияПриОткрытии = Не Модифицированность;
	ПараметрыОткрытияРедактора.Заголовок = СтрШаблон(НСтр("ru = 'После записи ""%1""'"),
		Объект.СинонимОбъектаМетаданных);
	ПараметрыОткрытияРедактора.Описание = СтроковыеФункцииКлиент.ФорматированнаяСтрока(
		НСтр("ru = 'Алгоритм выполняемый после записи документа <span style=""color: ГиперссылкаЦвет"">%1</span>'"), 
		Объект.СинонимОбъектаМетаданных);
	
	ДобавитьОписаниеПеременныхАлгоритмаПослеЗаписи(
		ПараметрыОткрытияРедактора.ПользовательскиеОбъекты, 
		Объект.ИмяОбъектаМетаданных, 
		Объект.СинонимОбъектаМетаданных);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОткрытьАлгоритмПослеЗаписиЗавершение", ЭтотОбъект);
	ОткрытьРедакторКода(ОповещениеОЗавершении, ПараметрыОткрытияРедактора);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиИдентификацииСтрокТЧ(Команда)

	Если Элементы.НастройкиТабличныхЧастей.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ИмяОбъектаМетаданных) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбрано имя документа 1С'"), , 
			"Объект.СинонимОбъектаМетаданных");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Элементы.НастройкиТабличныхЧастей.ТекущиеДанные.ИмяТабличнойЧасти) Или
		Не СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(Элементы.НастройкиТабличныхЧастей.ТекущиеДанные.КлючСвязи) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбрана табличная часть'"), , 
			"Объект.НастройкиТабличныхЧастей");
		Возврат;
	КонецЕсли;
	
	ПараметрыИдентификацииСтрокТЧ = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеНастройки, 
		"ПараметрыИдентификацииСтрокТЧ", Новый Соответствие(), Тип("Соответствие"));
	
	ПараметрыЗавершенияОткрытия = Новый Структура("КлючСвязи, ТипТаблицы", 
		Элементы.НастройкиТабличныхЧастей.ТекущиеДанные.КлючСвязи,
		Элементы.НастройкиТабличныхЧастей.ТекущиеДанные.ТипТаблицы);
	
	ПараметрыОткрытияИдентификацииСтрок = Новый Структура();
	ПараметрыОткрытияИдентификацииСтрок.Вставить("ИмяОбъектаМетаданных", Объект.ИмяОбъектаМетаданных);
	ПараметрыОткрытияИдентификацииСтрок.Вставить("ИмяТабличнойЧасти", 
		Элементы.НастройкиТабличныхЧастей.ТекущиеДанные.ИмяТабличнойЧасти);
	ПараметрыОткрытияИдентификацииСтрок.Вставить("ПараметрыИдентификацииСтрокТЧ", 
		ПараметрыИдентификацииСтрокТЧ.Получить(ПараметрыЗавершенияОткрытия.ТипТаблицы));

	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОткрытьНастройкиИдентификацииСтрокТЧЗавершение", ЭтотОбъект,
		ПараметрыЗавершенияОткрытия);

	ОткрытьФорму("Справочник.SUI_НастройкиДокументов.Форма.ФормаНастройкиИдентификацииСтрокТЧ", 
		ПараметрыОткрытияИдентификацииСтрок, ЭтотОбъект, УникальныйИдентификатор, , , ОповещениеОЗавершении,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАлгоритмПолученияПризнакаМаркировки(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ИмяОбъектаМетаданных) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Не выбрано имя документа'"), , 
			"Объект.СинонимОбъектаМетаданных");
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытияРедактора = SUI_РедакторКодаКлиент.ПараметрыОткрытия(
		АлгоритмПолученияПризнакаМаркировки("ИзДокумента"));
	
	ПараметрыОткрытияРедактора.ЗапретРедактированияПриОткрытии = Не Модифицированность;
	ПараметрыОткрытияРедактора.Заголовок = НСтр("ru = 'Получение признака маркировки из документа'");
	ПараметрыОткрытияРедактора.Описание = СтроковыеФункцииКлиент.ФорматированнаяСтрока(
		НСтр("ru = 'Получение признака маркировки из документа <span style=""color: ГиперссылкаЦвет"">%1</span>.
		|<span style=""font:ВажнаяНадписьШрифт"">
		|Результат выполнения алгоритма необходимо присвоить в <span style=""color: ГиперссылкаЦвет"">Параметры.Результат</span></span>.'"), 
		Объект.СинонимОбъектаМетаданных);
	
	ДобавитьОписаниеПеременныхАлгоритмаПолученияПризнакаМаркировки(ПараметрыОткрытияРедактора.ПользовательскиеОбъекты,
		Объект.ИмяОбъектаМетаданных, Объект.СинонимОбъектаМетаданных);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОткрытьАлгоритмПолученияПризнакаМаркировкиЗавершение", ЭтотОбъект);
	ОткрытьРедакторКода(ОповещениеОЗавершении, ПараметрыОткрытияРедактора);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАлгоритмПолученияДополнительныхРеквизитов(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ИмяОбъектаМетаданных) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Не выбрано имя документа'"), , 
			"Объект.СинонимОбъектаМетаданных");
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытияРедактора = SUI_РедакторКодаКлиент.ПараметрыОткрытия(
		АлгоритмПолученияДополнительныхРеквизитов("ИзДокумента"));
	
	ПараметрыОткрытияРедактора.ЗапретРедактированияПриОткрытии = Не Модифицированность;
	ПараметрыОткрытияРедактора.Заголовок = НСтр("ru = 'Получение дополнительных реквизитов из документа'");
	ПараметрыОткрытияРедактора.Описание = СтроковыеФункцииКлиент.ФорматированнаяСтрока(
		НСтр("ru = 'Получение дополнительных реквизитов из документа <span style=""color: ГиперссылкаЦвет"">%1.</span>
		|<span style=""font:ВажнаяНадписьШрифт"">
		|Результат выполнения алгоритма необходимо присвоить в <span style=""color: ГиперссылкаЦвет"">Параметры.Результат</span></span>.'"), 
		Объект.СинонимОбъектаМетаданных);
	
	ДобавитьОписаниеПеременныхАлгоритмаПолученияДополнительныхРеквизитов(
		ПараметрыОткрытияРедактора.ПользовательскиеОбъекты, Объект.ИмяОбъектаМетаданных, Объект.СинонимОбъектаМетаданных);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОткрытьАлгоритмПолученияДополнительныхРеквизитовЗавершение", 
		ЭтотОбъект);
	ОткрытьРедакторКода(ОповещениеОЗавершении, ПараметрыОткрытияРедактора);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАлгоритмСозданияНовогоДокумента(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ИмяОбъектаМетаданных) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Не выбрано имя документа'"), , 
			"Объект.СинонимОбъектаМетаданных");
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытияРедактора = SUI_РедакторКодаКлиент.ПараметрыОткрытия(
		Объект.АлгоритмСозданияНовогоДокумента);
	
	ПараметрыОткрытияРедактора.ЗапретРедактированияПриОткрытии = Не Модифицированность;
	ПараметрыОткрытияРедактора.Заголовок = НСтр("ru = 'Алгоритм создания нового документа из ТСД'");
	ПараметрыОткрытияРедактора.Описание = СтроковыеФункцииКлиент.ФорматированнаяСтрока(
		НСтр("ru = 'Алгоритм заполнения нового документа %1 созданного на ТСД.'"), 
		Объект.СинонимОбъектаМетаданных);
	
	ДобавитьОписаниеПеременныхАлгоритмаСозданияНовогоДокумента(ПараметрыОткрытияРедактора.ПользовательскиеОбъекты,
		Объект.ИмяОбъектаМетаданных, Объект.СинонимОбъектаМетаданных);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОткрытьАлгоритмСозданияНовогоДокументаЗавершение", ЭтотОбъект);
	ОткрытьРедакторКода(ОповещениеОЗавершении, ПараметрыОткрытияРедактора);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПереопределениеСтандартныхКоманад

&НаСервере
Процедура ЗаменитьСтандартныеКнопкиКоманднойПанели()
	
	Если Элементы.Найти("ФормаЗаписатьИЗакрыть") <> Неопределено Тогда
		
		Элементы.ФормаЗаписатьИЗакрыть.Видимость = Ложь;
		
		SUI_ЗаписатьИЗакрытьКоманда = Команды.Добавить("SUI_ЗаписатьИЗакрыть");
		SUI_ЗаписатьИЗакрытьКоманда.Действие = "SUI_ЗаписатьИЗакрыть";
		
		SUI_ЗаписатьИЗакрытьЭлемент = Элементы.Добавить("SUI_ЗаписатьИЗакрыть" , Тип("КнопкаФормы"), Элементы.ФормаКоманднаяПанель);
		SUI_ЗаписатьИЗакрытьЭлемент.Заголовок = "Записать и закрыть";
		SUI_ЗаписатьИЗакрытьЭлемент.ИмяКоманды = SUI_ЗаписатьИЗакрытьКоманда.Имя;
		SUI_ЗаписатьИЗакрытьЭлемент.КнопкаПоУмолчанию = Истина;
		
		Элементы.Переместить(SUI_ЗаписатьИЗакрытьЭлемент, SUI_ЗаписатьИЗакрытьЭлемент.Родитель, Элементы.ФормаЗаписатьИЗакрыть);

	КонецЕсли;
	
	Если Элементы.Найти("ФормаЗаписать") <> Неопределено Тогда
		
		Элементы.ФормаЗаписать.Видимость = Ложь;
		
		SUI_ЗаписатьКоманда = Команды.Добавить("SUI_Записать");
		SUI_ЗаписатьКоманда.Действие = "SUI_Записать";
		
		SUI_ЗаписатьЭлемент = Элементы.Добавить("SUI_Записать" , Тип("КнопкаФормы"), Элементы.ФормаКоманднаяПанель);
		SUI_ЗаписатьЭлемент.Заголовок = "Записать";
		SUI_ЗаписатьЭлемент.ИмяКоманды = SUI_ЗаписатьКоманда.Имя;
		
		Элементы.Переместить(SUI_ЗаписатьЭлемент, SUI_ЗаписатьЭлемент.Родитель, Элементы.ФормаЗаписать);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеЗакрытияЗавершение(Результат = Неопределено, ДополнительныеПараметры) Экспорт
	
	ПараметрыЗаписи = Новый Структура();
	ПараметрыЗаписи.Вставить("SUI_Закрыть");
	
	Если Записать(ПараметрыЗаписи) Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПередЗаписьюЗавершение(Результат, ПараметрыЗаписи) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ПараметрыЗаписи.Вставить("SUI_ВопросПроверкиВыгруженныхДанныхЗадан");
		
		Если Записать(ПараметрыЗаписи) Тогда
			
			Если ПараметрыЗаписи.Свойство("SUI_Закрыть") Тогда
				Закрыть();
			КонецЕсли;
			
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ИнициализироватьФормуОбъекта()

	ЗаменитьСтандартныеКнопкиКоманднойПанели();
	
	НастройкиСхемыКомпоновкиДанных = Неопределено;
	
	Для Каждого МетаданныеДокумента Из Метаданные.Документы Цикл
	
		Элементы.СинонимОбъектаМетаданных.СписокВыбора.Добавить(МетаданныеДокумента.Имя, МетаданныеДокумента.Синоним);

	КонецЦикла;
	
	Если ЭтоНовый И ЗначениеЗаполнено(Объект.ИмяОбъектаМетаданных) Тогда
		
		Объект.СинонимОбъектаМетаданных = Объект.ИмяОбъектаМетаданных;
		
		Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
			Объект.Наименование = Объект.СинонимОбъектаМетаданных;
		КонецЕсли;
		
	КонецЕсли;
	
	ИнициализироватьСпискиВыбора();
	
	Если ЭтоНовый Тогда
		Объект.СостояниеДокументаПоУмолчанию = Перечисления.SUI_СостоянияДокументовОбмена.Новый;
	Иначе
		
		Для Каждого СоответствиеРеквизита Из Объект.СоответствияРеквизитов Цикл
			
			Если СоответствиеРеквизита.Ключ = "id_countragents" Тогда
				ИмяРеквизитаКонтрагент = СоответствиеРеквизита.Значение;
			КонецЕсли;
			
			Если СоответствиеРеквизита.Ключ = "id_warehouse" Тогда
				ИмяРеквизитаСклад = СоответствиеРеквизита.Значение;
			КонецЕсли;
			
		КонецЦикла;

		ТекущийОбъект = РеквизитФормыВЗначение("Объект", Тип("СправочникОбъект.SUI_НастройкиДокументов"));
		
		НастройкиСхемыКомпоновкиДанных = ТекущийОбъект.НастройкиСхемыКомпоновкиДанных.Получить();
		
		ДополнительныеНастройки = ТекущийОбъект.ДополнительныеНастройки.Получить();
		
		Для Каждого РеквизитЗначение Из ТекущийОбъект.НастройкиЗаполненияРеквизитовПередЗаписью Цикл
		
			СтрокаЗаполненияРеквизитов = УстановкаРеквизитов.Добавить();
			СтрокаЗаполненияРеквизитов.РеквизитДокумента = РеквизитЗначение.Ключ;
			СтрокаЗаполненияРеквизитов.Значение = РеквизитЗначение.Значение.Получить();
			СтрокаЗаполненияРеквизитов.ПриРасхождении = РеквизитЗначение.ПриРасхождении;
		
		КонецЦикла;
		
		Для Каждого РеквизитЗначение Из ТекущийОбъект.НастройкиСозданияДокументовНаОснованииПослеЗаписи Цикл
		
			СтрокаЗаполненияРеквизитов = СозданиеДокументов.Добавить();
			СтрокаЗаполненияРеквизитов.Документ = РеквизитЗначение.Ключ;
		    СтрокаЗаполненияРеквизитов.ИмяМетаданныхДокумента = РеквизитЗначение.Значение;								
		    СтрокаЗаполненияРеквизитов.ПриРасхождении = РеквизитЗначение.ПриРасхождении;								
		    СтрокаЗаполненияРеквизитов.Проводить = РеквизитЗначение.Проводить;								
		      
		КонецЦикла;
		
	КонецЕсли;

	ИнициализироватьДополнительныеНастройки();
	
	ИнициализироватьКомпоновщикНастроек(НастройкиСхемыКомпоновкиДанных);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьДополнительныеНастройки(Сбросить = Ложь)
	
	Если Сбросить Тогда
		ДополнительныеНастройки = Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(ДополнительныеНастройки) <> Тип("Структура") Тогда
		ДополнительныеНастройки = Новый Структура();
	КонецЕсли;
	
	Если Не ДополнительныеНастройки.Свойство("АлгоритмыОбработкиСтрокТабличныхЧастей") Или
		ТипЗнч(ДополнительныеНастройки.АлгоритмыОбработкиСтрокТабличныхЧастей) <> Тип("Соответствие") Тогда
		ДополнительныеНастройки.Вставить("АлгоритмыОбработкиСтрокТабличныхЧастей", Новый Соответствие());
	КонецЕсли;
	 
	Если Не ДополнительныеНастройки.Свойство("АлгоритмыОбработкиСозданияДокументаНаОсновании") Или
		ТипЗнч(ДополнительныеНастройки.АлгоритмыОбработкиСозданияДокументаНаОсновании) <> Тип("Соответствие") Тогда
		ДополнительныеНастройки.Вставить("АлгоритмыОбработкиСозданияДокументаНаОсновании", Новый Соответствие());
	КонецЕсли;
	
	Если Не ДополнительныеНастройки.Свойство("ОбработчикиСобытий") Или
		ТипЗнч(ДополнительныеНастройки.ОбработчикиСобытий) <> Тип("Структура") Тогда
		ДополнительныеНастройки.Вставить("ОбработчикиСобытий", Новый Структура());
	КонецЕсли;
	
	Если Не ДополнительныеНастройки.ОбработчикиСобытий.Свойство("ПередЗаписью") Или
		ТипЗнч(ДополнительныеНастройки.ОбработчикиСобытий.ПередЗаписью) <> Тип("Строка") Тогда
		ДополнительныеНастройки.ОбработчикиСобытий.Вставить("ПередЗаписью", "");
	КонецЕсли;
	
	Если Не ДополнительныеНастройки.ОбработчикиСобытий.Свойство("ПослеЗаписи") Или
		ТипЗнч(ДополнительныеНастройки.ОбработчикиСобытий.ПослеЗаписи) <> Тип("Строка") Тогда
		ДополнительныеНастройки.ОбработчикиСобытий.Вставить("ПослеЗаписи", "");
	КонецЕсли;
	
	Если Не ДополнительныеНастройки.Свойство("ПараметрыИдентификацииСтрокТЧ") Или
		ТипЗнч(ДополнительныеНастройки.ПараметрыИдентификацииСтрокТЧ) <> Тип("Соответствие") Тогда
		ДополнительныеНастройки.Вставить("ПараметрыИдентификацииСтрокТЧ", Новый Соответствие());
	КонецЕсли;
	
	Если Не ДополнительныеНастройки.Свойство("ПолучениеДополнительныхРеквизитов") Или
		ТипЗнч(ДополнительныеНастройки.ПолучениеДополнительныхРеквизитов) <> Тип("Структура") Тогда
		ДополнительныеНастройки.Вставить("ПолучениеДополнительныхРеквизитов", Новый Структура());
	КонецЕсли;
	
	Если Не ДополнительныеНастройки.ПолучениеДополнительныхРеквизитов.Свойство("ИзДокумента") Или
		ТипЗнч(ДополнительныеНастройки.ПолучениеДополнительныхРеквизитов.ИзДокумента) <> Тип("ФиксированнаяСтруктура") Тогда
		ДополнительныеНастройки.ПолучениеДополнительныхРеквизитов.Вставить("ИзДокумента", 
			Новый ФиксированнаяСтруктура(SUI_КонструкторЗапросаКлиентСервер.ДанныеКонструктора()));
	КонецЕсли;
	
	Если Не ДополнительныеНастройки.ПолучениеДополнительныхРеквизитов.Свойство("ИзТабличныхЧастей") Или
		ТипЗнч(ДополнительныеНастройки.ПолучениеДополнительныхРеквизитов.ИзТабличныхЧастей) <> Тип("Соответствие") Тогда
		ДополнительныеНастройки.ПолучениеДополнительныхРеквизитов.Вставить("ИзТабличныхЧастей", Новый Соответствие());
	КонецЕсли;
	
	Если Не ДополнительныеНастройки.Свойство("ПропускатьПриЗаписи") Или
		ТипЗнч(ДополнительныеНастройки.ПропускатьПриЗаписи) <> Тип("Соответствие") Тогда
		ДополнительныеНастройки.Вставить("ПропускатьПриЗаписи", Новый Соответствие());
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьСпискиВыбора()
	
	РеквизитыДокумента = Новый Массив;
	
	Если ЗначениеЗаполнено(Объект.ИмяОбъектаМетаданных) Тогда
		
		Для Каждого МетаданныеРеквизитаДокумента Из Метаданные.Документы[Объект.ИмяОбъектаМетаданных].Реквизиты Цикл
			РеквизитыДокумента.Добавить(МетаданныеРеквизитаДокумента.Имя);
		КонецЦикла;
		
	КонецЕсли;
	
	Элементы.ИмяРеквизитаКонтрагент.СписокВыбора.ЗагрузитьЗначения(РеквизитыДокумента);
	
	Элементы.ИмяРеквизитаСклад.СписокВыбора.ЗагрузитьЗначения(РеквизитыДокумента);
	
	//Сандалов_11.03.2024 11:50:25_++
	Элементы.УстановкаРеквизитовРеквизитДокумента.СписокВыбора.ЗагрузитьЗначения(РеквизитыДокумента);
	//Сандалов_11.03.2024 11:50:30_--
	//Сандалов_11.03.2024 11:50:25_++
	Элементы.НастройкаВыводаДополнительныхПолейРеквизитДокумета.СписокВыбора.ЗагрузитьЗначения(РеквизитыДокумента);
	//Сандалов_11.03.2024 11:50:30_--
	ИнициализироватьДокументыДляВводаНаОсновании();
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьКомпоновщикНастроек(Знач НастройкиСхемыКомпоновкиДанных = Неопределено)
	
	Если Не ЗначениеЗаполнено(Объект.ИмяОбъектаМетаданных) Тогда
		Возврат;
	КонецЕсли;
	
	СхемаКомпоновкиДанных = Справочники.SUI_НастройкиДокументов.СформироватьСхемуКомпоновкиДанных(Объект.ИмяОбъектаМетаданных);
	
	Если СхемаКомпоновкиДанных = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(НастройкиСхемыКомпоновкиДанных) = Тип("Строка") И ЭтоАдресВременногоХранилища(НастройкиСхемыКомпоновкиДанных) Тогда
		НастройкиСхемыКомпоновкиДанных = ПолучитьИзВременногоХранилища(НастройкиСхемыКомпоновкиДанных);
	КонецЕсли;
	
	Если ТипЗнч(НастройкиСхемыКомпоновкиДанных) = Тип("НастройкиКомпоновкиДанных") Тогда
		SUI_КомпоновкаДанныхСервер.ИнициализироватьКомпоновщикНастроек(КомпоновщикНастроек, СхемаКомпоновкиДанных, НастройкиСхемыКомпоновкиДанных);
	Иначе
		SUI_КомпоновкаДанныхСервер.ИнициализироватьКомпоновщикНастроек(КомпоновщикНастроек, СхемаКомпоновкиДанных);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеЭлементовФормыОбъекта()
	
	Если КомпоновщикНастроек.Настройки.Отбор.Элементы.Количество() = 0 Тогда
		Элементы.ОткрытьНастройкиОтбора.Заголовок = НСтр("ru = '<настройки отбора не установлены>'");
	Иначе
		Элементы.ОткрытьНастройкиОтбора.Заголовок = НСтр("ru = 'настройки отбора'");
	КонецЕсли;
	
	// Документ.SUI_СборШтрихкодов Начало
	ЭтоДокументСборШК = (Объект.ИмяОбъектаМетаданных = "SUI_СборШтрихкодов");
	Элементы.СтраницаНастройкиТабличныхЧастей.Видимость = Не ЭтоДокументСборШК;
	Элементы.ГруппаИспользуетсяМаркировка.Видимость = Не ЭтоДокументСборШК;
	Элементы.КонтролироватьДокумент.Видимость = Не ЭтоДокументСборШК;
	Элементы.ГрупповоеСканирование.Видимость = Не ЭтоДокументСборШК;
	Элементы.ГруппаСопоставлениеРеквизитов.Видимость = Не ЭтоДокументСборШК;
	Элементы.СтраницаСозданиеДокументовНаОсновании.Видимость = Не ЭтоДокументСборШК;
	// Документ.SUI_СборШтрихкодов Конец
	
	// 20.09.2024 - artem - B119267 -
	Элементы.Агрегация.Видимость = Объект.ComputerVision;
	
	Элементы.ЗавершатьДокумент1СПослеПолученияИзТСД.Видимость = Объект.ЗагружатьВДокумент1СПослеПолученияИзТСД;
	
	// 30.09.2024 - artem - В120927
	Элементы.ОткрытьАлгоритмСозданияНовогоДокумента.Видимость = Объект.СоздаватьДокументыНаТСД;
	
КонецПроцедуры

&НаСервере
Процедура СинонимОбъектаМетаданныхОбработкаВыбораНаСервере(ВыбранноеЗначение)

	МетаданныеДокумента = Метаданные.Документы.Найти(ВыбранноеЗначение);

	Если МетаданныеДокумента = Неопределено Тогда
		Объект.ИмяОбъектаМетаданных = "";
		Объект.СинонимОбъектаМетаданных = "";
	Иначе
		Объект.ИмяОбъектаМетаданных = МетаданныеДокумента.Имя;
		Объект.СинонимОбъектаМетаданных = МетаданныеДокумента.Синоним;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
		Объект.Наименование = Объект.СинонимОбъектаМетаданных;
	КонецЕсли;
	
	ИнициализироватьСпискиВыбора();
	
	ИнициализироватьКомпоновщикНастроек();

КонецПроцедуры

&НаСервере
Процедура СостояниеДокументаПоУмолчаниюНачалоВыбораНаСервере(ДанныеВыбора)
	
	ДанныеВыбора = Новый СписокЗначений();
	
	ДанныеВыбора.Добавить(Перечисления.SUI_СостоянияДокументовОбмена.Новый);
	ДанныеВыбора.Добавить(Перечисления.SUI_СостоянияДокументовОбмена.КВыгрузке);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиОтбораПослеЗакрытия(НастройкиСхемыКомпоновкиДанныхАдрес, ДополнительныеПараметры) Экспорт
	
	Если НастройкиСхемыКомпоновкиДанныхАдрес = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИнициализироватьКомпоновщикНастроек(НастройкиСхемыКомпоновкиДанныхАдрес);
	
	Модифицированность = Истина;
	
	ОбновитьОтображениеЭлементовФормыОбъекта();
	
КонецПроцедуры

&НаКлиенте
Процедура АлгоритмОбработкиСтрокПослеРедактирования(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Результат.Свойство("ИмяТабличнойЧасти") Или Не ЗначениеЗаполнено(Результат.ИмяТабличнойЧасти) Или
		Не Результат.Свойство("АлгоритмОбработкиСтрок") Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеНастройки.АлгоритмыОбработкиСтрокТабличныхЧастей.Вставить(Результат.ТипТаблицы, Результат.АлгоритмОбработкиСтрок);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Функция КлючевыеПараметрыНастройкиИзменены()
	
	//@skip-check reading-attribute-from-database
	Если Объект.ИмяОбъектаМетаданных <> Объект.Ссылка.ИмяОбъектаМетаданных Тогда
		Возврат Истина;
	КонецЕсли;
	
	//@skip-check reading-attribute-from-database
	СоответствияРеквизитовТабличныхЧастейИдентичны = ОбщегоНазначения.КоллекцииИдентичны(
		Объект.Ссылка.СоответствияРеквизитовТабличныхЧастей.Выгрузить(), 
		Объект.СоответствияРеквизитовТабличныхЧастей.Выгрузить(), 
		"ИмяТабличнойЧасти, ТипТаблицы, Ключ, Значение");
	
	Если Не СоответствияРеквизитовТабличныхЧастейИдентичны Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции

&НаСервереБезКонтекста
Функция ЕстьВыгруженныеДокументыПоНастройке(НастройкаСсылка)
	
	// TODO: Проверить наличие ссылки в регистре сведений RS_docs
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Функция ПолучитьПараметрыОткрытияНастроекОтбора()
	
	ПараметрыОткрытияНастроекОтбора = Новый Структура();
		
	ПараметрыОткрытияНастроекОтбора.Вставить("ИмяОбъектаМетаданных", Объект.ИмяОбъектаМетаданных);
	ПараметрыОткрытияНастроекОтбора.Вставить("НастройкиКомпоновкиДанных", КомпоновщикНастроек.ПолучитьНастройки());
	
	Возврат ПараметрыОткрытияНастроекОтбора;
	
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияФормыАлгоритма(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.ТипАлгоритма = "ОбработкаСтрокиТабличнойЧасти" Тогда
		ДополнительныеНастройки.АлгоритмыОбработкиСтрокТабличныхЧастей.Вставить(Результат.ТипТаблицы, Результат.Алгоритм);
	ИначеЕсли Результат.ТипАлгоритма = "ОбработкаСозданияДокументаНаОсновании" Тогда
		ДополнительныеНастройки.АлгоритмыОбработкиСозданияДокументаНаОсновании.Вставить(Результат.ИмяМетаданныхСоздаваемогоДокумента, Результат.Алгоритм);
	ИначеЕсли Результат.ТипАлгоритма = "ПередЗаписью" Тогда
		ДополнительныеНастройки.ОбработчикиСобытий.Вставить("ПередЗаписью", Результат.Алгоритм);
	ИначеЕсли Результат.ТипАлгоритма = "ПослеЗаписи" Тогда
		ДополнительныеНастройки.ОбработчикиСобытий.Вставить("ПослеЗаписи", Результат.Алгоритм);
	Иначе
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;

КонецПроцедуры

#Область НастройкиТабличныхЧастей

&НаКлиенте
Процедура ОткрытьНастройкиТабличнойЧасти(КлючСвязи)
	
	ПараметрыОткрытия = Новый Структура("КлючСвязи, ТипТаблицы, ИмяТабличнойЧасти", КлючСвязи);
	
	СтрокиНастройкиТЧ = Объект.НастройкиТабличныхЧастей.НайтиСтроки(Новый Структура("КлючСвязи", КлючСвязи));
		
	Если СтрокиНастройкиТЧ.Количество() = 1 Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыОткрытия, СтрокиНастройкиТЧ[0]);
	КонецЕсли;
	
	ПараметрыОткрытия.Вставить("ИмяДокумента", Объект.ИмяОбъектаМетаданных);
	ПараметрыОткрытия.Вставить("ДоступныеТипыТаблиц", ПолучитьДоступныеТипыТаблиц(ПараметрыОткрытия.ТипТаблицы));
	
	Если ПараметрыОткрытия.ДоступныеТипыТаблиц.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия.Вставить("СопоставленияРеквизитов", 
		ПолучитьСопоставленияРеквизитовТабличнойЧасти(ПараметрыОткрытия.КлючСвязи));
	
	// Дополнительные реквизиты
	ПараметрыОткрытия.Вставить("АлгоритмПолученияДополнительныхРеквизитов", АлгоритмПолученияДополнительныхРеквизитов(ПараметрыОткрытия.ТипТаблицы));
	
	// Использование признака маркировки
	ПараметрыОткрытия.Вставить("ИспользованиеМаркировки", Объект.ИспользуетсяМаркировка);
	ПараметрыОткрытия.Вставить("АлгоритмПолученияПризнакаМаркировки", АлгоритмПолученияПризнакаМаркировки(ПараметрыОткрытия.ТипТаблицы));
	ПараметрыОткрытия.Вставить("АлгоритмПолученияСтатусаУказанияСерии", АлгоритмПолученияСтатусаУказанияСерии(ПараметрыОткрытия.ТипТаблицы));

	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОткрытьНастройкиТабличнойЧастиЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.SUI_НастройкиДокументов.Форма.НастройкаТабличнойЧасти", ПараметрыОткрытия, ЭтотОбъект, 
		УникальныйИдентификатор, , , ОповещениеОЗавершении, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСопоставленияРеквизитовТабличнойЧасти(КлючСвязи)
	
	МассивСтрок = Объект.СопоставлениеРеквизитовТабличныхЧастей.НайтиСтроки(Новый Структура("КлючСвязи", КлючСвязи));
	
	Если МассивСтрок.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат ПоместитьВоВременноеХранилище(Объект.СопоставлениеРеквизитовТабличныхЧастей.Выгрузить(МассивСтрок));
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьДоступныеТипыТаблиц(ТекущийТипТаблицы)
	
	ДоступныеТипыТаблиц = Новый Массив();
	
	ИсключаемыеТипыТаблиц = Объект.НастройкиТабличныхЧастей.Выгрузить().ВыгрузитьКолонку("ТипТаблицы");
	
	Если ИсключаемыеТипыТаблиц.Найти(Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары) <> Неопределено Тогда
		ИсключаемыеТипыТаблиц.Добавить(Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор);
		ИсключаемыеТипыТаблиц.Добавить(Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение);
	ИначеЕсли ИсключаемыеТипыТаблиц.Найти(Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор) <> Неопределено Или
		ИсключаемыеТипыТаблиц.Найти(Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение) <> Неопределено Тогда
		ИсключаемыеТипыТаблиц.Добавить(Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИсключаемыеТипыТаблиц", ИсключаемыеТипыТаблиц);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	SUI_ТипыТаблицДокументовОбмена.Ссылка КАК Ссылка
		|ИЗ
		|	Перечисление.SUI_ТипыТаблицДокументовОбмена КАК SUI_ТипыТаблицДокументовОбмена
		|ГДЕ
		|	SUI_ТипыТаблицДокументовОбмена.Ссылка <> ЗНАЧЕНИЕ(Перечисление.SUI_ТипыТаблицДокументовОбмена.ПотокШтрихкодов)
		|	И НЕ SUI_ТипыТаблицДокументовОбмена.Ссылка В (&ИсключаемыеТипыТаблиц)";

	ДоступныеТипыТаблиц = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Если ТекущийТипТаблицы <> Неопределено Тогда
		ДоступныеТипыТаблиц.Добавить(ТекущийТипТаблицы);
	КонецЕсли;
	
	Возврат ОбщегоНазначенияКлиентСервер.СвернутьМассив(ДоступныеТипыТаблиц);
	
КонецФункции

&НаКлиенте
Процедура ОткрытьНастройкиТабличнойЧастиЗавершение(Результат, ДополнительныеПараметры) Экспорт 

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьНастройкиТабличнойЧастиЗавершениеНаСервере(Результат);
	
	// Признак использования маркировки
	АлгоритмПолученияПризнакаМаркировки(Результат.ТипТаблицы, Результат.АлгоритмПолученияПризнакаМаркировки);
	
	// Признак использования маркировки
	АлгоритмПолученияСтатусаУказанияСерии(Результат.ТипТаблицы, Результат.АлгоритмПолученияСтатусаУказанияСерии);
	
	// Дополнительные реквизиты
	АлгоритмПолученияДополнительныхРеквизитов(Результат.ТипТаблицы, Результат.АлгоритмПолученияДополнительныхРеквизитов);
	
	ОбновитьНадписьГиперссылкиАлгоритмОбработкиСтрок();
	
КонецПроцедуры

&НаСервере
Процедура ОткрытьНастройкиТабличнойЧастиЗавершениеНаСервере(Результат)
	
	НайденныеСтроки = Объект.НастройкиТабличныхЧастей.НайтиСтроки(Новый Структура("КлючСвязи", Результат.КлючСвязи));
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		СтрокаНастройкиТЧ = НайденныеСтроки[0];
		
		Если НайденныеСтроки.Количество() > 1 Тогда
			
			Для Индекс = 1 По НайденныеСтроки.ВГраница() Цикл
				Объект.НастройкиТабличныхЧастей.Удалить(НайденныеСтроки[Индекс]);
			КонецЦикла;
			 
		КонецЕсли;
		
	Иначе
		СтрокаНастройкиТЧ = Объект.НастройкиТабличныхЧастей.Добавить();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(СтрокаНастройкиТЧ, Результат);
	
	НайденныеСтроки = Объект.СопоставлениеРеквизитовТабличныхЧастей.НайтиСтроки(
		Новый Структура("КлючСвязи", Результат.КлючСвязи));
	
	Для Индекс = 1 По НайденныеСтроки.ВГраница() Цикл
		Объект.СопоставлениеРеквизитовТабличныхЧастей.Удалить(НайденныеСтроки[Индекс]);
	КонецЦикла;
	
	СопоставленияРеквизитов = ПолучитьИзВременногоХранилища(Результат.СопоставленияРеквизитов);
	
	Для Каждого СтрокаСопоставленияРеквизитов Из СопоставленияРеквизитов Цикл
		НоваяСтрока = Объект.СопоставлениеРеквизитовТабличныхЧастей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСопоставленияРеквизитов);
		НоваяСтрока.КлючСвязи = Результат.КлючСвязи;
	КонецЦикла;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадписьГиперссылкиАлгоритмОбработкиСтрок()
	
	Для Каждого СтрокаНастройкиТЧ Из Объект.НастройкиТабличныхЧастей Цикл
		СтрокаНастройкиТЧ.АлгоритмОбработкиСтрокПредставление = НСтр("ru = 'редактировать'");
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадписьГиперссылкиДополнительныйОбработчикДокументов()
	
	Для Каждого СтрокаНастройкиТЧ Из СозданиеДокументов Цикл
		СтрокаНастройкиТЧ.ОбработчикПредставление = НСтр("ru = 'редактировать'");
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура НастройкиТабличныхЧастейПослеУдаленияНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СопоставлениеРеквизитовТЧ", Объект.СопоставлениеРеквизитовТабличныхЧастей.Выгрузить());
	Запрос.УстановитьПараметр("КлючиСвязи", Объект.НастройкиТабличныхЧастей.Выгрузить().ВыгрузитьКолонку("КлючСвязи"));
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СопоставлениеРеквизитовТЧ.КлючСвязи КАК КлючСвязи,
		|	СопоставлениеРеквизитовТЧ.Поле КАК Поле,
		|	СопоставлениеРеквизитовТЧ.ИмяРеквизита КАК ИмяРеквизита,
		|	СопоставлениеРеквизитовТЧ.ИспользуетсяПостоянноеЗначение КАК ИспользуетсяПостоянноеЗначение,
		|	СопоставлениеРеквизитовТЧ.ПостоянноеЗначение КАК ПостоянноеЗначение
		|ПОМЕСТИТЬ втСопоставлениеРеквизитовТЧ
		|ИЗ
		|	&СопоставлениеРеквизитовТЧ КАК СопоставлениеРеквизитовТЧ
		|ГДЕ
		|	СопоставлениеРеквизитовТЧ.КлючСвязи В(&КлючиСвязи)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втСопоставлениеРеквизитовТЧ.КлючСвязи КАК КлючСвязи,
		|	втСопоставлениеРеквизитовТЧ.Поле КАК Поле,
		|	втСопоставлениеРеквизитовТЧ.ИмяРеквизита КАК ИмяРеквизита,
		|	втСопоставлениеРеквизитовТЧ.ИспользуетсяПостоянноеЗначение КАК ИспользуетсяПостоянноеЗначение,
		|	втСопоставлениеРеквизитовТЧ.ПостоянноеЗначение КАК ПостоянноеЗначение
		|ИЗ
		|	втСопоставлениеРеквизитовТЧ КАК втСопоставлениеРеквизитовТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ втСопоставлениеРеквизитовТЧ";
	
    Объект.СопоставлениеРеквизитовТабличныхЧастей.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиИдентификацииСтрокТЧЗавершение(НастройкиИдентификацииСтрокТЧ, Контекст) Экспорт
	
	Если НастройкиИдентификацииСтрокТЧ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеНастройки.ПараметрыИдентификацииСтрокТЧ.Вставить(Контекст.ТипТаблицы, НастройкиИдентификацииСтрокТЧ);
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура УстановитьТипЗначенияПоРеквизиту(ВыбранноеЗначение)

	Элементы.УстановкаРеквизитовЗначение.ОграничениеТипа = Метаданные.Документы[Объект.ИмяОбъектаМетаданных].Реквизиты[ВыбранноеЗначение].Тип;	
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьДокументыДляВводаНаОсновании()
	
	МассивДокументовДляВводаНаОсновании = Новый Массив;
	ИскомыйДокумент = Метаданные.Документы.Найти(Объект.ИмяОбъектаМетаданных);
	
	Для Каждого ДокументыМетаданные Из Метаданные.Документы Цикл
		Для Каждого ДокументВводитсяНаОсновании Из ДокументыМетаданные.ВводитсяНаОсновании Цикл
			Если ДокументВводитсяНаОсновании = ИскомыйДокумент Тогда
				Элементы.СозданиеДокументовДокумент.СписокВыбора.Добавить(ДокументыМетаданные.Имя, ДокументыМетаданные.Синоним);
				Продолжить;
			КонецЕсли;			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СозданиеДокументовДокументОбработкаВыбораНаСервере(ВыбранноеЗначение)
	
	СтруктураВозврата = Новый Структура;
	МетаданныеДокумента = Метаданные.Документы.Найти(ВыбранноеЗначение);

	Если МетаданныеДокумента = Неопределено Тогда
		СтруктураВозврата.Вставить("Имя", "");
		СтруктураВозврата.Вставить("Синоним", "");
	Иначе
		СтруктураВозврата.Вставить("Имя", МетаданныеДокумента.Имя);
		СтруктураВозврата.Вставить("Синоним", МетаданныеДокумента.Синоним);
	КонецЕсли;
	
    Возврат СтруктураВозврата;

КонецФункции

&НаСервереБезКонтекста
Процедура ДобавитьОписаниеПеременныхАлгоритмаПередЗаписью(ПользовательскиеОбъекты, ИмяДокумента, СинонимДокумента)
	
	ОписаниеРеквизитовДокументаОбмена = SUI_НастройкиДокументовПовтИсп.ОписаниеРеквизитовДокумента(ИмяДокумента);
	
	// Описание переменных: ДокументОбъект
	ПользовательскийОбъект = SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(
		ПользовательскиеОбъекты, 
		"ДокументОбъект", 
		СтрШаблон(НСтр("ru = 'Объект документа %1'"), СинонимДокумента),
		"ДокументОбъект." + ИмяДокумента,
		Тип("ДокументСсылка." + ИмяДокумента));
	
	Для Каждого ОписаниеРеквизита Из ОписаниеРеквизитовДокументаОбмена.Строки.Найти("Реквизиты", "Имя", Ложь).Строки Цикл
		
		SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(
			ПользовательскийОбъект, 
			ОписаниеРеквизита.Имя,
			ОписаниеРеквизита.Синоним,
			ОписаниеРеквизита.Представление,
			SUI_ОбщегоНазначенияПереопределяемый.СтроковоеПредставлениеТипа(ОписаниеРеквизита.Тип),
			,
			Истина);
		
	КонецЦикла;
	
	Для Каждого ОписаниеРеквизита Из ОписаниеРеквизитовДокументаОбмена.Строки.Найти("ТабличныеЧасти", "Имя", Ложь).Строки Цикл
		
		СвойствоПользовательскогоОбъекта = SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(
			ПользовательскийОбъект, 
			ОписаниеРеквизита.Имя,
			ОписаниеРеквизита.Синоним,
			ОписаниеРеквизита.Представление,
			SUI_ОбщегоНазначенияПереопределяемый.СтроковоеПредставлениеТипа(ОписаниеРеквизита.Тип),
			,
			Истина);
		
		Для Каждого ОписаниеРеквизитаТЧ Из ОписаниеРеквизита.Строки Цикл
			
			SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(
				СвойствоПользовательскогоОбъекта, 
				ОписаниеРеквизитаТЧ.Имя,
				ОписаниеРеквизитаТЧ.Синоним,
				ОписаниеРеквизитаТЧ.Представление,
				SUI_ОбщегоНазначенияПереопределяемый.СтроковоеПредставлениеТипа(ОписаниеРеквизитаТЧ.Тип),
				,
				Истина);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАлгоритмПередЗаписьюЗавершение(Алгоритм, ДополнительныеПараметры) Экспорт
	
	Если Алгоритм = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеНастройки.ОбработчикиСобытий.Вставить("ПередЗаписью", Алгоритм);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьОписаниеПеременныхАлгоритмаПослеЗаписи(ПользовательскиеОбъекты, ИмяДокумента, СинонимДокумента)
	
	ОписаниеРеквизитовДокументаОбмена = SUI_НастройкиДокументовПовтИсп.ОписаниеРеквизитовДокумента(ИмяДокумента);
	
	// Описание переменных: ДокументСсылка
	ПользовательскийОбъект = SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(
		ПользовательскиеОбъекты, 
		"ДокументСсылка", 
		СтрШаблон(НСтр("ru = 'Ссылка документа %1'"), СинонимДокумента),
		Тип("ДокументСсылка." + ИмяДокумента),
		Тип("ДокументСсылка." + ИмяДокумента));
	
	Для Каждого ОписаниеРеквизита Из ОписаниеРеквизитовДокументаОбмена.Строки.Найти("Реквизиты", "Имя", Ложь).Строки Цикл
		
		SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(
			ПользовательскийОбъект, 
			ОписаниеРеквизита.Имя,
			ОписаниеРеквизита.Синоним,
			ОписаниеРеквизита.Представление,
			SUI_ОбщегоНазначенияПереопределяемый.СтроковоеПредставлениеТипа(ОписаниеРеквизита.Тип),
			,
			Истина);
		
	КонецЦикла;
	
	Для Каждого ОписаниеРеквизита Из ОписаниеРеквизитовДокументаОбмена.Строки.Найти("ТабличныеЧасти", "Имя", Ложь).Строки Цикл
		
		СвойствоПользовательскогоОбъекта = SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(
			ПользовательскийОбъект, 
			ОписаниеРеквизита.Имя,
			ОписаниеРеквизита.Синоним,
			ОписаниеРеквизита.Представление,
			SUI_ОбщегоНазначенияПереопределяемый.СтроковоеПредставлениеТипа(ОписаниеРеквизита.Тип),
			,
			Истина);
		
		Для Каждого ОписаниеРеквизитаТЧ Из ОписаниеРеквизита.Строки Цикл
			
			SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(
				СвойствоПользовательскогоОбъекта, 
				ОписаниеРеквизитаТЧ.Имя,
				ОписаниеРеквизитаТЧ.Синоним,
				ОписаниеРеквизитаТЧ.Представление,
				SUI_ОбщегоНазначенияПереопределяемый.СтроковоеПредставлениеТипа(ОписаниеРеквизитаТЧ.Тип),
				,
				Истина);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАлгоритмПослеЗаписиЗавершение(Алгоритм, ДополнительныеПараметры) Экспорт
	
	Если Алгоритм = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеНастройки.ОбработчикиСобытий.Вставить("ПослеЗаписи", Алгоритм);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьОписаниеПеременныхАлгоритмаОбработкиСтрок(ПользовательскиеОбъекты, ИмяДокумента, СинонимДокумента, ИмяТабличнойЧасти)
	
	ОписаниеРеквизитовДокументаОбмена = SUI_НастройкиДокументовПовтИсп.ОписаниеРеквизитовДокумента(ИмяДокумента);
	ОписаниеРеквизитовТекущейСтроки = Неопределено;
	
	// Описание переменных: ДокументОбъект
	ПользовательскийОбъект = SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(
		ПользовательскиеОбъекты, 
		"ДокументОбъект", 
		СтрШаблон(НСтр("ru = 'Объект документа %1'"), СинонимДокумента),
		"ДокументОбъект." + ИмяДокумента,
		Тип("ДокументСсылка." + ИмяДокумента));
	
	Для Каждого ОписаниеРеквизита Из ОписаниеРеквизитовДокументаОбмена.Строки.Найти("Реквизиты", "Имя", Ложь).Строки Цикл
		
		SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(
			ПользовательскийОбъект, 
			ОписаниеРеквизита.Имя,
			ОписаниеРеквизита.Синоним,
			ОписаниеРеквизита.Представление,
			SUI_ОбщегоНазначенияПереопределяемый.СтроковоеПредставлениеТипа(ОписаниеРеквизита.Тип),
			,
			Истина);
		
	КонецЦикла;
	
	Для Каждого ОписаниеРеквизита Из ОписаниеРеквизитовДокументаОбмена.Строки.Найти("ТабличныеЧасти", "Имя", Ложь).Строки Цикл
		
		СвойствоПользовательскогоОбъекта = SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(
			ПользовательскийОбъект, 
			ОписаниеРеквизита.Имя,
			ОписаниеРеквизита.Синоним,
			ОписаниеРеквизита.Представление,
			SUI_ОбщегоНазначенияПереопределяемый.СтроковоеПредставлениеТипа(ОписаниеРеквизита.Тип),
			,
			Истина);
		
		Если ИмяТабличнойЧасти = ОписаниеРеквизита.Имя Тогда
			ОписаниеРеквизитовТекущейСтроки = ОписаниеРеквизита;
		КонецЕсли;
		
		Для Каждого ОписаниеРеквизитаТЧ Из ОписаниеРеквизита.Строки Цикл
			
			SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(
				СвойствоПользовательскогоОбъекта, 
				ОписаниеРеквизитаТЧ.Имя,
				ОписаниеРеквизитаТЧ.Синоним,
				ОписаниеРеквизитаТЧ.Представление,
				SUI_ОбщегоНазначенияПереопределяемый.СтроковоеПредставлениеТипа(ОписаниеРеквизитаТЧ.Тип),
				,
				Истина);
			
		КонецЦикла;
		
	КонецЦикла;
	
	// Описание переменных: ТекущаяСтрока
	ПользовательскийОбъект = SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(
		ПользовательскиеОбъекты, 
		"ТекущаяСтрока", 
		СтрШаблон(НСтр("ru = 'Текущая строка табличной части %1 документа %2'"), , СинонимДокумента),
		Тип("Структура"),
		Тип("Структура"));
	
	Если ОписаниеРеквизитовТекущейСтроки <> Неопределено Тогда
		
		Для Каждого ОписаниеРеквизитаТЧ Из ОписаниеРеквизитовТекущейСтроки.Строки Цикл
			
			SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(
				ПользовательскийОбъект, 
				ОписаниеРеквизитаТЧ.Имя,
				ОписаниеРеквизитаТЧ.Синоним,
				ОписаниеРеквизитаТЧ.Представление,
				SUI_ОбщегоНазначенияПереопределяемый.СтроковоеПредставлениеТипа(ОписаниеРеквизитаТЧ.Тип),
				,
				Истина);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАлгоритмОбработкиСтрокЗавершение(Алгоритм, Контекст) Экспорт
	
	Если Алгоритм = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеНастройки.АлгоритмыОбработкиСтрокТабличныхЧастей.Вставить(Контекст.ТипТаблицы, Алгоритм);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьОписаниеПеременныхАлгоритмаСозданияНаОсновании(ПользовательскиеОбъекты, ИмяДокумента, СинонимДокумента)
	
	ОписаниеРеквизитовДокументаОбмена = SUI_НастройкиДокументовПовтИсп.ОписаниеРеквизитовДокумента(ИмяДокумента);
	
	// Описание переменных: ДокументОбъект
	ПользовательскийОбъект = SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(
		ПользовательскиеОбъекты, 
		"ДокументОбъект", 
		СтрШаблон(НСтр("ru = 'Объект документа %1'"), СинонимДокумента),
		"ДокументОбъект." + ИмяДокумента,
		Тип("ДокументСсылка." + ИмяДокумента));
	
	Для Каждого ОписаниеРеквизита Из ОписаниеРеквизитовДокументаОбмена.Строки.Найти("Реквизиты", "Имя", Ложь).Строки Цикл
		
		SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(
			ПользовательскийОбъект, 
			ОписаниеРеквизита.Имя,
			ОписаниеРеквизита.Синоним,
			ОписаниеРеквизита.Представление,
			SUI_ОбщегоНазначенияПереопределяемый.СтроковоеПредставлениеТипа(ОписаниеРеквизита.Тип),
			,
			Истина);
		
	КонецЦикла;
	
	Для Каждого ОписаниеРеквизита Из ОписаниеРеквизитовДокументаОбмена.Строки.Найти("ТабличныеЧасти", "Имя", Ложь).Строки Цикл
		
		СвойствоПользовательскогоОбъекта = SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(
			ПользовательскийОбъект, 
			ОписаниеРеквизита.Имя,
			ОписаниеРеквизита.Синоним,
			ОписаниеРеквизита.Представление,
			SUI_ОбщегоНазначенияПереопределяемый.СтроковоеПредставлениеТипа(ОписаниеРеквизита.Тип),
			,
			Истина);
		
		Для Каждого ОписаниеРеквизитаТЧ Из ОписаниеРеквизита.Строки Цикл
			
			SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(
				СвойствоПользовательскогоОбъекта, 
				ОписаниеРеквизитаТЧ.Имя,
				ОписаниеРеквизитаТЧ.Синоним,
				ОписаниеРеквизитаТЧ.Представление,
				SUI_ОбщегоНазначенияПереопределяемый.СтроковоеПредставлениеТипа(ОписаниеРеквизитаТЧ.Тип),
				,
				Истина);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАлгоритмСозданиеНаОснованииЗавершение(Алгоритм, Контекст) Экспорт
	
	Если Алгоритм = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеНастройки.АлгоритмыОбработкиСозданияДокументаНаОсновании.Вставить(
		Контекст.ИмяМетаданныхСоздаваемогоДокумента, Алгоритм);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьОписаниеПеременныхАлгоритмаПолученияПризнакаМаркировки(ПользовательскиеОбъекты, ИмяДокумента, СинонимДокумента)
	
	ОписаниеРеквизитовДокументаОбмена = SUI_НастройкиДокументовПовтИсп.ОписаниеРеквизитовДокумента(ИмяДокумента);
	
	// Описание переменных: Параметры
	ПользовательскийОбъектПараметры = SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(
		ПользовательскиеОбъекты, 
		"Параметры", 
		НСтр("ru = 'Входные параметры'"),
		Тип("Структура"),
		Тип("Структура"));
	
	// Описание переменных: Параметры.ДокументСсылка
	ПользовательскийОбъект = SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(
		ПользовательскийОбъектПараметры, 
		"ДокументСсылка",
		"ДокументСсылка", 
		СтрШаблон(НСтр("ru = 'Ссылка документа %1'"), СинонимДокумента),
		Тип("ДокументСсылка." + ИмяДокумента),
		Тип("ДокументСсылка." + ИмяДокумента));
	
	Для Каждого ОписаниеРеквизита Из ОписаниеРеквизитовДокументаОбмена.Строки.Найти("Реквизиты", "Имя", Ложь).Строки Цикл
		
		SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(
			ПользовательскийОбъект, 
			ОписаниеРеквизита.Имя,
			ОписаниеРеквизита.Синоним,
			ОписаниеРеквизита.Представление,
			SUI_ОбщегоНазначенияПереопределяемый.СтроковоеПредставлениеТипа(ОписаниеРеквизита.Тип),
			,
			Истина);
		
	КонецЦикла;
	
	Для Каждого ОписаниеРеквизита Из ОписаниеРеквизитовДокументаОбмена.Строки.Найти("ТабличныеЧасти", "Имя", Ложь).Строки Цикл
		
		СвойствоПользовательскогоОбъекта = SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(
			ПользовательскийОбъект, 
			ОписаниеРеквизита.Имя,
			ОписаниеРеквизита.Синоним,
			ОписаниеРеквизита.Представление,
			SUI_ОбщегоНазначенияПереопределяемый.СтроковоеПредставлениеТипа(ОписаниеРеквизита.Тип),
			,
			Истина);
		
		Для Каждого ОписаниеРеквизитаТЧ Из ОписаниеРеквизита.Строки Цикл
			
			SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(
				СвойствоПользовательскогоОбъекта, 
				ОписаниеРеквизитаТЧ.Имя,
				ОписаниеРеквизитаТЧ.Синоним,
				ОписаниеРеквизитаТЧ.Представление,
				SUI_ОбщегоНазначенияПереопределяемый.СтроковоеПредставлениеТипа(ОписаниеРеквизитаТЧ.Тип),
				,
				Истина);
			
		КонецЦикла;
		
	КонецЦикла;
	
	// Описание переменных: Параметры.Результат
	SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(
		ПользовательскийОбъектПараметры, 
		"Результат",
		"Результат",
		НСтр("ru = 'Результат выполнения алгоритма'"),
		"Булево",
		Тип("Булево"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАлгоритмПолученияПризнакаМаркировкиЗавершение(Алгоритм, ДополнительныеПараметры) Экспорт
	
	Если Алгоритм = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	АлгоритмПолученияПризнакаМаркировки("ИзДокумента", Алгоритм);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьОписаниеПеременныхАлгоритмаСозданияНовогоДокумента(ПользовательскиеОбъекты, ИмяДокумента, СинонимДокумента)
	
	ОписаниеРеквизитовДокументаОбмена = SUI_НастройкиДокументовПовтИсп.ОписаниеРеквизитовДокумента(ИмяДокумента);
	
	// Описание переменных: МобильноеУстройство
	SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(
		ПользовательскиеОбъекты, 
		"МобильноеУстройство", 
		НСтр("ru = 'Мобильное устройство'"),
		Тип("ПланОбменаСсылка.SUI_МобильныеУстройства"),
		Тип("ПланОбменаСсылка.SUI_МобильныеУстройства"));
	
	// Описание переменных: ДокументОбъект
	_ПользовательскийОбъект = SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(
		ПользовательскиеОбъекты, 
		"ДокументОбъект", 
		СтрШаблон(НСтр("ru = 'Объект документа %1'"), СинонимДокумента),
		"ДокументОбъект." + ИмяДокумента,
		Тип("ДокументСсылка." + ИмяДокумента));
	
	Для Каждого ОписаниеРеквизита Из ОписаниеРеквизитовДокументаОбмена.Строки.Найти("Реквизиты", "Имя", Ложь).Строки Цикл
		
		SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(_ПользовательскийОбъект, 
			ОписаниеРеквизита.Имя,
			ОписаниеРеквизита.Синоним,
			ОписаниеРеквизита.Представление,
			SUI_ОбщегоНазначенияПереопределяемый.СтроковоеПредставлениеТипа(ОписаниеРеквизита.Тип),
			,
			Истина);
		
	КонецЦикла;
	
	Для Каждого ОписаниеРеквизита Из ОписаниеРеквизитовДокументаОбмена.Строки.Найти("ТабличныеЧасти", "Имя", Ложь).Строки Цикл
		
		_СвойствоПользовательскогоОбъекта = SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(
			_ПользовательскийОбъект, 
			ОписаниеРеквизита.Имя,
			ОписаниеРеквизита.Синоним,
			ОписаниеРеквизита.Представление,
			SUI_ОбщегоНазначенияПереопределяемый.СтроковоеПредставлениеТипа(ОписаниеРеквизита.Тип),
			,
			Истина);
		
		Для Каждого ОписаниеРеквизитаТЧ Из ОписаниеРеквизита.Строки Цикл
			
			SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(_СвойствоПользовательскогоОбъекта, 
				ОписаниеРеквизитаТЧ.Имя,
				ОписаниеРеквизитаТЧ.Синоним,
				ОписаниеРеквизитаТЧ.Представление,
				SUI_ОбщегоНазначенияПереопределяемый.СтроковоеПредставлениеТипа(ОписаниеРеквизитаТЧ.Тип),
				,
				Истина);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАлгоритмСозданияНовогоДокументаЗавершение(Алгоритм, ДополнительныеПараметры) Экспорт
	
	Если Алгоритм = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.АлгоритмСозданияНовогоДокумента = Алгоритм;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТипДокументаСтрокой(ИмяОбъекта)
	
	Перем ТипСтрокой;
	
	Если ЗначениеЗаполнено(ИмяОбъекта) Тогда
		УстановитьПривилегированныйРежим(Истина);
		ТипСтрокой = ТипЗнч(ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("Документ." + ИмяОбъекта).ПустаяСсылка());
	КонецЕсли;
	
	Возврат ТипСтрокой;
	
КонецФункции

&НаКлиенте
Функция АлгоритмПолученияПризнакаМаркировки(Ключ, НовоеЗначение = Неопределено)
	
	АлгоритмыИзНастройки = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеНастройки, 
		SUI_ДокументыОбменаКлиентСервер.ДополнительныеНастройки_КлючАлгоритмыПризнакаМаркировки(), 
		Новый Соответствие(), Тип("Соответствие"));
			
	Если НовоеЗначение <> Неопределено Тогда
		АлгоритмыИзНастройки.Вставить(Ключ, НовоеЗначение);
		ДополнительныеНастройки.Вставить(
			SUI_ДокументыОбменаКлиентСервер.ДополнительныеНастройки_КлючАлгоритмыПризнакаМаркировки(), АлгоритмыИзНастройки);
		Модифицированность = Истина;
	КонецЕсли;
	
	Возврат АлгоритмыИзНастройки.Получить(Ключ);
	
КонецФункции

&НаКлиенте
Функция АлгоритмПолученияСтатусаУказанияСерии(Ключ, НовоеЗначение = Неопределено)
	
	АлгоритмыИзНастройки = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеНастройки, 
		SUI_ДокументыОбменаКлиентСервер.ДополнительныеНастройки_КлючАлгоритмыПолученияСтатусаУказанияСерии(), 
		Новый Соответствие(), Тип("Соответствие"));
			
	Если НовоеЗначение <> Неопределено Тогда
		АлгоритмыИзНастройки.Вставить(Ключ, НовоеЗначение);
		ДополнительныеНастройки.Вставить(
			SUI_ДокументыОбменаКлиентСервер.ДополнительныеНастройки_КлючАлгоритмыПолученияСтатусаУказанияСерии(), АлгоритмыИзНастройки);
		Модифицированность = Истина;
	КонецЕсли;
	
	Возврат АлгоритмыИзНастройки.Получить(Ключ);
	
КонецФункции

&НаКлиенте
Функция АлгоритмПолученияДополнительныхРеквизитов(Ключ, НовоеЗначение = Неопределено)
	
	АлгоритмыИзНастройки = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеНастройки, 
		SUI_ДокументыОбменаКлиентСервер.ДополнительныеНастройки_КлючАлгоритмыДополнительныхРеквизитов(), 
		Новый Соответствие(), Тип("Соответствие"));
	
	Если НовоеЗначение <> Неопределено Тогда
		АлгоритмыИзНастройки.Вставить(Ключ, НовоеЗначение);
		ДополнительныеНастройки.Вставить(
			SUI_ДокументыОбменаКлиентСервер.ДополнительныеНастройки_КлючАлгоритмыДополнительныхРеквизитов(), АлгоритмыИзНастройки);
		Модифицированность = Истина;
	КонецЕсли;
	
	Возврат АлгоритмыИзНастройки.Получить(Ключ);
	
КонецФункции

&НаСервереБезКонтекста
Процедура ДобавитьОписаниеПеременныхАлгоритмаПолученияДополнительныхРеквизитов(ПользовательскиеОбъекты, ИмяДокумента, СинонимДокумента)
	
	ОписаниеРеквизитовДокументаОбмена = SUI_НастройкиДокументовПовтИсп.ОписаниеРеквизитовДокумента(ИмяДокумента);
	
	// Описание переменных: Параметры
	ПользовательскийОбъектПараметры = SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(
		ПользовательскиеОбъекты, 
		"Параметры", 
		НСтр("ru = 'Входные параметры'"),
		Тип("Структура"),
		Тип("Структура"));
	
	// Описание переменных: Параметры.ДокументСсылка
	ПользовательскийОбъект = SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(
		ПользовательскийОбъектПараметры, 
		"ДокументСсылка",
		"ДокументСсылка", 
		СтрШаблон(НСтр("ru = 'Ссылка документа %1'"), СинонимДокумента),
		Тип("ДокументСсылка." + ИмяДокумента),
		Тип("ДокументСсылка." + ИмяДокумента));
	
	Для Каждого ОписаниеРеквизита Из ОписаниеРеквизитовДокументаОбмена.Строки.Найти("Реквизиты", "Имя", Ложь).Строки Цикл
		
		SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(
			ПользовательскийОбъект, 
			ОписаниеРеквизита.Имя,
			ОписаниеРеквизита.Синоним,
			ОписаниеРеквизита.Представление,
			SUI_ОбщегоНазначенияПереопределяемый.СтроковоеПредставлениеТипа(ОписаниеРеквизита.Тип),
			,
			Истина);
		
	КонецЦикла;
	
	Для Каждого ОписаниеРеквизита Из ОписаниеРеквизитовДокументаОбмена.Строки.Найти("ТабличныеЧасти", "Имя", Ложь).Строки Цикл
		
		СвойствоПользовательскогоОбъекта = SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(
			ПользовательскийОбъект, 
			ОписаниеРеквизита.Имя,
			ОписаниеРеквизита.Синоним,
			ОписаниеРеквизита.Представление,
			SUI_ОбщегоНазначенияПереопределяемый.СтроковоеПредставлениеТипа(ОписаниеРеквизита.Тип),
			,
			Истина);
		
		Для Каждого ОписаниеРеквизитаТЧ Из ОписаниеРеквизита.Строки Цикл
			
			SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(
				СвойствоПользовательскогоОбъекта, 
				ОписаниеРеквизитаТЧ.Имя,
				ОписаниеРеквизитаТЧ.Синоним,
				ОписаниеРеквизитаТЧ.Представление,
				SUI_ОбщегоНазначенияПереопределяемый.СтроковоеПредставлениеТипа(ОписаниеРеквизитаТЧ.Тип),
				,
				Истина);
			
		КонецЦикла;
		
	КонецЦикла;
	
	// Описание переменных: Параметры.Результат
	SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(
		ПользовательскийОбъектПараметры, 
		"Результат",
		"Результат",
		НСтр("ru = 'Результат выполнения алгоритма'"),
		"Булево",
		Тип("Булево"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАлгоритмПолученияДополнительныхРеквизитовЗавершение(Алгоритм, ДополнительныеПараметры) Экспорт
	
	Если Алгоритм = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	АлгоритмПолученияДополнительныхРеквизитов("ИзДокумента", Алгоритм);
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПередЗаписьюЗаполнитьМобильныхКлиентовЗавершение(Ответ, ПараметрыЗаписи) Экспорт
	
	ПараметрыЗаписи.Вставить("SUI_ЗаполнитьМобильныеУстройстваПриЗаписи", (Ответ = КодВозвратаДиалога.Да));
	
	Если Записать(ПараметрыЗаписи) Тогда
		
		Если ПараметрыЗаписи.Свойство("SUI_Закрыть") Тогда
			Закрыть();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРедакторКода(Оповещение, ПараметрыОткрытияРедактора)
	
	#Если ВебКлиент Тогда
		SUI_РедакторКодаКлиент.ОткрытьРедактор(ПараметрыОткрытияРедактора, Оповещение, ЭтотОбъект, ,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	#Иначе
		SUI_РедакторКодаКлиент.ОткрытьРедактор(ПараметрыОткрытияРедактора, Оповещение, ЭтотОбъект, Окно);
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти
