
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получить версии конфигураций приложений.
// 
// Параметры:
//  ВерсияОт - Строка - Версия от
//  ВключаяТестовые - Булево - Включая тестовые версии
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Получить версии конфигураций приложений:
//   * ПрисоединенныйФайл - СправочникСсылка.SUI_ПрисоединенныеФайлыОбщие - Ссылка на файл конфигурации приложений;
//	 * КонфигурацияПриложения - СправочникСсылка.SUI_КонфигурацииПриложений - Ссылка на конфигурацию приложений;
//	 * Версия - Строка - Версия конфигурации приложений;
//	 * ВесВерсии - Число - Вес версии конфигурации приложений;
//	 * Тестовая - Булево - Признак тестовой версии конфигурации приложений;
Функция ПолучитьВерсии(ВерсияОт = "", ВключаяТестовые = Ложь) Экспорт
	
	//TODO: Врем. выкл.
	ВызватьИсключение НСтр("ru = 'Функционал отключен'");
	
	Схема = ПолучитьМакет("ПолучениеВерсийКонфигурацийПриложений");
	Схема.Параметры.Найти("ВесВерсииОт").Значение = SUI_ОбщегоНазначенияКлиентСервер.ВесВерсии(ВерсияОт);
	Схема.Параметры.Найти("ВключаяТестовые").Значение = ВключаяТестовые;

	ПараметрыРезультатСКД = SUI_КомпоновкаДанныхСервер.ПараметрыРезультатСхемыКомпоновкиДанных();
	ПараметрыРезультатСКД.СхемаКомпоновкиДанных = Схема;
	ПараметрыРезультатСКД.ВыполнятьВПривилегированномРежиме = Истина;
	
	//@skip-check constructor-function-return-section
	Возврат SUI_КомпоновкаДанныхСервер.ВыгрузитьРезультатСхемыКомпоновкиДанных(ПараметрыРезультатСКД);

КонецФункции

// Получить последнюю новую версию.
// 
// Параметры:
//  ВерсияОт - Строка - Версия от
//  ВключаяТестовые - Булево - Включая тестовые
// 
// Возвращаемое значение:
// 	Неопределено, Структура - Параметры версии:
//   * ПрисоединенныйФайл - СправочникСсылка.SUI_ПрисоединенныеФайлыОбщие - Ссылка на файл конфигурации приложений;
//	 * КонфигурацияПриложения - СправочникСсылка.SUI_КонфигурацииПриложений - Ссылка на конфигурацию приложений;
//	 * Версия - Строка - Версия конфигурации приложений;
//	 * ВесВерсии - Число - Вес версии конфигурации приложений;
//	 * Тестовая - Булево - Признак тестовой версии конфигурации приложений;
Функция ПолучитьПоследнююНовуюВерсию(ВерсияОт = "", ВключаяТестовые = Ложь) Экспорт
	
	Версии = ПолучитьВерсии(ВерсияОт, ВключаяТестовые);
	
	Если Версии.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	//@skip-check constructor-function-return-section
	Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Версии[0]);
	
КонецФункции

#КонецОбласти

#КонецЕсли
