
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ПолучитьКоличествоЗаписейВТаблицахИнтеграции(Параметры, АдресРезультата) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	ТаблицаРезультат = Новый ТаблицаЗначений();
	ТаблицаРезультат.Колонки.Добавить("ТаблицаИнтеграции", Новый ОписаниеТипов("ПеречислениеСсылка.SUI_ТаблицыИнтеграции"));
	ТаблицаРезультат.Колонки.Добавить("КоличествоЗаписей", SUI_ОбщегоНазначения.ОписаниеТипаЧисло(10, , ДопустимыйЗнак.Неотрицательный));

	СписокТаблиц = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "СписокТаблиц");
	
	Если СписокТаблиц = Неопределено Тогда
		СписокТаблиц = SUI_НастройкиМетаданныхПовтИсп.ТаблицыИнтеграции();
		СписокТаблиц = СписокТаблиц.ВыгрузитьЗначения();
	Иначе
		ОписаниеТипаМассив = Новый ОписаниеТипов("Массив");
		СписокТаблиц = ОписаниеТипаМассив.ПривестиЗначение(СписокТаблиц);
	КонецЕсли;
	
	Если СписокТаблиц.Количество() > 0 Тогда

		ИменаТаблицВКонфигурации = SUI_НастройкиМетаданныхПовтИсп.СоответствиеТаблицИнтеграцииВКонфигурации();
		
		Запрос = Новый Запрос();
		Для индекс = 0 По СписокТаблиц.ВГраница() Цикл
			
			ИмяТаблицыВКонфигурации = ИменаТаблицВКонфигурации.Получить(СписокТаблиц[индекс]);
			
			Если ИмяТаблицыВКонфигурации = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ИмяПараметра = "&ТаблицаИнтеграции" + Формат(индекс, "ЧДЦ=0; ЧГ=0;");
			
			Если ПустаяСтрока(Запрос.Текст) Тогда
				Запрос.Текст = "ВЫБРАТЬ
				|	" + ИмяПараметра + " КАК ТаблицаИнтеграции,
				|	КОЛИЧЕСТВО(*) КАК КоличествоЗаписей
				|ИЗ
				|	" + ИмяТаблицыВКонфигурации;
			Иначе
				Запрос.Текст = Запрос.Текст + "
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	" + ИмяПараметра + ",
				|	КОЛИЧЕСТВО(*)
				|ИЗ
				|	" + ИмяТаблицыВКонфигурации;
			КонецЕсли;
			
			Запрос.УстановитьПараметр(Сред(ИмяПараметра, 2), СписокТаблиц[индекс]);
			
		КонецЦикла;
		
		ТаблицаРезультат = Запрос.Выполнить().Выгрузить();

	КонецЕсли;
	
	ТаблицаРезультат.Колонки.Добавить("ИндексКартинки", SUI_ОбщегоНазначения.ОписаниеТипаЧисло(1, , ДопустимыйЗнак.Неотрицательный));
	ТаблицаРезультат.Колонки.Добавить("Используется", Новый ОписаниеТипов("Булево"));

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицыИнтеграции", ТаблицаРезультат.ВыгрузитьКолонку("ТаблицаИнтеграции"));
	Запрос.Текст =
		"ВЫБРАТЬ
		|	НастройкиТаблицИнтеграции.ТаблицаИнтеграции КАК ТаблицаИнтеграции,
		|	НастройкиТаблицИнтеграции.ИмяОбъектаКонфигурации КАК ИмяОбъекта,
		|	НастройкиТаблицИнтеграции.СхемаКомпоновкиДанных КАК СхемаКомпоновкиДанных,
		|	НастройкиТаблицИнтеграции.НастройкиКомпоновкиДанных КАК НастройкиКомпоновкиДанных
		|ИЗ
		|	РегистрСведений.SUI_НастройкиТаблицИнтеграции КАК НастройкиТаблицИнтеграции
		|ГДЕ
		|	НастройкиТаблицИнтеграции.ТаблицаИнтеграции В (&ТаблицыИнтеграции)";
	
	ТаблицаНастроек = Запрос.Выполнить().Выгрузить();
	
	СоответсвиеФункциональныхОпций = SUI_НастройкиМетаданныхПовтИсп.СоответсвиеФункциональныхОпцийТаблицИнтеграции();
	Для Каждого СтрокаТаблицы Из ТаблицаРезультат Цикл
		
		ИмяФО = СоответсвиеФункциональныхОпций.Получить(СтрокаТаблицы.ТаблицаИнтеграции);
		
		Если ЗначениеЗаполнено(ИмяФО) Тогда
			СтрокаТаблицы.Используется = ПолучитьФункциональнуюОпцию(ИмяФО);
		Иначе
			СтрокаТаблицы.Используется = Ложь;
		КонецЕсли;
		
		Если СтрокаТаблицы.Используется И СтрокаТаблицы.ТаблицаИнтеграции <> Перечисления.SUI_ТаблицыИнтеграции.ПользователиТСД Тогда
			
			НайденныеНастройки = ТаблицаНастроек.НайтиСтроки(Новый Структура("ТаблицаИнтеграции", СтрокаТаблицы.ТаблицаИнтеграции));
			
			ЕстьКритическиеОшибки = Ложь;
			ЕстьОшибки = Ложь;
				
			Если НайденныеНастройки.Количество() = 0 Тогда
				ЕстьКритическиеОшибки = Истина;
				ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = '[Таблица: %1]: Отсутствуют настройки'"), СтрокаТаблицы.ТаблицаИнтеграции));
			Иначе
				
				Для Каждого НайденнаяНастройка Из НайденныеНастройки Цикл
					
					ПараметрыПроверкиНастройки = РегистрыСведений.SUI_НастройкиТаблицИнтеграции.ПараметрыПроверкиНастройки();
					ЗаполнитьЗначенияСвойств(ПараметрыПроверкиНастройки, НайденнаяНастройка);
					ПараметрыПроверкиНастройки.СхемаКомпоновкиДанных = ПараметрыПроверкиНастройки.СхемаКомпоновкиДанных.Получить();
					ПараметрыПроверкиНастройки.НастройкиКомпоновкиДанных = ПараметрыПроверкиНастройки.НастройкиКомпоновкиДанных.Получить();
					
					РезультатПроверки = РегистрыСведений.SUI_НастройкиТаблицИнтеграции.ПроверитьНастройку(ПараметрыПроверкиНастройки);
					
					ЕстьКритическиеОшибки = РезультатПроверки.КритическаяОшибка;
					ЕстьОшибки = РезультатПроверки.ЕстьОшибки;
					
					Если ЕстьКритическиеОшибки Тогда
						Прервать;
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
			Если ЕстьКритическиеОшибки Тогда
				СтрокаТаблицы.ИндексКартинки = 2;
			ИначеЕсли ЕстьОшибки Тогда
				СтрокаТаблицы.ИндексКартинки = 1;
			Иначе
				СтрокаТаблицы.ИндексКартинки = 0;
			КонецЕсли;
			
		Иначе
			СтрокаТаблицы.ИндексКартинки = 9;
		КонецЕсли;

	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(ТаблицаРезультат, АдресРезультата);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли