#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьНастройкиПоСтруктуреДанныхЗаполенения(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Метаданные.Документы.Найти(ИмяОбъектаМетаданных) = Неопределено Тогда
		Отказ = Истина;
	КонецЕсли;
	
	ПроверитьЗаполнениеСоответствияРеквизитов(Отказ);
	ПроверитьЗаполнениеСоответствияРеквизитовТабличныхЧастей(Отказ);
	
	// Для документа Сбор ШК настройки ТЧ не проверять
	Если ИмяОбъектаМетаданных = "SUI_СборШтрихкодов" Тогда
		SUI_ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, 
			SUI_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("НастройкиТабличныхЧастей"));
	КонецЕсли;
	
	Если ГрупповоеСканирование И Агрегация Тогда
		ТекстОшибки = НСтр("ru = 'В групповом сканировании агрегация недоступна.'");
		SUI_ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "Агрегация", "Объект", Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если Отказ Или ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ИмяОбъектаМетаданных = Метаданные.Документы.SUI_СборШтрихкодов.Имя Тогда
		
		ГрупповоеСканирование = Ложь;
		ИспользуетсяМаркировка = Ложь;
		КонтролироватьДокумент = Ложь;
		
	КонецЕсли;
	
	ЗаполнитьПараметрыИдентификацииСтрокТЧ();
	
	АлгоритмСозданияНовогоДокумента = СокрЛП(АлгоритмСозданияНовогоДокумента);
	
	ПерезаполнитьНастройкиТабличныхЧастейПередЗаписью();
	
	Если СписокСтатусовКодовМаркировок.Количество() = 0 И Ссылка = Справочники.SUI_НастройкиДокументов.ПустаяСсылка() Тогда
		
		ЗаполнитьСписокЗапрещенныхСтатусов();
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если Отказ Или ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьМУ = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ДополнительныеСвойства, "SUI_ЗаполнитьМобильныеУстройстваПриЗаписи", Ложь, Тип("Булево"));
	
	Если ЗаполнитьМУ Тогда
		ЗаполнитьМобильныеУстройстваПриЗаписи();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьЗаполнениеСоответствияРеквизитов(Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыСоответствия = SUI_НастройкиДокументовСервер.ПолучитьРеквизитыСоответствия();
	
	Для Каждого СтрокаСоответствияРеквизитов Из СоответствияРеквизитов Цикл
		
		Если РеквизитыСоответствия.Получить(СтрокаСоответствияРеквизитов.Ключ) = Неопределено Тогда
			СоответствияРеквизитов.Удалить(СтрокаСоответствияРеквизитов);
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаСоответствияРеквизитов.Значение) Тогда
			СоответствияРеквизитов.Удалить(СтрокаСоответствияРеквизитов);
			Продолжить;
		КонецЕсли;
		
		Если Метаданные.Документы[ИмяОбъектаМетаданных].Реквизиты.Найти(СтрокаСоответствияРеквизитов.Значение) = Неопределено Тогда
			СоответствияРеквизитов.Удалить(СтрокаСоответствияРеквизитов);
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеСоответствияРеквизитовТабличныхЧастей(Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ТипыТаблиц = СоответствияРеквизитовТабличныхЧастей.Выгрузить();
	ТипыТаблиц.Свернуть("ИмяТабличнойЧасти, ТипТаблицы");
	
	Для Каждого СтрокаТипыТаблиц Из ТипыТаблиц Цикл

		СтруктураОтбора = Новый Структура("ИмяТабличнойЧасти, ТипТаблицы");
		
		ЗаполнитьЗначенияСвойств(СтруктураОтбора, СтрокаТипыТаблиц);

		МетаданныеТабличнойЧасти = Метаданные.Документы[ИмяОбъектаМетаданных].ТабличныеЧасти.Найти(СтруктураОтбора.ИмяТабличнойЧасти);
		
		Если МетаданныеТабличнойЧасти = Неопределено Тогда
			SUI_ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон(НСтр("ru = 'Для настройки документа %1 табличная часть %2 не существует.'"), 
					ИмяОбъектаМетаданных, СтруктураОтбора.ИмяТабличнойЧасти), 
				ЭтотОбъект, "СоответствияРеквизитовТабличныхЧастей", , Отказ);
			Продолжить;
		КонецЕсли;
		
		РеквизитыСоответсвтия = SUI_НастройкиДокументовСервер.ПолучитьРеквизитыСоответствияТабличныхЧастей(СтруктураОтбора.ТипТаблицы);

		СтрокиСоответствияТЧ = СоответствияРеквизитовТабличныхЧастей.НайтиСтроки(СтруктураОтбора);
		
		Для Каждого СтрокаСоответствияТЧ Из СтрокиСоответствияТЧ Цикл
			
			ОбязательноеЗаполнениеРеквизита = РеквизитыСоответсвтия.Получить(СтрокаСоответствияТЧ.Ключ);
			
			Если ОбязательноеЗаполнениеРеквизита = Неопределено Тогда
				СоответствияРеквизитовТабличныхЧастей.Удалить(СтрокаСоответствияТЧ);
				Продолжить;
			КонецЕсли;
			
			Если ОбязательноеЗаполнениеРеквизита И Не ЗначениеЗаполнено(СтрокаСоответствияТЧ.Значение) Тогда
				СоответствияРеквизитовТабличныхЧастей.Удалить(СтрокаСоответствияТЧ);
				Продолжить;
			КонецЕсли;
			
			Если МетаданныеТабличнойЧасти = Неопределено Тогда
				СоответствияРеквизитовТабличныхЧастей.Удалить(СтрокаСоответствияТЧ);
			Иначе
				
				Если ЗначениеЗаполнено(СтрокаСоответствияТЧ.Значение) И
					МетаданныеТабличнойЧасти.Реквизиты.Найти(СтрокаСоответствияТЧ.Значение) = Неопределено Тогда
					СоответствияРеквизитовТабличныхЧастей.Удалить(СтрокаСоответствияТЧ);
				Иначе
					РеквизитыСоответсвтия.Удалить(СтрокаСоответствияТЧ.Ключ);
				КонецЕсли;

			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого РеквизитСоответствия Из РеквизитыСоответсвтия Цикл
			
			Если Не РеквизитСоответствия.Значение Тогда
				Продолжить;
			КонецЕсли;
			
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Для настройки документа %1 в таблице %2 не заполнено обязательное поле %3.'"), 
				ИмяОбъектаМетаданных, СтруктураОтбора.ТипТаблицы, РеквизитСоответствия.Ключ);
			
			SUI_ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, 
				"СоответствияРеквизитовТабличныхЧастей", , Отказ);

		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыИдентификацииСтрокТЧ() 
	
	_ДополнительныеНастройки = ДополнительныеНастройки.Получить();
	
	ПараметрыИдентификацииСтрокТЧ = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		_ДополнительныеНастройки, "ПараметрыИдентификацииСтрокТЧ", Новый Соответствие(), Тип("Соответствие"));
		
	ТипыТаблицыСПараметрамиИдентификацииСтрок = Новый Массив();
	Для Каждого Элемент Из ПараметрыИдентификацииСтрокТЧ Цикл
		ТипыТаблицыСПараметрамиИдентификацииСтрок.Добавить(Элемент.Ключ);
	КонецЦикла;
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.УстановитьПараметр("НастройкиТЧ", НастройкиТабличныхЧастей.Выгрузить(, "ТипТаблицы, КлючСвязи"));
	Запрос.УстановитьПараметр("ТипыТаблицыСПараметрамиИдентификацииСтрок", ТипыТаблицыСПараметрамиИдентификацииСтрок);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НастройкиТЧ.ТипТаблицы КАК ТипТаблицы,
		|	НастройкиТЧ.КлючСвязи КАК КлючСвязи
		|ПОМЕСТИТЬ втНастройкиТЧ
		|ИЗ
		|	&НастройкиТЧ КАК НастройкиТЧ
		|ГДЕ
		|	НЕ НастройкиТЧ.ТипТаблицы В (&ТипыТаблицыСПараметрамиИдентификацииСтрок)";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	Если РезультатыЗапроса[0].Пустой() Тогда
		МенеджерВТ.Закрыть();
		Возврат;
	КонецЕсли;
	
	ВыбираемыеИменаПолейДляТаблицыТовары = Новый Массив();
	ВыбираемыеИменаПолейДляТаблицыТовары.Добавить("Номенклатура");
	ВыбираемыеИменаПолейДляТаблицыТовары.Добавить("Характеристика");
	ВыбираемыеИменаПолейДляТаблицыТовары.Добавить("Упаковка");
	
	ВыбираемыеИменаПолейДляТаблицыШтрихкодыУпаковок = Новый Массив();
	ВыбираемыеИменаПолейДляТаблицыШтрихкодыУпаковок.Добавить("ШтрихкодУпаковки");
	
	ВыбираемыеИменаПолейДляТаблицыСерии = Новый Массив();
	ВыбираемыеИменаПолейДляТаблицыСерии.Добавить("Номенклатура");
	ВыбираемыеИменаПолейДляТаблицыСерии.Добавить("Характеристика");
	ВыбираемыеИменаПолейДляТаблицыСерии.Добавить("Серия");
	ВыбираемыеИменаПолейДляТаблицыСерии.Добавить("Склад");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.УстановитьПараметр("СопоставлениеРеквизитовТЧ", СопоставлениеРеквизитовТабличныхЧастей.Выгрузить(, "КлючСвязи, Поле, ИмяРеквизита, ИспользуетсяПостоянноеЗначение"));
	Запрос.УстановитьПараметр("ВыбираемыеИменаПолейДляТаблицыТовары", ВыбираемыеИменаПолейДляТаблицыТовары);
	Запрос.УстановитьПараметр("ВыбираемыеИменаПолейДляТаблицыШтрихкодыУпаковок", ВыбираемыеИменаПолейДляТаблицыШтрихкодыУпаковок);
	Запрос.УстановитьПараметр("ВыбираемыеИменаПолейДляТаблицыСерии", ВыбираемыеИменаПолейДляТаблицыСерии);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СопоставлениеРеквизитовТЧ.КлючСвязи КАК КлючСвязи,
		|	СопоставлениеРеквизитовТЧ.Поле КАК Поле,
		|	СопоставлениеРеквизитовТЧ.ИмяРеквизита КАК ИмяРеквизита,
		|	СопоставлениеРеквизитовТЧ.ИспользуетсяПостоянноеЗначение КАК ИспользуетсяПостоянноеЗначение
		|ПОМЕСТИТЬ втСопоставлениеРеквизитовТЧ
		|ИЗ
		|	&СопоставлениеРеквизитовТЧ КАК СопоставлениеРеквизитовТЧ
		|ГДЕ
		|	НЕ СопоставлениеРеквизитовТЧ.ИспользуетсяПостоянноеЗначение
		|	И СопоставлениеРеквизитовТЧ.ИмяРеквизита <> """"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втНастройкиТЧ.ТипТаблицы КАК ТипТаблицы,
		|	втСопоставлениеРеквизитовТЧ.ИмяРеквизита КАК ИмяРеквизита
		|ИЗ
		|	втНастройкиТЧ КАК втНастройкиТЧ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСопоставлениеРеквизитовТЧ КАК втСопоставлениеРеквизитовТЧ
		|		ПО втНастройкиТЧ.КлючСвязи = втСопоставлениеРеквизитовТЧ.КлючСвязи
		|		И ВЫБОР
		|			КОГДА втНастройкиТЧ.ТипТаблицы В (ЗНАЧЕНИЕ(Перечисление.SUI_ТипыТаблицДокументовОбмена.Товары),
		|				ЗНАЧЕНИЕ(Перечисление.SUI_ТипыТаблицДокументовОбмена.Отбор),
		|				ЗНАЧЕНИЕ(Перечисление.SUI_ТипыТаблицДокументовОбмена.Размещение))
		|				ТОГДА втСопоставлениеРеквизитовТЧ.Поле В (&ВыбираемыеИменаПолейДляТаблицыТовары)
		|			КОГДА втНастройкиТЧ.ТипТаблицы = ЗНАЧЕНИЕ(Перечисление.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок)
		|				ТОГДА втСопоставлениеРеквизитовТЧ.Поле В (&ВыбираемыеИменаПолейДляТаблицыШтрихкодыУпаковок)
		|			КОГДА втНастройкиТЧ.ТипТаблицы = ЗНАЧЕНИЕ(Перечисление.SUI_ТипыТаблицДокументовОбмена.Серии)
		|				ТОГДА втСопоставлениеРеквизитовТЧ.Поле В (&ВыбираемыеИменаПолейДляТаблицыСерии)
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|ИТОГИ
		|ПО
		|	ТипТаблицы";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	МенеджерВТ.Закрыть();
	
	Если Не РезультатЗапроса.Пустой() Тогда
	
		Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока Выборка.Следующий() Цикл
			
			ПараметрыИдентификацииСтрокиТЧ = Новый Структура();
			ПараметрыИдентификацииСтрокиТЧ.Вставить("ТипИдентификацииСтроки", Перечисления.SUI_ТипыИдентификацииСтрокТЧ.ПоСовокупностиРеквизитов);
			ПараметрыИдентификацииСтрокиТЧ.Вставить("РеквизитИдентификацииСтроки", "");
			ПараметрыИдентификацииСтрокиТЧ.Вставить("РеквизитыИдентификацииСтроки", Новый Массив());
			
			ВыборкаРеквизитов = Выборка.Выбрать();
			Пока ВыборкаРеквизитов.Следующий() Цикл
				ПараметрыИдентификацииСтрокиТЧ.РеквизитыИдентификацииСтроки.Добавить(ВыборкаРеквизитов.ИмяРеквизита);
			КонецЦикла;

			ПараметрыИдентификацииСтрокТЧ.Вставить(Выборка.ТипТаблицы, ПараметрыИдентификацииСтрокиТЧ);
			
		КонецЦикла;
		
		_ДополнительныеНастройки.Вставить("ПараметрыИдентификацииСтрокТЧ", ПараметрыИдентификацииСтрокТЧ);
		
		ДополнительныеНастройки = Новый ХранилищеЗначения(_ДополнительныеНастройки, Новый СжатиеДанных(9));
	
	КонецЕсли;
		
КонецПроцедуры

Процедура ЗаполнитьМобильныеУстройстваПриЗаписи()
	
	НаборЗаписей = РегистрыСведений.SUI_НастройкиДокументовМобильныхУстройств.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.НастройкаДокумента.Установить(Ссылка);
	НаборЗаписей.Заполнить(Новый Структура());
	
	Если НаборЗаписей.Количество() > 0 Тогда
		НаборЗаписей.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПерезаполнитьНастройкиТабличныхЧастейПередЗаписью()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НастройкиТабличныхЧастей", НастройкиТабличныхЧастей.Выгрузить());
	Запрос.УстановитьПараметр("СопоставлениеРеквизитовТабличныхЧастей", 
		СопоставлениеРеквизитовТабличныхЧастей.Выгрузить());
	Запрос.Текст =
		"ВЫБРАТЬ
		|	АВТОНОМЕРЗАПИСИ() КАК НомерПоПорядку,
		|	НастройкиТабличныхЧастей.КлючСвязи КАК КлючСвязи,
		|	НастройкиТабличныхЧастей.ТипТаблицы,
		|	НастройкиТабличныхЧастей.ИмяТабличнойЧасти,
		|	НастройкиТабличныхЧастей.УдалятьПустыеСтроки,
		|	НастройкиТабличныхЧастей.ПропускатьПриЗаписи
		|ПОМЕСТИТЬ втНастройкиТЧ
		|ИЗ
		|	&НастройкиТабличныхЧастей КАК НастройкиТабличныхЧастей
		|ГДЕ
		|	НастройкиТабличныхЧастей.ТипТаблицы <> ЗНАЧЕНИЕ(Перечисление.SUI_ТипыТаблицДокументовОбмена.ПустаяСсылка)
		|	И НастройкиТабличныхЧастей.ИмяТабличнойЧасти <> """"
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	КлючСвязи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АВТОНОМЕРЗАПИСИ() КАК НомерПоПорядку,
		|	СопоставлениеРеквизитовТабличныхЧастей.КлючСвязи КАК КлючСвязи,
		|	СопоставлениеРеквизитовТабличныхЧастей.Поле,
		|	СопоставлениеРеквизитовТабличныхЧастей.ИмяРеквизита,
		|	СопоставлениеРеквизитовТабличныхЧастей.ИспользуетсяПостоянноеЗначение,
		|	СопоставлениеРеквизитовТабличныхЧастей.ПостоянноеЗначение
		|ПОМЕСТИТЬ втСопоставлениеРеквизитовТЧ
		|ИЗ
		|	&СопоставлениеРеквизитовТабличныхЧастей КАК СопоставлениеРеквизитовТабличныхЧастей
		|ГДЕ
		|	СопоставлениеРеквизитовТабличныхЧастей.Поле <> """"
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	КлючСвязи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втНастройкиТЧ.НомерПоПорядку КАК НомерПоПорядкуТЧ,
		|	втНастройкиТЧ.КлючСвязи,
		|	втНастройкиТЧ.ТипТаблицы,
		|	втНастройкиТЧ.ИмяТабличнойЧасти,
		|	втНастройкиТЧ.УдалятьПустыеСтроки,
		|	втНастройкиТЧ.ПропускатьПриЗаписи,
		|	втСопоставлениеРеквизитовТЧ.НомерПоПорядку КАК НомерПоПорядкуРеквизит,
		|	втСопоставлениеРеквизитовТЧ.Поле,
		|	втСопоставлениеРеквизитовТЧ.ИмяРеквизита,
		|	втСопоставлениеРеквизитовТЧ.ИспользуетсяПостоянноеЗначение,
		|	втСопоставлениеРеквизитовТЧ.ПостоянноеЗначение
		|ПОМЕСТИТЬ втОбщаяТаблица
		|ИЗ
		|	втНастройкиТЧ КАК втНастройкиТЧ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСопоставлениеРеквизитовТЧ КАК втСопоставлениеРеквизитовТЧ
		|		ПО втНастройкиТЧ.КлючСвязи = втСопоставлениеРеквизитовТЧ.КлючСвязи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ втНастройкиТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ втСопоставлениеРеквизитовТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	втОбщаяТаблица.КлючСвязи КАК КлючСвязи,
		|	втОбщаяТаблица.ТипТаблицы КАК ТипТаблицы,
		|	втОбщаяТаблица.ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
		|	втОбщаяТаблица.УдалятьПустыеСтроки КАК УдалятьПустыеСтроки,
		|	втОбщаяТаблица.ПропускатьПриЗаписи КАК ПропускатьПриЗаписи
		|ПОМЕСТИТЬ втНастройкиТЧФильтр
		|ИЗ
		|	(ВЫБРАТЬ
		|		МАКСИМУМ(втОбщаяТаблица.НомерПоПорядкуТЧ) КАК НомерПоПорядкуТЧ,
		|		втОбщаяТаблица.ТипТаблицы КАК ТипТаблицы
		|	ИЗ
		|		втОбщаяТаблица КАК втОбщаяТаблица
		|	СГРУППИРОВАТЬ ПО
		|		втОбщаяТаблица.ТипТаблицы) КАК ВложенныйЗапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втОбщаяТаблица КАК втОбщаяТаблица
		|		ПО (ВложенныйЗапрос.ТипТаблицы = втОбщаяТаблица.ТипТаблицы
		|		И ВложенныйЗапрос.НомерПоПорядкуТЧ = втОбщаяТаблица.НомерПоПорядкуТЧ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втОбщаяТаблица.КлючСвязи КАК КлючСвязи,
		|	втОбщаяТаблица.Поле КАК Поле,
		|	втОбщаяТаблица.ИмяРеквизита КАК ИмяРеквизита,
		|	втОбщаяТаблица.ИспользуетсяПостоянноеЗначение КАК ИспользуетсяПостоянноеЗначение,
		|	втОбщаяТаблица.ПостоянноеЗначение КАК ПостоянноеЗначение
		|ИЗ
		|	(ВЫБРАТЬ
		|		МАКСИМУМ(втОбщаяТаблица.НомерПоПорядкуРеквизит) КАК НомерПоПорядкуРеквизит,
		|		втОбщаяТаблица.КлючСвязи КАК КлючСвязи,
		|		втОбщаяТаблица.Поле КАК Поле
		|	ИЗ
		|		втНастройкиТЧФильтр КАК втНастройкиТЧФильтр
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ втОбщаяТаблица КАК втОбщаяТаблица
		|			ПО втНастройкиТЧФильтр.КлючСвязи = втОбщаяТаблица.КлючСвязи
		|	СГРУППИРОВАТЬ ПО
		|		втОбщаяТаблица.КлючСвязи,
		|		втОбщаяТаблица.Поле) КАК ВложенныйЗапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втОбщаяТаблица КАК втОбщаяТаблица
		|		ПО (ВложенныйЗапрос.НомерПоПорядкуРеквизит = втОбщаяТаблица.НомерПоПорядкуРеквизит
		|		И ВложенныйЗапрос.КлючСвязи = втОбщаяТаблица.КлючСвязи
		|		И ВложенныйЗапрос.Поле = втОбщаяТаблица.Поле)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ втОбщаяТаблица";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	НастройкиТабличныхЧастей.Загрузить(РезультатыЗапроса[РезультатыЗапроса.ВГраница() - 2].Выгрузить());
	СопоставлениеРеквизитовТабличныхЧастей.Загрузить(РезультатыЗапроса[РезультатыЗапроса.ВГраница() - 1].Выгрузить());
	
КонецПроцедуры

Процедура ЗаполнитьНастройкиПоСтруктуреДанныхЗаполенения(ДанныеЗаполнения)
	
	МетаданныеОбъекта = Метаданные();
	
	РеквизитыЗаполнения = Новый Массив();
	РеквизитыХранилищаЗначений = Новый Массив();
	ТабличныеЧасти = Новый Массив();
	
	Для Каждого МетаданныеРеквизита Из МетаданныеОбъекта.Реквизиты Цикл
		
		Если МетаданныеРеквизита.Тип.СодержитТип(Тип("ХранилищеЗначения")) Тогда
			РеквизитыХранилищаЗначений.Добавить(МетаданныеРеквизита.Имя);
		Иначе
			РеквизитыЗаполнения.Добавить(МетаданныеРеквизита.Имя);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого МетаданныеТабличнойЧасти Из МетаданныеОбъекта.ТабличныеЧасти Цикл
		ТабличныеЧасти.Добавить(МетаданныеТабличнойЧасти.Имя);
	КонецЦикла;
	
	Для Каждого ЭлементДанных Из ДанныеЗаполнения Цикл
		
		Если РеквизитыЗаполнения.Найти(ЭлементДанных.Ключ) <> Неопределено Тогда
			ЭтотОбъект[ЭлементДанных.Ключ] = ЭлементДанных.Значение;
		ИначеЕсли РеквизитыХранилищаЗначений.Найти(ЭлементДанных.Ключ) <> Неопределено Тогда
			ЭтотОбъект[ЭлементДанных.Ключ] = Новый ХранилищеЗначения(ЭлементДанных.Значение, Новый СжатиеДанных(9));
		ИначеЕсли ТабличныеЧасти.Найти(ЭлементДанных.Ключ) <> Неопределено Тогда
			
			ЭтотОбъект[ЭлементДанных.Ключ].Очистить();
			
			Если ТипЗнч(ЭлементДанных.Значение) = Тип("ТаблицаЗначений") Тогда
				ЭтотОбъект[ЭлементДанных.Ключ].Загрузить(ЭлементДанных.Значение);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ДанныеЗаполнения.Свойство("ПометкаУдаления") Тогда
		ПометкаУдаления = ДанныеЗаполнения.ПометкаУдаления;
	КонецЕсли;
	
	Если ПустаяСтрока(СинонимОбъектаМетаданных) Тогда
		СинонимОбъектаМетаданных = ИмяОбъектаМетаданных;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСписокЗапрещенныхСтатусов()
	
	МассивСтатусов = ЗапрещенныеСтатусы();
	
	Для Каждого Статус Из МассивСтатусов Цикл
		НоваяСтрока = СписокСтатусовКодовМаркировок.Добавить();
		НоваяСтрока.КодСтатуса = Статус;
	КонецЦикла;
	
КонецПроцедуры

Функция ЗапрещенныеСтатусы()
	
	МассивСтатусов = Новый Массив();
	
	МассивСтатусов.Добавить("EMITTED");
	МассивСтатусов.Добавить("APPLIED");
	МассивСтатусов.Добавить("INTRODUCED");
	МассивСтатусов.Добавить("WRITTEN_OFF");
	МассивСтатусов.Добавить("RETIRED");
	МассивСтатусов.Добавить("WITHDRAWN");
	МассивСтатусов.Добавить("INTRODUCED_RETURNED");
	МассивСтатусов.Добавить("DISAGGREGATION");
	МассивСтатусов.Добавить("DISAGGREGATED");
	
	Возврат МассивСтатусов;
	
КонецФункции
#КонецОбласти

#КонецЕсли