
#Область ОписаниеПеременных

&НаКлиенте
Перем ПорядокСтраниц;

&НаКлиенте
Перем ГраницаСтраниц;

&НаКлиенте
Перем МаксимальноеКоличествоВыбираемыхСобытийЖР;

&НаКлиенте
Перем МаксимальноеКоличествоВыбираемыхЗаписейЛогирования;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	СистемнаяИнформация = Новый СистемнаяИнформация();
	
	Элементы.ИнформацияПлатформа1С.Заголовок = СтрШаблон(НСтр("ru = '1С: Предприятие %1'"), 
		СистемнаяИнформация.ВерсияПриложения);
	
	Элементы.ИнформацияКонфигурация1С.Заголовок = СтрШаблон(НСтр("ru = '%1, ред.%2 (%3)'"), 
		Метаданные.Синоним, 
		SUI_ОбщегоНазначения.РедакцияКонфигурации(), 
		Метаданные.Версия);
	
	Элементы.ИнформацияРасширениеSimple.Заголовок = СтрШаблон(НСтр("ru = '%1 (%2)'"), 
		SUI_SimpleКлиентСервер.Представление(), 
		SUI_SimpleКлиентСервер.Версия());
	
	Элементы.АдресЭлектроннойПочтыТехническойПоддержки.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
		СтрШаблон(НСтр("ru = '<a style=""color: ГиперссылкаЦвет; font: ВажнаяНадписьШрифт"" href=""mailto:%1"">%1</a>'"),
		SUI_SimpleКлиентСервер.ПочтаТехподдержки()));
	
	ИнициализацияПараметровЖурналаРегистрацииПриСозданииНаСервере();
	
	ИнициализацияПараметровЗаписейЛогированияHTTPЗапросовПриСозданииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МаксимальноеКоличествоВыбираемыхСобытийЖР = 20;
	ОбновитьПодсказкуСобытийЖурналаРегистрации();
	
	МаксимальноеКоличествоВыбираемыхЗаписейЛогирования = 20;
	ОбновитьПодсказкуЗаписиЛогированияHTTPЗапросов();
	
	// Инициализировать порядок страниц
	ПорядокСтраниц = Новый Массив();
	Для Каждого ПодчиненныйЭлемент Из Элементы.Страницы.ПодчиненныеЭлементы Цикл
		Если ПодчиненныйЭлемент.Вид = ВидГруппыФормы.Страница И
			ПодчиненныйЭлемент.Видимость И
			ПодчиненныйЭлемент.ПодчиненныеЭлементы.Количество() > 0 Тогда
			ПорядокСтраниц.Добавить(ПодчиненныйЭлемент);
		КонецЕсли;
	КонецЦикла;
	
	ГраницаСтраниц = ?(ПорядокСтраниц.Количество() = 0, -1, ПорядокСтраниц.ВГраница());
	
	СменаСтраницы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Окно.Содержимое.Количество() > 1 Тогда
		Отказ = Истина;
		СтандартнаяОбработка = Ложь;
		Окно.Содержимое[Окно.Содержимое.ВГраница()].Закрыть();
	ИначеЕсли Не ЗакрытьФормуБезПодтверждения Тогда
		
		ТекстПредупреждения = НСтр("ru = 'Закрыть мастер обращения в техническую поддержку?'");
		ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияПроизвольнойФормы(ЭтотОбъект, Отказ, ЗавершениеРаботы,
			ТекстПредупреждения, "ЗакрытьФормуБезПодтверждения");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура МобильноеПриложениеВерсияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ОткрытьРедакторВерсии(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура МобильноеПриложениеКонфигурацияВерсияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ОткрытьРедакторВерсии(Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСобытияЖурналаРегистрации

&НаКлиенте
Процедура СобытияЖурналаРегистрацииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") И ВыбранноеЗначение.Свойство("Событие") И
		ВыбранноеЗначение.Событие = "УстановленОтборЖурналаРегистрации" Тогда
		
		ОтборЖурналаРегистрации.Очистить();
		Для Каждого ЭлементСписка Из ВыбранноеЗначение.Отбор Цикл
			ОтборЖурналаРегистрации.Вставить(ЭлементСписка.Представление, ЭлементСписка.Значение);
		КонецЦикла;
		
		ОбновитьТекущийСписокСобытийЖурналаРегистрации();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СобытияЖурналаРегистрацииПометкаПриИзменении(Элемент)
	
	ОбновитьПодсказкуСобытийЖурналаРегистрации();
	
КонецПроцедуры

&НаКлиенте
Процедура СобытияЖурналаРегистрацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПараметрыВыбора = Новый Структура();
	ПараметрыВыбора.Вставить("ТекущиеДанные", Элементы.СобытияЖурналаРегистрации.ТекущиеДанные);
	ПараметрыВыбора.Вставить("Поле", Поле);
	ПараметрыВыбора.Вставить("ОтборЖурналаРегистрации", ОтборЖурналаРегистрации);
	ПараметрыВыбора.Вставить("ХранилищеДанных", ХранилищеДанныхЖР);
	
	ЖурналРегистрацииКлиент.СобытияВыбор(ПараметрыВыбора);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗаписиЛогированияHTTPЗапросов

&НаКлиенте
Процедура ЗаписиЛогированияHTTPЗапросовПометкаПриИзменении(Элемент)
	
	ОбновитьПодсказкуЗаписиЛогированияHTTPЗапросов();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписиЛогированияHTTPЗапросовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	//@skip-check structure-consructor-too-many-keys
	СтруктураЗаписи = Новый Структура("Период,SID,Метод,Удалить_МобильноеУстройство");
	ЗаполнитьЗначенияСвойств(СтруктураЗаписи, Элемент.ТекущиеДанные);
	
	КлючЗаписи = Новый ("РегистрСведенийКлючЗаписи.SUI_ЛогированиеHTTPЗапросов", 
		SUI_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СтруктураЗаписи));
	
	ПараметрыОткрытия = Новый Структура("Ключ", КлючЗаписи);
	ОткрытьФорму("РегистрСведений.SUI_ЛогированиеHTTPЗапросов.ФормаЗаписи", ПараметрыОткрытия);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВложения

&НаКлиенте
Процедура ВложенияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	Отказ = Истина;
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузкаФайлаВложенияЗавершение", ЭтотОбъект);
	
	ПараметрыЗагрузкиФайла = ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла();
	ПараметрыЗагрузкиФайла.ИдентификаторФормы = УникальныйИдентификатор;
	ПараметрыЗагрузкиФайла.Диалог.МножественныйВыбор = Ложь;
	ПараметрыЗагрузкиФайла.Диалог.ПроверятьСуществованиеФайла = Истина;
	ПараметрыЗагрузкиФайла.Диалог.Фильтр = ПолучитьФильтрДиалогаВыбораВложений();
	ПараметрыЗагрузкиФайла.Диалог.Заголовок = НСтр("ru = 'Выберите вложение к обращению'");
	
	ФайловаяСистемаКлиент.ЗагрузитьФайл(Оповещение, ПараметрыЗагрузкиФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ВложенияПослеУдаления(Элемент)
	
	ОбновитьЗаголовокГруппыВложения();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПредыдущаяСтраница(Команда)
	
	СменаСтраницы("Назад");
	
КонецПроцедуры

&НаКлиенте
Процедура СледующаяСтраница(Команда)
	
	СменаСтраницы("Вперед");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЖурналРегистрации(Команда)
	
	УстановитьОтборСобытийЖурналаРегистрацииНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСобытияЖурналаРегистрации(Команда)
	
	ОбновитьТекущийСписокСобытийЖурналаРегистрации();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЗаписиЛогированияHTTPЗапросов(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьЗаписиЛогированияHTTPЗапросовПослеНастройкиОтбора", ЭтотОбъект);
	
	ПараметрыОткрытия = SUI_КомпоновкаДанныхКлиент.ПараметрыОткрытияНастройкиСхемыКомпоновкиДанных(Оповещение, ЭтотОбъект);
	ПараметрыОткрытия.Окно = Окно;
	ПараметрыОткрытия.Уникальность = УникальныйИдентификатор;
	
	ПараметрыНастройкиСхемы = SUI_КомпоновкаДанныхКлиент.ПараметрыНастройкиСхемыКомпоновкиДанных(
		АдресСхемыКомпоновкиЗаписиЛогирования, АдресНастроекКомпоновкиЗаписиЛогирования, УникальныйИдентификатор);
	ПараметрыНастройкиСхемы.НеЗагружатьСхемуКомпоновкиДанныхИзФайла = Истина;
	ПараметрыНастройкиСхемы.НеРедактироватьСхемуКомпоновкиДанных = Истина;
	ПараметрыНастройкиСхемы.НеПомещатьНастройкиВСхемуКомпоновкиДанных = Истина;
	ПараметрыНастройкиСхемы.НеНастраиватьВыбор = Истина;
	ПараметрыНастройкиСхемы.НеНастраиватьПараметры = Истина;
	ПараметрыНастройкиСхемы.НеНастраиватьПользовательскиеПоля = Истина;
	ПараметрыНастройкиСхемы.НеНастраиватьПорядок = Истина;
	ПараметрыНастройкиСхемы.Заголовок = НСтр("ru = 'Настройте отбор выбора записей логирования HTTP запросов'");
	
	SUI_КомпоновкаДанныхКлиент.ОткрытьНастройкиКомпоновкиДанных(ПараметрыОткрытия, ПараметрыНастройкиСхемы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаписиЛогированияHTTPЗапросов(Команда)
	
	ОбновитьТекущийСписокЗаписейЛогированияHTTPЗапросов();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьОбращениеВФайл(Команда)
	
	РезультатВыполнения = ПодготовитьФайлОбращенияНаСервере();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Заголовок = НСтр("ru = 'Формирование файла обращения в техническую поддержку'");
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПодготовитьФайлОбращенияЗавершение", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьРедакторВерсии(Элемент)
	
	ПараметрыРедактированияВерсии = Новый Структура();
	
	Если Элемент = Элементы.МобильноеПриложениеВерсия Тогда
		ПараметрыРедактированияВерсии.Вставить("Версия", МобильноеПриложениеВерсия);
		ПараметрыРедактированияВерсии.Вставить("Заголовок", НСтр("ru = 'Версия мобильного приложения'"));
	ИначеЕсли Элемент = Элементы.МобильноеПриложениеКонфигурацияВерсия Тогда
		ПараметрыРедактированияВерсии.Вставить("Заголовок", НСтр("ru = 'Версия конфигурации мобильного приложения'"));
		ПараметрыРедактированияВерсии.Вставить("Версия", МобильноеПриложениеКонфигурацияВерсия);
	КонецЕсли;
	
	ОткрытьФорму("ОбщаяФорма.SUI_РедактированиеВерсии", ПараметрыРедактированияВерсии, Элемент, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура СменаСтраницы(Направление = Неопределено)
	
	Если ГраницаСтраниц < 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтраница = Элементы.Страницы.ТекущаяСтраница;
	ИндексСтраницы = ПорядокСтраниц.Найти(ТекущаяСтраница);
	
	Если ИндексСтраницы = Неопределено Тогда
		ИндексСтраницы = 0;
	КонецЕсли;
	
	Если Направление = "Назад" Тогда
		ИндексСтраницы = ИндексСтраницы - 1;
	ИначеЕсли Направление = "Вперед" Тогда
		
		Если ТекущаяСтраница = Элементы.СтраницаЖурналРегистрации
			И Не ПроверитьКоличествоВыбранныхСобытийЖурналаРегистрации() Тогда
			Возврат;
		ИначеЕсли ТекущаяСтраница = Элементы.СтраницаЗаписиЛогированияHTTPЗапросов И 
			Не ПроверитьКоличествоВыбранныхЗаписейЛогированияHTTPЗапросов() Тогда
			Возврат;
		ИначеЕсли ТекущаяСтраница = Элементы.СтраницаСообщениеИВложения И 
			Не ПроверитьКоличествоВложений() Тогда
			Возврат;
		КонецЕсли;
		
		ИндексСтраницы = ИндексСтраницы + 1;
		
	КонецЕсли;
	
	Если ИндексСтраницы < 0 Тогда
		ИндексСтраницы = 0;
	ИначеЕсли ИндексСтраницы > ГраницаСтраниц Тогда
		Закрыть();
		ИндексСтраницы = ГраницаСтраниц;
	КонецЕсли;
	
	Если ИндексСтраницы = 0 Тогда
		Элементы.ФормаПредыдущаяСтраница.Видимость = Ложь;
		Элементы.ФормаСледующаяСтраница.Заголовок = НСтр("ru = 'Начать'");
		Элементы.ФормаСледующаяСтраница.Картинка = БиблиотекаКартинок.СтартБизнесПроцесса;
		Элементы.ФормаСледующаяСтраница.КнопкаПоУмолчанию = Истина;
	ИначеЕсли ИндексСтраницы < ГраницаСтраниц Тогда
		Элементы.ФормаПредыдущаяСтраница.Видимость = Истина;
		Элементы.ФормаСледующаяСтраница.Заголовок = НСтр("ru = 'Далее'");
		Элементы.ФормаСледующаяСтраница.Картинка = БиблиотекаКартинок.ПерейтиВперед;
		Элементы.ФормаСледующаяСтраница.КнопкаПоУмолчанию = Ложь;
	Иначе
		Элементы.ФормаПредыдущаяСтраница.Видимость = Истина;
		Элементы.ФормаСледующаяСтраница.Заголовок = НСтр("ru = 'Завершить'");
		Элементы.ФормаСледующаяСтраница.Картинка = БиблиотекаКартинок.ВыполнитьЗадачу;
		Элементы.ФормаСледующаяСтраница.КнопкаПоУмолчанию = Истина;
	КонецЕсли;
	
	Элементы.Страницы.ТекущаяСтраница = ПорядокСтраниц.Получить(ИндексСтраницы);
	
КонецПроцедуры

#Область ЛогированиеHTTPЗапросов

&НаСервере
Процедура ИнициализацияПараметровЗаписейЛогированияHTTPЗапросовПриСозданииНаСервере()
	
	АдресСхемыКомпоновкиЗаписиЛогирования = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	АдресНастроекКомпоновкиЗаписиЛогирования = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	
	РегистрыСведений.SUI_ЛогированиеHTTPЗапросов.ИнициализироватьСхемуПоУмолчанию(
		АдресСхемыКомпоновкиЗаписиЛогирования, АдресНастроекКомпоновкиЗаписиЛогирования);
	
	НастройкаКомпоновки = ПолучитьИзВременногоХранилища(АдресНастроекКомпоновкиЗаписиЛогирования);
	ПредставлениеОтбораЗаписиЛогирования = Строка(НастройкаКомпоновки.Отбор);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЗаписиЛогированияHTTPЗапросовПослеНастройкиОтбора(АдресНастройкиКД, Контекст) Экспорт
	
	Если АдресНастройкиКД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	АдресНастроекКомпоновкиЗаписиЛогирования = АдресНастройкиКД;
	
	НастройкаКомпоновки = ПолучитьИзВременногоХранилища(АдресНастроекКомпоновкиЗаписиЛогирования);
	ПредставлениеОтбораЗаписиЛогирования = Строка(НастройкаКомпоновки.Отбор);
	
	ОбновитьТекущийСписокЗаписейЛогированияHTTPЗапросов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТекущийСписокЗаписейЛогированияHTTPЗапросов()
	
	РезультатВыполнения = ОбновитьТекущийСписокЗаписейЛогированияHTTPЗапросовНаСервере();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Заголовок = НСтр("ru = 'Получение записей логирования HTTP запросов'");
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения(
		"ОбновитьТекущийСписокЗаписейЛогированияHTTPЗапросовЗавершение", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ОбновитьТекущийСписокЗаписейЛогированияHTTPЗапросовНаСервере()
	
	Если ЗначениеЗаполнено(ИдентификаторЗаданияПолучениеЗаписейЛогирования) Тогда
		ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗаданияПолучениеЗаписейЛогирования);
	КонецЕсли;
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("НастройкиКомпоновкиОтбор", 
		ПолучитьИзВременногоХранилища(АдресНастроекКомпоновкиЗаписиЛогирования));
	ПараметрыПроцедуры.Вставить("КоличествоПоследнихЗаписей", 100);
	ПараметрыПроцедуры.Вставить("ТаблицаСписка", РеквизитФормыВЗначение("ЗаписиЛогированияHTTPЗапросов"));
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = 
		СтрШаблон(НСтр("ru = '%1. Получение записей логирования HTTP запросов'"),
		SUI_SimpleКлиентСервер.Представление());
	
	РезультатВыполнения = ДлительныеОперации.ВыполнитьВФоне(
		"РегистрыСведений.SUI_ЛогированиеHTTPЗапросов.ПолучитьЗаписиЛогирования",
		ПараметрыПроцедуры, ПараметрыВыполнения);
	
	Если РезультатВыполнения.Статус = "Ошибка" Тогда
		ВызватьИсключение РезультатВыполнения.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	ИдентификаторЗаданияПолучениеЗаписейЛогирования = РезультатВыполнения.ИдентификаторЗадания;
	
	Возврат РезультатВыполнения;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьТекущийСписокЗаписейЛогированияHTTPЗапросовЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		ЗагрузитьПодготовленныеДанныеЗаписейЛогированияHTTPЗапросов(Результат.АдресРезультата);
		ПозиционированиеЗаписейЛогированияHTTPЗапросовВКонецСписка();
		ОбновитьПодсказкуЗаписиЛогированияHTTPЗапросов();
		
		Если ЗаписиЛогированияHTTPЗапросов.Количество() = 0 Тогда
			ТекстПредупреждения = НСтр("ru = 'Отсутствуют записи удовлетворяющие условию отбора'");
			ПоказатьПредупреждение(, ТекстПредупреждения, 10, НСтр("ru = 'Логирование HTTP запросов'"));
		КонецЕсли;
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ПозиционированиеЗаписейЛогированияHTTPЗапросовВКонецСписка();
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПозиционированиеЗаписейЛогированияHTTPЗапросовВКонецСписка()
	
	Если ЗаписиЛогированияHTTPЗапросов.Количество() > 0 Тогда
		
		Элементы.ЗаписиЛогированияHTTPЗапросов.ТекущаяСтрока = 
			ЗаписиЛогированияHTTPЗапросов[ЗаписиЛогированияHTTPЗапросов.Количество() - 1].ПолучитьИдентификатор();
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ЗагрузитьПодготовленныеДанныеЗаписейЛогированияHTTPЗапросов(АдресРезультата)
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	ЗаписиЛогирования = Результат.ТаблицаСписок;
	
	Если ЗаписиЛогирования.Колонки.Найти("Пометка") = Неопределено Тогда
		ЗаписиЛогирования.Колонки.Добавить("Пометка", Новый ОписаниеТипов("Булево"));
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ЗаписиЛогирования, "ЗаписиЛогированияHTTPЗапросов");
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьКоличествоВыбранныхЗаписейЛогированияHTTPЗапросов()
	Возврат ЗаписиЛогированияHTTPЗапросов.НайтиСтроки(Новый Структура("Пометка", Истина)).Количество();
КонецФункции

&НаКлиенте
Функция ПроверитьКоличествоВыбранныхЗаписейЛогированияHTTPЗапросов()
	
	Если ПолучитьКоличествоВыбранныхЗаписейЛогированияHTTPЗапросов() <= МаксимальноеКоличествоВыбираемыхЗаписейЛогирования Тогда
		Возврат Истина;
	Иначе
		ТекстОшибки = НСтр("ru = 'Превышено допустимое количество выбранных записей логирования HTTP запросов.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , "ЗаписиЛогированияHTTPЗапросов");
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьПодсказкуЗаписиЛогированияHTTPЗапросов()
	
	ШаблонПодсказки = СтрШаблон(
		НСтр("ru = 'Выберите не более %1 записей логирования HTTP запросов.'"),
		Формат(МаксимальноеКоличествоВыбираемыхЗаписейЛогирования, "ЧГ=0;"));
	
	Элементы.ЗаписиЛогированияHTTPЗапросов.Подсказка = СтрШаблон(НСтр("ru = '%1 Выбрано: %2'"),
		ШаблонПодсказки, ПолучитьКоличествоВыбранныхЗаписейЛогированияHTTPЗапросов());
	
	Если Не ПустаяСтрока(ПредставлениеОтбораЗаписиЛогирования) Тогда
		
		Элементы.ЗаписиЛогированияHTTPЗапросов.Подсказка = 
			СтрШаблон(НСтр("ru = 'Отбор: %1'"), ПредставлениеОтбораЗаписиЛогирования)
			+ Символы.ПС
			+ Элементы.ЗаписиЛогированияHTTPЗапросов.Подсказка;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЖурналРегистрации

&НаСервере
Процедура ИнициализацияПараметровЖурналаРегистрацииПриСозданииНаСервере()
	
	Элементы.СтраницаЖурналРегистрации.Видимость = Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	МетаданныеСтандартнойОбработки = Метаданные.Обработки.Найти("ЖурналРегистрации");
	Если МетаданныеСтандартнойОбработки = Неопределено Или
		МетаданныеСтандартнойОбработки.Формы.Найти("ОтборЖурналаРегистрации") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОтборЖурналаРегистрации = Новый Структура();
	ОтборЖурналаРегистрации.Вставить("ДатаНачала", НачалоДня(ТекущаяДатаСеанса()));
	ОтборЖурналаРегистрации.Вставить("ДатаОкончания", КонецДня(ТекущаяДатаСеанса()));
	
	ОтборПоСобытию = Новый СписокЗначений();
	Для Каждого ЭлементСобытие Из ПолучитьЗначенияОтбораЖурналаРегистрации("Событие").Событие Цикл
		
		Если СтрНачинаетсяС(ЭлементСобытие.Ключ, SUI_SimpleКлиентСервер.Представление()) Тогда
			ОтборПоСобытию.Добавить(ЭлементСобытие.Ключ, ЭлементСобытие.Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	Если ОтборПоСобытию.Количество() > 0 Тогда
		ОтборЖурналаРегистрации.Вставить("Событие", ОтборПоСобытию);
	КонецЕсли;
	
	Элементы.СтраницаЖурналРегистрации.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборСобытийЖурналаРегистрацииНаКлиенте()
	
	ОтборФормы = Новый СписокЗначений();
	Для Каждого КлючИЗначение Из ОтборЖурналаРегистрации Цикл
		ОтборФормы.Добавить(КлючИЗначение.Значение, КлючИЗначение.Ключ);
	КонецЦикла;
	
	ПараметрыОткрытияОтбора = Новый Структура();
	ПараметрыОткрытияОтбора.Вставить("Отбор", ОтборФормы);
	
	ОткрытьФорму("Обработка.ЖурналРегистрации.Форма.ОтборЖурналаРегистрации", ПараметрыОткрытияОтбора, 
		Элементы.СобытияЖурналаРегистрации, УникальныйИдентификатор, Окно);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТекущийСписокСобытийЖурналаРегистрации()
	
	РезультатВыполнения = ПрочитатьСобытияЖурналаРегистрацииНаСервере();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Заголовок = НСтр("ru = 'Получение событий журнала регистрации'");
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбновитьТекущийСписокСобытийЖурналаРегистрацииЗавершение", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ПрочитатьСобытияЖурналаРегистрацииНаСервере()
	
	Если ЗначениеЗаполнено(ИдентификаторЗаданияПолучениеСобытийЖР) Тогда
		ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗаданияПолучениеСобытийЖР);
	КонецЕсли;
	
	ДатаНачала    = Неопределено; // Дата
	ДатаОкончания = Неопределено; // Дата
	ДатыОтбораУказаны = Ложь;
	
	Если ОтборЖурналаРегистрации.Свойство("ДатаНачала", ДатаНачала) И
		ОтборЖурналаРегистрации.Свойство("ДатаОкончания", ДатаОкончания) Тогда
		
		Если ЗначениеЗаполнено(ДатаНачала) И ЗначениеЗаполнено(ДатаОкончания) Тогда
			ДатыОтбораУказаны = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДатыОтбораУказаны Тогда
		SUI_ОбщегоНазначенияКлиентСервер.Проверить(ДатаНачала <= ДатаОкончания,
			НСтр("ru = 'Некорректно заданы условия отбора журнала регистрации.
			|Дата начала не может быть больше даты окончания.'"));
	КонецЕсли;
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ОтборЖурналаРегистрации", ОтборЖурналаРегистрации);
	ПараметрыПроцедуры.Вставить("КоличествоПоказываемыхСобытий", 100);
	ПараметрыПроцедуры.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
	ПараметрыПроцедуры.Вставить("МенеджерВладельца", Обработки.ЖурналРегистрации);
	ПараметрыПроцедуры.Вставить("ДобавлятьДополнительныеКолонки", Ложь);
	ПараметрыПроцедуры.Вставить("Журнал", РеквизитФормыВЗначение("СобытияЖурналаРегистрации"));
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = СтрШаблон(НСтр("ru = '%1. Обновление журнала регистрации'"),
		SUI_SimpleКлиентСервер.Представление());
	
	РезультатВыполнения = ДлительныеОперации.ВыполнитьВФоне("ЖурналРегистрации.ПрочитатьСобытияЖурналаРегистрации",
		ПараметрыПроцедуры, ПараметрыВыполнения);
	
	Если РезультатВыполнения.Статус = "Ошибка" Тогда
		ВызватьИсключение РезультатВыполнения.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	ИдентификаторЗаданияПолучениеСобытийЖР = РезультатВыполнения.ИдентификаторЗадания;
	
	Возврат РезультатВыполнения;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьТекущийСписокСобытийЖурналаРегистрацииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		ЗагрузитьПодготовленныеДанныеСобытийЖурналаРегистрации(Результат.АдресРезультата);
		ПозиционированиеСобытийЖурналаРегистрацииВКонецСписка();
		
		Если СобытияЖурналаРегистрации.Количество() = 0 Тогда
			ТекстПредупреждения = НСтр("ru = 'Отсутствуют события удовлетворяющие условию отбора'");
			ПоказатьПредупреждение(, ТекстПредупреждения, 10, НСтр("ru = 'События журнала регистрации'"));
		КонецЕсли;
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ПозиционированиеСобытийЖурналаРегистрацииВКонецСписка();
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПодготовленныеДанныеСобытийЖурналаРегистрации(АдресРезультата)
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Если Результат.СобытияЖурнала.Колонки.Найти("Пометка") = Неопределено Тогда
		Результат.СобытияЖурнала.Колонки.Добавить("Пометка", Новый ОписаниеТипов("Булево"));
	КонецЕсли;
	
	Если Результат.СобытияЖурнала.Колонки.Найти("АдресДанных") = Неопределено Тогда
		Результат.СобытияЖурнала.Колонки.Добавить("АдресДанных", SUI_ОбщегоНазначения.ОписаниеТипаСтрока(0));
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(Результат.СобытияЖурнала, "СобытияЖурналаРегистрации");
	
КонецПроцедуры

&НаКлиенте
Процедура ПозиционированиеСобытийЖурналаРегистрацииВКонецСписка()
	
	Если СобытияЖурналаРегистрации.Количество() > 0 Тогда
		
		Элементы.СобытияЖурналаРегистрации.ТекущаяСтрока = 
			СобытияЖурналаРегистрации[СобытияЖурналаРегистрации.Количество() - 1].ПолучитьИдентификатор();
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Функция ПолучитьКоличествоВыбранныхСобытийЖурналаРегистрации()
	Возврат СобытияЖурналаРегистрации.НайтиСтроки(Новый Структура("Пометка", Истина)).Количество();
КонецФункции

&НаКлиенте
Функция ПроверитьКоличествоВыбранныхСобытийЖурналаРегистрации()
	
	Если ПолучитьКоличествоВыбранныхСобытийЖурналаРегистрации() <= МаксимальноеКоличествоВыбираемыхСобытийЖР Тогда
		Возврат Истина;
	Иначе
		ТекстОшибки = НСтр("ru = 'Превышено допустимое количество выбранных событий журнала регистрации.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , "СобытияЖурналаРегистрации");
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьПодсказкуСобытийЖурналаРегистрации()
	
	ШаблонПодсказкиСобытийЖурналаРегистрации = СтрШаблон(
		НСтр("ru = 'Выберите не более %1 событий журнала регистрации.'"),
		Формат(МаксимальноеКоличествоВыбираемыхСобытийЖР, "ЧГ=0;"));
	
	Элементы.СобытияЖурналаРегистрации.Подсказка = СтрШаблон(НСтр("ru = '%1 Выбрано: %2'"),
		ШаблонПодсказкиСобытийЖурналаРегистрации, ПолучитьКоличествоВыбранныхСобытийЖурналаРегистрации());
	
КонецПроцедуры

#КонецОбласти

#Область ВложенияФайлов

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьФильтрДиалогаВыбораВложений()
	
	ФильтрыФайлов = Новый Массив();
	ФильтрыФайлов.Добавить("Изображение (*.jpeg, *.jpg, *.png, *.bmp, *.raw)|*.jpeg;*.jpg;*.png;*.bmp;*.raw");
	ФильтрыФайлов.Добавить("Текстовый документ (*.txt)|*.txt");
	ФильтрыФайлов.Добавить("Документ MS Word (*.docx, *.doc)|*.docx;*.doc");
	ФильтрыФайлов.Добавить("Документ MS Excel (*.xlsx, *.xls)|*.xlsx;*.xls");
	ФильтрыФайлов.Добавить("Документ 1С: Предприятие (*.mxl)|*.mxl");
	ФильтрыФайлов.Добавить("Документ XML (*.xml)|*.xml");
	ФильтрыФайлов.Добавить("Документ JSON (*.json)|*.json");
	ФильтрыФайлов.Добавить("Документ BSL (*.bsl)|*.bsl");
	ФильтрыФайлов.Добавить("Архив ZIP (*.zip)|*.zip");
	ФильтрыФайлов.Добавить("Файл внешней обработки 1C (*.epf)|*.epf");
	ФильтрыФайлов.Добавить("Файл внешнего отчета 1C (*.erf)|*.erf");
	ФильтрыФайлов.Добавить("Файл расширения 1C (*.cfe)|*.cfe");
	
	Возврат СтрСоединить(ФильтрыФайлов, "|");
	
КонецФункции

&НаКлиенте
Процедура ЗагрузкаФайлаВложенияЗавершение(ЗагруженныйФайл, ДополнительныеПараметры) Экспорт
	
	Если ЗагруженныйФайл = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РазборИмениФайла = SUI_ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ЗагруженныйФайл.Имя);
	
	ОписаниеФайла = Новый Структура();
	ОписаниеФайла.Вставить("Хранение", ЗагруженныйФайл.Хранение);
	ОписаниеФайла.Вставить("Имя", РазборИмениФайла.Имя);
	ОписаниеФайла.Вставить("Расширение", РазборИмениФайла.Расширение);
	ОписаниеФайла.Вставить("Представление", РазборИмениФайла.ИмяБезРасширения);
	
	Оповещение = Новый ОписаниеОповещения("ОписаниеНаименованияФайлаВложенияЗавершение", ЭтотОбъект, ОписаниеФайла);
	ПоказатьВводСтроки(Оповещение, ОписаниеФайла.Представление, НСтр("ru = 'Введите наименование файла'"), , Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеНаименованияФайлаВложенияЗавершение(ПредставлениеФайла, ОписаниеФайла) Экспорт
	
	Если ПредставлениеФайла = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПустаяСтрока(ПредставлениеФайла) Тогда
		ОписаниеФайла.Представление = ПредставлениеФайла;
	КонецЕсли;
	
	СтрокаВложения = Вложения.Добавить();
	СтрокаВложения.АдресХранения = ОписаниеФайла.Хранение;
	СтрокаВложения.Имя = ОписаниеФайла.Имя;
	СтрокаВложения.Расширение = ОписаниеФайла.Расширение;
	СтрокаВложения.Представление = ОписаниеФайла.Представление;
	
	Элементы.Вложения.ТекущаяСтрока = СтрокаВложения.ПолучитьИдентификатор();
	
	ОбновитьЗаголовокГруппыВложения();
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьКоличествоВложений()
	Возврат Вложения.Количество();
КонецФункции

&НаКлиенте
Функция ПроверитьКоличествоВложений()
	
	Если ПолучитьКоличествоВложений() <= 15 Тогда
		Возврат Истина;
	Иначе
		ТекстОшибки = НСтр("ru = 'Превышено допустимое количество вложений файлов.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , "Вложения");
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьЗаголовокГруппыВложения()
	
	Элементы.ГруппаВложения.Заголовок = НСтр("ru = 'Вложения'");
	
	КоличествоВложений = ПолучитьКоличествоВложений();
	Если КоличествоВложений > 0 Тогда
		Элементы.ГруппаВложения.Заголовок = Элементы.ГруппаВложения.Заголовок 
			+ " (" + Формат(КоличествоВложений, "ЧГ=0;") + ")";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПодготовкаФайлаОбращения

&НаСервере
Функция ПодготовитьФайлОбращенияНаСервере()
	
	ПараметрыПроцедуры = Новый Структура;
	
	ПараметрыПроцедуры.Вставить("МобильноеПриложение", Новый Структура());
	ПараметрыПроцедуры.МобильноеПриложение.Вставить("Версия", МобильноеПриложениеВерсия);
	ПараметрыПроцедуры.МобильноеПриложение.Вставить("Конфигурация", МобильноеПриложениеКонфигурация);
	ПараметрыПроцедуры.МобильноеПриложение.Вставить("ВерсияКонфигурации", МобильноеПриложениеКонфигурацияВерсия);
	
	ПараметрыПроцедуры.Вставить("ЗаписиЛогированияHTTPЗапросов", 
		ЗаписиЛогированияHTTPЗапросов.Выгрузить(Новый Структура("Пометка", Истина)));
	
	ПараметрыПроцедуры.Вставить("СобытияЖурналаРегистрации", 
		СобытияЖурналаРегистрации.Выгрузить(Новый Структура("Пометка", Истина)));
	
	ПараметрыПроцедуры.Вставить("Сообщение", Сообщение);
	
	ВложенияТаблица = РеквизитФормыВЗначение("Вложения");
	ВложенияТаблица.Колонки.Добавить("КВыгрузке", Новый ОписаниеТипов("Булево"));
	ВложенияТаблица.Колонки.Добавить("Данные");
	Для Каждого СтрокаВложения Из ВложенияТаблица Цикл
		Если ЭтоАдресВременногоХранилища(СтрокаВложения.АдресХранения) Тогда
			СтрокаВложения.Данные = ПолучитьИзВременногоХранилища(СтрокаВложения.АдресХранения);
			Если ТипЗнч(СтрокаВложения.Данные) = Тип("ДвоичныеДанные") И ЗначениеЗаполнено(СтрокаВложения.Данные) Тогда
				СтрокаВложения.КВыгрузке = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ВложенияТаблица = ВложенияТаблица.Скопировать(Новый Структура("КВыгрузке", Истина), 
		"Имя,Расширение,Представление,Описание,Данные");
	
	ПараметрыПроцедуры.Вставить("Вложения", ВложенияТаблица);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = 
		СтрШаблон(НСтр("ru = '%1. Подготовка файла обращения в техническую поддержку'"), 
		SUI_SimpleКлиентСервер.Представление());
	
	РезультатВыполнения = ДлительныеОперации.ВыполнитьВФоне(
		"Обработки.SUI_ОбращениеВТехническуюПоддержку.ПодготовитьФайлОбращения",
		ПараметрыПроцедуры, ПараметрыВыполнения);
	
	Если РезультатВыполнения.Статус = "Ошибка" Тогда
		ВызватьИсключение РезультатВыполнения.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	ИдентификаторЗаданияПолучениеСобытийЖР = РезультатВыполнения.ИдентификаторЗадания;
	
	Возврат РезультатВыполнения;
	
КонецФункции

&НаКлиенте
Процедура ПодготовитьФайлОбращенияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		Оповещение = Новый ОписаниеОповещения("ПодготовитьФайлОбращенияЗавершениеСохранения", ЭтотОбъект);
		
		ИмяФайла = СтрШаблон("%1_Issue_%2.zip",
			SUI_SimpleКлиентСервер.Представление(), 
			Формат(ОбщегоНазначенияКлиент.ДатаСеанса(), "ДФ=dd_MM_yyyy_HH_mm_ss;"));
		
		ПараметрыСохраненияФайла = ФайловаяСистемаКлиент.ПараметрыСохраненияФайла();
		ПараметрыСохраненияФайла.Диалог.Заголовок = 
			СтрШаблон(НСтр("ru = 'Сохраните файл обращения в техническую поддержку %1'"),
			SUI_SimpleКлиентСервер.Представление());
			
		ФайловаяСистемаКлиент.СохранитьФайл(Оповещение, Результат.АдресРезультата, ИмяФайла, ПараметрыСохраненияФайла);
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьФайлОбращенияЗавершениеСохранения(СохраненныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если СохраненныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СохраненныеФайлы.Количество() > 0 Тогда
		ФайловаяСистемаКлиент.ОткрытьПроводник(СохраненныеФайлы[0].ПолноеИмя);
	КонецЕсли;
	
	СменаСтраницы("Вперед");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
