
#Область ОписаниеПеременных

&НаКлиенте
Перем БиблиотекаИнициализирована;

&НаКлиенте
Перем РедакторЗагружен;

&НаКлиенте
Перем СтрокаВРедакторУстановлена;

&НаКлиенте
Перем РезультатПриЗакрытии;

&НаКлиенте
Перем ИдентификаторРедактируемойСтроки;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ФормаЗавершитьРедактирование.Видимость = Параметры.СохранятьРезультат;
	Элементы.ФормаРежимРедактирования.Пометка = Не Параметры.РежимПросмотраПриОткрытии;
	
	Элементы.ФормаЗагрузитьИзФайла.Доступность = Элементы.ФормаРежимРедактирования.Пометка;
	
	Элементы.ФормаЗагрузитьИзФайла.Видимость = Не Параметры.НеЗагружатьИзФайла;
	Элементы.ФормаСохранитьВФайл.Видимость = Не Параметры.НеВыгружатьВФайл;
	
	Если Не ПустаяСтрока(Параметры.Заголовок) Тогда
		Заголовок = Параметры.Заголовок;
		АвтоЗаголовок = Ложь;
	КонецЕсли;
	
	Если Параметры.СтрокиJSON.Количество() > 0 Тогда
		ПакетыСтрок = Параметры.СтрокиJSON;
	Иначе
		ПакетыСтрок.Добавить(Параметры.СтрокаJSON);
		ВозвратПервого = Истина;
	КонецЕсли;
	
	Для Каждого СтрокаПакета Из ПакетыСтрок Цикл
		
		Если ПустаяСтрока(СтрокаПакета.Представление) Тогда
			СтрокаПакета.Представление = СтрШаблон(
				НСтр("ru = 'Строка JSON %1'"), 
				Формат(ПакетыСтрок.Индекс(СтрокаПакета), "ЧГ=;"));
		КонецЕсли;
		
	КонецЦикла;
	
	Если ПолучитьФункциональнуюОпцию("SUI_ИспользоватьРедакторJSON") Тогда
		АдресБиблиотеки = ПоместитьВоВременноеХранилище(
			Обработки.SUI_РедакторJSON.ПолучитьМакет(ИмяБиблиотеки()), УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	БиблиотекаИнициализирована = Ложь;
	РедакторЗагружен = Ложь;
	СтрокаВРедакторУстановлена = Ложь;
	
	#Если ВебКлиент Тогда
		
		Элементы.РедакторHTML.Видимость = Ложь;
		Элементы.ФормаРежимДерева.Видимость = Ложь;
		Элементы.ФормаПереустановитьБиблиотеку.Видимость = Ложь;
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаРедакторСтрока;
		
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ИндексныйФайл) Тогда
		
		Отказ = Истина;
		СтандартнаяОбработка = Ложь;
		
		Оповещение = Новый ОписаниеОповещения("ПослеУдаленияИндексногоФайлаПередЗакрытием", ЭтотОбъект);
		НачатьУдалениеФайлов(Оповещение, ИндексныйФайл);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РедакторHTMLДокументСформирован(Элемент)
	
	РедакторЗагружен = Истина;
	
	ПодключитьОбработчикОжидания("УстановитьРедактируемуюСтрокуВРедакторHTML", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура РедакторHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Если ДанныеСобытия.Свойство("Href") И ЗначениеЗаполнено(ДанныеСобытия.Href) Тогда
		
		СтандартнаяОбработка = Ложь;
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(ДанныеСобытия.Href);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПакетыСтрок

&НаКлиенте
Процедура ПакетыСтрокПриАктивизацииСтроки(Элемент)
	
	Если ИдентификаторРедактируемойСтроки = Неопределено Тогда
		
		ИдентификаторРедактируемойСтроки = Элемент.ТекущаяСтрока;
		РедактируемаяСтрока = ПакетыСтрок.НайтиПоИдентификатору(Элемент.ТекущаяСтрока).Значение;
		
		Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаРедакторСтрока Тогда
			ПереключитьРежимРедактирования();
		ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаРедакторHTML Тогда
			Элементы.ПакетыСтрок.Доступность = Ложь;
			ИнициализироватьБиблиотеку();
		КонецЕсли;
		
	ИначеЕсли Элементы.ПакетыСтрок.ТекущиеДанные <> Неопределено Тогда
		
		Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаРедакторHTML И СтрокаВРедакторУстановлена Тогда
			РедактируемаяСтрока = ПолучитьРедактируемуюСтрокуИзРедактораHTML();
		КонецЕсли;
		
		ПакетыСтрок.НайтиПоИдентификатору(ИдентификаторРедактируемойСтроки).Значение = РедактируемаяСтрока;
		
		Если ИдентификаторРедактируемойСтроки <> Элемент.ТекущаяСтрока Тогда
			
			РедактируемаяСтрока = Элементы.ПакетыСтрок.ТекущиеДанные.Значение;
			ИдентификаторРедактируемойСтроки = Элементы.ПакетыСтрок.ТекущаяСтрока;
			
			Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаРедакторHTML Тогда
				ПодключитьОбработчикОжидания("УстановитьРедактируемуюСтрокуВРедакторHTML", 0.1, Истина);
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаРедакторHTML И СтрокаВРедакторУстановлена Тогда
		РедактируемаяСтрока = ПолучитьРедактируемуюСтрокуИзРедактораHTML();
	КонецЕсли;
	
	Если ИдентификаторРедактируемойСтроки <> Неопределено Тогда
		
		ПакетыСтрок.НайтиПоИдентификатору(ИдентификаторРедактируемойСтроки).Значение = РедактируемаяСтрока;
		
		Если ВозвратПервого Тогда
			Результат = ПакетыСтрок[0].Значение;
		Иначе
			
			Результат = Новый СписокЗначений();
			Для Каждого ЭлементСписка Из ПакетыСтрок Цикл
				Результат.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
			КонецЦикла;
			
		КонецЕсли;
		
		РезультатПриЗакрытии = Результат;
	
	КонецЕсли;
	
	Закрыть(РезультатПриЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура РежимРедактирования(Команда)
	
	Элементы.ФормаРежимРедактирования.Пометка = Не Элементы.ФормаРежимРедактирования.Пометка;
	
	ПереключитьРежимРедактирования();
	
КонецПроцедуры

&НаКлиенте
Процедура РежимДерева(Команда)
	
	Элементы.ФормаРежимДерева.Пометка = Не Элементы.ФормаРежимДерева.Пометка;
	
	СменитьРежимРедактораHTML(Элементы.ФормаРежимРедактирования.Пометка, Элементы.ФормаРежимДерева.Пометка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереустановитьБиблиотеку(Команда)
	
	#Если Не ВебКлиент Тогда
		
		Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаРедакторHTML Тогда
			
			Оповещение = Новый ОписаниеОповещения("ПослеПодтвержденияПереустановитьБиблиотеку", ЭтотОбъект);
			ПоказатьВопрос(Оповещение, НСтр("ru = 'Выполнить переустановку библиотеки редактора?'"), 
				РежимДиалогаВопрос.ДаНет);
			
		КонецЕсли;
		
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВФайл(Команда)
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаРедакторHTML И СтрокаВРедакторУстановлена Тогда
		РедактируемаяСтрока = ПолучитьРедактируемуюСтрокуИзРедактораHTML();
	КонецЕсли;
	
	Если ИдентификаторРедактируемойСтроки <> Неопределено Тогда
		ПакетыСтрок.НайтиПоИдентификатору(ИдентификаторРедактируемойСтроки).Значение = РедактируемаяСтрока;
	КонецЕсли;
	
	Если ПустаяСтрока(РедактируемаяСтрока) Тогда
		Возврат;
	КонецЕсли;
	
	#Если ВебКлиент Тогда
		АдресДанных = ЗаписатьТекстРедактораВДвоичныеДанныеНаСервере(РедактируемаяСтрока, УникальныйИдентификатор);
	#Иначе
		
		ПотокЗаписи = Новый ПотокВПамяти();
		
		ДокументТекст = Новый ТекстовыйДокумент();
		ДокументТекст.УстановитьТекст(РедактируемаяСтрока);
		ДокументТекст.Записать(ПотокЗаписи, КодировкаТекста.UTF8, "");
		
		АдресДанных = ПоместитьВоВременноеХранилище(ПотокЗаписи.ЗакрытьИПолучитьДвоичныеДанные(), УникальныйИдентификатор);
		
	#КонецЕсли
	
	Оповещение = Новый ОписаниеОповещения("СохранитьВФайлЗавершение", ЭтотОбъект);
	
	ПараметрыСохраненияФайла = ФайловаяСистемаКлиент.ПараметрыСохраненияФайла();
	ПараметрыСохраненияФайла.Диалог.Фильтр = ФильтрДиалогаФайлаJSON();
	ПараметрыСохраненияФайла.Диалог.Заголовок = НСтр("ru = 'Сохранить JSON в файл'");
	
	ФайловаяСистемаКлиент.СохранитьФайл(Оповещение, АдресДанных, , ПараметрыСохраненияФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	
	Если Не Элементы.ФормаРежимРедактирования.Пометка Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаРедакторHTML И СтрокаВРедакторУстановлена Тогда
		РедактируемаяСтрока = ПолучитьРедактируемуюСтрокуИзРедактораHTML();
	КонецЕсли;
	
	Если ИдентификаторРедактируемойСтроки <> Неопределено Тогда
		ПакетыСтрок.НайтиПоИдентификатору(ИдентификаторРедактируемойСтроки).Значение = РедактируемаяСтрока;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьИзФайлаПослеПодтверждения", ЭтотОбъект);
	
	Если Не ПустаяСтрока(РедактируемаяСтрока) Тогда
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Редактор JSON не пустой.
		|Загрузить JSON из файла?'"), РежимДиалогаВопрос.ДаНет);
	Иначе
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияБиблиотеки

&НаКлиентеНаСервереБезКонтекста
Функция ИмяБиблиотеки()
	Возврат "JsonEditor";
КонецФункции

&НаКлиенте
Функция ИндексныйФайлЭталон()
	Возврат SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(КаталогБиблиотеки, "index.html");
КонецФункции

&НаКлиенте
Функция ВременныйИндексныйФайл()
	Возврат SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(КаталогБиблиотеки,
		Формат(ТекущаяУниверсальнаяДатаВМиллисекундах(), "ЧГ=0") + ".html");
КонецФункции

&НаКлиенте
Процедура ИнициализироватьБиблиотеку(Переустановка = Ложь)
	
	Контекст = Новый Структура();
	
	Если Переустановка Тогда
		Контекст.Вставить("ПереустановитьБиблиотеку");
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеПодключенияРасширенияДляРаботыСФайлами", ЭтотОбъект, Контекст);
	ТекстВопроса = НСтр("ru = 'Для работы с редактором JSON требуется установить расширение для работы с 1С:Предприятием.
	|Установить?'");
	SUI_ОбщегоНазначенияКлиент.ПодключитьРасширениеРаботыСФайламиСВозможнойУстановкой(Оповещение, ТекстВопроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодключенияРасширенияДляРаботыСФайлами(РасширениеПодключено, Контекст) Экспорт
	
	Если РасширениеПодключено Тогда
		
		КаталогБиблиотеки = SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(
			SUI_ОбщегоНазначенияКлиент.КаталогВспомогательныхБиблиотекSimple(), ИмяБиблиотеки());
		
		Оповещение = Новый ОписаниеОповещения("ПослеПроверкиСуществованияКаталогаБиблиотеки", ЭтотОбъект, Контекст); 
		ФайлНаДиске = Новый Файл(КаталогБиблиотеки);
		ФайлНаДиске.НачатьПроверкуСуществования(Оповещение);
		
	Иначе
		ПоказатьОшибку(НСтр("ru = 'Расширение для работы с 1С:Предприятием не подключено.'"), Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПроверкиСуществованияКаталогаБиблиотеки(Существует, Контекст) Экспорт
	
	Если Существует Тогда
		
		Если Контекст.Свойство("ПопыткаСозданияКаталогаБиблиотеки") Тогда
			Контекст.Удалить("ПопыткаСозданияКаталогаБиблиотеки");
		КонецЕсли;
		
		Если Контекст.Свойство("ПереустановитьБиблиотеку") Тогда
			Контекст.Очистить();
			Контекст.Вставить("ПопыткаПереустановитьБиблиотеку");
			ИзвлечьБиблиотеку(Контекст);
		Иначе
			НачатьПроверкуСуществованияИндексногоФайлаБиблиотеки(Контекст);
		КонецЕсли;
		
	ИначеЕсли Контекст.Свойство("ПопыткаСозданияКаталогаБиблиотеки") Тогда
		ПоказатьОшибку(НСтр("ru = 'Не создать каталог библиотеки.'"), Истина);
	Иначе
		
		Контекст.Вставить("ПопыткаСозданияКаталогаБиблиотеки");
		
		Оповещение = Новый ОписаниеОповещения("ПослеСозданияКаталогаБиблиотеки", ЭтотОбъект, Контекст);
		НачатьСозданиеКаталога(Оповещение, КаталогБиблиотеки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПроверкуСуществованияИндексногоФайлаБиблиотеки(Контекст)
	
	Оповещение = Новый ОписаниеОповещения("ПослеПроверкиСуществованияИндексногоФайлаБиблиотеки", ЭтотОбъект, Контекст);
	ФайлНаДиске = Новый Файл(ИндексныйФайлЭталон());
	ФайлНаДиске.НачатьПроверкуСуществования(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеСозданияКаталогаБиблиотеки(ИмяКаталога, Контекст) Экспорт
	
	Оповещение = Новый ОписаниеОповещения("ПослеПроверкиСуществованияКаталогаБиблиотеки", ЭтотОбъект, Контекст);
	ФайлНаДиске = Новый Файл(ИмяКаталога);
	ФайлНаДиске.НачатьПроверкуСуществования(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПроверкиСуществованияИндексногоФайлаБиблиотеки(Существует, Контекст) Экспорт
		
	Если Существует Тогда
		
		Если Контекст.Свойство("ПопыткаИзвлеченияФайловБиблиотеки") Тогда
			Контекст.Удалить("ПопыткаИзвлеченияФайловБиблиотеки");
		КонецЕсли;
		
		Если Контекст.Свойство("ПопыткаПереустановитьБиблиотеку") Тогда
			Контекст.Удалить("ПопыткаПереустановитьБиблиотеку");
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Библиотека редактора была переустановлена'"));
		КонецЕсли;
		
		Оповещение = Новый ОписаниеОповещения("ПослеКопированияИндексногоФайлаБиблиотеки", ЭтотОбъект, Контекст);
		НачатьКопированиеФайла(Оповещение, ИндексныйФайлЭталон(), ВременныйИндексныйФайл());
		
	ИначеЕсли Контекст.Свойство("ПопыткаИзвлеченияФайловБиблиотеки") Тогда
		ПоказатьОшибку(НСтр("ru = 'Библиотека повреждена.'"), Истина);
	Иначе
		ИзвлечьБиблиотеку(Контекст);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеКопированияИндексногоФайлаБиблиотеки(СкопированныйФайл, Контекст) Экспорт
	
	ИндексныйФайл = СкопированныйФайл;
	РедакторHTML = ИндексныйФайл;
	
	БиблиотекаИнициализирована = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзвлечьБиблиотеку(Контекст = Неопределено)
	
	Если Контекст = Неопределено Тогда
		Контекст = Новый Структура();
	КонецЕсли;
	
	Контекст.Вставить("ПопыткаИзвлеченияФайловБиблиотеки");
	
	Оповещение = Новый ОписаниеОповещения("ПослеУдаленияФайловБиблиотеки", ЭтотОбъект, Контекст);
	НачатьУдалениеФайлов(Оповещение, КаталогБиблиотеки, "*.*");
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеУдаленияФайловБиблиотеки(Контекст) Экспорт
	
	Если Контекст.Свойство("ПопыткаИзвлеченияФайловБиблиотеки") Тогда
		
		#Если Не ВебКлиент Тогда
			
			ДанныеБиблиотеки = ПолучитьИзВременногоХранилища(АдресБиблиотеки);
		
			Поток = ДанныеБиблиотеки.ОткрытьПотокДляЧтения();
			
			ЧтениеАрхива = Новый ЧтениеZipФайла(Поток);
			ЧтениеАрхива.ИзвлечьВсе(КаталогБиблиотеки, РежимВосстановленияПутейФайловZIP.Восстанавливать);
			ЧтениеАрхива.Закрыть();
			
			Поток.Закрыть();
			
			НачатьПроверкуСуществованияИндексногоФайлаБиблиотеки(Контекст);
		
		#КонецЕсли
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодтвержденияПереустановитьБиблиотеку(Подтверждение, Контекст) Экспорт
	
	Если Подтверждение = КодВозвратаДиалога.Да Тогда
		
		РедактируемаяСтрока = ПолучитьРедактируемуюСтрокуИзРедактораHTML();
		
		БиблиотекаИнициализирована = Ложь;
		РедакторЗагружен = Ложь;
		СтрокаВРедакторУстановлена = Ложь;
		
		ИнициализироватьБиблиотеку(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеУдаленияИндексногоФайлаПередЗакрытием(Контекст) Экспорт
	
	ИндексныйФайл = "";
	
	Закрыть(РезультатПриЗакрытии);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПоказатьОшибку(ТекстОшибки, ЗакрытьРедактор = Ложь)
	
	Перем Оповещение;
	
	Если ЗакрытьРедактор Тогда
		Оповещение = Новый ОписаниеОповещения("ЗакрытьРедакторПослеОшибки", ЭтотОбъект);
		ТекстОшибки = ТекстОшибки + "
		|
		|Дальнейшая работа с редактором невозможна.";
	КонецЕсли;
	
	ПоказатьПредупреждение(Оповещение, ТекстОшибки, , НСтр("ru = 'Ошибка'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьРедакторПослеОшибки(Контекст) Экспорт
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьРежимРедактирования()
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаРедакторСтрока Тогда
		Элементы.РедакторСтрока.ТолькоПросмотр = Не Элементы.ФормаРежимРедактирования.Пометка;
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаРедакторHTML И
		БиблиотекаИнициализирована И РедакторЗагружен Тогда
		СменитьРежимРедактораHTML(Элементы.ФормаРежимРедактирования.Пометка, Элементы.ФормаРежимДерева.Пометка);
	КонецЕсли;
	
	Элементы.ФормаЗагрузитьИзФайла.Доступность = Элементы.ФормаРежимРедактирования.Пометка;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтруктуруДокументаРедактораHTML()
	
	Перем СтруктураДокумента;
	
	Если БиблиотекаИнициализирована И РедакторЗагружен Тогда
		
		ДокументHTML = Элементы.РедакторHTML.Документ;
		
		Если ДокументHTML.parentWindow = Неопределено Тогда
			СтруктураДокумента = ДокументHTML.defaultView;
		Иначе
			СтруктураДокумента = ДокументHTML.parentWindow;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтруктураДокумента;
	
КонецФункции

&НаКлиенте
Функция ПолучитьРедактируемуюСтрокуИзРедактораHTML(КакJSON = Ложь)
	
	Результат = "";
	
	СтруктураДокумента = ПолучитьСтруктуруДокументаРедактораHTML();
	
	Если СтруктураДокумента <> Неопределено Тогда
		Результат = ?(КакJSON, СтруктураДокумента.getJSON(), СтруктураДокумента.editor.getText());
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура УстановитьРедактируемуюСтрокуВРедакторHTML() Экспорт
	
	СтруктураДокумента = ПолучитьСтруктуруДокументаРедактораHTML();
	
	Если СтруктураДокумента <> Неопределено Тогда
		
		СтрокаВРедакторУстановлена = Истина;
		
		СтруктураДокумента.editor.setText(РедактируемаяСтрока);
		СменитьРежимРедактораHTML(Элементы.ФормаРежимРедактирования.Пометка, Элементы.ФормаРежимДерева.Пометка);
		
		Если Не Элементы.ПакетыСтрок.Доступность Тогда
			Элементы.ПакетыСтрок.Доступность = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СменитьРежимРедактораHTML(РежимРедактированияВКлючен, РежимДереваВключен)
	
	СтруктураДокумента = ПолучитьСтруктуруДокументаРедактораHTML();
	
	Если СтруктураДокумента <> Неопределено Тогда
		
		Если РежимДереваВключен Тогда
			НовыйРежим = ?(РежимРедактированияВКлючен, "tree", "view");
		Иначе
			НовыйРежим = ?(РежимРедактированияВКлючен, "code", "preview");
		КонецЕсли;
		
		СтруктураДокумента.editor.setMode(НовыйРежим);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ФильтрДиалогаФайлаJSON()
	Возврат "JSON (*.json)|*.json";
КонецФункции

&НаСервереБезКонтекста
Функция ЗаписатьТекстРедактораВДвоичныеДанныеНаСервере(Текст, Идентификатор)
	
	ПотокЗаписи = Новый ПотокВПамяти();
	
	ДокументТекст = Новый ТекстовыйДокумент();
	ДокументТекст.УстановитьТекст(Текст);
	ДокументТекст.Записать(ПотокЗаписи, КодировкаТекста.UTF8, "");
	
	Возврат ПоместитьВоВременноеХранилище(ПотокЗаписи.ЗакрытьИПолучитьДвоичныеДанные(), Идентификатор);
	
КонецФункции

&НаКлиенте
Процедура СохранитьВФайлЗавершение(СохраненныеФайлы, Контекст) Экспорт
	
	Если СохраненныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СохраненныеФайлы.Количество() > 0 Тогда
		ФайловаяСистемаКлиент.ОткрытьПроводник(СохраненныеФайлы[0].ПолноеИмя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайлаПослеПодтверждения(Подтверждение, Контекст) Экспорт
	
	Если Подтверждение <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьИзФайлаПослеВыбораФайла", ЭтотОбъект);
	ПараметрыЗагрузкиФайла = ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла();
	ПараметрыЗагрузкиФайла.Диалог.Фильтр = ФильтрДиалогаФайлаJSON();
	ПараметрыЗагрузкиФайла.Диалог.Заголовок = НСтр("ru = 'Загрузить JSON из файла'");
	
	ФайловаяСистемаКлиент.ЗагрузитьФайл(Оповещение, ПараметрыЗагрузкиФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайлаПослеВыбораФайла(ПомещенныйФайл, Контекст) Экспорт
	
	Если ПомещенныйФайл = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗагруженныйФайл = Новый ТекстовыйДокумент();
	Оповещение = Новый ОписаниеОповещения("ПриЗавершенииЧтенияЗагруженногоФайлаКода", ЭтотОбъект, ЗагруженныйФайл);
	ЗагруженныйФайл.НачатьЧтение(Оповещение, ПомещенныйФайл.Имя, КодировкаТекста.UTF8);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗавершенииЧтенияЗагруженногоФайлаКода(ЗагруженныйФайл) Экспорт
	
	РедактируемаяСтрока = ЗагруженныйФайл.ПолучитьТекст();
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаРедакторHTML Тогда
		УстановитьРедактируемуюСтрокуВРедакторHTML();
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти
