
#Область ОписаниеПеременных

&НаКлиенте
Перем БиблиотекаИнициализирована;

&НаКлиенте
Перем РедакторЗагружен;

&НаКлиенте
Перем РезультатПриЗакрытии;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ФормаЗавершитьРедактирование.Видимость = Параметры.СохранятьРезультат;
	Элементы.ФормаРежимРедактирования.Пометка = Не Параметры.РежимПросмотраПриОткрытии;
	
	Элементы.ФормаЗагрузитьИзФайла.Доступность = Элементы.ФормаРежимРедактирования.Пометка;
	
	Элементы.ФормаЗагрузитьИзФайла.Видимость = Не Параметры.НеЗагружатьИзФайла;
	Элементы.ФормаСохранитьВФайл.Видимость = Не Параметры.НеВыгружатьВФайл;
	
	Если Не ПустаяСтрока(Параметры.Заголовок) Тогда
		Заголовок = Параметры.Заголовок;
		АвтоЗаголовок = Ложь;
	КонецЕсли;
	
	Для индекс = 0 По Параметры.СтрокиJSON.Количество()-1 Цикл
		
		Если ПустаяСтрока(Параметры.СтрокиJSON[индекс].Представление) Тогда
			ПредставлениеВыбораСтроки = СтрШаблон(НСтр("ru = 'JSON %1'"), Формат(индекс+1, "ЧГ=0;"));
		Иначе
			ПредставлениеВыбораСтроки = Параметры.СтрокиJSON[индекс].Представление;
		КонецЕсли;
		
		Элементы.РедактируемаяСтрока.СписокВыбора.Добавить(Параметры.СтрокиJSON[индекс].Значение, ПредставлениеВыбораСтроки);
		
	КонецЦикла;
	
	Если Элементы.РедактируемаяСтрока.СписокВыбора.Количество() = 0 Тогда
		
		ВозвратПервого = Истина;
		
		Если ПустаяСтрока(Параметры.СтрокаJSON) Тогда
			Элементы.РедактируемаяСтрока.СписокВыбора.Добавить("", НСтр("ru = 'JSON 1'"));
		Иначе
			Элементы.РедактируемаяСтрока.СписокВыбора.Добавить(Параметры.СтрокаJSON, НСтр("ru = 'JSON 1'"));
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.РедактируемаяСтрока.Видимость = (Элементы.РедактируемаяСтрока.СписокВыбора.Количество() > 1);
	Элементы.РедактируемаяСтрока.Подсказка = СтрШаблон(НСтр("ru = 'Всего: %1'"), Формат(Элементы.РедактируемаяСтрока.СписокВыбора.Количество(), "ЧГ=0;"));
	
	Если ПолучитьФункциональнуюОпцию("SUI_ИспользоватьРедакторJSON") Тогда
		АдресБиблиотеки = ПоместитьВоВременноеХранилище(
			Обработки.SUI_РедакторJSON.ПолучитьМакет(ИмяБиблиотеки()), УникальныйИдентификатор);
	КонецЕсли;
	
	РедактируемаяСтрока = Элементы.РедактируемаяСтрока.СписокВыбора[0].Значение;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	БиблиотекаИнициализирована = Ложь;
	РедакторЗагружен = Ложь;
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаРедакторСтрока Тогда
		ПереключитьРежимРедактирования();
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаРедакторHTML Тогда
		ИнициализироватьБиблиотеку();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ИндексныйФайл) Тогда
		
		Отказ = Истина;
		СтандартнаяОбработка = Ложь;
		
		Оповещение = Новый ОписаниеОповещения("ПослеУдаленияИндексногоФайлаПередЗакрытием", ЭтотОбъект);
		НачатьУдалениеФайлов(Оповещение, ИндексныйФайл);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РедакторHTMLДокументСформирован(Элемент)
	
	РедакторЗагружен = Истина;
	
	ПодключитьОбработчикОжидания("УстановитьРедактируемуюСтрокуВРедакторHTML", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура РедакторHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Если ДанныеСобытия.Свойство("Href") И ЗначениеЗаполнено(ДанныеСобытия.Href) Тогда
		
		СтандартнаяОбработка = Ложь;
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(ДанныеСобытия.Href);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РедактируемаяСтрокаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаРедакторHTML Тогда
		
		Список = Элементы.РедактируемаяСтрока.СписокВыбора;
		
		ЭлементСписка = Список.НайтиПоЗначению(РедактируемаяСтрока);
		РедактируемаяСтрока = ПолучитьРедактируемуюСтрокуИзРедактораHTML();
		
		Если ЭлементСписка <> Неопределено Тогда
			ЭлементСписка.Значение = РедактируемаяСтрока;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РедактируемаяСтрокаПриИзменении(Элемент)
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаРедакторHTML Тогда
		ПодключитьОбработчикОжидания("УстановитьРедактируемуюСтрокуВРедакторHTML", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)
	
	Список = Элементы.РедактируемаяСтрока.СписокВыбора;
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаРедакторHTML Тогда
		
		ЭлементСписка = Список.НайтиПоЗначению(РедактируемаяСтрока);
		
		Если ЭлементСписка <> Неопределено Тогда
			РедактируемаяСтрока = ПолучитьРедактируемуюСтрокуИзРедактораHTML();
			ЭлементСписка.Значение = РедактируемаяСтрока;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВозвратПервого Тогда
		Результат = Список[0].Значение;
	Иначе
		
		Результат = Новый СписокЗначений();
		Для Каждого ЭлементСписка Из Список Цикл
			Результат.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
		КонецЦикла;
		
	КонецЕсли;
	
	РезультатПриЗакрытии = Результат;
	
	Закрыть(РезультатПриЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура РежимРедактирования(Команда)
	
	Элементы.ФормаРежимРедактирования.Пометка = Не Элементы.ФормаРежимРедактирования.Пометка;
	
	ПереключитьРежимРедактирования();
	
КонецПроцедуры

&НаКлиенте
Процедура РежимДерева(Команда)
	
	Элементы.ФормаРежимДерева.Пометка = Не Элементы.ФормаРежимДерева.Пометка;
	
	СменитьРежимРедактораHTML(Элементы.ФормаРежимРедактирования.Пометка, Элементы.ФормаРежимДерева.Пометка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереустановитьБиблиотеку(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеПодтвержденияПереустановитьБиблиотеку", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, НСтр("ru = 'Выполнить переустановку библиотеки редактора?'"), РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВФайл(Команда)
	
	Список = Элементы.РедактируемаяСтрока.СписокВыбора;
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаРедакторHTML Тогда
		
		ЭлементСписка = Список.НайтиПоЗначению(РедактируемаяСтрока);
		
		Если ЭлементСписка <> Неопределено Тогда
			РедактируемаяСтрока = ПолучитьРедактируемуюСтрокуИзРедактораHTML();
			ЭлементСписка.Значение = РедактируемаяСтрока;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПустаяСтрока(РедактируемаяСтрока) Тогда
		Возврат;
	КонецЕсли;
	
	#Если ВебКлиент Тогда
		АдресДанных = ЗаписатьТекстРедактораВДвоичныеДанныеНаСервере(РедактируемаяСтрока, УникальныйИдентификатор);
	#Иначе
		
		ПотокЗаписи = Новый ПотокВПамяти();
		
		ДокументТекст = Новый ТекстовыйДокумент();
		ДокументТекст.УстановитьТекст(РедактируемаяСтрока);
		ДокументТекст.Записать(ПотокЗаписи, КодировкаТекста.UTF8, "");
		
		АдресДанных = ПоместитьВоВременноеХранилище(ПотокЗаписи.ЗакрытьИПолучитьДвоичныеДанные(), УникальныйИдентификатор);
		
	#КонецЕсли
	
	Оповещение = Новый ОписаниеОповещения("СохранитьВФайлЗавершение", ЭтотОбъект);
	
	ПараметрыСохраненияФайла = ФайловаяСистемаКлиент.ПараметрыСохраненияФайла();
	ПараметрыСохраненияФайла.Диалог.Фильтр = ФильтрДиалогаФайлаJSON();
	ПараметрыСохраненияФайла.Диалог.Заголовок = НСтр("ru = 'Сохранить JSON в файл'");
	
	ФайловаяСистемаКлиент.СохранитьФайл(Оповещение, АдресДанных, , ПараметрыСохраненияФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	
	Если Не Элементы.ФормаРежимРедактирования.Пометка Тогда
		Возврат;
	КонецЕсли;
	
	Список = Элементы.РедактируемаяСтрока.СписокВыбора;
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаРедакторHTML Тогда
		
		ЭлементСписка = Список.НайтиПоЗначению(РедактируемаяСтрока);
		
		Если ЭлементСписка <> Неопределено Тогда
			РедактируемаяСтрока = ПолучитьРедактируемуюСтрокуИзРедактораHTML();
			ЭлементСписка.Значение = РедактируемаяСтрока;
		КонецЕсли;
		
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьИзФайлаПослеПодтверждения", ЭтотОбъект);
	
	Если Не ПустаяСтрока(РедактируемаяСтрока) Тогда
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Редактор JSON не пустой.
		|Загрузить JSON из файла?'"), РежимДиалогаВопрос.ДаНет);
	Иначе
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияБиблиотеки

&НаКлиентеНаСервереБезКонтекста
Функция ИмяБиблиотеки()
	Возврат "JsonEditor";
КонецФункции

&НаКлиенте
Функция ИндексныйФайл()
	Возврат SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(КаталогБиблиотеки,
		Формат(ТекущаяУниверсальнаяДатаВМиллисекундах(), "ЧГ=0") + ".html");
КонецФункции

&НаКлиенте
Процедура ИнициализироватьБиблиотеку(Переустановка = Ложь)
	
	Контекст = Новый Структура();
	
	Если Переустановка Тогда
		Контекст.Вставить("ПереустановитьБиблиотеку");
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеПодключенияРасширенияДляРаботыСФайлами", ЭтотОбъект, Контекст);
	ТекстВопроса = НСтр("ru = 'Для работы с редактором JSON требуется установить расширение для работы с 1С:Предприятием.
	|Установить?'");
	SUI_ОбщегоНазначенияКлиент.ПодключитьРасширениеРаботыСФайламиСВозможнойУстановкой(Оповещение, ТекстВопроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодключенияРасширенияДляРаботыСФайлами(РасширениеПодключено, Контекст) Экспорт
	
	Если РасширениеПодключено Тогда
		
		Контекст.Вставить("ПопыткаПроверкиСуществованияКаталогаБиблиотеки", 1);
		
		КаталогБиблиотеки = SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(
			SUI_ОбщегоНазначенияКлиент.КаталогВспомогательныхБиблиотекSimple(), ИмяБиблиотеки());
		
		Оповещение = Новый ОписаниеОповещения("ПослеПроверкиСуществованияКаталогаБиблиотеки", ЭтотОбъект, Контекст); 
		ФайлНаДиске = Новый Файл(КаталогБиблиотеки);
		ФайлНаДиске.НачатьПроверкуСуществования(Оповещение);
		
	Иначе
		ПоказатьОшибку(НСтр("ru = 'Расширение для работы с 1С:Предприятием не подключено.'"), Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПроверкиСуществованияКаталогаБиблиотеки(Существует, Контекст) Экспорт
	
	Если Существует Тогда
		
		Если Контекст.Свойство("ПопыткаПроверкиСуществованияКаталогаБиблиотеки") Тогда
			Контекст.Удалить("ПопыткаПроверкиСуществованияКаталогаБиблиотеки");
		КонецЕсли;
		
		Если Контекст.Свойство("ПереустановитьБиблиотеку") Тогда
			ИзвлечьБиблиотеку();
		Иначе
			НачатьПроверкуСуществованияИндексногоФайлаБиблиотеки(Контекст);
		КонецЕсли;
		
	Иначе
		
		Если Не Контекст.Свойство("ПопыткаПроверкиСуществованияКаталогаБиблиотеки") Тогда
			Контекст.Вставить("ПопыткаПроверкиСуществованияКаталогаБиблиотеки", 1);
		КонецЕсли;
		
		Если Контекст.ПопыткаПроверкиСуществованияКаталогаБиблиотеки > 3 Тогда
			ПоказатьОшибку(НСтр("ru = 'Не удалось проверить каталог библиотеки.'"), Истина);
		Иначе
			Оповещение = Новый ОписаниеОповещения("ПослеСозданияКаталогаБиблиотеки", ЭтотОбъект, Контекст);
			НачатьСозданиеКаталога(Оповещение, КаталогБиблиотеки);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПроверкуСуществованияИндексногоФайлаБиблиотеки(Контекст)
	
	Контекст.Вставить("ИндексныйФайлПуть", SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(КаталогБиблиотеки, "index.html"));
	
	Оповещение = Новый ОписаниеОповещения("ПослеПроверкиСуществованияИндексногоФайлаБиблиотеки", ЭтотОбъект, Контекст);
	ФайлНаДиске = Новый Файл(Контекст.ИндексныйФайлПуть);
	ФайлНаДиске.НачатьПроверкуСуществования(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеСозданияКаталогаБиблиотеки(ИмяКаталога, Контекст) Экспорт
	
	Контекст.ПопыткаПроверкиСуществованияКаталогаБиблиотеки = Контекст.ПопыткаПроверкиСуществованияКаталогаБиблиотеки+1;
	
	Оповещение = Новый ОписаниеОповещения("ПослеПроверкиСуществованияКаталогаБиблиотеки", ЭтотОбъект, Контекст);
	ФайлНаДиске = Новый Файл(ИмяКаталога);
	ФайлНаДиске.НачатьПроверкуСуществования(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПроверкиСуществованияИндексногоФайлаБиблиотеки(Существует, Контекст) Экспорт
	
	ИндексныйФайлПуть = "";
	Если Контекст.Свойство("ИндексныйФайлПуть", ИндексныйФайлПуть) Тогда
		Контекст.Удалить("ИндексныйФайлПуть");
	Иначе
		ВызватьИсключение НСтр("ru = 'Ошибка параметров контекста (ИндексныйФайлПуть).'");
	КонецЕсли;
	
	Если Существует Тогда
		
		Если Контекст.Свойство("ПослеПроверкиСуществованияИндексногоФайлаБиблиотеки") Тогда
			Контекст.Удалить("ПослеПроверкиСуществованияИндексногоФайлаБиблиотеки");
		КонецЕсли;
		
		Если Контекст.Свойство("ПослеИзвлеченияФайлаБиблиотеки") Тогда
			Контекст.Удалить("ПослеИзвлеченияФайлаБиблиотеки");
		КонецЕсли;
		
		Оповещение = Новый ОписаниеОповещения("ПослеКопированияИндексногоФайлаБиблиотеки", ЭтотОбъект, Контекст);
		НачатьКопированиеФайла(Оповещение, ИндексныйФайлПуть, ИндексныйФайл());
		
	Иначе
		
		Если Контекст.Свойство("ПослеИзвлеченияФайлаБиблиотеки") Тогда
			ПоказатьОшибку(НСтр("ru = 'Библиотека повреждена.'"), Истина);
		Иначе
			ИзвлечьБиблиотеку(Контекст);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеКопированияИндексногоФайлаБиблиотеки(СкопированныйФайл, Контекст) Экспорт
	
	ИндексныйФайл = СкопированныйФайл;
	РедакторHTML = ИндексныйФайл;
	
	БиблиотекаИнициализирована = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзвлечьБиблиотеку(Контекст = Неопределено)
	
	Если Контекст = Неопределено Тогда
		Контекст = Новый Структура();
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеУдаленияФайловБиблиотеки", ЭтотОбъект, Контекст);
	НачатьУдалениеФайлов(Оповещение, КаталогБиблиотеки, "*.*");
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеУдаленияФайловБиблиотеки(Контекст) Экспорт
	
	Контекст.Вставить("ПутьАрхиваБиблиотеки",
		SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(КаталогБиблиотеки, ИмяБиблиотеки() + ".zip"));
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗаписиФайлаБиблиотеки", ЭтотОбъект, Контекст);
	
	ДанныеБиблиотеки = ПолучитьИзВременногоХранилища(АдресБиблиотеки);
	ДанныеБиблиотеки.НачатьЗапись(Оповещение, Контекст.ПутьАрхиваБиблиотеки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписиФайлаБиблиотеки(Контекст) Экспорт
	
	Попытка
		
		#Если ВебКлиент Тогда
			
			Для Каждого ДанныеФайлаБиблиотеки Из РаспаковатьАрхивБиблиотекиНаСервере() Цикл
				
				ТекущийПуть = SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(КаталогБиблиотеки, ДанныеФайлаБиблиотеки.Ключ);
				ДанныеФайлаБиблиотеки.Значение.Записать(ТекущийПуть);
				
			КонецЦикла;
			
		#Иначе
			
			АрхивБиблиотеки = Новый ЧтениеZipФайла(Контекст.ПутьАрхиваБиблиотеки);
			АрхивБиблиотеки.ИзвлечьВсе(КаталогБиблиотеки, РежимВосстановленияПутейФайловZIP.Восстанавливать);
			АрхивБиблиотеки.Закрыть();
			
		#КонецЕсли
		
	Исключение
		ПоказатьОшибку(СтрШаблон(НСтр("ru = 'Ошибка инициализации библиотеки.
		|%1'"), ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке())), Истина);
		Возврат;
	КонецПопытки;
	
	Контекст.Вставить("ПослеИзвлеченияФайлаБиблиотеки");
	
	Оповещение = Новый ОписаниеОповещения("ПослеУдаленияАрхиваБиблиотеки", ЭтотОбъект, Контекст);
	НачатьУдалениеФайлов(Оповещение, Контекст.ПутьАрхиваБиблиотеки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеУдаленияАрхиваБиблиотеки(Контекст) Экспорт
	
	Если Контекст.Свойство("ПутьАрхиваБиблиотеки") Тогда
		Контекст.Удалить("ПутьАрхиваБиблиотеки");
	КонецЕсли;
	
	НачатьПроверкуСуществованияИндексногоФайлаБиблиотеки(Контекст);
	
КонецПроцедуры

&НаСервере
Функция РаспаковатьАрхивБиблиотекиНаСервере()
	
	Перем ТекущийКаталог;
	
	СтруктураБиблиотеки = Новый Соответствие();
	
	Попытка
		
		ТекущийКаталог = ФайловаяСистема.СоздатьВременныйКаталог();
		
		ДанныеБиблиотеки = ПолучитьИзВременногоХранилища(АдресБиблиотеки);
		
		Поток = ДанныеБиблиотеки.ОткрытьПотокДляЧтения();
		
		ЧтениеZIP = Новый ЧтениеZipФайла(Поток);
		ЧтениеZIP.ИзвлечьВсе(ТекущийКаталог, РежимВосстановленияПутейФайловZIP.Восстанавливать);
		ЧтениеZIP.Закрыть();
		
		Поток.Закрыть();
		
		Разделитель = ПолучитьРазделительПути();
		Если Не СтрЗаканчиваетсяНа(ТекущийКаталог, Разделитель) Тогда
			ТекущийКаталог = ТекущийКаталог + Разделитель;
		КонецЕсли;
		
		Для Каждого ФайлИзАрхива Из НайтиФайлы(ТекущийКаталог, "*", Истина) Цикл
			
			Если Не ФайлИзАрхива.ЭтоКаталог() Тогда
				КлючФайла = СтрЗаменить(ФайлИзАрхива.ПолноеИмя, ТекущийКаталог, "");
				СтруктураБиблиотеки.Вставить(КлючФайла, Новый ДвоичныеДанные(ФайлИзАрхива.ПолноеИмя));
			КонецЕсли;
			
		КонецЦикла;
		
		ФайловаяСистема.УдалитьВременныйКаталог(ТекущийКаталог);
		
	Исключение
		Если ТекущийКаталог <> Неопределено Тогда
			ФайловаяСистема.УдалитьВременныйКаталог(ТекущийКаталог);
		КонецЕсли;
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат СтруктураБиблиотеки;
	
КонецФункции

&НаКлиенте
Процедура ПослеПодтвержденияПереустановитьБиблиотеку(Подтверждение, Контекст) Экспорт
	
	Если Подтверждение = КодВозвратаДиалога.Да Тогда
		
		РедактируемаяСтрока = ПолучитьРедактируемуюСтрокуИзРедактораHTML();
		
		БиблиотекаИнициализирована = Ложь;
		РедакторЗагружен = Ложь;
		
		ИнициализироватьБиблиотеку(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеУдаленияИндексногоФайлаПередЗакрытием(Контекст) Экспорт
	
	ИндексныйФайл = "";
	
	Закрыть(РезультатПриЗакрытии);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПоказатьОшибку(ТекстОшибки, ЗакрытьРедактор = Ложь)
	
	Перем Оповещение;
	
	Если ЗакрытьРедактор Тогда
		Оповещение = Новый ОписаниеОповещения("ЗакрытьРедакторПослеОшибки", ЭтотОбъект);
		ТекстОшибки = ТекстОшибки + "
		|
		|Дальнейшая работа с редактором невозможна.";
	КонецЕсли;
	
	ПоказатьПредупреждение(Оповещение, ТекстОшибки, , НСтр("ru = 'Ошибка'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьРедакторПослеОшибки(Контекст) Экспорт
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьРежимРедактирования()
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаРедакторСтрока Тогда
		Элементы.РедакторСтрока.ТолькоПросмотр = Не Элементы.ФормаРежимРедактирования.Пометка;
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаРедакторHTML И
		БиблиотекаИнициализирована И РедакторЗагружен Тогда
		СменитьРежимРедактораHTML(Элементы.ФормаРежимРедактирования.Пометка, Элементы.ФормаРежимДерева.Пометка);
	КонецЕсли;
	
	Элементы.ФормаЗагрузитьИзФайла.Доступность = Элементы.ФормаРежимРедактирования.Пометка;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтруктуруДокументаРедактораHTML()
	
	Перем СтруктураДокумента;
	
	Если БиблиотекаИнициализирована И РедакторЗагружен Тогда
		
		ДокументHTML = Элементы.РедакторHTML.Документ;
		
		Если ДокументHTML.parentWindow = Неопределено Тогда
			СтруктураДокумента = ДокументHTML.defaultView;
		Иначе
			СтруктураДокумента = ДокументHTML.parentWindow;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтруктураДокумента;
	
КонецФункции

&НаКлиенте
Функция ПолучитьРедактируемуюСтрокуИзРедактораHTML(КакJSON = Ложь)
	
	Результат = "";
	
	СтруктураДокумента = ПолучитьСтруктуруДокументаРедактораHTML();
	
	Если СтруктураДокумента <> Неопределено Тогда
		Результат = ?(КакJSON, СтруктураДокумента.getJSON(), СтруктураДокумента.editor.getText());
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура УстановитьРедактируемуюСтрокуВРедакторHTML() Экспорт
	
	СтруктураДокумента = ПолучитьСтруктуруДокументаРедактораHTML();
	
	Если СтруктураДокумента <> Неопределено Тогда
		СтруктураДокумента.editor.setText(РедактируемаяСтрока);
		СменитьРежимРедактораHTML(Элементы.ФормаРежимРедактирования.Пометка, Элементы.ФормаРежимДерева.Пометка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СменитьРежимРедактораHTML(РежимРедактированияВКлючен, РежимДереваВключен)
	
	СтруктураДокумента = ПолучитьСтруктуруДокументаРедактораHTML();
	
	Если СтруктураДокумента <> Неопределено Тогда
		
		Если РежимДереваВключен Тогда
			НовыйРежим = ?(РежимРедактированияВКлючен, "tree", "view");
		Иначе
			НовыйРежим = ?(РежимРедактированияВКлючен, "code", "preview");
		КонецЕсли;
		
		СтруктураДокумента.editor.setMode(НовыйРежим);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ФильтрДиалогаФайлаJSON()
	Возврат "JSON (*.json)|*.json";
КонецФункции

&НаСервереБезКонтекста
Функция ЗаписатьТекстРедактораВДвоичныеДанныеНаСервере(Текст, Идентификатор)
	
	ПотокЗаписи = Новый ПотокВПамяти();
	
	ДокументТекст = Новый ТекстовыйДокумент();
	ДокументТекст.УстановитьТекст(Текст);
	ДокументТекст.Записать(ПотокЗаписи, КодировкаТекста.UTF8, "");
	
	Возврат ПоместитьВоВременноеХранилище(ПотокЗаписи.ЗакрытьИПолучитьДвоичныеДанные(), Идентификатор);
	
КонецФункции

&НаКлиенте
Процедура СохранитьВФайлЗавершение(СохраненныеФайлы, Контекст) Экспорт
	
	Если СохраненныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СохраненныеФайлы.Количество() > 0 Тогда
		ФайловаяСистемаКлиент.ОткрытьПроводник(СохраненныеФайлы[0].ПолноеИмя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайлаПослеПодтверждения(Подтверждение, Контекст) Экспорт
	
	Если Подтверждение <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьИзФайлаПослеВыбораФайла", ЭтотОбъект);
	ПараметрыЗагрузкиФайла = ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла();
	ПараметрыЗагрузкиФайла.Диалог.Фильтр = ФильтрДиалогаФайлаJSON();
	ПараметрыЗагрузкиФайла.Диалог.Заголовок = НСтр("ru = 'Загрузить JSON из файла'");
	
	ФайловаяСистемаКлиент.ЗагрузитьФайл(Оповещение, ПараметрыЗагрузкиФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайлаПослеВыбораФайла(ПомещенныйФайл, Контекст) Экспорт
	
	Если ПомещенныйФайл = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗагруженныйФайл = Новый ТекстовыйДокумент();
	Оповещение = Новый ОписаниеОповещения("ПриЗавершенииЧтенияЗагруженногоФайлаКода", ЭтотОбъект, ЗагруженныйФайл);
	ЗагруженныйФайл.НачатьЧтение(Оповещение, ПомещенныйФайл.Имя, КодировкаТекста.UTF8);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗавершенииЧтенияЗагруженногоФайлаКода(ЗагруженныйФайл) Экспорт
	
	РедактируемаяСтрока = ЗагруженныйФайл.ПолучитьТекст();
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаРедакторHTML Тогда
		УстановитьРедактируемуюСтрокуВРедакторHTML();
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти
