
#Область ПрограммныйИнтерфейс

Функция РазмерПакетаДанных() Экспорт
	
	РазмерПакета = ПолучитьФункциональнуюОпцию("SUI_РазмерПакетаДанных");
	
	Если РазмерПакета < Константы.SUI_РазмерПакетаДанных.МинимальныйРазмер() Тогда
		РазмерПакета = Константы.SUI_РазмерПакетаДанных.МинимальныйРазмер();
	ИначеЕсли РазмерПакета > Константы.SUI_РазмерПакетаДанных.МаксимальныйРазмер() Тогда
		РазмерПакета = Константы.SUI_РазмерПакетаДанных.МаксимальныйРазмер();
	КонецЕсли;
	
	Возврат РазмерПакета;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия 				= "1.0.2.1";
	Обработчик.Процедура 			= "SUI_ПакетыДанных.ОчиститьРегистрПакетыДанных_1_0_2_1";
	Обработчик.РежимВыполнения 		= "Оперативно";
	Обработчик.Комментарий 			= НСтр("ru = 'Очистка регистра пакеты данных'");
	
КонецПроцедуры

Процедура ОчиститьРегистрПакетыДанных_1_0_2_1() Экспорт
	
	Если Метаданные.РегистрыСведений.Найти("Удалить_SUI_ПакетыДанных") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.Удалить_SUI_ПакетыДанных.СоздатьНаборЗаписей();
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Функция ПолучитьЗапросДанных(Таблица, МобильноеУстройство, ТолькоИзменения = Истина, Знач ДополнительныеПараметры = Неопределено) Экспорт
	
	ОписаниеТипаСтруктура = Новый ОписаниеТипов("Структура");
	ДополнительныеПараметры = ОписаниеТипаСтруктура.ПривестиЗначение(ДополнительныеПараметры);
	
	Если ТолькоИзменения Тогда
		ДополнительныеПараметры.Вставить("ТолькоИзменения");
	КонецЕсли;
	
	Если Таблица = Перечисления.SUI_ТаблицыИнтеграции.Контрагенты Тогда
		Возврат ПолучитьЗапросДанных_Контрагенты(МобильноеУстройство, ДополнительныеПараметры);
	ИначеЕсли Таблица = Перечисления.SUI_ТаблицыИнтеграции.Склады Тогда
		Возврат ПолучитьЗапросДанных_Склады(МобильноеУстройство, ДополнительныеПараметры);
	ИначеЕсли Таблица = Перечисления.SUI_ТаблицыИнтеграции.Ячейки Тогда
		Возврат ПолучитьЗапросДанных_Ячейки(МобильноеУстройство, ДополнительныеПараметры);
	ИначеЕсли Таблица = Перечисления.SUI_ТаблицыИнтеграции.Номенклатура Тогда
		Возврат ПолучитьЗапросДанных_Номенклатура(МобильноеУстройство, ДополнительныеПараметры);
	ИначеЕсли Таблица = Перечисления.SUI_ТаблицыИнтеграции.ХарактеристикиНоменклатуры Тогда
		Возврат ПолучитьЗапросДанных_ХарактеристикиНоменклатуры(МобильноеУстройство, ДополнительныеПараметры);
	ИначеЕсли Таблица = Перечисления.SUI_ТаблицыИнтеграции.УпаковкиНоменклатуры Тогда
		Возврат ПолучитьЗапросДанных_УпаковкиНоменклатуры(МобильноеУстройство, ДополнительныеПараметры);
	ИначеЕсли Таблица = Перечисления.SUI_ТаблицыИнтеграции.ЕдиницыИзмерения Тогда
		Возврат ПолучитьЗапросДанных_ЕдиницыИзмерения(МобильноеУстройство, ДополнительныеПараметры);
	ИначеЕсли Таблица = Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыНоменклатуры Тогда
		Возврат ПолучитьЗапросДанных_ШтрихкодыНоменклатуры(МобильноеУстройство, ДополнительныеПараметры);
	ИначеЕсли Таблица = Перечисления.SUI_ТаблицыИнтеграции.НастройкиДокументов Тогда
		Возврат ПолучитьЗапросДанных_НастройкиДокументов(МобильноеУстройство, ДополнительныеПараметры);
	ИначеЕсли Таблица = Перечисления.SUI_ТаблицыИнтеграции.ПользователиТСД Тогда
		Возврат ПолучитьЗапросДанных_ПользователиТСД(МобильноеУстройство, ДополнительныеПараметры);
	ИначеЕсли Таблица = Перечисления.SUI_ТаблицыИнтеграции.Документы Тогда
		Возврат ПолучитьЗапросДанных_ДокументыОбмена(МобильноеУстройство, ДополнительныеПараметры);
	ИначеЕсли Таблица = SUI_ПакетыДанныхКлиентСервер.КлючТаблицы_Сообщения() Тогда
		Возврат ПолучитьЗапросДанных_Сообщения(МобильноеУстройство, ДополнительныеПараметры);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура ВыполнитьЗаданиеСформироватьПакетыДанныхСообщений(Знач Параметры, АдресРезультата) Экспорт
	
	// Оценка производительности
	ОценкаПроизводительности_НачалоЗамера = SUI_ОценкаПроизводительностиПереопределяемый.НачатьЗамерВремени();
	ОценкаПроизводительности_ВесЗамера = 0;
	ОценкаПроизводительности_КлючеваяОперация = "ВыполнитьЗаданиеСформироватьПакетыДанныхСообщений";
	
	ОписаниеТипаСтруктура = Новый ОписаниеТипов("Структура");
	Параметры = ОписаниеТипаСтруктура.ПривестиЗначение(Параметры);
	
	ЭтоПолнаяВыгрузка = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ЭтоПолнаяВыгрузка", Ложь, Тип("Булево"));
	
	ПараметрыРезультата = Новый Структура();
	ПараметрыРезультата.Вставить("ИсключитьСостояния", SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.МассивЗначений(
		Перечисления.SUI_СостоянияМобильныхУстройств.ФормированиеДанных));
	
	Если ЭтоПолнаяВыгрузка Тогда
		ПараметрыРезультата.Вставить("Состояние", Перечисления.SUI_СостоянияМобильныхУстройств.ЗапросПолнойВыгрузки);
	Иначе
		ПараметрыРезультата.Вставить("ИсключитьСостояние", Перечисления.SUI_СостоянияМобильныхУстройств.ЗапросПолнойВыгрузки);
	КонецЕсли;
	
	Если Параметры.Свойство("МобильныеУстройства") Тогда
		ПараметрыРезультата.Вставить("МобильныеУстройства", SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			Параметры, "МобильныеУстройства", Новый Массив(), Тип("Массив")));
	КонецЕсли;
	
	РезультатСостояния = РегистрыСведений.SUI_СостоянияМобильныхУстройств.СостоянияМобильныхУстройств(ПараметрыРезультата, Истина);
	
	Если РезультатСостояния.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаСостояния = РезультатСостояния.Выбрать();
	
	// Оценка производительности
	ОценкаПроизводительности_ВесЗамера = ВыборкаСостояния.Количество();
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных();
		ЭлементБлокировки = Блокировка.Добавить("ПланОбмена.SUI_МобильныеУстройства");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = РезультатСостояния;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Ссылка", "МобильноеУстройство");
		Блокировка.Заблокировать();
		
		Блокировка = Новый БлокировкаДанных();
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.SUI_СостоянияМобильныхУстройств");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = РезультатСостояния;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("МобильноеУстройство", "МобильноеУстройство");
		Блокировка.Заблокировать();
		
		Пока ВыборкаСостояния.Следующий() Цикл
			РегистрыСведений.SUI_СостоянияМобильныхУстройств.СменитьСостояние(ВыборкаСостояния.МобильноеУстройство, 
				Перечисления.SUI_СостоянияМобильныхУстройств.ФормированиеДанных);
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(SUI_ПакетыДанныхКлиентСервер.ИмяСобытия(НСтр("ru = 'Формирование сообщений'")), , 
			Метаданные.ОбщиеМодули.SUI_ПакетыДанных, ВыборкаСостояния.МобильноеУстройство, ИнформацияОбОшибке());
		SUI_ОценкаПроизводительностиПереопределяемый.ЗакончитьЗамерВремени(
			ОценкаПроизводительности_КлючеваяОперация, 
			ОценкаПроизводительности_НачалоЗамера, 
			ОценкаПроизводительности_ВесЗамера, 
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()), 
			Истина);
		ВызватьИсключение;
	КонецПопытки;
	
	ВыборкаСостояния.Сбросить();
	
	Пока ВыборкаСостояния.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			СледующееСостояние = Перечисления.SUI_СостоянияМобильныхУстройств.Выгружено;
			
			// Команда полный сброс
			Если ЭтоПолнаяВыгрузка Тогда
				СоздатьПакетКоманду_ПолныйСброс(ВыборкаСостояния.МобильноеУстройство);
				СледующееСостояние = Перечисления.SUI_СостоянияМобильныхУстройств.ТребуетсяПолучитьДанные;
			КонецЕсли;
			
			// Сформировать пакеты данных
			СостояниеТаблицМУ = ПолучитьСостояниеТаблиц(ВыборкаСостояния.МобильноеУстройство, ЭтоПолнаяВыгрузка);
			Если СостояниеТаблицМУ.Количество() > 0 Тогда
				СформироватьКоллекцииДанныхПакетаСообщений(ВыборкаСостояния.МобильноеУстройство, СостояниеТаблицМУ, ЭтоПолнаяВыгрузка);
				СледующееСостояние = Перечисления.SUI_СостоянияМобильныхУстройств.ТребуетсяПолучитьДанные;
			КонецЕсли;
			
			// Сменить состояние текущего МУ
			РегистрыСведений.SUI_СостоянияМобильныхУстройств.СменитьСостояние(ВыборкаСостояния.МобильноеУстройство, СледующееСостояние);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			Ошибка = ИнформацияОбОшибке();
			SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(SUI_ПакетыДанныхКлиентСервер.ИмяСобытия(НСтр("ru = 'Формирование сообщений'")), , 
				Метаданные.ОбщиеМодули.SUI_ПакетыДанных, ВыборкаСостояния.МобильноеУстройство, Ошибка);
			// Сменить состояние текущего МУ на Ошибка
			РегистрыСведений.SUI_СостоянияМобильныхУстройств.СменитьСостояние(ВыборкаСостояния.МобильноеУстройство, 
				Перечисления.SUI_СостоянияМобильныхУстройств.Ошибка, ОбработкаОшибок.КраткоеПредставлениеОшибки(Ошибка));
			
			// Вернуть состояние оставшихся МУ на ЗапросПолнойВыгрузки
			Пока ВыборкаСостояния.Следующий() Цикл
				РегистрыСведений.SUI_СостоянияМобильныхУстройств.СменитьСостояние(ВыборкаСостояния.МобильноеУстройство, 
				ВыборкаСостояния.Состояние);
			КонецЦикла;
			
			SUI_ОценкаПроизводительностиПереопределяемый.ЗакончитьЗамерВремени(
				ОценкаПроизводительности_КлючеваяОперация, 
				ОценкаПроизводительности_НачалоЗамера, 
				ОценкаПроизводительности_ВесЗамера, 
				ОбработкаОшибок.КраткоеПредставлениеОшибки(Ошибка), 
				Истина);
			ВызватьИсключение;
		КонецПопытки;
		
	КонецЦикла;
	
	// Оценка производительности
	Если ОценкаПроизводительности_ВесЗамера > 0 Тогда
		SUI_ОценкаПроизводительностиПереопределяемый.ЗакончитьЗамерВремени(ОценкаПроизводительности_КлючеваяОперация, 
			ОценкаПроизводительности_НачалоЗамера, ОценкаПроизводительности_ВесЗамера);
	КонецЕсли;
	
КонецПроцедуры

Функция ПараметрыСборкиСообщенийПакетаДанныхИзКоллекции(КоллекцияДанных) Экспорт
	
	ПараметрыСборки = Новый Структура();
	
	ПараметрыСборки.Вставить("КоллекцияДанных", КоллекцияДанных);
	ПараметрыСборки.Вставить("Записывать", Ложь);
	ПараметрыСборки.Вставить("ВидДанных", Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.Значение);
	ПараметрыСборки.Вставить("Отправитель");
	ПараметрыСборки.Вставить("Получатель");
	ПараметрыСборки.Вставить("РазмерПакета", РазмерПакетаДанных());
	ПараметрыСборки.Вставить("Приоритет", 5);
	
	Возврат ПараметрыСборки;
	
КонецФункции

Функция СобратьСообщениеПакетаДанныхИзКоллекции(ПараметрыСборки, АдресРезультата = Неопределено) Экспорт
	
	Пакеты = Новый Массив();
	
	КоллекцияДанных = ПараметрыСборки.КоллекцияДанных;
	
	Если ПараметрыСборки.Записывать И ПараметрыСборки.ВидДанных = Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.Значение Тогда
		РегистрыСведений.SUI_СообщенияОбменаДанными.Создать(ПараметрыСборки.Отправитель, ПараметрыСборки.Получатель, КоллекцияДанных);
	Иначе
		
		Сообщения = КоллекцияДанных.Получить(SUI_ПакетыДанныхКлиентСервер.КлючТаблицы_Сообщения());
		Если Сообщения <> Неопределено Тогда
			КоллекцияДанных.Удалить(SUI_ПакетыДанныхКлиентСервер.КлючТаблицы_Сообщения());
		КонецЕсли;
		
		ОписаниеТипаМассив = Новый ОписаниеТипов("Массив");
		
		Если КоллекцияДанных.Количество() = 0 Тогда
			Пакет = SUI_ПакетыДанныхКлиентСервер.ПустойПакет(SUI_ПакетыДанныхКлиентСервер.ФорматПакета_НетДанных());
			Пакет.messages = ОписаниеТипаМассив.ПривестиЗначение(Сообщения);
		Иначе
			
			ОстатокПакета = ПараметрыСборки.РазмерПакета;
			
			Пакет = SUI_ПакетыДанныхКлиентСервер.ПустойПакет(SUI_ПакетыДанныхКлиентСервер.ФорматПакета_ЕстьДанные(), Новый Соответствие());
			Пакет.messages = ОписаниеТипаМассив.ПривестиЗначение(Сообщения);
			
			Для Каждого ЭлементКоллекции Из КоллекцияДанных Цикл
				
				РезультатЗапроса = РезультатЗапросаПоПараметру(ЭлементКоллекции.Значение.Данные);
				Если РезультатЗапроса.Пустой() Тогда
					Продолжить;
				КонецЕсли;
				
				КолонкаУдаленно = "deleted";
				
				ПоляДанных = ОбщегоНазначения.ОписаниеТипаСтрока(0).ПривестиЗначение(ЭлементКоллекции.Значение.ПоляДанных);
				ПоляДанных = SUI_ОбщегоНазначения.КолонкиРезультатаЗапросаВСтроку(РезультатЗапроса, ПоляДанных, КолонкаУдаленно);
				
				ПоляУдаленныхДанных = "";
				Если РезультатЗапроса.Колонки.Найти(КолонкаУдаленно) = Неопределено Тогда
					КолонкаУдаленно = Неопределено;
				Иначе
					
					ПоляУдаленныхДанных = "id";
					
					Если ЭлементКоллекции.Ключ = Перечисления.SUI_ТаблицыИнтеграции.ХарактеристикиНоменклатуры Тогда
						ПоляУдаленныхДанных = ПоляУдаленныхДанных + ",id_owner";
					КонецЕсли;
					
					ПоляУдаленныхДанных = SUI_ОбщегоНазначения.КолонкиРезультатаЗапросаВСтроку(РезультатЗапроса, ПоляУдаленныхДанных);
					
				КонецЕсли;
				
				Выборка = РезультатЗапроса.Выбрать();
				
				ДанныеТаблицы = Новый Массив();
				УдаленныеДанныеТаблицы = Новый Массив();
				
				Пока Выборка.Следующий() Цикл
					
					Если ОстатокПакета = 0 Тогда
						
						Если ДанныеТаблицы.Количество() > 0 Тогда
							Пакет.data.Вставить(ЭлементКоллекции.Значение.ИмяТаблицы, ДанныеТаблицы);
						КонецЕсли;
						
						Если УдаленныеДанныеТаблицы.Количество() > 0 И КолонкаУдаленно <> Неопределено Тогда
							Пакет.data.Вставить(ЭлементКоллекции.Значение.ИмяТаблицы + "_" + КолонкаУдаленно, 
								УдаленныеДанныеТаблицы);
						КонецЕсли;
						
						Если ПараметрыСборки.Записывать Тогда
							РегистрыСведений.SUI_СообщенияОбменаДанными.Создать(ПараметрыСборки.Отправитель, 
								ПараметрыСборки.Получатель, Пакет, ПараметрыСборки.Приоритет, ПараметрыСборки.ВидДанных);
						Иначе
							
							Если ПараметрыСборки.ВидДанных = Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.JSON Тогда
								Пакет = SUI_СообщенияОбменаДанными.ДанныеСообщенияВJSON(Пакет);
								ОбщегоНазначенияКлиентСервер.Проверить(Пакет <> Неопределено,
									НСтр("ru = 'Не удалось собрать сообщение обмена данных по причине:
									|Неудалось преобразовать пакет данных в JSON'"));
							КонецЕсли;
							
							Пакеты.Добавить(Пакет);
							
						КонецЕсли;
						
						ОстатокПакета = ПараметрыСборки.РазмерПакета;
						
						Пакет = SUI_ПакетыДанныхКлиентСервер.ПустойПакет(
							SUI_ПакетыДанныхКлиентСервер.ФорматПакета_ЕстьДанные(), Новый Соответствие());
						
						ДанныеТаблицы = Новый Массив();
						
					КонецЕсли;
					
					ДанныеВыборки = Новый Структура(ПоляДанных);
					
					Если ЭлементКоллекции.Ключ = Перечисления.SUI_ТаблицыИнтеграции.Документы Тогда
						
						СтрокаДанных = ЭлементКоллекции.Значение.Данные.Найти(Выборка.id, "id");
						Если СтрокаДанных = Неопределено Тогда
							ЗаполнитьЗначенияСвойств(ДанныеВыборки, Выборка);
						Иначе
							ЗаполнитьЗначенияСвойств(ДанныеВыборки, СтрокаДанных);
						КонецЕсли;
						
					Иначе
						
						ЗаполнитьЗначенияСвойств(ДанныеВыборки, Выборка);
						
						// Строка авторизации пользователя ТСД
						Если ЭлементКоллекции.Ключ = Перечисления.SUI_ТаблицыИнтеграции.ПользователиТСД Тогда
							ЗаполнитьСтрокуАвторизацииПользователяТСД(ДанныеВыборки);
						// Идентификатор настройки документа обмена
						ИначеЕсли ЭлементКоллекции.Ключ = Перечисления.SUI_ТаблицыИнтеграции.НастройкиДокументов Тогда
							ДанныеВыборки.id = SUI_ИнтеграцияВКонфигурацию.ИдентификаторSimpleПоСсылке(ДанныеВыборки.id);
						КонецЕсли;
						
					КонецЕсли;
					
					Если КолонкаУдаленно <> Неопределено И Выборка[КолонкаУдаленно] Тогда
						ДанныеВыборкиУдаление = Новый Структура(ПоляУдаленныхДанных);
						ЗаполнитьЗначенияСвойств(ДанныеВыборкиУдаление, ДанныеВыборки);
						УдаленныеДанныеТаблицы.Добавить(ДанныеВыборкиУдаление);
					Иначе
						ДанныеТаблицы.Добавить(ДанныеВыборки);
					КонецЕсли;
					
					ОстатокПакета = ОстатокПакета - 1;
					
				КонецЦикла;
				
				Если ДанныеТаблицы.Количество() > 0 Тогда
					Пакет.data.Вставить(ЭлементКоллекции.Значение.ИмяТаблицы, ДанныеТаблицы);
				КонецЕсли;
				
				Если УдаленныеДанныеТаблицы.Количество() > 0 И КолонкаУдаленно <> Неопределено Тогда
					Пакет.data.Вставить(ЭлементКоллекции.Значение.ИмяТаблицы + "_" + КолонкаУдаленно, УдаленныеДанныеТаблицы);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Пакет.data) Или ЗначениеЗаполнено(Пакет.messages) Тогда
			
			Если ПараметрыСборки.Записывать Тогда
				РегистрыСведений.SUI_СообщенияОбменаДанными.Создать(ПараметрыСборки.Отправитель, 
					ПараметрыСборки.Получатель, Пакет, ПараметрыСборки.Приоритет, ПараметрыСборки.ВидДанных);
			Иначе
				
				Если ПараметрыСборки.ВидДанных = Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.JSON Тогда
					Пакет = SUI_СообщенияОбменаДанными.ДанныеСообщенияВJSON(Пакет);
					ОбщегоНазначенияКлиентСервер.Проверить(Пакет <> Неопределено,
						НСтр("ru = 'Не удалось собрать сообщение обмена данных по причине:
						|Неудалось преобразовать пакет данных в JSON'"));
				КонецЕсли;
				
				Пакеты.Добавить(Пакет);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗнч(АдресРезультата) = Тип("Строка") И ЭтоАдресВременногоХранилища(АдресРезультата) Тогда
		ПоместитьВоВременноеХранилище(Пакеты, АдресРезультата);
		Возврат АдресРезультата;
	Иначе
		Возврат Пакеты;
	КонецЕсли;
	
КонецФункции

Процедура СвернутьКоллекцииДанных(КоллекцияИсточник, КоллекцияПриемник) Экспорт
	
	Для Каждого ИсточникКлючЗначение Из КоллекцияИсточник Цикл
		
		ЗначениеПриемник = КоллекцияПриемник.Получить(ИсточникКлючЗначение.Ключ);
		
		Если ЗначениеПриемник = Неопределено Тогда
			КоллекцияПриемник.Вставить(ИсточникКлючЗначение.Ключ, ИсточникКлючЗначение.Значение);
		Иначе
			
			Если ИсточникКлючЗначение.Ключ = SUI_ПакетыДанныхКлиентСервер.КлючТаблицы_Сообщения() Тогда
				ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ЗначениеПриемник, ИсточникКлючЗначение.Значение, Истина);
				
			//TODO: 28.08.2024 - artem - Временная свертка документов
			ИначеЕсли ИсточникКлючЗначение.Ключ = Перечисления.SUI_ТаблицыИнтеграции.Документы Тогда
				
				Для Каждого СтрокаДокументИсточник Из ИсточникКлючЗначение.Значение.Данные Цикл
					
					СтрокаДокументПриемник = ЗначениеПриемник.Данные.Найти(СтрокаДокументИсточник.id, "id");
					
					Если СтрокаДокументПриемник = Неопределено Тогда
						СтрокаДокументПриемник = ЗначениеПриемник.Данные.Добавить();
					КонецЕсли;
					
					ЗаполнитьЗначенияСвойств(СтрокаДокументПриемник, СтрокаДокументИсточник);
					
				КонецЦикла;
				
			Иначе
				
				ПоляВыборИсточник = Новый Массив();
				ПоляВыборПриемник = Новый Массив();
				ПоляВыбор = Новый Массив();
				Для Каждого Колонка Из ИсточникКлючЗначение.Значение.Данные.Колонки Цикл
					ПоляВыборИсточник.Добавить("Источник." + Колонка.Имя);
					ПоляВыборПриемник.Добавить("Приемник." + Колонка.Имя);
					ПоляВыбор.Добавить("ЕСТЬNULL(втПриемник." + Колонка.Имя + ", втИсточник." + Колонка.Имя + ") КАК " + Колонка.Имя);
				КонецЦикла;
				
				ПоляСоединения = Новый Массив();
				Для Каждого ПолеСоединения Из ПоляСоединенияПоТаблице(ИсточникКлючЗначение.Ключ) Цикл
					ПоляСоединения.Добавить("втИсточник." + ПолеСоединения + " = втПриемник." + ПолеСоединения);
				КонецЦикла;
				
				Запрос = Новый Запрос();
				Запрос.УстановитьПараметр("Источник", ИсточникКлючЗначение.Значение.Данные);
				Запрос.УстановитьПараметр("Приемник", ЗначениеПриемник.Данные);
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	" + СтрСоединить(ПоляВыборИсточник, "," + Символы.ПС + Символы.Таб) + "
					|ПОМЕСТИТЬ втИсточник
					|ИЗ
					|	&Источник КАК Источник" 
					+ ОбщегоНазначения.РазделительПакетаЗапросов() +
					"ВЫБРАТЬ
					|	" + СтрСоединить(ПоляВыборПриемник, "," + Символы.ПС + Символы.Таб) + "
					|ПОМЕСТИТЬ втПриемник
					|ИЗ
					|	&Приемник КАК Приемник"
					+ ОбщегоНазначения.РазделительПакетаЗапросов() +
					"ВЫБРАТЬ
					|	" + СтрСоединить(ПоляВыбор, "," + Символы.ПС + Символы.Таб) + "
					|ИЗ
					|	втИсточник КАК втИсточник
					|		ПОЛНОЕ СОЕДИНЕНИЕ втПриемник КАК втПриемник
					|		ПО " + СтрСоединить(ПоляСоединения, Символы.ПС + Символы.Таб + Символы.Таб + "И ")
					+ ОбщегоНазначения.РазделительПакетаЗапросов() +
					"УНИЧТОЖИТЬ втИсточник"
					+ ОбщегоНазначения.РазделительПакетаЗапросов() +
					"УНИЧТОЖИТЬ втПриемник;";
				
				//@skip-check query-in-loop
				ЗначениеПриемник.Данные = Запрос.Выполнить().Выгрузить();
				
			КонецЕсли;
			
			КоллекцияПриемник.Вставить(ИсточникКлючЗначение.Ключ, ЗначениеПриемник);
			
		КонецЕсли;
		
		КоллекцияИсточник.Удалить(ИсточникКлючЗначение.Ключ);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ВычислитьКоличествоВТаблице(Таблица, МобильноеУстройство, ТолькоИзменения, ТолькоИспользуемые = Истина) Экспорт
	
	Количество = 0;
	
	Если ТолькоИспользуемые И Не SUI_НастройкиМетаданныхСервер.ТаблицаИспользуется(Таблица) Тогда
		Возврат Количество;
	КонецЕсли;
	
	ИмяТаблицыВКонфигурации = SUI_НастройкиМетаданныхСервер.ПолучитьИмяТаблицыВКонфигурации(Таблица);
	
	Если ЗначениеЗаполнено(ИмяТаблицыВКонфигурации) Тогда
		
		Запрос = Новый Запрос("ВЫБРАТЬ КОЛИЧЕСТВО(*) КАК Количество ИЗ " + ИмяТаблицыВКонфигурации);
		
		Если ТолькоИзменения Тогда
			Запрос.Текст = Запрос.Текст + ".Изменения
			|ГДЕ Узел = &Узел";
			Запрос.УстановитьПараметр("Узел", МобильноеУстройство);
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Истина);
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		
		Количество = Выборка.Количество;
		
	КонецЕсли;
	
	Возврат Количество;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСообщенияПоСостояниюТаблицы(СостояниеТаблицы)
	
	Сообщения = Новый Массив();
	
	Результат = ВыполнитьЗапросСостоянияТаблицы(СостояниеТаблицы);
	
	Для Каждого ДанныеПакета Из Результат.Пакеты Цикл
		
		Если Результат.Результаты[ДанныеПакета.Ключ].Пустой() Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыУдаленияРегистрации = ПараметрыУдаленияРегистрацииИзменний(СостояниеТаблицы.МобильноеУстройство,
			СостояниеТаблицы.ИмяТаблицы, ДанныеПакета.Значение.КлючиОтбора);
		
		Если ПараметрыУдаленияРегистрации <> Неопределено И
			Результат.Результаты[ДанныеПакета.Ключ].Колонки.Найти(ПараметрыУдаленияРегистрации.ИмяПоляЕстьИзменения) = Неопределено Тогда
			ПараметрыУдаленияРегистрации = Неопределено;
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Истина);
		
		Выборка = Результат.Результаты[ДанныеПакета.Ключ].Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Сообщения.Добавить(Выборка[ДанныеПакета.Значение.ПоляДанных]);
			
			// Удалить регистрацию
			УдалитьРегистрацию(Выборка, ПараметрыУдаленияРегистрации);
				
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Сообщения;
	
КонецФункции

Функция ВыполнитьЗапросСостоянияТаблицы(СтрокаСостояниеТаблиц)
	
	Результат = Новый Структура();
	Результат.Вставить("Результаты");
	Результат.Вставить("Пакеты", СтрокаСостояниеТаблиц.ДанныеЗапроса.Пакеты);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Результат.Пакеты = Неопределено Тогда
		
		ДобавитьПакетДанныхВСтруктуруЗапросаДанных(Результат, 0, СтрокаСостояниеТаблиц.ИмяТаблицыМобильногоУстройства, 
			СтрокаСостояниеТаблиц.ДанныеЗапроса.ПоляДанных, СтрокаСостояниеТаблиц.ДанныеЗапроса.КлючиОтбора, СтрокаСостояниеТаблиц.Таблица);
		
		Результат.Результаты = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
			СтрокаСостояниеТаблиц.ДанныеЗапроса.Запрос.Выполнить());
			
	Иначе
		Результат.Результаты = СтрокаСостояниеТаблиц.ДанныеЗапроса.Запрос.ВыполнитьПакет();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПараметрыУдаленияРегистрацииИзменний(МобильноеУстройство, Знач ИмяТаблицы, КлючиОтбора)
	
	Параметры = Новый Структура();
	Параметры.Вставить("ИмяПоляЕстьИзменения", "SUI_ЕстьИзменения");
	Параметры.Вставить("МобильноеУстройство", МобильноеУстройство);
	Параметры.Вставить("ЭтоРегистр", Ложь);
	Параметры.Вставить("ЭтоСправочник", Ложь);
	Параметры.Вставить("КлючиОтбора", СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(
		ОбщегоНазначения.ОписаниеТипаСтрока(0).ПривестиЗначение(КлючиОтбора), , Истина, Истина));
	
	ИмяТаблицы = ОбщегоНазначения.ОписаниеТипаСтрока(0).ПривестиЗначение(ИмяТаблицы);
	
	Если СтрНачинаетсяС(ВРег(ИмяТаблицы), "РЕГИСТРСВЕДЕНИЙ.") Тогда
		Параметры.ЭтоРегистр = Истина;
	ИначеЕсли СтрНачинаетсяС(ВРег(ИмяТаблицы), "СПРАВОЧНИК.") И Параметры.КлючиОтбора.Найти("Ссылка") <> Неопределено Тогда
		Параметры.КлючиОтбора = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("Ссылка");
		Параметры.ЭтоСправочник = Истина;
	КонецЕсли;
	
	Если (Параметры.ЭтоРегистр Или Параметры.ЭтоСправочник) И Параметры.КлючиОтбора.Количество() > 0 Тогда
		Параметры.Вставить("МенеджерТаблицы", ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ИмяТаблицы));
	Иначе
		Параметры = Неопределено;
	КонецЕсли;
	
	Возврат Параметры;
	
КонецФункции

Процедура УдалитьРегистрацию(Выборка, ПараметрыУдаленияРегистрации)
	
	Если ПараметрыУдаленияРегистрации <> Неопределено И Выборка[ПараметрыУдаленияРегистрации.ИмяПоляЕстьИзменения] Тогда
		
		Если ПараметрыУдаленияРегистрации.ЭтоРегистр Тогда
			Данные = ПараметрыУдаленияРегистрации.МенеджерТаблицы.СоздатьНаборЗаписей();
			Для индекс = 0 По ПараметрыУдаленияРегистрации.КлючиОтбора.ВГраница() Цикл
				Данные.Отбор[ПараметрыУдаленияРегистрации.КлючиОтбора[индекс]].Установить(
					Выборка[ПараметрыУдаленияРегистрации.КлючиОтбора[индекс]]);
			КонецЦикла;
		ИначеЕсли ПараметрыУдаленияРегистрации.ЭтоСправочник Тогда
			Данные = Выборка[ПараметрыУдаленияРегистрации.КлючиОтбора[0]];
		Иначе
			Данные = Неопределено;
		КонецЕсли;
		
		Если Данные <> Неопределено Тогда
			ПланыОбмена.УдалитьРегистрациюИзменений(ПараметрыУдаленияРегистрации.МобильноеУстройство, Данные);
		КонецЕсли;
						
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСостояниеТаблиц(МобильноеУстройство, ЭтоПолнаяВыгрузка = Ложь)
	
	ПараметрыРезультата = SUI_КомпоновкаДанныхСервер.ПараметрыРезультатСхемыКомпоновкиДанных();
	ПараметрыРезультата.СхемаКомпоновкиДанных = SUI_ПакетыДанныхПовтИсп.СхемаСостоянияТаблицМобильногоУстройства();
	ПараметрыРезультата.ВозможностьИспользованияВнешнихФункций = Истина;
	ПараметрыРезультата.ВыполнятьВПривилегированномРежиме = Истина;
	
	SUI_КомпоновкаДанныхСервер.ДобавитьПараметр(ПараметрыРезультата.СхемаКомпоновкиДанных, 
		"МобильноеУстройство", , МобильноеУстройство, , Истина);
		
	SUI_КомпоновкаДанныхСервер.ДобавитьПараметр(ПараметрыРезультата.СхемаКомпоновкиДанных, 
		"ЭтоПолнаяВыгрузка", , ЭтоПолнаяВыгрузка, , Истина);
	
	Возврат SUI_КомпоновкаДанныхСервер.ВыгрузитьРезультатСхемыКомпоновкиДанных(ПараметрыРезультата);
		
КонецФункции

Процедура ЗаполнитьСтрокуАвторизацииПользователяТСД(Данные)
	
	ДанныеСтрокиАвторизации = Новый Структура("Логин,Пароль");

	Если Данные.Свойство("Логин") Тогда
		ДанныеСтрокиАвторизации.Логин = Данные.Логин;
		Данные.Удалить("Логин");
	КонецЕсли;
	
	Если Данные.Свойство("Пароль") Тогда
		ДанныеСтрокиАвторизации.Пароль = Данные.Пароль;
		Данные.Удалить("Пароль");
	КонецЕсли;
	
	Если ДанныеСтрокиАвторизации.Логин <> Неопределено И ДанныеСтрокиАвторизации.Пароль <> Неопределено Тогда
		Данные.Вставить("auth_string", ОбщегоНазначения.КонтрольнаяСуммаСтрокой(
			ДанныеСтрокиАвторизации.Логин + ":" + ДанныеСтрокиАвторизации.Пароль));
	Иначе
		Данные.Вставить("auth_string");
	КонецЕсли;
					
КонецПроцедуры

Функция РезультатЗапросаПоПараметру(Знач Данные)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТипЗначенияДанных = ТипЗнч(Данные);
	
	Если ТипЗнч(Данные) = Тип("Строка") И ЭтоАдресВременногоХранилища(Данные) Тогда
		Данные = ПолучитьИзВременногоХранилища(Данные);
		ТипЗначенияДанных = ТипЗнч(Данные);
	КонецЕсли;
	
	Если ТипЗначенияДанных = Тип("РезультатЗапроса") Или ТипЗначенияДанных = Тип("ТаблицаЗначений") Тогда
		Построитель = Новый ПостроительЗапроса;
		Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(Данные);
		Построитель.Выполнить();
		Данные = Построитель.Результат;
	ИначеЕсли ТипЗначенияДанных = Тип("ВыборкаИзРезультатаЗапроса") Тогда
		Данные = Данные.Владелец();
	КонецЕсли;

	ОписаниеТипа = Новый ОписаниеТипов("РезультатЗапроса");
	Возврат ОписаниеТипа.ПривестиЗначение(Данные);
	
КонецФункции

Процедура СформироватьКоллекцииДанныхПакетаСообщений(МобильноеУстройство, СостояниеТаблиц, ЭтоПолнаяВыгрузка = Ложь)
	
	УстановитьПривилегированныйРежим(Истина);
	
	КоллекцияДанных = Новый Соответствие();
	
	НачатьТранзакцию();
	
	Попытка
		
		// Перезапись таблиц
		СостояниеТаблицКПерезаписи = СостояниеТаблиц.Скопировать(Новый Структура("ПерезаписьТаблицы", Истина), "ПерезаписьТаблицы,Таблица,ИмяТаблицыМобильногоУстройства");
		Если СостояниеТаблицКПерезаписи.Количество() > 0 Тогда
			СоздатьПакетКоманду_ПерезаписьТаблицМУ(МобильноеУстройство, СостояниеТаблицКПерезаписи);
		КонецЕсли;
		
		// Сообщения мобильных устройств
		СостояниеТаблицыСообщения = СостояниеТаблиц.Найти(SUI_ПакетыДанныхКлиентСервер.КлючТаблицы_Сообщения(), "Таблица");
		Если СостояниеТаблицыСообщения <> Неопределено Тогда
			КоллекцияДанных.Вставить(SUI_ПакетыДанныхКлиентСервер.КлючТаблицы_Сообщения(), 
				ПолучитьСообщенияПоСостояниюТаблицы(СостояниеТаблицыСообщения));
			СостояниеТаблиц.Удалить(СостояниеТаблицыСообщения);
		КонецЕсли;
		
		Для Каждого СостояниеТаблицы Из СостояниеТаблиц Цикл
			
			//TODO: 26.08.2024 - artem - Требуется рефакторинг кода под новый документ обмена >>>
			
			Результат = ВыполнитьЗапросСостоянияТаблицы(СостояниеТаблицы);
			
			Для Каждого ДанныеПакета Из Результат.Пакеты Цикл
				
				Если Результат.Результаты[ДанныеПакета.Ключ].Пустой() Тогда
					Продолжить;
				КонецЕсли;
				
				ДанныеКоллекции = Новый Структура("ПоляДанных, ИмяТаблицы, Данные");
				ДанныеКоллекции.ПоляДанных = ДанныеПакета.Значение.ПоляДанных;
				ДанныеКоллекции.ИмяТаблицы = ДанныеПакета.Значение.ИмяПакета;
				
				Если СостояниеТаблицы.Таблица = Перечисления.SUI_ТаблицыИнтеграции.Документы Тогда
					
					Если ЭтоПолнаяВыгрузка Тогда
						Продолжить;
					КонецЕсли;
					
					ДанныеКоллекции.Данные = СобратьСообщениеДокументаОбмена(МобильноеУстройство, Результат.Результаты);
					
				Иначе
					
					ПараметрыУдаленияРегистрации = ПараметрыУдаленияРегистрацииИзменний(МобильноеУстройство,
						СостояниеТаблицы.ИмяТаблицы, ДанныеПакета.Значение.КлючиОтбора);
					
					Если ПараметрыУдаленияРегистрации <> Неопределено И
						Результат.Результаты[ДанныеПакета.Ключ].Колонки.Найти(ПараметрыУдаленияРегистрации.ИмяПоляЕстьИзменения) = Неопределено Тогда
						ПараметрыУдаленияРегистрации = Неопределено;
					КонецЕсли;
					
					// Удалить регистрацию
					Если ПараметрыУдаленияРегистрации <> Неопределено Тогда
						
						Выборка = Результат.Результаты[ДанныеПакета.Ключ].Выбрать();
						
						Пока Выборка.НайтиСледующий(Новый Структура(ПараметрыУдаленияРегистрации.ИмяПоляЕстьИзменения, Истина)) Цикл
							
							Если ПараметрыУдаленияРегистрации.ЭтоРегистр Тогда
								Данные = ПараметрыУдаленияРегистрации.МенеджерТаблицы.СоздатьНаборЗаписей();
								Для индекс = 0 По ПараметрыУдаленияРегистрации.КлючиОтбора.ВГраница() Цикл
									Данные.Отбор[ПараметрыУдаленияРегистрации.КлючиОтбора[индекс]].Установить(
										Выборка[ПараметрыУдаленияРегистрации.КлючиОтбора[индекс]]);
								КонецЦикла;
							ИначеЕсли ПараметрыУдаленияРегистрации.ЭтоСправочник Тогда
								Данные = Выборка[ПараметрыУдаленияРегистрации.КлючиОтбора[0]];
							Иначе
								Продолжить;
							КонецЕсли;
							
							ПланыОбмена.УдалитьРегистрациюИзменений(ПараметрыУдаленияРегистрации.МобильноеУстройство, Данные);
							
						КонецЦикла;
						
					КонецЕсли;
					
					Если ЭтоПолнаяВыгрузка Тогда
						ДанныеКоллекции.Данные = Результат.Результаты[ДанныеПакета.Ключ];
					Иначе
						ДанныеКоллекции.Данные = Результат.Результаты[ДанныеПакета.Ключ].Выгрузить();
					КонецЕсли;
					
				КонецЕсли;
				
				КоллекцияДанных.Вставить(ДанныеПакета.Значение.Таблица, ДанныеКоллекции);
				
			КонецЦикла;
			
		КонецЦикла;
		
		Если КоллекцияДанных.Количество() > 0 Тогда
			
			ПараметрыСборки = ПараметрыСборкиСообщенийПакетаДанныхИзКоллекции(КоллекцияДанных);
			ПараметрыСборки.Записывать = Истина;
			ПараметрыСборки.Отправитель = ПланыОбмена.SUI_МобильныеУстройства.ЭтотУзел();
			ПараметрыСборки.Получатель = МобильноеУстройство;
			
			Если ЭтоПолнаяВыгрузка Тогда
				ПараметрыСборки.ВидДанных = Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.JSON;
			КонецЕсли;
			
			СобратьСообщениеПакетаДанныхИзКоллекции(ПараметрыСборки);
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Функция ПоляСоединенияПоТаблице(Таблица)
	
	Если Таблица = Перечисления.SUI_ТаблицыИнтеграции.Контрагенты Или
		Таблица = Перечисления.SUI_ТаблицыИнтеграции.Склады Или
		Таблица = Перечисления.SUI_ТаблицыИнтеграции.Номенклатура Или
		Таблица = Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыНоменклатуры Или
		Таблица = Перечисления.SUI_ТаблицыИнтеграции.УпаковкиНоменклатуры Или
		Таблица = Перечисления.SUI_ТаблицыИнтеграции.ЕдиницыИзмерения Или
		Таблица = Перечисления.SUI_ТаблицыИнтеграции.Ячейки Тогда
		Поля = "id";
	ИначеЕсли Таблица = Перечисления.SUI_ТаблицыИнтеграции.НастройкиДокументов Или
		Таблица = Перечисления.SUI_ТаблицыИнтеграции.ПользователиТСД Или
		Таблица = Перечисления.SUI_ТаблицыИнтеграции.ШаблоныЭтикеток Тогда
		Поля = "Ссылка";
	ИначеЕсли Таблица = Перечисления.SUI_ТаблицыИнтеграции.ХарактеристикиНоменклатуры Тогда
		Поля = "id,id_owner";
	ИначеЕсли Таблица = SUI_ПакетыДанныхКлиентСервер.КлючТаблицы_ДокументыЗавершенные() Тогда
		Поля = "id_doc";
	ИначеЕсли Таблица = SUI_ПакетыДанныхКлиентСервер.КлючТаблицы_Сообщения() Тогда
		Поля = "";
	Иначе
		ВызватьИсключение НСтр("ru = 'Не удалось определить таблицу'");
	КонецЕсли;
	
	Возврат СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Поля, , Истина, Истина);
	
КонецФункции

#Область Пакеты_Команды

Функция СоздатьПакетКоманду(МобильноеУстройство, ПараметрыКоманды, Записывать = Истина, Приоритет = 7)
	
	Пакет = SUI_ПакетыДанныхКлиентСервер.ПустойПакет(SUI_ПакетыДанныхКлиентСервер.ФорматПакета_Команда(), ПараметрыКоманды);
	
	Если Записывать Тогда
		РегистрыСведений.SUI_СообщенияОбменаДанными.Создать(ПланыОбмена.SUI_МобильныеУстройства.ЭтотУзел(), МобильноеУстройство, 
			Пакет, Приоритет, Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.JSON);
		Возврат Неопределено;
	Иначе
		Возврат Пакет;
	КонецЕсли;
	
КонецФункции

Функция СоздатьПакетКоманду_ПолныйСброс(МобильноеУстройство, Записывать = Истина)

	ДанныеКоманды = Новый Структура();
	ДанныеКоманды.Вставить("data_reset", Истина);
	
	Возврат СоздатьПакетКоманду(МобильноеУстройство, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеКоманды), Записывать, 9);
	
КонецФункции

Функция СоздатьПакетКоманду_ПерезаписьТаблицМУ(МобильноеУстройство, СтрокиСостояниеТаблицКПерезаписи, Записывать = Истина)
	
	Перем Результат;
	
	НачатьТранзакцию();
	
	Попытка
		
		ДанныеКоманды = Новый Структура();
		ДанныеКоманды.Вставить("truncate_table", Новый Массив());
		
		Для Каждого СтрокаСостояниеТаблицКПерезаписи Из СтрокиСостояниеТаблицКПерезаписи Цикл
			
			Если Не СтрокаСостояниеТаблицКПерезаписи.ПерезаписьТаблицы Тогда
				Продолжить;
			КонецЕсли;
			
			ДанныеКоманды.truncate_table.Добавить(СтрокаСостояниеТаблицКПерезаписи.ИмяТаблицыМобильногоУстройства);
			
			НаборЗаписей = РегистрыСведений.SUI_ТаблицыКПерезаписиВМУ.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Таблица.Установить(СтрокаСостояниеТаблицКПерезаписи.Таблица);
			
			ПланыОбмена.УдалитьРегистрациюИзменений(МобильноеУстройство, НаборЗаписей);
			
		КонецЦикла;
		
		Если ДанныеКоманды.truncate_table.Количество() > 0 Тогда
			
			Результат = СоздатьПакетКоманду(
				МобильноеУстройство, 
				ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеКоманды), 
				Записывать, 8);
			
		КонецЕсли;
	
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ЗапросыДанных

Функция СтруктураЗапросаДанных(ПоляДанных = "", КлючиОтбора = "")
	
	ДанныеЗапроса = Новый Структура();
	
	ДанныеЗапроса.Вставить("Запрос", 		Новый Запрос());
	ДанныеЗапроса.Вставить("ПоляДанных", 	ПоляДанных);
	ДанныеЗапроса.Вставить("КлючиОтбора", 	КлючиОтбора);
	ДанныеЗапроса.Вставить("Пакеты");
	
	Возврат ДанныеЗапроса;
	
КонецФункции

Функция СтруктураПакетаЗапросаДанных(ИмяПакета, ПоляДанных, КлючиОтбора, Таблица)
	
	ДанныеПакета = Новый Структура();
	
	ДанныеПакета.Вставить("ИмяПакета", 		ИмяПакета);
	ДанныеПакета.Вставить("ПоляДанных", 	ПоляДанных);
	ДанныеПакета.Вставить("КлючиОтбора", 	КлючиОтбора);
	ДанныеПакета.Вставить("Таблица", 		Таблица);
	
	Возврат ДанныеПакета;
	
КонецФункции

Процедура ДобавитьПакетДанныхВСтруктуруЗапросаДанных(СтруктураЗапросаДанных, ИндексПакета, ИмяПакета, ПоляДанных, КлючиОтбора = Неопределено, Таблица = Неопределено)
	
	ДанныеПакета = СтруктураПакетаЗапросаДанных(ИмяПакета, ПоляДанных, КлючиОтбора, Таблица);
	
	Если СтруктураЗапросаДанных.Пакеты = Неопределено Тогда
		СтруктураЗапросаДанных.Пакеты = Новый Соответствие();
	КонецЕсли;
	
	СтруктураЗапросаДанных.Пакеты.Вставить(ИндексПакета, Новый ФиксированнаяСтруктура(ДанныеПакета));
	
КонецПроцедуры

Функция ПолучитьЗапросДанных_Контрагенты(МобильноеУстройство, ДополнительныеПараметры)
	
	ДанныеЗапроса = СтруктураЗапросаДанных("id,full_name,inn,kpp,name,deleted", "id");
	
	ТипСоединения = ?(ДополнительныеПараметры.Свойство("ТолькоИзменения"), "ЛЕВОЕ", "ПОЛНОЕ");
	ДанныеЗапроса.Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(Изменения.id, Таблица.id) КАК id,
		|	ЕСТЬNULL(Таблица.full_name, НЕОПРЕДЕЛЕНО) КАК full_name,
		|	ЕСТЬNULL(Таблица.inn, НЕОПРЕДЕЛЕНО) КАК inn,
		|	ЕСТЬNULL(Таблица.kpp, НЕОПРЕДЕЛЕНО) КАК kpp,
		|	ЕСТЬNULL(Таблица.name, НЕОПРЕДЕЛЕНО) КАК name,
		|	Таблица.id ЕСТЬ NULL КАК deleted,
		|	НЕ Изменения.id ЕСТЬ NULL КАК SUI_ЕстьИзменения
		|ИЗ
		|	(ВЫБРАТЬ
		|			id
		|		ИЗ
		|			РегистрСведений.SUI_tbl_countragents.Изменения
		|		ГДЕ
		|			Узел = &МобильноеУстройство) КАК Изменения
		|		" + ТипСоединения + " СОЕДИНЕНИЕ РегистрСведений.SUI_tbl_countragents КАК Таблица
		|		ПО  Изменения.id = Таблица.id";
	
	ДанныеЗапроса.Запрос.УстановитьПараметр("МобильноеУстройство", МобильноеУстройство);
	
	Возврат Новый ФиксированнаяСтруктура(ДанныеЗапроса);

КонецФункции

Функция ПолучитьЗапросДанных_Склады(МобильноеУстройство, ДополнительныеПараметры)
	
	ДанныеЗапроса = СтруктураЗапросаДанных("id,name,deleted", "id");
	
	ТипСоединения = ?(ДополнительныеПараметры.Свойство("ТолькоИзменения"), "ЛЕВОЕ", "ПОЛНОЕ");
	
	ДанныеЗапроса.Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(Изменения.id, Таблица.id) КАК id,
		|	ЕСТЬNULL(Таблица.name, НЕОПРЕДЕЛЕНО) КАК name,
		|	Таблица.id ЕСТЬ NULL КАК deleted,
		|	НЕ Изменения.id ЕСТЬ NULL КАК SUI_ЕстьИзменения
		|ИЗ
		|	(ВЫБРАТЬ
		|			id
		|		ИЗ
		|			РегистрСведений.SUI_tbl_warehouses.Изменения
		|		ГДЕ
		|			Узел = &МобильноеУстройство) КАК Изменения
		|		" + ТипСоединения + " СОЕДИНЕНИЕ РегистрСведений.SUI_tbl_warehouses КАК Таблица
		|		ПО  Изменения.id = Таблица.id";
	
	ДанныеЗапроса.Запрос.УстановитьПараметр("МобильноеУстройство", МобильноеУстройство);
	
	Возврат Новый ФиксированнаяСтруктура(ДанныеЗапроса);

КонецФункции

Функция ПолучитьЗапросДанных_Ячейки(МобильноеУстройство, ДополнительныеПараметры)
	
	ДанныеЗапроса = СтруктураЗапросаДанных("id,name,barcode,deleted", "id");
	
	ТипСоединения = ?(ДополнительныеПараметры.Свойство("ТолькоИзменения"), "ЛЕВОЕ", "ПОЛНОЕ");
	
	ДанныеЗапроса.Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(Изменения.id, Таблица.id) КАК id,
		|	ЕСТЬNULL(Таблица.name, НЕОПРЕДЕЛЕНО) КАК name,
		|	ЕСТЬNULL(Таблица.barcode, НЕОПРЕДЕЛЕНО) КАК barcode,
		|	Таблица.id ЕСТЬ NULL КАК deleted,
		|	НЕ Изменения.id ЕСТЬ NULL КАК SUI_ЕстьИзменения
		|ИЗ
		|	(ВЫБРАТЬ
		|			id
		|		ИЗ
		|			РегистрСведений.SUI_tbl_cells.Изменения
		|		ГДЕ
		|			Узел = &МобильноеУстройство) КАК Изменения
		|		" + ТипСоединения + " СОЕДИНЕНИЕ РегистрСведений.SUI_tbl_cells КАК Таблица
		|		ПО  Изменения.id = Таблица.id";
	
	ДанныеЗапроса.Запрос.УстановитьПараметр("МобильноеУстройство", МобильноеУстройство);
	
	Возврат Новый ФиксированнаяСтруктура(ДанныеЗапроса);

КонецФункции

Функция ПолучитьЗапросДанных_Номенклатура(МобильноеУстройство, ДополнительныеПараметры)
	
	ДанныеЗапроса = СтруктураЗапросаДанных("id,name,art,code,description,type_good,unit,use_mark,deleted", "id");
	
	ТипСоединения = ?(ДополнительныеПараметры.Свойство("ТолькоИзменения"), "ЛЕВОЕ", "ПОЛНОЕ");
	
	ДанныеЗапроса.Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(Изменения.id, Таблица.id) КАК id,
		|	ЕСТЬNULL(Таблица.name, НЕОПРЕДЕЛЕНО) КАК name,
		|	ЕСТЬNULL(Таблица.art, НЕОПРЕДЕЛЕНО) КАК art,
		|	ЕСТЬNULL(Таблица.code, НЕОПРЕДЕЛЕНО) КАК code,
		|	ЕСТЬNULL(Таблица.description, НЕОПРЕДЕЛЕНО) КАК description,
		|	ЕСТЬNULL(Таблица.type_good, НЕОПРЕДЕЛЕНО) КАК type_good,
		|	ЕСТЬNULL(Таблица.unit, НЕОПРЕДЕЛЕНО) КАК unit,
		|	ВЫБОР
		|		КОГДА Таблица.use_mark ЕСТЬ NULL
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		КОГДА Таблица.use_mark
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК use_mark,
		|	Таблица.id ЕСТЬ NULL КАК deleted,
		|	НЕ Изменения.id ЕСТЬ NULL КАК SUI_ЕстьИзменения
		|ИЗ
		|	(ВЫБРАТЬ
		|			id
		|		ИЗ
		|			РегистрСведений.SUI_tbl_goods.Изменения
		|		ГДЕ
		|			Узел = &МобильноеУстройство) КАК Изменения
		|		" + ТипСоединения + " СОЕДИНЕНИЕ РегистрСведений.SUI_tbl_goods КАК Таблица
		|		ПО  Изменения.id = Таблица.id";
	
	ДанныеЗапроса.Запрос.УстановитьПараметр("МобильноеУстройство", МобильноеУстройство);
	
	Возврат Новый ФиксированнаяСтруктура(ДанныеЗапроса);

КонецФункции

Функция ПолучитьЗапросДанных_ХарактеристикиНоменклатуры(МобильноеУстройство, ДополнительныеПараметры)
	
	ДанныеЗапроса = СтруктураЗапросаДанных("id,id_owner,name,deleted", "id,id_owner");
	
	ТипСоединения = ?(ДополнительныеПараметры.Свойство("ТолькоИзменения"), "ЛЕВОЕ", "ПОЛНОЕ");
	
	ДанныеЗапроса.Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(Изменения.id, Таблица.id) КАК id,
		|	ЕСТЬNULL(Изменения.id_owner, Таблица.id_owner) КАК id_owner,
		|	ЕСТЬNULL(Таблица.name, НЕОПРЕДЕЛЕНО) КАК name,
		|	Таблица.id ЕСТЬ NULL КАК deleted,
		|	НЕ Изменения.id ЕСТЬ NULL КАК SUI_ЕстьИзменения
		|ИЗ
		|	(ВЫБРАТЬ
		|			id,
		|			id_owner
		|		ИЗ
		|			РегистрСведений.SUI_tbl_properties.Изменения
		|		ГДЕ
		|			Узел = &МобильноеУстройство) КАК Изменения
		|		" + ТипСоединения + " СОЕДИНЕНИЕ РегистрСведений.SUI_tbl_properties КАК Таблица
		|		ПО  Изменения.id = Таблица.id
		|		И Изменения.id_owner = Таблица.id_owner";
	
	ДанныеЗапроса.Запрос.УстановитьПараметр("МобильноеУстройство", МобильноеУстройство);
	
	Возврат Новый ФиксированнаяСтруктура(ДанныеЗапроса);

КонецФункции

Функция ПолучитьЗапросДанных_УпаковкиНоменклатуры(МобильноеУстройство, ДополнительныеПараметры)
	
	ДанныеЗапроса = СтруктураЗапросаДанных("id,id_owner,code,name,nominator,denominator,int_reduction,deleted", "id");
	
	ТипСоединения = ?(ДополнительныеПараметры.Свойство("ТолькоИзменения"), "ЛЕВОЕ", "ПОЛНОЕ");
	
	ДанныеЗапроса.Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(Изменения.id, Таблица.id) КАК id,
		|	ЕСТЬNULL(Таблица.id_owner, НЕОПРЕДЕЛЕНО) КАК id_owner,
		|	ЕСТЬNULL(Таблица.code, НЕОПРЕДЕЛЕНО) КАК code,
		|	ЕСТЬNULL(Таблица.name, НЕОПРЕДЕЛЕНО) КАК name,
		|	ЕСТЬNULL(Таблица.nominator, НЕОПРЕДЕЛЕНО) КАК nominator,
		|	ЕСТЬNULL(Таблица.denominator, НЕОПРЕДЕЛЕНО) КАК denominator,
		|	ЕСТЬNULL(Таблица.int_reduction, НЕОПРЕДЕЛЕНО) КАК int_reduction,
		|	Таблица.id ЕСТЬ NULL КАК deleted,
		|	НЕ Изменения.id ЕСТЬ NULL КАК SUI_ЕстьИзменения
		|ИЗ
		|	(ВЫБРАТЬ
		|			id
		|		ИЗ
		|			РегистрСведений.SUI_tbl_units.Изменения
		|		ГДЕ
		|			Узел = &МобильноеУстройство) КАК Изменения
		|		" + ТипСоединения + " СОЕДИНЕНИЕ РегистрСведений.SUI_tbl_units КАК Таблица
		|		ПО  Изменения.id = Таблица.id";
	
	ДанныеЗапроса.Запрос.УстановитьПараметр("МобильноеУстройство", МобильноеУстройство);
	
	Возврат Новый ФиксированнаяСтруктура(ДанныеЗапроса);

КонецФункции

Функция ПолучитьЗапросДанных_ЕдиницыИзмерения(МобильноеУстройство, ДополнительныеПараметры)
	
	ДанныеЗапроса = СтруктураЗапросаДанных("id,code,name,deleted", "id");
	
	ТипСоединения = ?(ДополнительныеПараметры.Свойство("ТолькоИзменения"), "ЛЕВОЕ", "ПОЛНОЕ");
	
	ДанныеЗапроса.Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(Изменения.id, Таблица.id) КАК id,
		|	ЕСТЬNULL(Таблица.code, НЕОПРЕДЕЛЕНО) КАК code,
		|	ЕСТЬNULL(Таблица.name, НЕОПРЕДЕЛЕНО) КАК name,
		|	Таблица.id ЕСТЬ NULL КАК deleted,
		|	НЕ Изменения.id ЕСТЬ NULL КАК SUI_ЕстьИзменения
		|ИЗ
		|	(ВЫБРАТЬ
		|			id
		|		ИЗ
		|			РегистрСведений.SUI_tbl_classifier_units.Изменения
		|		ГДЕ
		|			Узел = &МобильноеУстройство) КАК Изменения
		|		" + ТипСоединения + " СОЕДИНЕНИЕ РегистрСведений.SUI_tbl_classifier_units КАК Таблица
		|		ПО  Изменения.id = Таблица.id";
	
	ДанныеЗапроса.Запрос.УстановитьПараметр("МобильноеУстройство", МобильноеУстройство);
	
	Возврат Новый ФиксированнаяСтруктура(ДанныеЗапроса);

КонецФункции

Функция ПолучитьЗапросДанных_ШтрихкодыНоменклатуры(МобильноеУстройство, ДополнительныеПараметры)
	
	ДанныеЗапроса = СтруктураЗапросаДанных("id,barcode,id_good,id_property,id_series,id_unit,ratio,deleted", "id");
	
	ТипСоединения = ?(ДополнительныеПараметры.Свойство("ТолькоИзменения"), "ЛЕВОЕ", "ПОЛНОЕ");
	
	ДанныеЗапроса.Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(Изменения.id, Таблица.id) КАК id,
		|	ЕСТЬNULL(Таблица.barcode, НЕОПРЕДЕЛЕНО) КАК barcode,
		|	ЕСТЬNULL(Таблица.id_good, НЕОПРЕДЕЛЕНО) КАК id_good,
		|	ЕСТЬNULL(Таблица.id_property, НЕОПРЕДЕЛЕНО) КАК id_property,
		|	ЕСТЬNULL(Таблица.id_series, НЕОПРЕДЕЛЕНО) КАК id_series,
		|	ЕСТЬNULL(Таблица.id_unit, НЕОПРЕДЕЛЕНО) КАК id_unit,
		|	ЕСТЬNULL(Таблица.ratio, НЕОПРЕДЕЛЕНО) КАК ratio,
		|	Таблица.id ЕСТЬ NULL КАК deleted,
		|	НЕ Изменения.id ЕСТЬ NULL КАК SUI_ЕстьИзменения
		|ИЗ
		|	(ВЫБРАТЬ
		|			id
		|		ИЗ
		|			РегистрСведений.SUI_tbl_barcodes.Изменения
		|		ГДЕ
		|			Узел = &МобильноеУстройство) КАК Изменения
		|		" + ТипСоединения + " СОЕДИНЕНИЕ РегистрСведений.SUI_tbl_barcodes КАК Таблица
		|		ПО  Изменения.id = Таблица.id";
	
	ДанныеЗапроса.Запрос.УстановитьПараметр("МобильноеУстройство", МобильноеУстройство);
	
	Возврат Новый ФиксированнаяСтруктура(ДанныеЗапроса);

КонецФункции

Функция ПолучитьЗапросДанных_НастройкиДокументов(МобильноеУстройство, ДополнительныеПараметры)
	
	ДанныеЗапроса = СтруктураЗапросаДанных("id,doc_type,deleted", "Ссылка");
	
	ТипСоединения = ?(ДополнительныеПараметры.Свойство("ТолькоИзменения"), "ЛЕВОЕ", "ПОЛНОЕ");
	
	ДанныеЗапроса.Запрос.Текст =
		"ВЫБРАТЬ
		|	Таблица.Ссылка,
		|	Таблица.Ссылка КАК id,
		|	Таблица.Наименование КАК doc_type,
		|	Таблица.id ЕСТЬ NULL КАК deleted,
		|	НЕ Изменения.Ссылка ЕСТЬ NULL КАК SUI_ЕстьИзменения
		|ИЗ
		|	(ВЫБРАТЬ
		|			Ссылка
		|		ИЗ
		|			Справочник.SUI_НастройкиДокументовОбмена.Изменения
		|		ГДЕ
		|			Узел = &МобильноеУстройство) КАК Изменения
		|		" + ТипСоединения + " СОЕДИНЕНИЕ Справочник.SUI_НастройкиДокументовОбмена КАК Таблица
		|		ПО  Изменения.Ссылка = Таблица.Ссылка";
	
	ДанныеЗапроса.Запрос.УстановитьПараметр("МобильноеУстройство", МобильноеУстройство);
	
	Возврат Новый ФиксированнаяСтруктура(ДанныеЗапроса);

КонецФункции

Функция ПолучитьЗапросДанных_ПользователиТСД(МобильноеУстройство, ДополнительныеПараметры)
	
	ДанныеЗапроса = СтруктураЗапросаДанных("id,full_name,deleted,", "Ссылка");
	
	ТипСоединения = ?(ДополнительныеПараметры.Свойство("ТолькоИзменения"), "ЛЕВОЕ", "ПОЛНОЕ");
	
	ДанныеЗапроса.Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(Изменения.Ссылка, Таблица.Ссылка) КАК Ссылка,
		|	ЕСТЬNULL(Изменения.Ссылка, Таблица.Ссылка) КАК id,
		|	ЕСТЬNULL(Таблица.Наименование, НЕОПРЕДЕЛЕНО) КАК full_name,
		|	ЕСТЬNULL(Таблица.Логин, НЕОПРЕДЕЛЕНО) КАК Логин,
		|	ЕСТЬNULL(Таблица.Пароль, НЕОПРЕДЕЛЕНО) КАК Пароль,
		|	Таблица.Ссылка ЕСТЬ NULL КАК deleted,
		|	НЕ Изменения.Ссылка ЕСТЬ NULL КАК SUI_ЕстьИзменения
		|ИЗ
		|	(ВЫБРАТЬ
		|			Ссылка
		|		ИЗ
		|			Справочник.SUI_ПользователиТСД.Изменения
		|		ГДЕ
		|			Узел = &МобильноеУстройство) КАК Изменения
		|		" + ТипСоединения + " СОЕДИНЕНИЕ Справочник.SUI_ПользователиТСД КАК Таблица
		|		ПО  Изменения.Ссылка = Таблица.Ссылка";
	
	ДанныеЗапроса.Запрос.УстановитьПараметр("МобильноеУстройство", МобильноеУстройство);
	
	Возврат Новый ФиксированнаяСтруктура(ДанныеЗапроса);

КонецФункции

Функция ПолучитьЗапросДанных_Сообщения(МобильноеУстройство, ДополнительныеПараметры)
	
	ДанныеЗапроса = СтруктураЗапросаДанных("Сообщение", "ID,Отправитель,Получатель");
	
	ДанныеЗапроса.Запрос.Текст =
		"ВЫБРАТЬ
		|	Таблица.ID,
		|	Таблица.Отправитель,
		|	Таблица.Получатель,
		|	Таблица.Сообщение,
		|	НЕ Изменения.ID ЕСТЬ NULL КАК SUI_ЕстьИзменения
		|ИЗ
		|	РегистрСведений.SUI_СообщенияМобильныхУстройств КАК Таблица
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.SUI_СообщенияМобильныхУстройств.Изменения КАК Изменения
		|		ПО Таблица.ID = Изменения.ID
		|		И Таблица.Отправитель = Изменения.Отправитель
		|		И Таблица.Получатель = Изменения.Получатель
		|		И Изменения.Узел = &МобильноеУстройство";
	
	ДанныеЗапроса.Запрос.УстановитьПараметр("МобильноеУстройство", МобильноеУстройство);
	
	Возврат Новый ФиксированнаяСтруктура(ДанныеЗапроса);

КонецФункции

#Область ДокументОбмена

Функция ПолучитьЗапросДанных_ДокументыОбмена(МобильноеУстройство, ДополнительныеПараметры)
	
	ДанныеЗапроса = СтруктураЗапросаДанных();
	
	ДанныеЗапроса.Запрос.УстановитьПараметр("СостоянияДляВыгрузки", SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.МассивЗначений(
		Перечисления.SUI_СостоянияДокументовОбмена.КВыгрузке,
		Перечисления.SUI_СостоянияДокументовОбмена.Выгружен,
		Перечисления.SUI_СостоянияДокументовОбмена.Загружен,
		Перечисления.SUI_СостоянияДокументовОбмена.ВРаботе));
		
	ДанныеЗапроса.Запрос.УстановитьПараметр("СостоянияЗавершенного", SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.МассивЗначений(
		Перечисления.SUI_СостоянияДокументовОбмена.Завершен,
		Перечисления.SUI_СостоянияДокументовОбмена.Отменен));
		
	ДанныеЗапроса.Запрос.УстановитьПараметр("МобильноеУстройство", МобильноеУстройство);
	ДанныеЗапроса.Запрос.Текст =
		"ВЫБРАТЬ
		|	ДокументОбмена.Ссылка КАК ДокументОбмена,
		|	ЕСТЬNULL(Настройка.Ссылка, ЗНАЧЕНИЕ(Справочник.SUI_НастройкиДокументовОбмена.ПустаяСсылка)) КАК НастройкаДокумента,
		|	ДокументОбмена.Ссылка.Состояние КАК Состояние
		|ПОМЕСТИТЬ втДанные
		|ИЗ
		|	Документ.SUI_ДокументОбмена.Изменения КАК Изменения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.SUI_ДокументОбмена КАК ДокументОбмена
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.SUI_НастройкиДокументовОбмена КАК Настройка
		|			ПО (ДокументОбмена.НастройкаДокумента = Настройка.Ссылка)
		|		ПО Изменения.Ссылка = ДокументОбмена.Ссылка
		|		И Изменения.Узел = &МобильноеУстройство
		|		И (ДокументОбмена.Состояние В (&СостоянияДляВыгрузки)
		|		ИЛИ ДокументОбмена.Состояние В (&СостоянияЗавершенного))
		|ДЛЯ ИЗМЕНЕНИЯ
		|	Документ.SUI_ДокументОбмена.Изменения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втДанные.ДокументОбмена.Ссылка КАК id,
		|	втДанные.НастройкаДокумента.Наименование КАК type,
		|	ВЫБОР
		|		КОГДА втДанные.ДокументОбмена.ТипДокумента = ЗНАЧЕНИЕ(Перечисление.SUI_ТипыДокументовОбмена.Документ)
		|			ТОГДА ""document""
		|		КОГДА втДанные.ДокументОбмена.ТипДокумента В (ЗНАЧЕНИЕ(Перечисление.SUI_ТипыДокументовОбмена.АдресноеХранениеОтбор),
		|			ЗНАЧЕНИЕ(Перечисление.SUI_ТипыДокументовОбмена.АдресноеХранениеРазмещение))
		|			ТОГДА ""cells""
		|		КОГДА втДанные.ДокументОбмена.ТипДокумента = ЗНАЧЕНИЕ(Перечисление.SUI_ТипыДокументовОбмена.СборШтрихкодов)
		|			ТОГДА ""flow""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК process_type,
		|	ВЫБОР
		|		КОГДА втДанные.ДокументОбмена.ТипДокумента = ЗНАЧЕНИЕ(Перечисление.SUI_ТипыДокументовОбмена.АдресноеХранениеОтбор)
		|			ТОГДА ""selection""
		|		КОГДА
		|			втДанные.ДокументОбмена.ТипДокумента = ЗНАЧЕНИЕ(Перечисление.SUI_ТипыДокументовОбмена.АдресноеХранениеРазмещение)
		|			ТОГДА ""placement""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК cells_process_type,
		|	втДанные.ДокументОбмена.НомерДокументаОснования КАК number,
		|	втДанные.ДокументОбмена.ДатаДокументаОснования КАК date,
		|	втДанные.ДокументОбмена.Контрагент КАК countragent_id,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(150)) КАК countragent,
		|	втДанные.ДокументОбмена.Склад КАК warehouse_id,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(150)) КАК warehouse,
		|	втДанные.НастройкаДокумента.КонтролироватьДокумент КАК on_control,
		|	ВЫБОР
		|		КОГДА втДанные.Состояние В (&СостоянияЗавершенного)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК is_completed,
		|	"""" КАК allow_fact_input,
		|	втДанные.ДокументОбмена.ПризнакМаркировки КАК use_mark,
		|	втДанные.ДокументОбмена.ШтрихкодДокумента КАК barcode,
		|	втДанные.НастройкаДокумента.ГрупповоеСканирование КАК is_group_scan,
		|	втДанные.ДокументОбмена.Комментарий КАК comment,
		|	втДанные.ДокументОбмена.Товары.(
		|		ИдентификаторСтроки КАК id,
		|		Номенклатура КАК product_id,
		|		Характеристика КАК property_id,
		|		Упаковка КАК unit_id,
		|		Ячейка КАК cell_id,
		|		ВидЦены КАК price_type_id,
		|		"""" КАК price_type,
		|		Цена КАК price_value,
		|		СтатусУказанияСерии КАК use_series,
		|		ПризнакМаркировки КАК use_mark,
		|		"""" КАК search_string,
		|		КоличествоПлан КАК qty_plan,
		|		КоличествоФакт КАК qty) КАК tbl_products,
		|	втДанные.ДокументОбмена.Серии.(
		|		ИдентификаторСтроки КАК id,
		|		Номенклатура КАК product_id,
		|		Характеристика КАК property_id,
		|		Наименование КАК name,
		|		Номер КАК number,
		|		ДатаПроизводства КАК production_date,
		|		ГоденДо КАК best_before,
		|		КоличествоФакт КАК qty) КАК tbl_series,
		|	втДанные.ДокументОбмена.ШтрихкодыУпаковок.(
		|		ИдентификаторСтроки КАК id,
		|		Номенклатура КАК product_id,
		|		Характеристика КАК property_id,
		|		Упаковка КАК unit_id,
		|		ЗначениеШтрихкода КАК mark_code) КАК tbl_marks
		|ИЗ
		|	втДанные КАК втДанные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДополнительныеРеквизиты.ДокументОбмена КАК ДокументОбмена,
		|	ДополнительныеРеквизиты.Таблица КАК Таблица,
		|	ДополнительныеРеквизиты.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	ДополнительныеРеквизиты.КлючРеквизита КАК КлючРеквизита,
		|	ДополнительныеРеквизиты.ЗначениеРеквизита КАК ЗначениеРеквизита
		|ИЗ
		|	втДанные КАК втДанные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.SUI_ДополнительныеРеквизитыДокументовОбмена КАК ДополнительныеРеквизиты
		|		ПО (втДанные.ДокументОбмена.Ссылка = ДополнительныеРеквизиты.Регистратор)
		|ГДЕ
		|	втДанные.Состояние В (&СостоянияДляВыгрузки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПотокШтрихкодов.ДокументОбмена КАК ДокументОбмена,
		|	ПотокШтрихкодов.ИдентификаторЗаписи КАК id,
		|	ПотокШтрихкодов.Штрихкод КАК barcode,
		|	СУММА(ПотокШтрихкодов.Количество) КАК qty
		|ИЗ
		|	втДанные КАК втДанные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.SUI_ПотокШтрихкодов КАК ПотокШтрихкодов
		|		ПО (втДанные.ДокументОбмена = ПотокШтрихкодов.ДокументОбмена)
		|ГДЕ
		|	втДанные.Состояние В (&СостоянияДляВыгрузки)
		|СГРУППИРОВАТЬ ПО
		|	ПотокШтрихкодов.ДокументОбмена,
		|	ПотокШтрихкодов.ИдентификаторЗаписи,
		|	ПотокШтрихкодов.Штрихкод";
	
	ДанныеЗапроса.Пакеты = Новый Соответствие();
	
	ДанныеПакета = СтруктураПакетаЗапросаДанных(
		SUI_НастройкиМетаданныхСервер.ПолучитьИмяТаблицыМобильногоУстройства(Перечисления.SUI_ТаблицыИнтеграции.Документы), 
		Неопределено, "id", Перечисления.SUI_ТаблицыИнтеграции.Документы);
	
	ДанныеЗапроса.Пакеты.Вставить(1, Новый ФиксированнаяСтруктура(ДанныеПакета));
	
	Возврат Новый ФиксированнаяСтруктура(ДанныеЗапроса);
	
КонецФункции

Функция СобратьСообщениеДокументаОбмена(МобильноеУстройство, РезультатыЗапроса)
	
	ДанныеДокументов = Новый ТаблицаЗначений();
	
	Для Каждого КолонкаРезультата Из РезультатыЗапроса[1].Колонки Цикл
		
		Если КолонкаРезультата.Имя = "id" Тогда
			ТипЗначенияКолонки = Новый ОписаниеТипов("УникальныйИдентификатор");
		ИначеЕсли КолонкаРезультата.Имя = "tbl_products" Или
			КолонкаРезультата.Имя = "tbl_series" Или
			КолонкаРезультата.Имя = "tbl_marks" Тогда
			ТипЗначенияКолонки = Новый ОписаниеТипов("Массив");
		Иначе
			ТипЗначенияКолонки = КолонкаРезультата.ТипЗначения;
		КонецЕсли;
		
		ДанныеДокументов.Колонки.Добавить(КолонкаРезультата.Имя, ТипЗначенияКолонки);
		
	КонецЦикла;
	
	ДанныеДокументов.Колонки.Добавить("tbl_barcode_flow", Новый ОписаниеТипов("Массив"));
	ДанныеДокументов.Колонки.Добавить("additional_details", Новый ОписаниеТипов("Соответствие"));
	
	ВыборкаДокументыОбмена = РезультатыЗапроса[1].Выбрать();
	ВыборкаДополнительныеРеквизиты = РезультатыЗапроса[2].Выбрать();
	ВыборкаПотокШтрихкодов = РезультатыЗапроса[3].Выбрать();
	
	Пока ВыборкаДокументыОбмена.Следующий() Цикл
		
		ДокументОбмена = ВыборкаДокументыОбмена.id;
		
		ДанныеДокументовСтрока = ДанныеДокументов.Добавить();
		ДанныеДокументовСтрока.id = ВыборкаДокументыОбмена.id.УникальныйИдентификатор();
		ЗаполнитьЗначенияСвойств(ДанныеДокументовСтрока, ВыборкаДокументыОбмена, , "id,tbl_products,tbl_series,tbl_marks");
		
		// Заполнить представление Контрагент
		Если SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(ДанныеДокументовСтрока.countragent_id) Тогда
			ДанныеДокументовСтрока.countragent = SUI_ИнтеграцияВКонфигурацию.СсылкаПоИдентификаторуSimple(
				ДанныеДокументовСтрока.countragent_id);
		Иначе
			ДанныеДокументовСтрока.countragent = ДанныеДокументовСтрока.countragent_id;
		КонецЕсли;
		
		// Заполнить представление Склад
		Если SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(ДанныеДокументовСтрока.warehouse_id) Тогда
			ДанныеДокументовСтрока.warehouse = SUI_ИнтеграцияВКонфигурацию.СсылкаПоИдентификаторуSimple(
				ДанныеДокументовСтрока.warehouse_id);
		Иначе
			ДанныеДокументовСтрока.warehouse = ДанныеДокументовСтрока.warehouse_id;
		КонецЕсли;
		
		// Дополнительные реквизиты
		ДобавитьДополнительныеРеквизитыДокументаОбменаИзВыборки(ВыборкаДополнительныеРеквизиты, ДанныеДокументовСтрока);
		
		// Заполнить tbl_products
		ЗаполнитьДанныеТЧДокументаОбменаИзВыборки(ВыборкаДокументыОбмена.tbl_products, ДанныеДокументовСтрока.tbl_products,
			Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары, ВыборкаДополнительныеРеквизиты);
		
		// Заполнить tbl_series
		ЗаполнитьДанныеТЧДокументаОбменаИзВыборки(ВыборкаДокументыОбмена.tbl_series, ДанныеДокументовСтрока.tbl_series,
			Перечисления.SUI_ТипыТаблицДокументовОбмена.Серии, ВыборкаДополнительныеРеквизиты);
		
		// Заполнить tbl_marks
		ЗаполнитьДанныеТЧДокументаОбменаИзВыборки(ВыборкаДокументыОбмена.tbl_marks, ДанныеДокументовСтрока.tbl_marks,
			Перечисления.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок, ВыборкаДополнительныеРеквизиты);
		
		// Заполнить tbl_barcode_flow
		Если Не ВыборкаПотокШтрихкодов.Владелец().Пустой() Тогда
			
			ИменаКолонок = SUI_ОбщегоНазначения.КолонкиРезультатаЗапросаВСтроку(ВыборкаПотокШтрихкодов.Владелец(), , "ДокументОбмена");
			Отбор = Новый Структура("ДокументОбмена", ДокументОбмена);
			ВыборкаПотокШтрихкодов.Сбросить();
			Пока ВыборкаПотокШтрихкодов.НайтиСледующий(Отбор) Цикл
				ДанныеСтроки = Новый Структура(ИменаКолонок);
				ЗаполнитьЗначенияСвойств(ДанныеСтроки, ВыборкаПотокШтрихкодов);
				ДанныеДокументовСтрока.tbl_barcode_flow.Добавить(ДанныеСтроки);
			КонецЦикла;
			
		КонецЕсли;
		
		// Удалить регистрацию
		ПланыОбмена.УдалитьРегистрациюИзменений(МобильноеУстройство, ДокументОбмена);
		
	КонецЦикла;
	
	Возврат ДанныеДокументов;
	
КонецФункции

Процедура ЗаполнитьДанныеТЧДокументаОбменаИзВыборки(РезультатЗапроса, Приемник, Таблица, ВыборкаДополнительныеРеквизиты)
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ИменаКолонок = SUI_ОбщегоНазначения.КолонкиРезультатаЗапросаВСтроку(РезультатЗапроса);
	ИменаКолонок = ИменаКолонок + ",additional_details";
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДанныеВыборки = Новый Структура(ИменаКолонок);
		ЗаполнитьЗначенияСвойств(ДанныеВыборки, Выборка);
		
		// Заполнить представление Вид цены
		Если ДанныеВыборки.Свойство("price_type_id") И ДанныеВыборки.Свойство("price_type") Тогда
			
			Если SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(ДанныеВыборки.price_type_id) Тогда
				ДанныеВыборки.price_type = SUI_ИнтеграцияВКонфигурацию.СсылкаПоИдентификаторуSimple(
					ДанныеВыборки.price_type_id);
			Иначе
				ДанныеВыборки.price_type = ДанныеВыборки.price_type_id;
			КонецЕсли;
			
		КонецЕсли;
		
		// Дополнительные реквизиты
		Если ВыборкаДополнительныеРеквизиты <> Неопределено И Таблица <> Неопределено Тогда
			ДобавитьДополнительныеРеквизитыДокументаОбменаИзВыборки(ВыборкаДополнительныеРеквизиты, ДанныеВыборки, Таблица, ДанныеВыборки.id);
		КонецЕсли;
		
		Приемник.Добавить(ДанныеВыборки);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьДополнительныеРеквизитыДокументаОбменаИзВыборки(ВыборкаДополнительныеРеквизиты, Приемник, 
	Знач Таблица = Неопределено, Знач ИдентификаторСтроки = Неопределено)
	
	Если Таблица = Неопределено Тогда
		Таблица = Перечисления.SUI_ТипыТаблицДокументовОбмена.ПустаяСсылка();
	КонецЕсли;
	
	Если ИдентификаторСтроки = Неопределено Тогда
		ИдентификаторСтроки = ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор();
	КонецЕсли;
	
	Приемник.additional_details = Новый Соответствие();
	
	Отбор = Новый Структура();
	Отбор.Вставить("Таблица", Таблица);
	Отбор.Вставить("ИдентификаторСтроки", ИдентификаторСтроки);
	
	ВыборкаДополнительныеРеквизиты.Сбросить();
	Пока ВыборкаДополнительныеРеквизиты.НайтиСледующий(Отбор) Цикл
		Приемник.additional_details.Вставить(ВыборкаДополнительныеРеквизиты.КлючРеквизита,
			ОбщегоНазначения.ЗначениеИзСтрокиXML(ВыборкаДополнительныеРеквизиты.ЗначениеРеквизита));
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти
