
#Область ПрограммныйИнтерфейс

Функция РазмерПакетаДанных() Экспорт
	
	РазмерПакета = ПолучитьФункциональнуюОпцию("SUI_РазмерПакетаДанных");
	
	Если РазмерПакета < Константы.SUI_РазмерПакетаДанных.МинимальныйРазмер() Тогда
		РазмерПакета = Константы.SUI_РазмерПакетаДанных.МинимальныйРазмер();
	ИначеЕсли РазмерПакета > Константы.SUI_РазмерПакетаДанных.МаксимальныйРазмер() Тогда
		РазмерПакета = Константы.SUI_РазмерПакетаДанных.МаксимальныйРазмер();
	КонецЕсли;
	
	Возврат РазмерПакета;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия 				= "1.0.2.1";
	Обработчик.Процедура 			= "SUI_ПакетыДанных.ОчиститьРегистрПакетыДанных_1_0_2_1";
	Обработчик.РежимВыполнения 		= "Оперативно";
	Обработчик.Комментарий 			= НСтр("ru = 'Очистка регистра пакеты данных'");
	
КонецПроцедуры

Процедура ОчиститьРегистрПакетыДанных_1_0_2_1() Экспорт
	
	Если Метаданные.РегистрыСведений.Найти("Удалить_SUI_ПакетыДанных") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.Удалить_SUI_ПакетыДанных.СоздатьНаборЗаписей();
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Функция ПолучитьЗапросДанных(Таблица, МобильноеУстройство, ТолькоИзменения = Истина, Знач ДополнительныеПараметры = Неопределено) Экспорт
	
	ОписаниеТипаСтруктура = Новый ОписаниеТипов("Структура");
	ДополнительныеПараметры = ОписаниеТипаСтруктура.ПривестиЗначение(ДополнительныеПараметры);
	
	Если ТолькоИзменения Тогда
		ДополнительныеПараметры.Вставить("ТолькоИзменения");
	КонецЕсли;
	
	Если Таблица = Перечисления.SUI_ТаблицыИнтеграции.Контрагенты Тогда
		Возврат ПолучитьЗапросДанных_Контрагенты(МобильноеУстройство, ДополнительныеПараметры);
	ИначеЕсли Таблица = Перечисления.SUI_ТаблицыИнтеграции.Склады Тогда
		Возврат ПолучитьЗапросДанных_Склады(МобильноеУстройство, ДополнительныеПараметры);
	ИначеЕсли Таблица = Перечисления.SUI_ТаблицыИнтеграции.Ячейки Тогда
		Возврат ПолучитьЗапросДанных_Ячейки(МобильноеУстройство, ДополнительныеПараметры);
	ИначеЕсли Таблица = Перечисления.SUI_ТаблицыИнтеграции.Номенклатура Тогда
		Возврат ПолучитьЗапросДанных_Номенклатура(МобильноеУстройство, ДополнительныеПараметры);
	ИначеЕсли Таблица = Перечисления.SUI_ТаблицыИнтеграции.ХарактеристикиНоменклатуры Тогда
		Возврат ПолучитьЗапросДанных_ХарактеристикиНоменклатуры(МобильноеУстройство, ДополнительныеПараметры);
	ИначеЕсли Таблица = Перечисления.SUI_ТаблицыИнтеграции.СерииНоменклатуры Тогда
		Возврат ПолучитьЗапросДанных_СерииНоменклатуры(МобильноеУстройство, ДополнительныеПараметры);
	ИначеЕсли Таблица = Перечисления.SUI_ТаблицыИнтеграции.УпаковкиНоменклатуры Тогда
		Возврат ПолучитьЗапросДанных_УпаковкиНоменклатуры(МобильноеУстройство, ДополнительныеПараметры);
	ИначеЕсли Таблица = Перечисления.SUI_ТаблицыИнтеграции.ЕдиницыИзмерения Тогда
		Возврат ПолучитьЗапросДанных_ЕдиницыИзмерения(МобильноеУстройство, ДополнительныеПараметры);
	ИначеЕсли Таблица = Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыУпаковок Тогда
		Возврат ПолучитьЗапросДанных_ШтрихкодыУпаковок(МобильноеУстройство, ДополнительныеПараметры);
	ИначеЕсли Таблица = Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыНоменклатуры Тогда
		Возврат ПолучитьЗапросДанных_ШтрихкодыНоменклатуры(МобильноеУстройство, ДополнительныеПараметры);
	ИначеЕсли Таблица = Перечисления.SUI_ТаблицыИнтеграции.ВидыЦен Тогда
		Возврат ПолучитьЗапросДанных_ВидыЦен(МобильноеУстройство, ДополнительныеПараметры);
	ИначеЕсли Таблица = Перечисления.SUI_ТаблицыИнтеграции.ЦеныНоменклатуры Тогда
		Возврат ПолучитьЗапросДанных_ЦеныНоменклатуры(МобильноеУстройство, ДополнительныеПараметры);
	ИначеЕсли Таблица = Перечисления.SUI_ТаблицыИнтеграции.НастройкиДокументов Тогда
		Возврат ПолучитьЗапросДанных_НастройкиДокументов(МобильноеУстройство, ДополнительныеПараметры);
	ИначеЕсли Таблица = Перечисления.SUI_ТаблицыИнтеграции.ПользователиТСД Тогда
		Возврат ПолучитьЗапросДанных_ПользователиТСД(МобильноеУстройство, ДополнительныеПараметры);
	ИначеЕсли Таблица = Перечисления.SUI_ТаблицыИнтеграции.Документы Или
		Таблица = Перечисления.SUI_ТаблицыИнтеграции.ДокументыАдресногоХранения Тогда
		Возврат ПолучитьЗапросДанных_Документы(МобильноеУстройство, ДополнительныеПараметры);
	ИначеЕсли Таблица = SUI_ПакетыДанныхКлиентСервер.КлючТаблицы_Сообщения() Тогда
		Возврат ПолучитьЗапросДанных_Сообщения(МобильноеУстройство, ДополнительныеПараметры);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура ВыполнитьЗаданиеСформироватьПакетыДанныхСообщений(Знач Параметры, АдресРезультата) Экспорт
	
	// Оценка производительности
	ОценкаПроизводительности_НачалоЗамера = SUI_ОценкаПроизводительностиПереопределяемый.НачатьЗамерВремени();
	ОценкаПроизводительности_ВесЗамера = 0;
	ОценкаПроизводительности_КлючеваяОперация = "ВыполнитьЗаданиеСформироватьПакетыДанныхСообщений";
	
	ОписаниеТипаСтруктура = Новый ОписаниеТипов("Структура");
	Параметры = ОписаниеТипаСтруктура.ПривестиЗначение(Параметры);
	
	ЭтоПолнаяВыгрузка = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ЭтоПолнаяВыгрузка", Ложь, Тип("Булево"));
	
	ПараметрыРезультата = Новый Структура();
	ПараметрыРезультата.Вставить("ИсключитьСостояния", SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.МассивЗначений(
		Перечисления.SUI_СостоянияМобильныхУстройств.ФормированиеДанных));
	
	Если ЭтоПолнаяВыгрузка Тогда
		ПараметрыРезультата.Вставить("Состояние", Перечисления.SUI_СостоянияМобильныхУстройств.ЗапросПолнойВыгрузки);
	Иначе
		ПараметрыРезультата.Вставить("ИсключитьСостояние", Перечисления.SUI_СостоянияМобильныхУстройств.ЗапросПолнойВыгрузки);
	КонецЕсли;
	
	Если Параметры.Свойство("МобильныеУстройства") Тогда
		ПараметрыРезультата.Вставить("МобильныеУстройства", SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			Параметры, "МобильныеУстройства", Новый Массив(), Тип("Массив")));
	КонецЕсли;
	
	РезультатСостояния = РегистрыСведений.SUI_СостоянияМобильныхУстройств.СостоянияМобильныхУстройств(ПараметрыРезультата, Истина);
	
	Если РезультатСостояния.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаСостояния = РезультатСостояния.Выбрать();
	
	// Оценка производительности
	ОценкаПроизводительности_ВесЗамера = ВыборкаСостояния.Количество();
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных();
		ЭлементБлокировки = Блокировка.Добавить("ПланОбмена.SUI_МобильныеУстройства");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = РезультатСостояния;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Ссылка", "МобильноеУстройство");
		Блокировка.Заблокировать();
		
		Блокировка = Новый БлокировкаДанных();
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.SUI_СостоянияМобильныхУстройств");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = РезультатСостояния;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("МобильноеУстройство", "МобильноеУстройство");
		Блокировка.Заблокировать();
		
		Пока ВыборкаСостояния.Следующий() Цикл
			РегистрыСведений.SUI_СостоянияМобильныхУстройств.СменитьСостояние(ВыборкаСостояния.МобильноеУстройство, 
				Перечисления.SUI_СостоянияМобильныхУстройств.ФормированиеДанных);
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(SUI_ПакетыДанныхКлиентСервер.ИмяСобытия(НСтр("ru = 'Формирование сообщений'")), , 
			Метаданные.ОбщиеМодули.SUI_ПакетыДанных, ВыборкаСостояния.МобильноеУстройство, ИнформацияОбОшибке());
		SUI_ОценкаПроизводительностиПереопределяемый.ЗакончитьЗамерВремени(
			ОценкаПроизводительности_КлючеваяОперация, 
			ОценкаПроизводительности_НачалоЗамера, 
			ОценкаПроизводительности_ВесЗамера, 
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()), 
			Истина);
		ВызватьИсключение;
	КонецПопытки;
	
	ВыборкаСостояния.Сбросить();
	
	Пока ВыборкаСостояния.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			СледующееСостояние = Перечисления.SUI_СостоянияМобильныхУстройств.Выгружено;
			
			// Команда полный сброс
			Если ЭтоПолнаяВыгрузка Тогда
				СоздатьПакетКоманду_ПолныйСброс(ВыборкаСостояния.МобильноеУстройство);
				СледующееСостояние = Перечисления.SUI_СостоянияМобильныхУстройств.ТребуетсяПолучитьДанные;
			КонецЕсли;
			
			// Сформировать пакеты данных
			СостояниеТаблицМУ = ПолучитьСостояниеТаблиц(ВыборкаСостояния.МобильноеУстройство, ЭтоПолнаяВыгрузка);
			Если СостояниеТаблицМУ.Количество() > 0 Тогда
				СформироватьКоллекцииДанныхПакетаСообщений(ВыборкаСостояния.МобильноеУстройство, СостояниеТаблицМУ, ЭтоПолнаяВыгрузка);
				СледующееСостояние = Перечисления.SUI_СостоянияМобильныхУстройств.ТребуетсяПолучитьДанные;
			КонецЕсли;
			
			// Сменить состояние текущего МУ
			РегистрыСведений.SUI_СостоянияМобильныхУстройств.СменитьСостояние(ВыборкаСостояния.МобильноеУстройство, СледующееСостояние);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			Ошибка = ИнформацияОбОшибке();
			SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(SUI_ПакетыДанныхКлиентСервер.ИмяСобытия(НСтр("ru = 'Формирование сообщений'")), , 
				Метаданные.ОбщиеМодули.SUI_ПакетыДанных, ВыборкаСостояния.МобильноеУстройство, Ошибка);
			// Сменить состояние текущего МУ на Ошибка
			РегистрыСведений.SUI_СостоянияМобильныхУстройств.СменитьСостояние(ВыборкаСостояния.МобильноеУстройство, 
				Перечисления.SUI_СостоянияМобильныхУстройств.Ошибка, ОбработкаОшибок.КраткоеПредставлениеОшибки(Ошибка));
			
			// Вернуть состояние оставшихся МУ на ЗапросПолнойВыгрузки
			Пока ВыборкаСостояния.Следующий() Цикл
				РегистрыСведений.SUI_СостоянияМобильныхУстройств.СменитьСостояние(ВыборкаСостояния.МобильноеУстройство, 
				ВыборкаСостояния.Состояние);
			КонецЦикла;
			
			SUI_ОценкаПроизводительностиПереопределяемый.ЗакончитьЗамерВремени(
				ОценкаПроизводительности_КлючеваяОперация, 
				ОценкаПроизводительности_НачалоЗамера, 
				ОценкаПроизводительности_ВесЗамера, 
				ОбработкаОшибок.КраткоеПредставлениеОшибки(Ошибка), 
				Истина);
			ВызватьИсключение;
		КонецПопытки;
		
	КонецЦикла;
	
	// Оценка производительности
	Если ОценкаПроизводительности_ВесЗамера > 0 Тогда
		SUI_ОценкаПроизводительностиПереопределяемый.ЗакончитьЗамерВремени(ОценкаПроизводительности_КлючеваяОперация, 
			ОценкаПроизводительности_НачалоЗамера, ОценкаПроизводительности_ВесЗамера);
	КонецЕсли;
	
КонецПроцедуры

Функция ПараметрыСборкиСообщенийПакетаДанныхИзКоллекции(КоллекцияДанных) Экспорт
	
	ПараметрыСборки = Новый Структура();
	
	ПараметрыСборки.Вставить("КоллекцияДанных", КоллекцияДанных);
	ПараметрыСборки.Вставить("Записывать", Ложь);
	ПараметрыСборки.Вставить("ВидДанных", Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.Значение);
	ПараметрыСборки.Вставить("Отправитель");
	ПараметрыСборки.Вставить("Получатель");
	ПараметрыСборки.Вставить("РазмерПакета", РазмерПакетаДанных());
	ПараметрыСборки.Вставить("Приоритет", 5);
	
	Возврат ПараметрыСборки;
	
КонецФункции

Функция СобратьСообщениеПакетаДанныхИзКоллекции(ПараметрыСборки, АдресРезультата = Неопределено) Экспорт
	
	Пакеты = Новый Массив();
	
	КоллекцияДанных = ПараметрыСборки.КоллекцияДанных;
	
	Если ПараметрыСборки.Записывать И ПараметрыСборки.ВидДанных = Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.Значение Тогда
		РегистрыСведений.SUI_СообщенияОбменаДанными.Создать(ПараметрыСборки.Отправитель, ПараметрыСборки.Получатель, КоллекцияДанных);
	Иначе
		
		Сообщения = КоллекцияДанных.Получить(SUI_ПакетыДанныхКлиентСервер.КлючТаблицы_Сообщения());
		Если Сообщения <> Неопределено Тогда
			КоллекцияДанных.Удалить(SUI_ПакетыДанныхКлиентСервер.КлючТаблицы_Сообщения());
		КонецЕсли;
		
		ОписаниеТипаМассив = Новый ОписаниеТипов("Массив");
		
		Если КоллекцияДанных.Количество() = 0 Тогда
			Пакет = SUI_ПакетыДанныхКлиентСервер.ПустойПакет(SUI_ПакетыДанныхКлиентСервер.ФорматПакета_НетДанных());
			Пакет.messages = ОписаниеТипаМассив.ПривестиЗначение(Сообщения);
		Иначе
			
			КлючДанных_ДополнительныеРеквизиты = SUI_ДополнительныеРеквизитыТаблиц.КлючДополнительныхРеквизитов();
			
			ОстатокПакета = ПараметрыСборки.РазмерПакета;
			
			Пакет = SUI_ПакетыДанныхКлиентСервер.ПустойПакет(SUI_ПакетыДанныхКлиентСервер.ФорматПакета_ЕстьДанные(), Новый Соответствие());
			Пакет.messages = ОписаниеТипаМассив.ПривестиЗначение(Сообщения);
			
			Для Каждого ЭлементКоллекции Из КоллекцияДанных Цикл
				
				РезультатЗапроса = РезультатЗапросаПоПараметру(ЭлементКоллекции.Значение.Данные);
				Если РезультатЗапроса.Пустой() Тогда
					Продолжить;
				КонецЕсли;
				
				КолонкаУдаленно = "deleted";
				
				ПоляДанных = ОбщегоНазначения.ОписаниеТипаСтрока(0).ПривестиЗначение(ЭлементКоллекции.Значение.ПоляДанных);
				ПоляДанных = SUI_ОбщегоНазначения.КолонкиРезультатаЗапросаВСтроку(РезультатЗапроса, ПоляДанных, КолонкаУдаленно);
				
				ПоляУдаленныхДанных = "";
				Если РезультатЗапроса.Колонки.Найти(КолонкаУдаленно) = Неопределено Тогда
					КолонкаУдаленно = Неопределено;
				Иначе
					
					ПоляУдаленныхДанных = "id";
					
					Если ЭлементКоллекции.Ключ = Перечисления.SUI_ТаблицыИнтеграции.ХарактеристикиНоменклатуры Тогда
						ПоляУдаленныхДанных = ПоляУдаленныхДанных + ",id_owner";
					КонецЕсли;
					
					ПоляУдаленныхДанных = SUI_ОбщегоНазначения.КолонкиРезультатаЗапросаВСтроку(РезультатЗапроса, ПоляУдаленныхДанных);
					
				КонецЕсли;
				
				Выборка = РезультатЗапроса.Выбрать();
				
				ДанныеТаблицы = Новый Массив();
				УдаленныеДанныеТаблицы = Новый Массив();
				
				Пока Выборка.Следующий() Цикл
					
					Если ОстатокПакета = 0 Тогда
						
						Если ДанныеТаблицы.Количество() > 0 Тогда
							Пакет.data.Вставить(ЭлементКоллекции.Значение.ИмяТаблицы, ДанныеТаблицы);
						КонецЕсли;
						
						Если УдаленныеДанныеТаблицы.Количество() > 0 И КолонкаУдаленно <> Неопределено Тогда
							Пакет.data.Вставить(ЭлементКоллекции.Значение.ИмяТаблицы + "_" + КолонкаУдаленно, 
								УдаленныеДанныеТаблицы);
						КонецЕсли;
						
						Если ПараметрыСборки.Записывать Тогда
							РегистрыСведений.SUI_СообщенияОбменаДанными.Создать(ПараметрыСборки.Отправитель, 
								ПараметрыСборки.Получатель, Пакет, ПараметрыСборки.Приоритет, ПараметрыСборки.ВидДанных);
						Иначе
							
							Если ПараметрыСборки.ВидДанных = Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.JSON Тогда
								Пакет = SUI_СообщенияОбменаДанными.ДанныеСообщенияВJSON(Пакет);
								ОбщегоНазначенияКлиентСервер.Проверить(Пакет <> Неопределено,
									НСтр("ru = 'Не удалось собрать сообщение обмена данных по причине:
									|Неудалось преобразовать пакет данных в JSON'"));
							КонецЕсли;
							
							Пакеты.Добавить(Пакет);
							
						КонецЕсли;
						
						ОстатокПакета = ПараметрыСборки.РазмерПакета;
						
						Пакет = SUI_ПакетыДанныхКлиентСервер.ПустойПакет(
							SUI_ПакетыДанныхКлиентСервер.ФорматПакета_ЕстьДанные(), Новый Соответствие());
						
						ДанныеТаблицы = Новый Массив();
						
					КонецЕсли;
					
					Если КолонкаУдаленно <> Неопределено И Выборка[КолонкаУдаленно] Тогда
						ДанныеВыборки = Новый Структура(ПоляУдаленныхДанных);
					Иначе
						ДанныеВыборки = Новый Структура(ПоляДанных);
					КонецЕсли;
					
					ЗаполнитьЗначенияСвойств(ДанныеВыборки, Выборка);
					
					Если ЭлементКоллекции.Ключ = Перечисления.SUI_ТаблицыИнтеграции.НастройкиДокументов И
						ДанныеВыборки.Свойство("id") Тогда
						ДанныеВыборки.id = SUI_ИнтеграцияВКонфигурацию.ИдентификаторSimpleПоСсылке(ДанныеВыборки.id, Истина);
					КонецЕсли;
					
					Если КолонкаУдаленно <> Неопределено И Выборка[КолонкаУдаленно] Тогда
						УдаленныеДанныеТаблицы.Добавить(ДанныеВыборки);
					Иначе
						
						Если (ЭлементКоллекции.Ключ = Перечисления.SUI_ТаблицыИнтеграции.Документы Или
							ЭлементКоллекции.Ключ = Перечисления.SUI_ТаблицыИнтеграции.ДокументыАдресногоХранения Или
							ЭлементКоллекции.Ключ = Перечисления.SUI_ТаблицыИнтеграции.ТоварыДокументов Или
							ЭлементКоллекции.Ключ = Перечисления.SUI_ТаблицыИнтеграции.ТоварыДокументовАдресногоХранения Или
							ЭлементКоллекции.Ключ = Перечисления.SUI_ТаблицыИнтеграции.СерииДокументов Или
							ЭлементКоллекции.Ключ = Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыУпаковокДокументов) И
							ДанныеВыборки.Свойство(КлючДанных_ДополнительныеРеквизиты) И Не ПустаяСтрока(ДанныеВыборки[КлючДанных_ДополнительныеРеквизиты]) Тогда
							
							ДанныеВыборки.Вставить(КлючДанных_ДополнительныеРеквизиты, 
								SUI_ДополнительныеРеквизитыТаблиц.ДополнительныеРеквизитыИзJSON(ДанныеВыборки[КлючДанных_ДополнительныеРеквизиты]));
							
						ИначеЕсли ЭлементКоллекции.Ключ = Перечисления.SUI_ТаблицыИнтеграции.ПользователиТСД Тогда
							ЗаполнитьСтрокуАвторизацииПользователяТСД(ДанныеВыборки);
						КонецЕсли;
						
						ДанныеТаблицы.Добавить(ДанныеВыборки);
						
					КонецЕсли;
					
					ОстатокПакета = ОстатокПакета - 1;
					
				КонецЦикла;
				
				Если ДанныеТаблицы.Количество() > 0 Тогда
					Пакет.data.Вставить(ЭлементКоллекции.Значение.ИмяТаблицы, ДанныеТаблицы);
				КонецЕсли;
				
				Если УдаленныеДанныеТаблицы.Количество() > 0 И КолонкаУдаленно <> Неопределено Тогда
					Пакет.data.Вставить(ЭлементКоллекции.Значение.ИмяТаблицы + "_" + КолонкаУдаленно, УдаленныеДанныеТаблицы);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Пакет.data) Или ЗначениеЗаполнено(Пакет.messages) Тогда
			
			Если ПараметрыСборки.Записывать Тогда
				РегистрыСведений.SUI_СообщенияОбменаДанными.Создать(ПараметрыСборки.Отправитель, 
					ПараметрыСборки.Получатель, Пакет, ПараметрыСборки.Приоритет, ПараметрыСборки.ВидДанных);
			Иначе
				
				Если ПараметрыСборки.ВидДанных = Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.JSON Тогда
					Пакет = SUI_СообщенияОбменаДанными.ДанныеСообщенияВJSON(Пакет);
					ОбщегоНазначенияКлиентСервер.Проверить(Пакет <> Неопределено,
						НСтр("ru = 'Не удалось собрать сообщение обмена данных по причине:
						|Неудалось преобразовать пакет данных в JSON'"));
				КонецЕсли;
				
				Пакеты.Добавить(Пакет);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗнч(АдресРезультата) = Тип("Строка") И ЭтоАдресВременногоХранилища(АдресРезультата) Тогда
		ПоместитьВоВременноеХранилище(Пакеты, АдресРезультата);
		Возврат АдресРезультата;
	Иначе
		Возврат Пакеты;
	КонецЕсли;
	
КонецФункции

Процедура СвернутьКоллекцииДанных(КоллекцияИсточник, КоллекцияПриемник) Экспорт
	
	Для Каждого ИсточникКлючЗначение Из КоллекцияИсточник Цикл
		
		ЗначениеПриемник = КоллекцияПриемник.Получить(ИсточникКлючЗначение.Ключ);
		
		Если ЗначениеПриемник = Неопределено Тогда
			КоллекцияПриемник.Вставить(ИсточникКлючЗначение.Ключ, ИсточникКлючЗначение.Значение);
		Иначе
			
			Если ИсточникКлючЗначение.Ключ = SUI_ПакетыДанныхКлиентСервер.КлючТаблицы_Сообщения() Тогда
				ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ЗначениеПриемник, ИсточникКлючЗначение.Значение, Истина);
			Иначе
				
				ПоляВыборИсточник = Новый Массив();
				ПоляВыборПриемник = Новый Массив();
				ПоляВыбор = Новый Массив();
				Для Каждого Колонка Из ИсточникКлючЗначение.Значение.Данные.Колонки Цикл
					ПоляВыборИсточник.Добавить("Источник." + Колонка.Имя);
					ПоляВыборПриемник.Добавить("Приемник." + Колонка.Имя);
					ПоляВыбор.Добавить("ЕСТЬNULL(втПриемник." + Колонка.Имя + ", втИсточник." + Колонка.Имя + ") КАК " + Колонка.Имя);
				КонецЦикла;
				
				ПоляСоединения = Новый Массив();
				Для Каждого ПолеСоединения Из ПоляСоединенияПоТаблице(ИсточникКлючЗначение.Ключ) Цикл
					ПоляСоединения.Добавить("втИсточник." + ПолеСоединения + " = втПриемник." + ПолеСоединения);
				КонецЦикла;
				
				Запрос = Новый Запрос();
				Запрос.УстановитьПараметр("Источник", ИсточникКлючЗначение.Значение.Данные);
				Запрос.УстановитьПараметр("Приемник", ЗначениеПриемник.Данные);
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	" + СтрСоединить(ПоляВыборИсточник, "," + Символы.ПС + Символы.Таб) + "
					|ПОМЕСТИТЬ втИсточник
					|ИЗ
					|	&Источник КАК Источник" 
					+ ОбщегоНазначения.РазделительПакетаЗапросов() +
					"ВЫБРАТЬ
					|	" + СтрСоединить(ПоляВыборПриемник, "," + Символы.ПС + Символы.Таб) + "
					|ПОМЕСТИТЬ втПриемник
					|ИЗ
					|	&Приемник КАК Приемник"
					+ ОбщегоНазначения.РазделительПакетаЗапросов() +
					"ВЫБРАТЬ
					|	" + СтрСоединить(ПоляВыбор, "," + Символы.ПС + Символы.Таб) + "
					|ИЗ
					|	втИсточник КАК втИсточник
					|		ПОЛНОЕ СОЕДИНЕНИЕ втПриемник КАК втПриемник
					|		ПО " + СтрСоединить(ПоляСоединения, Символы.ПС + Символы.Таб + Символы.Таб + "И ")
					+ ОбщегоНазначения.РазделительПакетаЗапросов() +
					"УНИЧТОЖИТЬ втИсточник"
					+ ОбщегоНазначения.РазделительПакетаЗапросов() +
					"УНИЧТОЖИТЬ втПриемник;";
				
				//@skip-check query-in-loop
				ЗначениеПриемник.Данные = Запрос.Выполнить().Выгрузить();
				
			КонецЕсли;
			
			КоллекцияПриемник.Вставить(ИсточникКлючЗначение.Ключ, ЗначениеПриемник);
			
		КонецЕсли;
		
		КоллекцияИсточник.Удалить(ИсточникКлючЗначение.Ключ);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСообщенияПоСостояниюТаблицы(СостояниеТаблицы)
	
	Сообщения = Новый Массив();
	
	Результат = ВыполнитьЗапросСостоянияТаблицы(СостояниеТаблицы);
	
	Для Каждого ДанныеПакета Из Результат.Пакеты Цикл
		
		Если Результат.Результаты[ДанныеПакета.Ключ].Пустой() Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыУдаленияРегистрации = ПараметрыУдаленияРегистрацииИзменний(СостояниеТаблицы.МобильноеУстройство,
			СостояниеТаблицы.ИмяТаблицы, ДанныеПакета.Значение.КлючиОтбора);
		
		Если ПараметрыУдаленияРегистрации <> Неопределено И
			Результат.Результаты[ДанныеПакета.Ключ].Колонки.Найти(ПараметрыУдаленияРегистрации.ИмяПоляЕстьИзменения) = Неопределено Тогда
			ПараметрыУдаленияРегистрации = Неопределено;
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Истина);
		
		Выборка = Результат.Результаты[ДанныеПакета.Ключ].Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Сообщения.Добавить(Выборка[ДанныеПакета.Значение.ПоляДанных]);
			
			// Удалить регистрацию
			УдалитьРегистрацию(Выборка, ПараметрыУдаленияРегистрации);
				
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Сообщения;
	
КонецФункции

Функция ВыполнитьЗапросСостоянияТаблицы(СтрокаСостояниеТаблиц)
	
	Результат = Новый Структура();
	Результат.Вставить("Результаты");
	Результат.Вставить("Пакеты", СтрокаСостояниеТаблиц.ДанныеЗапроса.Пакеты);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Результат.Пакеты = Неопределено Тогда
		
		ДобавитьПакетДанныхВСтруктуруЗапросаДанных(Результат, 0, СтрокаСостояниеТаблиц.ИмяТаблицыМобильногоУстройства, 
			СтрокаСостояниеТаблиц.ДанныеЗапроса.ПоляДанных, СтрокаСостояниеТаблиц.ДанныеЗапроса.КлючиОтбора, СтрокаСостояниеТаблиц.Таблица);
		
		Результат.Результаты = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
			СтрокаСостояниеТаблиц.ДанныеЗапроса.Запрос.Выполнить());
			
	Иначе
		Результат.Результаты = СтрокаСостояниеТаблиц.ДанныеЗапроса.Запрос.ВыполнитьПакет();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПараметрыУдаленияРегистрацииИзменний(МобильноеУстройство, Знач ИмяТаблицы, КлючиОтбора)
	
	Параметры = Новый Структура();
	Параметры.Вставить("ИмяПоляЕстьИзменения", "SUI_ЕстьИзменения");
	Параметры.Вставить("МобильноеУстройство", МобильноеУстройство);
	Параметры.Вставить("ЭтоРегистр", Ложь);
	Параметры.Вставить("ЭтоСправочник", Ложь);
	Параметры.Вставить("КлючиОтбора", СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(
		ОбщегоНазначения.ОписаниеТипаСтрока(0).ПривестиЗначение(КлючиОтбора), , Истина, Истина));
	
	ИмяТаблицы = ОбщегоНазначения.ОписаниеТипаСтрока(0).ПривестиЗначение(ИмяТаблицы);
	
	Если СтрНачинаетсяС(ВРег(ИмяТаблицы), "РЕГИСТРСВЕДЕНИЙ.") Тогда
		Параметры.ЭтоРегистр = Истина;
	ИначеЕсли СтрНачинаетсяС(ВРег(ИмяТаблицы), "СПРАВОЧНИК.") И Параметры.КлючиОтбора.Найти("Ссылка") <> Неопределено Тогда
		Параметры.КлючиОтбора = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("Ссылка");
		Параметры.ЭтоСправочник = Истина;
	КонецЕсли;
	
	Если (Параметры.ЭтоРегистр Или Параметры.ЭтоСправочник) И Параметры.КлючиОтбора.Количество() > 0 Тогда
		Параметры.Вставить("МенеджерТаблицы", ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ИмяТаблицы));
	Иначе
		Параметры = Неопределено;
	КонецЕсли;
	
	Возврат Параметры;
	
КонецФункции

Процедура УдалитьРегистрацию(Выборка, ПараметрыУдаленияРегистрации)
	
	Если ПараметрыУдаленияРегистрации <> Неопределено И Выборка[ПараметрыУдаленияРегистрации.ИмяПоляЕстьИзменения] Тогда
		
		Если ПараметрыУдаленияРегистрации.ЭтоРегистр Тогда
			Данные = ПараметрыУдаленияРегистрации.МенеджерТаблицы.СоздатьНаборЗаписей();
			Для индекс = 0 По ПараметрыУдаленияРегистрации.КлючиОтбора.ВГраница() Цикл
				Данные.Отбор[ПараметрыУдаленияРегистрации.КлючиОтбора[индекс]].Установить(
					Выборка[ПараметрыУдаленияРегистрации.КлючиОтбора[индекс]]);
			КонецЦикла;
		ИначеЕсли ПараметрыУдаленияРегистрации.ЭтоСправочник Тогда
			Данные = Выборка[ПараметрыУдаленияРегистрации.КлючиОтбора[0]];
		Иначе
			Данные = Неопределено;
		КонецЕсли;
		
		Если Данные <> Неопределено Тогда
			ПланыОбмена.УдалитьРегистрациюИзменений(ПараметрыУдаленияРегистрации.МобильноеУстройство, Данные);
		КонецЕсли;
						
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСостояниеТаблиц(МобильноеУстройство, ЭтоПолнаяВыгрузка = Ложь)
	
	ПараметрыРезультата = SUI_КомпоновкаДанныхСервер.ПараметрыРезультатСхемыКомпоновкиДанных();
	ПараметрыРезультата.СхемаКомпоновкиДанных = SUI_ПакетыДанныхПовтИсп.СхемаСостоянияТаблицМобильногоУстройства();
	ПараметрыРезультата.ВозможностьИспользованияВнешнихФункций = Истина;
	ПараметрыРезультата.ВыполнятьВПривилегированномРежиме = Истина;
	
	SUI_КомпоновкаДанныхСервер.ДобавитьПараметр(ПараметрыРезультата.СхемаКомпоновкиДанных, 
		"МобильноеУстройство", , МобильноеУстройство, , Истина);
		
	SUI_КомпоновкаДанныхСервер.ДобавитьПараметр(ПараметрыРезультата.СхемаКомпоновкиДанных, 
		"ЭтоПолнаяВыгрузка", , ЭтоПолнаяВыгрузка, , Истина);
	
	Возврат SUI_КомпоновкаДанныхСервер.ВыгрузитьРезультатСхемыКомпоновкиДанных(ПараметрыРезультата);
		
КонецФункции

Процедура ЗаполнитьСтрокуАвторизацииПользователяТСД(Данные)
	
	ДанныеСтрокиАвторизации = Новый Структура("Логин,Пароль");

	Если Данные.Свойство("Логин") Тогда
		ДанныеСтрокиАвторизации.Логин = Данные.Логин;
		Данные.Удалить("Логин");
	КонецЕсли;
	
	Если Данные.Свойство("Пароль") Тогда
		ДанныеСтрокиАвторизации.Пароль = Данные.Пароль;
		Данные.Удалить("Пароль");
	КонецЕсли;
	
	Если ДанныеСтрокиАвторизации.Логин <> Неопределено И ДанныеСтрокиАвторизации.Пароль <> Неопределено Тогда
		Данные.Вставить("auth_string", ОбщегоНазначения.КонтрольнаяСуммаСтрокой(
			ДанныеСтрокиАвторизации.Логин + ":" + ДанныеСтрокиАвторизации.Пароль));
	Иначе
		Данные.Вставить("auth_string");
	КонецЕсли;
					
КонецПроцедуры

Функция РезультатЗапросаПоПараметру(Знач Данные)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТипЗначенияДанных = ТипЗнч(Данные);
	
	Если ТипЗнч(Данные) = Тип("Строка") И ЭтоАдресВременногоХранилища(Данные) Тогда
		Данные = ПолучитьИзВременногоХранилища(Данные);
		ТипЗначенияДанных = ТипЗнч(Данные);
	КонецЕсли;
	
	Если ТипЗначенияДанных = Тип("РезультатЗапроса") Или ТипЗначенияДанных = Тип("ТаблицаЗначений") Тогда
		Построитель = Новый ПостроительЗапроса;
		Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(Данные);
		Построитель.Выполнить();
		Данные = Построитель.Результат;
	ИначеЕсли ТипЗначенияДанных = Тип("ВыборкаИзРезультатаЗапроса") Тогда
		Данные = Данные.Владелец();
	КонецЕсли;

	ОписаниеТипа = Новый ОписаниеТипов("РезультатЗапроса");
	Возврат ОписаниеТипа.ПривестиЗначение(Данные);
	
КонецФункции

Процедура СформироватьКоллекцииДанныхПакетаСообщений(МобильноеУстройство, СостояниеТаблиц, ЭтоПолнаяВыгрузка = Ложь)
	
	УстановитьПривилегированныйРежим(Истина);
	
	КоллекцияДанных = Новый Соответствие();
	
	НачатьТранзакцию();
	
	Попытка
		
		// Перезапись таблиц
		СостояниеТаблицКПерезаписи = СостояниеТаблиц.Скопировать(Новый Структура("ПерезаписьТаблицы", Истина), "ПерезаписьТаблицы,Таблица,ИмяТаблицыМобильногоУстройства");
		Если СостояниеТаблицКПерезаписи.Количество() > 0 Тогда
			СоздатьПакетКоманду_ПерезаписьТаблицМУ(МобильноеУстройство, СостояниеТаблицКПерезаписи);
		КонецЕсли;
		
		// Сообщения мобильных устройств
		СостояниеТаблицыСообщения = СостояниеТаблиц.Найти(SUI_ПакетыДанныхКлиентСервер.КлючТаблицы_Сообщения(), "Таблица");
		Если СостояниеТаблицыСообщения <> Неопределено Тогда
			КоллекцияДанных.Вставить(SUI_ПакетыДанныхКлиентСервер.КлючТаблицы_Сообщения(), 
				ПолучитьСообщенияПоСостояниюТаблицы(СостояниеТаблицыСообщения));
			СостояниеТаблиц.Удалить(СостояниеТаблицыСообщения);
		КонецЕсли;
		
		Для Каждого СостояниеТаблицы Из СостояниеТаблиц Цикл
			
			Результат = ВыполнитьЗапросСостоянияТаблицы(СостояниеТаблицы);
			
			Для Каждого ДанныеПакета Из Результат.Пакеты Цикл
				
				Если Результат.Результаты[ДанныеПакета.Ключ].Пустой() Тогда
					Продолжить;
				КонецЕсли;
				
				ПараметрыУдаленияРегистрации = ПараметрыУдаленияРегистрацииИзменний(МобильноеУстройство,
					СостояниеТаблицы.ИмяТаблицы, ДанныеПакета.Значение.КлючиОтбора);
				
				Если ПараметрыУдаленияРегистрации <> Неопределено И
					Результат.Результаты[ДанныеПакета.Ключ].Колонки.Найти(ПараметрыУдаленияРегистрации.ИмяПоляЕстьИзменения) = Неопределено Тогда
					ПараметрыУдаленияРегистрации = Неопределено;
				КонецЕсли;
				
				// Удалить регистрацию
				Если ПараметрыУдаленияРегистрации <> Неопределено Тогда
					
					Выборка = Результат.Результаты[ДанныеПакета.Ключ].Выбрать();
					
					Пока Выборка.НайтиСледующий(Новый Структура(ПараметрыУдаленияРегистрации.ИмяПоляЕстьИзменения, Истина)) Цикл
						
						Если ПараметрыУдаленияРегистрации.ЭтоРегистр Тогда
							Данные = ПараметрыУдаленияРегистрации.МенеджерТаблицы.СоздатьНаборЗаписей();
							Для индекс = 0 По ПараметрыУдаленияРегистрации.КлючиОтбора.ВГраница() Цикл
								Данные.Отбор[ПараметрыУдаленияРегистрации.КлючиОтбора[индекс]].Установить(
									Выборка[ПараметрыУдаленияРегистрации.КлючиОтбора[индекс]]);
							КонецЦикла;
						ИначеЕсли ПараметрыУдаленияРегистрации.ЭтоСправочник Тогда
							Данные = Выборка[ПараметрыУдаленияРегистрации.КлючиОтбора[0]];
						Иначе
							Продолжить;
						КонецЕсли;
						
						ПланыОбмена.УдалитьРегистрациюИзменений(ПараметрыУдаленияРегистрации.МобильноеУстройство, Данные);
						
					КонецЦикла;
					
				КонецЕсли;
				
				ДанныеКоллекции = Новый Структура("ПоляДанных, ИмяТаблицы, Данные");
				ДанныеКоллекции.ПоляДанных = ДанныеПакета.Значение.ПоляДанных;
				ДанныеКоллекции.ИмяТаблицы = ДанныеПакета.Значение.ИмяПакета;
				
				Если ЭтоПолнаяВыгрузка Тогда
					ДанныеКоллекции.Данные = Результат.Результаты[ДанныеПакета.Ключ];
				Иначе
					ДанныеКоллекции.Данные = Результат.Результаты[ДанныеПакета.Ключ].Выгрузить();
				КонецЕсли;
				
				КоллекцияДанных.Вставить(ДанныеПакета.Значение.Таблица, ДанныеКоллекции);
				
			КонецЦикла;
			
		КонецЦикла;
		
		Если КоллекцияДанных.Количество() > 0 Тогда
			
			ПараметрыСборки = ПараметрыСборкиСообщенийПакетаДанныхИзКоллекции(КоллекцияДанных);
			ПараметрыСборки.Записывать = Истина;
			ПараметрыСборки.Отправитель = ПланыОбмена.SUI_МобильныеУстройства.ЭтотУзел();
			ПараметрыСборки.Получатель = МобильноеУстройство;
			
			Если ЭтоПолнаяВыгрузка Тогда
				ПараметрыСборки.ВидДанных = Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.JSON;
			КонецЕсли;
			
			СобратьСообщениеПакетаДанныхИзКоллекции(ПараметрыСборки);
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Функция ПоляСоединенияПоТаблице(Таблица)
	
	Если Таблица = Перечисления.SUI_ТаблицыИнтеграции.Контрагенты Или
		Таблица = Перечисления.SUI_ТаблицыИнтеграции.Склады Или
		Таблица = Перечисления.SUI_ТаблицыИнтеграции.Номенклатура Или
		Таблица = Перечисления.SUI_ТаблицыИнтеграции.СерииНоменклатуры Или
		Таблица = Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыНоменклатуры Или
		Таблица = Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыУпаковок Или
		Таблица = Перечисления.SUI_ТаблицыИнтеграции.УпаковкиНоменклатуры Или
		Таблица = Перечисления.SUI_ТаблицыИнтеграции.ЕдиницыИзмерения Или
		Таблица = Перечисления.SUI_ТаблицыИнтеграции.ВидыЦен Или
		Таблица = Перечисления.SUI_ТаблицыИнтеграции.ЦеныНоменклатуры Или
		Таблица = Перечисления.SUI_ТаблицыИнтеграции.Ячейки Тогда
		Поля = "id";
	ИначеЕсли Таблица = Перечисления.SUI_ТаблицыИнтеграции.Документы Или
		Таблица = Перечисления.SUI_ТаблицыИнтеграции.ДокументыАдресногоХранения Тогда
		Поля = "sid,id_doc,НастройкаДокумента";
	ИначеЕсли Таблица = Перечисления.SUI_ТаблицыИнтеграции.НастройкиДокументов Или
		Таблица = Перечисления.SUI_ТаблицыИнтеграции.ПользователиТСД Или
		Таблица = Перечисления.SUI_ТаблицыИнтеграции.ШаблоныЭтикеток Тогда
		Поля = "Ссылка";
	ИначеЕсли Таблица = Перечисления.SUI_ТаблицыИнтеграции.ТоварыДокументов Или
		Таблица = Перечисления.SUI_ТаблицыИнтеграции.ТоварыДокументовАдресногоХранения Или
		Таблица = Перечисления.SUI_ТаблицыИнтеграции.СерииДокументов Или
		Таблица = Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыУпаковокДокументов Тогда
		Поля = "sid,sid_doc";
	ИначеЕсли Таблица = Перечисления.SUI_ТаблицыИнтеграции.ХарактеристикиНоменклатуры Тогда
		Поля = "id,id_owner";
	ИначеЕсли Таблица = SUI_ПакетыДанныхКлиентСервер.КлючТаблицы_ДокументыЗавершенные() Тогда
		Поля = "id_doc";
	ИначеЕсли Таблица = SUI_ПакетыДанныхКлиентСервер.КлючТаблицы_Сообщения() Тогда
		Поля = "";
	Иначе
		ВызватьИсключение НСтр("ru = 'Не удалось определить таблицу'");
	КонецЕсли;
	
	Возврат СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Поля, , Истина, Истина);
	
КонецФункции

#Область Пакеты_Команды

Функция СоздатьПакетКоманду(МобильноеУстройство, ПараметрыКоманды, Записывать = Истина, Приоритет = 7)
	
	Пакет = SUI_ПакетыДанныхКлиентСервер.ПустойПакет(SUI_ПакетыДанныхКлиентСервер.ФорматПакета_Команда(), ПараметрыКоманды);
	
	Если Записывать Тогда
		РегистрыСведений.SUI_СообщенияОбменаДанными.Создать(ПланыОбмена.SUI_МобильныеУстройства.ЭтотУзел(), МобильноеУстройство, 
			Пакет, Приоритет, Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.JSON);
		Возврат Неопределено;
	Иначе
		Возврат Пакет;
	КонецЕсли;
	
КонецФункции

Функция СоздатьПакетКоманду_ПолныйСброс(МобильноеУстройство, Записывать = Истина)

	ДанныеКоманды = Новый Структура();
	ДанныеКоманды.Вставить("data_reset", Истина);
	
	Возврат СоздатьПакетКоманду(МобильноеУстройство, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеКоманды), Записывать, 9);
	
КонецФункции

Функция СоздатьПакетКоманду_ПерезаписьТаблицМУ(МобильноеУстройство, СтрокиСостояниеТаблицКПерезаписи, Записывать = Истина)
	
	Перем Результат;
	
	НачатьТранзакцию();
	
	Попытка
		
		ДанныеКоманды = Новый Структура();
		ДанныеКоманды.Вставить("truncate_table", Новый Массив());
		
		Для Каждого СтрокаСостояниеТаблицКПерезаписи Из СтрокиСостояниеТаблицКПерезаписи Цикл
			
			Если Не СтрокаСостояниеТаблицКПерезаписи.ПерезаписьТаблицы Тогда
				Продолжить;
			КонецЕсли;
			
			ДанныеКоманды.truncate_table.Добавить(СтрокаСостояниеТаблицКПерезаписи.ИмяТаблицыМобильногоУстройства);
			
			НаборЗаписей = РегистрыСведений.SUI_ТаблицыКПерезаписиВМУ.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Таблица.Установить(СтрокаСостояниеТаблицКПерезаписи.Таблица);
			
			ПланыОбмена.УдалитьРегистрациюИзменений(МобильноеУстройство, НаборЗаписей);
			
		КонецЦикла;
		
		Если ДанныеКоманды.truncate_table.Количество() > 0 Тогда
			
			Результат = СоздатьПакетКоманду(
				МобильноеУстройство, 
				ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеКоманды), 
				Записывать, 8);
			
		КонецЕсли;
	
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ЗапросыДанных

Функция СтруктураЗапросаДанных(ПоляДанных = "", КлючиОтбора = "")
	
	ДанныеЗапроса = Новый Структура();
	
	ДанныеЗапроса.Вставить("Запрос", 		Новый Запрос());
	ДанныеЗапроса.Вставить("ПоляДанных", 	ПоляДанных);
	ДанныеЗапроса.Вставить("КлючиОтбора", 	КлючиОтбора);
	ДанныеЗапроса.Вставить("Пакеты");
	
	Возврат ДанныеЗапроса;
	
КонецФункции

Функция СтруктураПакетаЗапросаДанных(ИмяПакета, ПоляДанных, КлючиОтбора, Таблица)
	
	ДанныеПакета = Новый Структура();
	
	ДанныеПакета.Вставить("ИмяПакета", 		ИмяПакета);
	ДанныеПакета.Вставить("ПоляДанных", 	ПоляДанных);
	ДанныеПакета.Вставить("КлючиОтбора", 	КлючиОтбора);
	ДанныеПакета.Вставить("Таблица", 		Таблица);
	
	Возврат ДанныеПакета;
	
КонецФункции

Процедура ДобавитьПакетДанныхВСтруктуруЗапросаДанных(СтруктураЗапросаДанных, ИндексПакета, ИмяПакета, ПоляДанных, КлючиОтбора = Неопределено, Таблица = Неопределено)
	
	ДанныеПакета = СтруктураПакетаЗапросаДанных(ИмяПакета, ПоляДанных, КлючиОтбора, Таблица);
	
	Если СтруктураЗапросаДанных.Пакеты = Неопределено Тогда
		СтруктураЗапросаДанных.Пакеты = Новый Соответствие();
	КонецЕсли;
	
	СтруктураЗапросаДанных.Пакеты.Вставить(ИндексПакета, Новый ФиксированнаяСтруктура(ДанныеПакета));
	
КонецПроцедуры

Функция ПолучитьЗапросДанных_Контрагенты(МобильноеУстройство, ДополнительныеПараметры)
	
	ДанныеЗапроса = СтруктураЗапросаДанных("id,full_name,inn,kpp,name,deleted", "id");
	
	ТипСоединения = ?(ДополнительныеПараметры.Свойство("ТолькоИзменения"), "ЛЕВОЕ", "ПОЛНОЕ");
	ДанныеЗапроса.Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(Изменения.id, Таблица.id) КАК id,
		|	ЕСТЬNULL(Таблица.full_name, НЕОПРЕДЕЛЕНО) КАК full_name,
		|	ЕСТЬNULL(Таблица.inn, НЕОПРЕДЕЛЕНО) КАК inn,
		|	ЕСТЬNULL(Таблица.kpp, НЕОПРЕДЕЛЕНО) КАК kpp,
		|	ЕСТЬNULL(Таблица.name, НЕОПРЕДЕЛЕНО) КАК name,
		|	Таблица.id ЕСТЬ NULL КАК deleted,
		|	НЕ Изменения.id ЕСТЬ NULL КАК SUI_ЕстьИзменения
		|ИЗ
		|	(ВЫБРАТЬ
		|			id
		|		ИЗ
		|			РегистрСведений.SUI_tbl_countragents.Изменения
		|		ГДЕ
		|			Узел = &МобильноеУстройство) КАК Изменения
		|		" + ТипСоединения + " СОЕДИНЕНИЕ РегистрСведений.SUI_tbl_countragents КАК Таблица
		|		ПО  Изменения.id = Таблица.id";
	
	ДанныеЗапроса.Запрос.УстановитьПараметр("МобильноеУстройство", МобильноеУстройство);
	
	Возврат Новый ФиксированнаяСтруктура(ДанныеЗапроса);

КонецФункции

Функция ПолучитьЗапросДанных_Склады(МобильноеУстройство, ДополнительныеПараметры)
	
	ДанныеЗапроса = СтруктураЗапросаДанных("id,name,deleted", "id");
	
	ТипСоединения = ?(ДополнительныеПараметры.Свойство("ТолькоИзменения"), "ЛЕВОЕ", "ПОЛНОЕ");
	
	ДанныеЗапроса.Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(Изменения.id, Таблица.id) КАК id,
		|	ЕСТЬNULL(Таблица.name, НЕОПРЕДЕЛЕНО) КАК name,
		|	Таблица.id ЕСТЬ NULL КАК deleted,
		|	НЕ Изменения.id ЕСТЬ NULL КАК SUI_ЕстьИзменения
		|ИЗ
		|	(ВЫБРАТЬ
		|			id
		|		ИЗ
		|			РегистрСведений.SUI_tbl_warehouses.Изменения
		|		ГДЕ
		|			Узел = &МобильноеУстройство) КАК Изменения
		|		" + ТипСоединения + " СОЕДИНЕНИЕ РегистрСведений.SUI_tbl_warehouses КАК Таблица
		|		ПО  Изменения.id = Таблица.id";
	
	ДанныеЗапроса.Запрос.УстановитьПараметр("МобильноеУстройство", МобильноеУстройство);
	
	Возврат Новый ФиксированнаяСтруктура(ДанныеЗапроса);

КонецФункции

Функция ПолучитьЗапросДанных_Ячейки(МобильноеУстройство, ДополнительныеПараметры)
	
	ДанныеЗапроса = СтруктураЗапросаДанных("id,name,barcode,deleted", "id");
	
	ТипСоединения = ?(ДополнительныеПараметры.Свойство("ТолькоИзменения"), "ЛЕВОЕ", "ПОЛНОЕ");
	
	ДанныеЗапроса.Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(Изменения.id, Таблица.id) КАК id,
		|	ЕСТЬNULL(Таблица.name, НЕОПРЕДЕЛЕНО) КАК name,
		|	ЕСТЬNULL(Таблица.barcode, НЕОПРЕДЕЛЕНО) КАК barcode,
		|	Таблица.id ЕСТЬ NULL КАК deleted,
		|	НЕ Изменения.id ЕСТЬ NULL КАК SUI_ЕстьИзменения
		|ИЗ
		|	(ВЫБРАТЬ
		|			id
		|		ИЗ
		|			РегистрСведений.SUI_tbl_cells.Изменения
		|		ГДЕ
		|			Узел = &МобильноеУстройство) КАК Изменения
		|		" + ТипСоединения + " СОЕДИНЕНИЕ РегистрСведений.SUI_tbl_cells КАК Таблица
		|		ПО  Изменения.id = Таблица.id";
	
	ДанныеЗапроса.Запрос.УстановитьПараметр("МобильноеУстройство", МобильноеУстройство);
	
	Возврат Новый ФиксированнаяСтруктура(ДанныеЗапроса);

КонецФункции

Функция ПолучитьЗапросДанных_Номенклатура(МобильноеУстройство, ДополнительныеПараметры)
	
	ДанныеЗапроса = СтруктураЗапросаДанных("id,name,art,code,description,type_good,unit,use_mark,deleted", "id");
	
	ТипСоединения = ?(ДополнительныеПараметры.Свойство("ТолькоИзменения"), "ЛЕВОЕ", "ПОЛНОЕ");
	
	ДанныеЗапроса.Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(Изменения.id, Таблица.id) КАК id,
		|	ЕСТЬNULL(Таблица.name, НЕОПРЕДЕЛЕНО) КАК name,
		|	ЕСТЬNULL(Таблица.art, НЕОПРЕДЕЛЕНО) КАК art,
		|	ЕСТЬNULL(Таблица.code, НЕОПРЕДЕЛЕНО) КАК code,
		|	ЕСТЬNULL(Таблица.description, НЕОПРЕДЕЛЕНО) КАК description,
		|	ЕСТЬNULL(Таблица.type_good, НЕОПРЕДЕЛЕНО) КАК type_good,
		|	ЕСТЬNULL(Таблица.unit, НЕОПРЕДЕЛЕНО) КАК unit,
		|	ВЫБОР
		|		КОГДА Таблица.use_mark ЕСТЬ NULL
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		КОГДА Таблица.use_mark
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК use_mark,
		|	Таблица.id ЕСТЬ NULL КАК deleted,
		|	НЕ Изменения.id ЕСТЬ NULL КАК SUI_ЕстьИзменения
		|ИЗ
		|	(ВЫБРАТЬ
		|			id
		|		ИЗ
		|			РегистрСведений.SUI_tbl_goods.Изменения
		|		ГДЕ
		|			Узел = &МобильноеУстройство) КАК Изменения
		|		" + ТипСоединения + " СОЕДИНЕНИЕ РегистрСведений.SUI_tbl_goods КАК Таблица
		|		ПО  Изменения.id = Таблица.id";
	
	ДанныеЗапроса.Запрос.УстановитьПараметр("МобильноеУстройство", МобильноеУстройство);
	
	Возврат Новый ФиксированнаяСтруктура(ДанныеЗапроса);

КонецФункции

Функция ПолучитьЗапросДанных_ХарактеристикиНоменклатуры(МобильноеУстройство, ДополнительныеПараметры)
	
	ДанныеЗапроса = СтруктураЗапросаДанных("id,id_owner,name,deleted", "id,id_owner");
	
	ТипСоединения = ?(ДополнительныеПараметры.Свойство("ТолькоИзменения"), "ЛЕВОЕ", "ПОЛНОЕ");
	
	ДанныеЗапроса.Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(Изменения.id, Таблица.id) КАК id,
		|	ЕСТЬNULL(Изменения.id_owner, Таблица.id_owner) КАК id_owner,
		|	ЕСТЬNULL(Таблица.name, НЕОПРЕДЕЛЕНО) КАК name,
		|	Таблица.id ЕСТЬ NULL КАК deleted,
		|	НЕ Изменения.id ЕСТЬ NULL КАК SUI_ЕстьИзменения
		|ИЗ
		|	(ВЫБРАТЬ
		|			id,
		|			id_owner
		|		ИЗ
		|			РегистрСведений.SUI_tbl_properties.Изменения
		|		ГДЕ
		|			Узел = &МобильноеУстройство) КАК Изменения
		|		" + ТипСоединения + " СОЕДИНЕНИЕ РегистрСведений.SUI_tbl_properties КАК Таблица
		|		ПО  Изменения.id = Таблица.id
		|		И Изменения.id_owner = Таблица.id_owner";
	
	ДанныеЗапроса.Запрос.УстановитьПараметр("МобильноеУстройство", МобильноеУстройство);
	
	Возврат Новый ФиксированнаяСтруктура(ДанныеЗапроса);

КонецФункции

Функция ПолучитьЗапросДанных_СерииНоменклатуры(МобильноеУстройство, ДополнительныеПараметры)
	
	ДанныеЗапроса = СтруктураЗапросаДанных("id,name,best_before,type_goods,number,production_date,deleted", "id");
	
	ТипСоединения = ?(ДополнительныеПараметры.Свойство("ТолькоИзменения"), "ЛЕВОЕ", "ПОЛНОЕ");
	
	ДанныеЗапроса.Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(Изменения.id, Таблица.id) КАК id,
		|	ЕСТЬNULL(Таблица.name, НЕОПРЕДЕЛЕНО) КАК name,
		|	ЕСТЬNULL(Таблица.best_before, НЕОПРЕДЕЛЕНО) КАК best_before,
		|	ЕСТЬNULL(Таблица.type_goods, НЕОПРЕДЕЛЕНО) КАК type_goods,
		|	ЕСТЬNULL(Таблица.number, НЕОПРЕДЕЛЕНО) КАК number,
		|	ЕСТЬNULL(Таблица.production_date, НЕОПРЕДЕЛЕНО) КАК production_date,
		|	Таблица.id ЕСТЬ NULL КАК deleted,
		|	НЕ Изменения.id ЕСТЬ NULL КАК SUI_ЕстьИзменения
		|ИЗ
		|	(ВЫБРАТЬ
		|			id
		|		ИЗ
		|			РегистрСведений.SUI_tbl_series.Изменения
		|		ГДЕ
		|			Узел = &МобильноеУстройство) КАК Изменения
		|		" + ТипСоединения + " СОЕДИНЕНИЕ РегистрСведений.SUI_tbl_series КАК Таблица
		|		ПО  Изменения.id = Таблица.id";
	
	ДанныеЗапроса.Запрос.УстановитьПараметр("МобильноеУстройство", МобильноеУстройство);
	
	Возврат Новый ФиксированнаяСтруктура(ДанныеЗапроса);

КонецФункции

Функция ПолучитьЗапросДанных_УпаковкиНоменклатуры(МобильноеУстройство, ДополнительныеПараметры)
	
	ДанныеЗапроса = СтруктураЗапросаДанных("id,id_owner,code,name,nominator,denominator,int_reduction,deleted", "id");
	
	ТипСоединения = ?(ДополнительныеПараметры.Свойство("ТолькоИзменения"), "ЛЕВОЕ", "ПОЛНОЕ");
	
	ДанныеЗапроса.Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(Изменения.id, Таблица.id) КАК id,
		|	ЕСТЬNULL(Таблица.id_owner, НЕОПРЕДЕЛЕНО) КАК id_owner,
		|	ЕСТЬNULL(Таблица.code, НЕОПРЕДЕЛЕНО) КАК code,
		|	ЕСТЬNULL(Таблица.name, НЕОПРЕДЕЛЕНО) КАК name,
		|	ЕСТЬNULL(Таблица.nominator, НЕОПРЕДЕЛЕНО) КАК nominator,
		|	ЕСТЬNULL(Таблица.denominator, НЕОПРЕДЕЛЕНО) КАК denominator,
		|	ЕСТЬNULL(Таблица.int_reduction, НЕОПРЕДЕЛЕНО) КАК int_reduction,
		|	Таблица.id ЕСТЬ NULL КАК deleted,
		|	НЕ Изменения.id ЕСТЬ NULL КАК SUI_ЕстьИзменения
		|ИЗ
		|	(ВЫБРАТЬ
		|			id
		|		ИЗ
		|			РегистрСведений.SUI_tbl_units.Изменения
		|		ГДЕ
		|			Узел = &МобильноеУстройство) КАК Изменения
		|		" + ТипСоединения + " СОЕДИНЕНИЕ РегистрСведений.SUI_tbl_units КАК Таблица
		|		ПО  Изменения.id = Таблица.id";
	
	ДанныеЗапроса.Запрос.УстановитьПараметр("МобильноеУстройство", МобильноеУстройство);
	
	Возврат Новый ФиксированнаяСтруктура(ДанныеЗапроса);

КонецФункции

Функция ПолучитьЗапросДанных_ЕдиницыИзмерения(МобильноеУстройство, ДополнительныеПараметры)
	
	ДанныеЗапроса = СтруктураЗапросаДанных("id,code,name,deleted", "id");
	
	ТипСоединения = ?(ДополнительныеПараметры.Свойство("ТолькоИзменения"), "ЛЕВОЕ", "ПОЛНОЕ");
	
	ДанныеЗапроса.Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(Изменения.id, Таблица.id) КАК id,
		|	ЕСТЬNULL(Таблица.code, НЕОПРЕДЕЛЕНО) КАК code,
		|	ЕСТЬNULL(Таблица.name, НЕОПРЕДЕЛЕНО) КАК name,
		|	Таблица.id ЕСТЬ NULL КАК deleted,
		|	НЕ Изменения.id ЕСТЬ NULL КАК SUI_ЕстьИзменения
		|ИЗ
		|	(ВЫБРАТЬ
		|			id
		|		ИЗ
		|			РегистрСведений.SUI_tbl_classifier_units.Изменения
		|		ГДЕ
		|			Узел = &МобильноеУстройство) КАК Изменения
		|		" + ТипСоединения + " СОЕДИНЕНИЕ РегистрСведений.SUI_tbl_classifier_units КАК Таблица
		|		ПО  Изменения.id = Таблица.id";
	
	ДанныеЗапроса.Запрос.УстановитьПараметр("МобильноеУстройство", МобильноеУстройство);
	
	Возврат Новый ФиксированнаяСтруктура(ДанныеЗапроса);

КонецФункции

Функция ПолучитьЗапросДанных_ШтрихкодыУпаковок(МобильноеУстройство, ДополнительныеПараметры)
	
	ДанныеЗапроса = СтруктураЗапросаДанных("id,mark_code,id_good,id_property,id_series,id_unit,deleted", "id");
	
	ТипСоединения = ?(ДополнительныеПараметры.Свойство("ТолькоИзменения"), "ЛЕВОЕ", "ПОЛНОЕ");
	
	ДанныеЗапроса.Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(Изменения.id, Таблица.id) КАК id,
		|	ЕСТЬNULL(Таблица.mark_code, НЕОПРЕДЕЛЕНО) КАК mark_code,
		|	ЕСТЬNULL(Таблица.id_good, НЕОПРЕДЕЛЕНО) КАК id_good,
		|	ЕСТЬNULL(Таблица.id_property, НЕОПРЕДЕЛЕНО) КАК id_property,
		|	ЕСТЬNULL(Таблица.id_series, НЕОПРЕДЕЛЕНО) КАК id_series,
		|	ЕСТЬNULL(Таблица.id_unit, НЕОПРЕДЕЛЕНО) КАК id_unit,
		|	Таблица.id ЕСТЬ NULL КАК deleted,
		|	НЕ Изменения.id ЕСТЬ NULL КАК SUI_ЕстьИзменения
		|ИЗ
		|	(ВЫБРАТЬ
		|			id
		|		ИЗ
		|			РегистрСведений.SUI_tbl_marking_codes.Изменения
		|		ГДЕ
		|			Узел = &МобильноеУстройство) КАК Изменения
		|		" + ТипСоединения + " СОЕДИНЕНИЕ РегистрСведений.SUI_tbl_marking_codes КАК Таблица
		|		ПО  Изменения.id = Таблица.id";
	
	ДанныеЗапроса.Запрос.УстановитьПараметр("МобильноеУстройство", МобильноеУстройство);
	
	Возврат Новый ФиксированнаяСтруктура(ДанныеЗапроса);

КонецФункции

Функция ПолучитьЗапросДанных_ШтрихкодыНоменклатуры(МобильноеУстройство, ДополнительныеПараметры)
	
	ДанныеЗапроса = СтруктураЗапросаДанных("id,barcode,id_good,id_property,id_series,id_unit,ratio,deleted", "id");
	
	ТипСоединения = ?(ДополнительныеПараметры.Свойство("ТолькоИзменения"), "ЛЕВОЕ", "ПОЛНОЕ");
	
	ДанныеЗапроса.Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(Изменения.id, Таблица.id) КАК id,
		|	ЕСТЬNULL(Таблица.barcode, НЕОПРЕДЕЛЕНО) КАК barcode,
		|	ЕСТЬNULL(Таблица.id_good, НЕОПРЕДЕЛЕНО) КАК id_good,
		|	ЕСТЬNULL(Таблица.id_property, НЕОПРЕДЕЛЕНО) КАК id_property,
		|	ЕСТЬNULL(Таблица.id_series, НЕОПРЕДЕЛЕНО) КАК id_series,
		|	ЕСТЬNULL(Таблица.id_unit, НЕОПРЕДЕЛЕНО) КАК id_unit,
		|	ЕСТЬNULL(Таблица.ratio, НЕОПРЕДЕЛЕНО) КАК ratio,
		|	Таблица.id ЕСТЬ NULL КАК deleted,
		|	НЕ Изменения.id ЕСТЬ NULL КАК SUI_ЕстьИзменения
		|ИЗ
		|	(ВЫБРАТЬ
		|			id
		|		ИЗ
		|			РегистрСведений.SUI_tbl_barcodes.Изменения
		|		ГДЕ
		|			Узел = &МобильноеУстройство) КАК Изменения
		|		" + ТипСоединения + " СОЕДИНЕНИЕ РегистрСведений.SUI_tbl_barcodes КАК Таблица
		|		ПО  Изменения.id = Таблица.id";
	
	ДанныеЗапроса.Запрос.УстановитьПараметр("МобильноеУстройство", МобильноеУстройство);
	
	Возврат Новый ФиксированнаяСтруктура(ДанныеЗапроса);

КонецФункции

Функция ПолучитьЗапросДанных_ВидыЦен(МобильноеУстройство, ДополнительныеПараметры)
	
	ДанныеЗапроса = СтруктураЗапросаДанных("id,name,deleted", "id");
	
	ТипСоединения = ?(ДополнительныеПараметры.Свойство("ТолькоИзменения"), "ЛЕВОЕ", "ПОЛНОЕ");
	
	ДанныеЗапроса.Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(Изменения.id, Таблица.id) КАК id,
		|	ЕСТЬNULL(Таблица.name, НЕОПРЕДЕЛЕНО) КАК name,
		|	Таблица.id ЕСТЬ NULL КАК deleted,
		|	НЕ Изменения.id ЕСТЬ NULL КАК SUI_ЕстьИзменения
		|ИЗ
		|	(ВЫБРАТЬ
		|			id
		|		ИЗ
		|			РегистрСведений.SUI_tbl_price_types.Изменения
		|		ГДЕ
		|			Узел = &МобильноеУстройство) КАК Изменения
		|		" + ТипСоединения + " СОЕДИНЕНИЕ РегистрСведений.SUI_tbl_price_types КАК Таблица
		|		ПО  Изменения.id = Таблица.id";
	
	ДанныеЗапроса.Запрос.УстановитьПараметр("МобильноеУстройство", МобильноеУстройство);
	
	Возврат Новый ФиксированнаяСтруктура(ДанныеЗапроса);

КонецФункции

Функция ПолучитьЗапросДанных_ЦеныНоменклатуры(МобильноеУстройство, ДополнительныеПараметры)
	
	ДанныеЗапроса = СтруктураЗапросаДанных("id,id_goods,id_properties,id_price_types,id_unit,price,deleted", "id");
	
	ТипСоединения = ?(ДополнительныеПараметры.Свойство("ТолькоИзменения"), "ЛЕВОЕ", "ПОЛНОЕ");
	
	ДанныеЗапроса.Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(Изменения.id, Таблица.id) КАК id,
		|	ЕСТЬNULL(Таблица.id_goods, НЕОПРЕДЕЛЕНО) КАК id_goods,
		|	ЕСТЬNULL(Таблица.id_properties, НЕОПРЕДЕЛЕНО) КАК id_properties,
		|	ЕСТЬNULL(Таблица.id_price_types, НЕОПРЕДЕЛЕНО) КАК id_price_types,
		|	ЕСТЬNULL(Таблица.id_unit, НЕОПРЕДЕЛЕНО) КАК id_unit,
		|	ЕСТЬNULL(Таблица.price, НЕОПРЕДЕЛЕНО) КАК price,
		|	Таблица.id ЕСТЬ NULL КАК deleted,
		|	НЕ Изменения.id ЕСТЬ NULL КАК SUI_ЕстьИзменения
		|ИЗ
		|	(ВЫБРАТЬ
		|			id
		|		ИЗ
		|			РегистрСведений.SUI_tbl_prices.Изменения
		|		ГДЕ
		|			Узел = &МобильноеУстройство) КАК Изменения
		|		" + ТипСоединения + " СОЕДИНЕНИЕ РегистрСведений.SUI_tbl_prices КАК Таблица
		|		ПО  Изменения.id = Таблица.id";
	
	ДанныеЗапроса.Запрос.УстановитьПараметр("МобильноеУстройство", МобильноеУстройство);
	
	Возврат Новый ФиксированнаяСтруктура(ДанныеЗапроса);

КонецФункции

Функция ПолучитьЗапросДанных_НастройкиДокументов(МобильноеУстройство, ДополнительныеПараметры)
	
	ДанныеЗапроса = СтруктураЗапросаДанных("id,doc_type,is_adr_storage,creating_documents,deleted", "Ссылка");
	
	ТипСоединения = ?(ДополнительныеПараметры.Свойство("ТолькоИзменения"), "ЛЕВОЕ", "ПОЛНОЕ");
	
	ДанныеЗапроса.Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(Изменения.Ссылка, Таблица.Ссылка) КАК Ссылка,
		|	ЕСТЬNULL(Изменения.Ссылка, Таблица.Ссылка) КАК id,
		|	ЕСТЬNULL(Таблица.Наименование, НЕОПРЕДЕЛЕНО) КАК doc_type,
		|	ВЫБОР
		|		КОГДА Таблица.Ссылка ЕСТЬ NULL
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК is_adr_storage,
		|	ВЫБОР
		|		КОГДА Таблица.СоздаватьДокументыНаТСД ЕСТЬ NULL
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		КОГДА Таблица.СоздаватьДокументыНаТСД
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК creating_documents,
		|	ВЫБОР
		|		КОГДА Таблица.Ссылка ЕСТЬ NULL ИЛИ НЕ Таблица.Используется ИЛИ Таблица.ПометкаУдаления
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК deleted,
		|	НЕ Изменения.Ссылка ЕСТЬ NULL КАК SUI_ЕстьИзменения
		|ИЗ
		|	(ВЫБРАТЬ
		|			Ссылка
		|		ИЗ
		|			Справочник.SUI_НастройкиДокументов.Изменения
		|		ГДЕ
		|			Узел = &МобильноеУстройство) КАК Изменения
		|		" + ТипСоединения + " СОЕДИНЕНИЕ Справочник.SUI_НастройкиДокументов КАК Таблица
		|		ПО  Изменения.Ссылка = Таблица.Ссылка";
	
	ДанныеЗапроса.Запрос.УстановитьПараметр("МобильноеУстройство", МобильноеУстройство);
	
	Возврат Новый ФиксированнаяСтруктура(ДанныеЗапроса);

КонецФункции

Функция ПолучитьЗапросДанных_ПользователиТСД(МобильноеУстройство, ДополнительныеПараметры)
	
	ДанныеЗапроса = СтруктураЗапросаДанных("id,full_name,deleted", "Ссылка");
	
	ТипСоединения = ?(ДополнительныеПараметры.Свойство("ТолькоИзменения"), "ЛЕВОЕ", "ПОЛНОЕ");
	
	ДанныеЗапроса.Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(Изменения.Ссылка, Таблица.Ссылка) КАК Ссылка,
		|	ЕСТЬNULL(Изменения.Ссылка, Таблица.Ссылка) КАК id,
		|	ЕСТЬNULL(Таблица.Наименование, НЕОПРЕДЕЛЕНО) КАК full_name,
		|	ЕСТЬNULL(Таблица.Логин, НЕОПРЕДЕЛЕНО) КАК Логин,
		|	ЕСТЬNULL(Таблица.Пароль, НЕОПРЕДЕЛЕНО) КАК Пароль,
		|	Таблица.Ссылка ЕСТЬ NULL КАК deleted,
		|	НЕ Изменения.Ссылка ЕСТЬ NULL КАК SUI_ЕстьИзменения
		|ИЗ
		|	(ВЫБРАТЬ
		|			Ссылка
		|		ИЗ
		|			Справочник.SUI_ПользователиТСД.Изменения
		|		ГДЕ
		|			Узел = &МобильноеУстройство) КАК Изменения
		|		" + ТипСоединения + " СОЕДИНЕНИЕ Справочник.SUI_ПользователиТСД КАК Таблица
		|		ПО  Изменения.Ссылка = Таблица.Ссылка";
	
	ДанныеЗапроса.Запрос.УстановитьПараметр("МобильноеУстройство", МобильноеУстройство);
	
	Возврат Новый ФиксированнаяСтруктура(ДанныеЗапроса);

КонецФункции

Функция ПолучитьЗапросДанных_Документы(МобильноеУстройство, ДополнительныеПараметры)
	
	ДанныеЗапроса = СтруктураЗапросаДанных();
	
	ВыборПервых = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ВыборПервых", 0, Тип("Число"));
	Если ВыборПервых > 0 Тогда
		ВыборПервых = "ПЕРВЫЕ " + Формат(ВыборПервых, "ЧДЦ=0; ЧГ=0;");
	Иначе
		ВыборПервых = "";
	КонецЕсли;
		
	#Область ТекстЗапроса
	ДанныеЗапроса.Запрос.Текст =
		"ВЫБРАТЬ " + ВыборПервых + "
		|	Таблица.sid КАК sid,
		|	Таблица.id_doc КАК id_doc,
		|	Таблица.НастройкаДокумента КАК НастройкаДокумента,
		|	Таблица.doc_type,
		|	Таблица.doc_n,
		|	Таблица.doc_date,
		|	Таблица.id_countragents,
		|	Таблица.id_warehouse,
		|	Таблица.use_mark,
		|	ВЫБОР
		|		КОГДА Таблица.КонтролироватьДокумент
		|			ТОГДА ""1""
		|		ИНАЧЕ ""0""
		|	КОНЕЦ КАК control,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(Таблица.НастройкаДокумента.ГрупповоеСканирование, ЛОЖЬ)
		|			ТОГДА ""1""
		|		ИНАЧЕ ""0""
		|	КОНЕЦ КАК is_group_scan,
		|	// 20.09.2024 - artem - B119267 -
		|	ВЫБОР
		|		КОГДА Таблица.Агрегация
		|			ТОГДА ""1""
		|		ИНАЧЕ ""0""
		|	КОНЕЦ КАК is_aggr_doc,
		|	Таблица.ЭтоДокументАдресногоХранения,
		|	Таблица.additional_details,
		|	Таблица.barcode,
		|	Таблица.Состояние,
		|	Таблица.is_barc_flow,
		|	// 20.09.2024 - artem - B120423 -
		|	Таблица.process_type,
		|	// 20.09.2024 - artem - B120423 -
		|	Таблица.cells_process_type,
		|	НЕ Изменения.sid ЕСТЬ NULL КАК SUI_ЕстьИзменения
		|ПОМЕСТИТЬ втТаблица
		|ИЗ
		|	РегистрСведений.SUI_docs КАК Таблица
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.SUI_docs.Изменения КАК Изменения
		|		ПО Таблица.sid = Изменения.sid
		|		И Таблица.id_doc = Изменения.id_doc
		|		И Таблица.НастройкаДокумента = Изменения.НастройкаДокумента
		|		И Изменения.Узел = &МобильноеУстройство
		|ГДЕ
		|	ВЫБОР
		|		КОГДА &sid = НЕОПРЕДЕЛЕНО
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ Таблица.sid = &sid
		|	КОНЕЦ
		|	И ВЫБОР
		|		КОГДА &id_doc = НЕОПРЕДЕЛЕНО
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ Таблица.id_doc = &id_doc
		|	КОНЕЦ
		|	И ВЫБОР
		|		КОГДА &НастройкаДокумента = НЕОПРЕДЕЛЕНО
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ Таблица.НастройкаДокумента = &НастройкаДокумента
		|	КОНЕЦ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	sid,
		|	id_doc,
		|	НастройкаДокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТаблица.sid,
		|	втТаблица.id_doc,
		|	втТаблица.НастройкаДокумента,
		|	втТаблица.SUI_ЕстьИзменения
		|ИЗ
		|	втТаблица КАК втТаблица
		|ГДЕ
		|	НЕ втТаблица.Состояние В (&СостоянияДляВыгрузки)
		|	И втТаблица.Состояние <> ЗНАЧЕНИЕ(Перечисление.SUI_СостоянияДокументовОбмена.Завершен)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТаблица.sid,
		|	втТаблица.id_doc,
		|	втТаблица.НастройкаДокумента,
		|	втТаблица.SUI_ЕстьИзменения
		|ИЗ
		|	втТаблица КАК втТаблица
		|ГДЕ
		|	втТаблица.Состояние = ЗНАЧЕНИЕ(Перечисление.SUI_СостоянияДокументовОбмена.Завершен)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТаблица.sid,
		|	втТаблица.id_doc,
		|	втТаблица.НастройкаДокумента,
		|	втТаблица.doc_type,
		|	втТаблица.doc_n,
		|	втТаблица.doc_date,
		|	втТаблица.id_countragents,
		|	втТаблица.id_warehouse,
		|	втТаблица.use_mark,
		|	втТаблица.control,
		|	втТаблица.is_group_scan,
		|	втТаблица.barcode,
		|	втТаблица.additional_details,
		|	втТаблица.is_barc_flow,
		|	// artem - 29.08.24 - B119267 -
		|	втТаблица.is_aggr_doc,
		|	// 20.09.2024 - artem - B120423 -
		|	втТаблица.process_type,
		|	// 20.09.2024 - artem - B120423 -
		|	втТаблица.cells_process_type,
		|	втТаблица.SUI_ЕстьИзменения
		|ИЗ
		|	втТаблица КАК втТаблица
		|ГДЕ
		|	НЕ втТаблица.ЭтоДокументАдресногоХранения
		|	И втТаблица.Состояние В (&СостоянияДляВыгрузки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Товары.sid,
		|	Товары.sid_doc,
		|	втТаблица.id_doc,
		|	Товары.id_good,
		|	Товары.id_properties,
		|	Товары.id_unit,
		|	Товары.id_cell,
		|	Товары.id_series,
		|	Товары.id_price,
		|	Товары.price,
		|	Товары.use_series,
		|	Товары.use_mark,
		|	Товары.qtty_plan,
		|	Товары.qtty,
		|	Товары.additional_details
		|ИЗ
		|	втТаблица КАК втТаблица
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.SUI_docs_tbl_goods КАК Товары
		|		ПО втТаблица.sid = Товары.sid_doc
		|		И НЕ втТаблица.ЭтоДокументАдресногоХранения
		|		И Товары.ТипТаблицы = ЗНАЧЕНИЕ(Перечисление.SUI_ТипыТаблицДокументовОбмена.Товары)
		|		И втТаблица.Состояние В (&СостоянияДляВыгрузки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТаблица.sid,
		|	втТаблица.id_doc,
		|	втТаблица.НастройкаДокумента,
		|	втТаблица.doc_type,
		|	втТаблица.doc_n,
		|	втТаблица.doc_date,
		|	втТаблица.id_warehouse,
		|	втТаблица.use_mark,
		|	втТаблица.control,
		|	втТаблица.is_group_scan,
		|	втТаблица.additional_details,
		|	втТаблица.barcode,
		|	втТаблица.is_barc_flow,
		// artem - 29.08.24 - B119267 -
		|	втТаблица.is_aggr_doc,
		|	// 20.09.2024 - artem - B120423 -
		|	втТаблица.process_type,
		|	// 20.09.2024 - artem - B120423 -
		|	втТаблица.cells_process_type,
		|	втТаблица.SUI_ЕстьИзменения
		|ИЗ
		|	втТаблица КАК втТаблица
		|ГДЕ
		|	втТаблица.ЭтоДокументАдресногоХранения
		|	И втТаблица.Состояние В (&СостоянияДляВыгрузки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Товары.sid,
		|	Товары.sid_doc,
		|	втТаблица.id_doc,
		|	Товары.id_good,
		|	Товары.id_properties,
		|	Товары.id_unit,
		|	Товары.id_cell,
		|	Товары.id_series,
		|	ВЫБОР
		|		КОГДА Товары.ТипТаблицы = ЗНАЧЕНИЕ(Перечисление.SUI_ТипыТаблицДокументовОбмена.Отбор)
		|			ТОГДА ""out""
		|		КОГДА Товары.ТипТаблицы = ЗНАЧЕНИЕ(Перечисление.SUI_ТипыТаблицДокументовОбмена.Размещение)
		|			ТОГДА ""in""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК table_type,
		|	Товары.use_series,
		|	Товары.use_mark,
		|	Товары.qtty_plan,
		|	Товары.qtty,
		|	Товары.additional_details
		|ИЗ
		|	втТаблица КАК втТаблица
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.SUI_docs_tbl_goods КАК Товары
		|		ПО втТаблица.sid = Товары.sid_doc
		|		И втТаблица.ЭтоДокументАдресногоХранения
		|		И Товары.ТипТаблицы В (ЗНАЧЕНИЕ(Перечисление.SUI_ТипыТаблицДокументовОбмена.Отбор),
		|			ЗНАЧЕНИЕ(Перечисление.SUI_ТипыТаблицДокументовОбмена.Размещение))
		|		И втТаблица.Состояние В (&СостоянияДляВыгрузки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ШтрихкодыУпаковокДокумента.sid,
		|	ШтрихкодыУпаковокДокумента.sid_doc,
		|	втТаблица.id_doc,
		|	ШтрихкодыУпаковокДокумента.id_marking_code,
		|	ШтрихкодыУпаковокДокумента.id_good,
		|	ШтрихкодыУпаковокДокумента.id_property,
		|	ШтрихкодыУпаковокДокумента.id_series,
		|	ШтрихкодыУпаковокДокумента.id_unit,
		|	ШтрихкодыУпаковокДокумента.mark_code,
		|	ШтрихкодыУпаковокДокумента.additional_details
		|ИЗ
		|	втТаблица КАК втТаблица
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.SUI_docs_tbl_barcodes КАК ШтрихкодыУпаковокДокумента
		|		ПО втТаблица.sid = ШтрихкодыУпаковокДокумента.sid_doc
		|		И втТаблица.Состояние В (&СостоянияДляВыгрузки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СерииДокумента.sid,
		|	СерииДокумента.sid_doc,
		|	втТаблица.id_doc,
		|	СерииДокумента.id_good,
		|	СерииДокумента.id_properties,
		|	СерииДокумента.id_series,
		|	СерииДокумента.id_warehouse,
		|	СерииДокумента.qtty,
		|	ВЫБОР
		|		КОГДА СерииНоменклатуры.name ЕСТЬ NULL
		|		ИЛИ СерииДокумента.СтатусОбработки = ЗНАЧЕНИЕ(Перечисление.SUI_СтатусыОбработкиСтрок.Новая)
		|			ТОГДА СерииДокумента.name
		|		ИНАЧЕ СерииНоменклатуры.name
		|	КОНЕЦ КАК name,
		|	ВЫБОР
		|		КОГДА СерииНоменклатуры.number ЕСТЬ NULL
		|		ИЛИ СерииДокумента.СтатусОбработки = ЗНАЧЕНИЕ(Перечисление.SUI_СтатусыОбработкиСтрок.Новая)
		|			ТОГДА СерииДокумента.number
		|		ИНАЧЕ СерииНоменклатуры.number
		|	КОНЕЦ КАК number,
		|	ВЫБОР
		|		КОГДА СерииНоменклатуры.best_before ЕСТЬ NULL
		|		ИЛИ СерииДокумента.СтатусОбработки = ЗНАЧЕНИЕ(Перечисление.SUI_СтатусыОбработкиСтрок.Новая)
		|			ТОГДА СерииДокумента.best_before
		|		ИНАЧЕ СерииНоменклатуры.best_before
		|	КОНЕЦ КАК best_before,
		|	ВЫБОР
		|		КОГДА СерииНоменклатуры.production_date ЕСТЬ NULL
		|		ИЛИ СерииДокумента.СтатусОбработки = ЗНАЧЕНИЕ(Перечисление.SUI_СтатусыОбработкиСтрок.Новая)
		|			ТОГДА СерииДокумента.production_date
		|		ИНАЧЕ СерииНоменклатуры.production_date
		|	КОНЕЦ КАК production_date,
		|	СерииДокумента.additional_details
		|ИЗ
		|	втТаблица КАК втТаблица
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.SUI_docs_tbl_series КАК СерииДокумента
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.SUI_tbl_series КАК СерииНоменклатуры
		|			ПО СерииДокумента.id_series = СерииНоменклатуры.id
		|		ПО втТаблица.sid = СерииДокумента.sid_doc
		|		И втТаблица.Состояние В (&СостоянияДляВыгрузки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ втТаблица";
	#КонецОбласти
	
	СостоянияДляВыгрузки = SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.МассивЗначений(
		Перечисления.SUI_СостоянияДокументовОбмена.КВыгрузке,
		Перечисления.SUI_СостоянияДокументовОбмена.Выгружен,
		Перечисления.SUI_СостоянияДокументовОбмена.Загружен,
		Перечисления.SUI_СостоянияДокументовОбмена.ВРаботе);
	
	ДанныеЗапроса.Запрос.УстановитьПараметр("МобильноеУстройство", МобильноеУстройство);
	ДанныеЗапроса.Запрос.УстановитьПараметр("СостоянияДляВыгрузки", СостоянияДляВыгрузки);
	ДанныеЗапроса.Запрос.УстановитьПараметр("sid", Неопределено);
	ДанныеЗапроса.Запрос.УстановитьПараметр("id_doc", Неопределено);
	ДанныеЗапроса.Запрос.УстановитьПараметр("НастройкаДокумента", Неопределено);
	
	ДополнительныеРеквизиты_Использовать = ПолучитьФункциональнуюОпцию("SUI_ИспользоватьДополнительныеРеквизитыТаблиц");
	
	ЗаполнитьЗначенияСвойств(ДанныеЗапроса.Запрос.Параметры, 
		SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "Параметры", Новый Структура(), Тип("Структура")));
	
	// Данные для удаления регистрации
	ДобавитьПакетДанныхВСтруктуруЗапросаДанных(ДанныеЗапроса, 1, SUI_ПакетыДанныхКлиентСервер.КлючТаблицы_ОтменаРегистрации(),
		Неопределено, "sid,id_doc,НастройкаДокумента");
	
	// Данные завершенных документов
	ДобавитьПакетДанныхВСтруктуруЗапросаДанных(ДанныеЗапроса, 2, 
		SUI_НастройкиМетаданныхСервер.ПолучитьИмяТаблицыМобильногоУстройства(SUI_ПакетыДанныхКлиентСервер.КлючТаблицы_ДокументыЗавершенные()),
		"id_doc", "sid,id_doc,НастройкаДокумента", SUI_ПакетыДанныхКлиентСервер.КлючТаблицы_ДокументыЗавершенные());

	// artem - 29.08.24 - B119267 -
	// 20.09.2024 - artem - B120423 -
	// Данные документов
	ДобавитьПакетДанныхВСтруктуруЗапросаДанных(ДанныеЗапроса, 3, 
		SUI_НастройкиМетаданныхСервер.ПолучитьИмяТаблицыМобильногоУстройства(Перечисления.SUI_ТаблицыИнтеграции.Документы),
		"id_doc,doc_date,doc_n,doc_type,id_countragents,id_warehouse,control,is_group_scan,use_mark,barcode,is_barc_flow,is_aggr_doc,process_type,cells_process_type" + ?(ДополнительныеРеквизиты_Использовать, ",additional_details", ""), 
		"sid,id_doc,НастройкаДокумента",
		Перечисления.SUI_ТаблицыИнтеграции.Документы);
	
	// Данные строк документов
	ДобавитьПакетДанныхВСтруктуруЗапросаДанных(ДанныеЗапроса, 4, 
		SUI_НастройкиМетаданныхСервер.ПолучитьИмяТаблицыМобильногоУстройства(Перечисления.SUI_ТаблицыИнтеграции.ТоварыДокументов),
		"id_doc,id_good,id_properties,id_unit,id_cell,id_series,id_price,price,use_series,use_mark,qtty_plan,qtty" + ?(ДополнительныеРеквизиты_Использовать, ",additional_details", ""), ,
		Перечисления.SUI_ТаблицыИнтеграции.ТоварыДокументов);
		
	// artem - 29.08.24 - B119267 -
	// 20.09.2024 - artem - B120423 -
	// Данные документов адресного хранения
	ДобавитьПакетДанныхВСтруктуруЗапросаДанных(ДанныеЗапроса, 5, 
		SUI_НастройкиМетаданныхСервер.ПолучитьИмяТаблицыМобильногоУстройства(Перечисления.SUI_ТаблицыИнтеграции.ДокументыАдресногоХранения),
		"id_doc,doc_date,doc_n,doc_type,id_warehouse,control,is_group_scan,use_mark,barcode,is_aggr_doc,process_type,cells_process_type" + ?(ДополнительныеРеквизиты_Использовать, ",additional_details", ""), 
		"sid,id_doc,НастройкаДокумента",
		Перечисления.SUI_ТаблицыИнтеграции.ДокументыАдресногоХранения);
			
	// Данные строк документов адресного хранения
	ДобавитьПакетДанныхВСтруктуруЗапросаДанных(ДанныеЗапроса, 6, 
		SUI_НастройкиМетаданныхСервер.ПолучитьИмяТаблицыМобильногоУстройства(Перечисления.SUI_ТаблицыИнтеграции.ТоварыДокументовАдресногоХранения),
		"id_doc,id_good,id_properties,id_unit,id_cell,id_series,table_type,use_series,use_mark,qtty_plan,qtty" + ?(ДополнительныеРеквизиты_Использовать, ",additional_details", ""), ,
		Перечисления.SUI_ТаблицыИнтеграции.ТоварыДокументовАдресногоХранения);
	
	// Данные штрихкодов упаковок документов
	ДобавитьПакетДанныхВСтруктуруЗапросаДанных(ДанныеЗапроса, 7, 
		SUI_НастройкиМетаданныхСервер.ПолучитьИмяТаблицыМобильногоУстройства(Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыУпаковокДокументов),
		"id_doc,id_marking_code,id_good,id_property,id_unit,id_series,mark_code" + ?(ДополнительныеРеквизиты_Использовать, ",additional_details", ""), , 
		Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыУпаковокДокументов);
	
	// Данные серий документов
	ДобавитьПакетДанныхВСтруктуруЗапросаДанных(ДанныеЗапроса, 8, 
		SUI_НастройкиМетаданныхСервер.ПолучитьИмяТаблицыМобильногоУстройства(Перечисления.SUI_ТаблицыИнтеграции.СерииДокументов),
		"id_doc,id_good,id_properties,id_series,id_warehouse,qtty,name,number,best_before,production_date" + ?(ДополнительныеРеквизиты_Использовать, ",additional_details", ""), , 
		Перечисления.SUI_ТаблицыИнтеграции.СерииДокументов);
	
	Возврат Новый ФиксированнаяСтруктура(ДанныеЗапроса);

КонецФункции

Функция ПолучитьЗапросДанных_Сообщения(МобильноеУстройство, ДополнительныеПараметры)
	
	ДанныеЗапроса = СтруктураЗапросаДанных("Сообщение", "ID,Отправитель,Получатель");
	
	ДанныеЗапроса.Запрос.Текст =
		"ВЫБРАТЬ
		|	Таблица.ID,
		|	Таблица.Отправитель,
		|	Таблица.Получатель,
		|	Таблица.Сообщение,
		|	НЕ Изменения.ID ЕСТЬ NULL КАК SUI_ЕстьИзменения
		|ИЗ
		|	РегистрСведений.SUI_СообщенияМобильныхУстройств КАК Таблица
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.SUI_СообщенияМобильныхУстройств.Изменения КАК Изменения
		|		ПО Таблица.ID = Изменения.ID
		|		И Таблица.Отправитель = Изменения.Отправитель
		|		И Таблица.Получатель = Изменения.Получатель
		|		И Изменения.Узел = &МобильноеУстройство";
	
	ДанныеЗапроса.Запрос.УстановитьПараметр("МобильноеУстройство", МобильноеУстройство);
	
	Возврат Новый ФиксированнаяСтруктура(ДанныеЗапроса);

КонецФункции

#КонецОбласти

#КонецОбласти
