
#Область ПрограммныйИнтерфейс

Процедура ПодключитьБиблиотеку(ОповещениеОЗавершении) Экспорт
	
	Контекст = Новый Структура();
	Контекст.Вставить("ОповещениеОЗавершении", ОповещениеОЗавершении);
	
	Оповещение = Новый ОписаниеОповещения("ПодключитьБиблиотку_ПодключениеРасширенияРаботыСФайламиЗавершение", 
		ЭтотОбъект, Контекст);
	SUI_ОбщегоНазначенияКлиент.ПодключитьРасширениеРаботыСФайламиСВозможнойУстановкой(Оповещение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПодключитьБиблиотку_ПодключениеРасширенияРаботыСФайламиЗавершение(Подключено, Контекст) Экспорт
	
	Если Подключено Тогда
		
		КаталогБиблиотек = SUI_ОбщегоНазначенияКлиент.КаталогВспомогательныхБиблиотекИнструментов();
		
		Если ПустаяСтрока(КаталогБиблиотек) Тогда
			ВыполнитьОповещениеЗавершения(Контекст.ОповещениеОЗавершении, Ложь, 
				НСтр("ru = 'Не удалось получить временный каталог файлов Simple.
				|Требуется перезапуск сеанса.'"));
		Иначе
			
			Контекст.Вставить("КаталогБибилиотеки", КаталогБиблиотек
				+ ПолучитьРазделительПути() + Формат(SUI_ОбщегоНазначенияКлиент.НомерСеанса(), "ЧГ=0;")
				+ ПолучитьРазделительПути() + "jsoneditor");
	
			Оповещение = Новый ОписаниеОповещения("ПодключитьБиблиотку_ПроверкаСуществованияКаталогаБиблиотекиЗавершение", 
				ЭтотОбъект, Контекст);
		
			ФайлРедактора = Новый Файл(Контекст.КаталогБибилиотеки);
			ФайлРедактора.НачатьПроверкуСуществования(Оповещение);
		
		КонецЕсли;

	Иначе
		ВыполнитьОповещениеЗавершения(Контекст.ОповещениеОЗавершении, Ложь, 
			НСтр("ru = 'Не удалось подключить расширение для работы с файлами.'"));
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодключитьБиблиотку_ПроверкаСуществованияКаталогаБиблиотекиЗавершение(Существует, Контекст) Экспорт
	
	Если Существует Тогда
		ПодключитьБиблиотку_НачатьПроверкуФайловБиблиотеки(Контекст);
	Иначе
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ПодключитьБиблиотку_СозданиеКаталогаБиблиотекиЗавершение", 
			ЭтотОбъект, Контекст, "ПодключитьБиблиотку_СозданиеКаталогаБиблиотекиЗавершениеПриОшибке", ЭтотОбъект);
		НачатьСозданиеКаталога(ОповещениеОЗавершении, Контекст.КаталогБибилиотеки);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодключитьБиблиотку_СозданиеКаталогаБиблиотекиЗавершение(ИмяКаталога, Контекст) Экспорт
	
	Контекст.Вставить("ТребуетсяСохранитьБиблиоткеу");
	
	Оповещение = Новый ОписаниеОповещения("ПодключитьБиблиотку_ПроверкаСуществованияКаталогаБиблиотекиЗавершение", 
		ЭтотОбъект, Контекст);
	
	ФайлРедактора = Новый Файл(Контекст.КаталогБибилиотеки);
	ФайлРедактора.НачатьПроверкуСуществования(Оповещение);

КонецПроцедуры

Процедура ПодключитьБиблиотку_СозданиеКаталогаБиблиотекиЗавершениеПриОшибке(Ошибка, Отказ, Контекст) Экспорт
	
	ВыполнитьОповещениеЗавершения(Контекст.ОповещениеОЗавершении, Ложь, 
		НСтр("ru = 'Не удалось создать каталог библиотеки для работы с JSON.'"));
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВыполнитьОповещениеЗавершения(Оповещение, Результат, ТекстСообщения = "")
	
	Если Не ПустаяСтрока(ТекстСообщения) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	Если ТипЗнч(Оповещение) = Тип("ОписаниеОповещения") Тогда
		ВыполнитьОбработкуОповещения(Оповещение, Результат);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодключитьБиблиотку_НачатьПроверкуФайловБиблиотеки(Контекст)
		
КонецПроцедуры

#КонецОбласти
