
#Область ПрограммныйИнтерфейс

// Возвращает имя расширения
// Возвращаемое значение:
//   Строка	- Имя расширения
Функция ИмяРасширения() Экспорт
	Возврат НСтр("ru = 'Simple'");
КонецФункции

// Возвращает представление текущего расширения
// Возвращаемое значение:
//   Строка	- Представление расширения
Функция Представление() Экспорт
	Возврат НСтр("ru = 'Simple'");
КонецФункции

// Возвращает текущую версию расширения
// Возвращаемое значение:
//   Строка	- Текущая версия расширения
Функция Версия() Экспорт
	Возврат SUI_SimpleВызовСервера.Версия();
КонецФункции

// Возвращает префикс объектов расширения
// Возвращаемое значение:
//   Строка	- Префикс объектов расширения
Функция Префикс() Экспорт 
	Возврат "SUI_";
КонецФункции

// Возвращает почту для техподдержки
// Возвращаемое значение:
//   Строка	- Почта для техподдержки
Функция ПочтаТехподдержки() Экспорт 
	Возврат "help@simple-kit.ru";
КонецФункции

// Возвращает адрес для скачивания apk файла
// Возвращаемое значение:
//   Строка  - адрес для скачивания apk файла
Функция АдресAPKМобильногоПриложения() Экспорт 
	Возврат "https://www.simple-kit.ru/files/251/";
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ВыполнитьПроверкуСвязиПубликацииИБ(ДанныеАутентификации) Экспорт
	
	сткВозврат = Новый Структура("Результат, ТекстСообщения", Ложь, "");
	
	#Если ВебКлиент Тогда
		Возврат SUI_SimpleВызовСервера.ВыполнитьПроверкуСвязиПубликацииИБНаСервере(ДанныеАутентификации);
	#Иначе
	
		АдресПубликацииHTTPСервиса = SUI_SimpleВызовСервера.ПолучитьАдресПубликацииHTTPСервиса();
	
		Если Не ЗначениеЗаполнено(АдресПубликацииHTTPСервиса) Тогда
			сткВозврат.ТекстСообщения = НСтр("ru = 'Проверка связи не выполнена.
			|Адрес публикации информационной базы заполнен с ошибками.'");
			Возврат сткВозврат;
		КонецЕсли;
		
		СтруктураURI = ОбщегоНазначенияКлиентСервер.СтруктураURI(АдресПубликацииHTTPСервиса + "/communication_test");
	
		HTTPСоединение = Новый HTTPСоединение(СтруктураURI.Хост, СтруктураURI.Порт, ДанныеАутентификации.Имя, 
			ДанныеАутентификации.Пароль , , 10);
	
		HTTPЗапрос = Новый HTTPЗапрос(СтруктураURI.ПутьНаСервере);                                           
		
		Попытка
			Результат = HTTPСоединение.Получить(HTTPЗапрос);
		Исключение
			ВызватьИсключение;
		КонецПопытки;
	
		Если Результат.КодСостояния = 200 Тогда
			сткВозврат.Результат = Истина;
			сткВозврат.ТекстСообщения = НСтр("ru = 'Проверка связи успешно выполнена'");
		Иначе
			
			ТекстПредупреждения = Новый Массив();
			ТекстПредупреждения.Добавить(НСтр("ru = 'Проверка связи не выполнена.'"));
			ТекстПредупреждения.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Код состояния: %1'"), Результат.КодСостояния));
	
			Если Результат.КодСостояния = 401 Тогда
				ТекстПредупреждения.Добавить(НСтр("ru = 'Не удалось авторизоваться в сервисе.'"));
			ИначеЕсли Результат.КодСостояния = 404 Тогда
				ТекстПредупреждения.Добавить(НСтр("ru = 'Удаленный ресурс не найден.'"));
			ИначеЕсли Результат.КодСостояния = 500 Тогда
				ТекстПредупреждения.Добавить(НСтр("ru = 'Внутренняя ошибка сервиса.'"));
			КонецЕсли;
				
			ТекстПредупреждения.Добавить(НСтр("ru = 'Обратитесь к системному администрутору.'"));
		
			сткВозврат.ТекстСообщения = СтрСоединить(ТекстПредупреждения, Символы.ПС);
			
		КонецЕсли;
	
	#КонецЕсли

	Возврат сткВозврат;

КонецФункции

#КонецОбласти
