
#Область ПрограммныйИнтерфейс

// Возвращает имя расширения
// Возвращаемое значение:
//   Строка	- Имя расширения
Функция ИмяРасширения() Экспорт
	Возврат НСтр("ru = 'Simple'");
КонецФункции

// Возвращает представление текущего расширения
// Возвращаемое значение:
//   Строка	- Представление расширения
Функция Представление() Экспорт
	Возврат НСтр("ru = 'Simple'");
КонецФункции

// Возвращает текущую версию расширения
// Возвращаемое значение:
//   Строка	- Текущая версия расширения
Функция Версия() Экспорт
	Возврат SUI_SimpleВызовСервера.Версия();
КонецФункции

// Возвращает префикс объектов расширения
// Возвращаемое значение:
//   Строка	- Префикс объектов расширения
Функция Префикс() Экспорт 
	Возврат "SUI_";
КонецФункции

// Возвращает почту для техподдержки
// Возвращаемое значение:
//   Строка	- Почта для техподдержки
Функция ПочтаТехподдержки() Экспорт 
	Возврат "help@simple-kit.ru";
КонецФункции

// Возвращает адрес для скачивания apk файла
// Возвращаемое значение:
//   Строка  - адрес для скачивания apk файла
Функция АдресAPKМобильногоПриложения() Экспорт 
	Возврат "https://www.simple-kit.ru/files/251/";
КонецФункции

// Путь до HTTP cервиса Simple.
// 
// Возвращаемое значение:
//  Строка - Путь до HTTP cервиса на сервере
Функция ПутьДоHTTPСервиса() Экспорт
	
	Возврат "/hs/simple_accounting";
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПроверитьАдресПубликацииИнформационнойБазы(СтруктураАдреса) Экспорт
	
	// Проверка Хоста адреса публикации
	ОбщегоНазначенияКлиентСервер.Проверить(
		Не ПустаяСтрока(СтруктураАдреса.Хост),
		НСтр("ru = 'Не удалось определить хост адреса публикации информационной базы.'"));
	
	// Проверка Протокола передачи данных в адресе публикации
	ОбщегоНазначенияКлиентСервер.Проверить(
		Не ПустаяСтрока(СтруктураАдреса.Схема),
		НСтр("ru = 'Не указан протокол передачи данных в адреса публикации информационной базы.'"));
	
	// Проверка Протокола передачи данных в адресе публикации
	ОбщегоНазначенияКлиентСервер.Проверить(
		СтруктураАдреса.Схема = "http" Или СтруктураАдреса.Схема = "https",
		СтрШаблон(НСтр("ru = 'Протокол передачи данных ""%1"" адреса публикации информационной базы не поддерживается.
		|Поддерживаемые протоколы http и https.'"), СтруктураАдреса.Схема));
	
КонецПроцедуры

Функция ВыполнитьПроверкуСвязиПубликацииИБ(ДанныеАутентификации) Экспорт
	
	#Если ВебКлиент Тогда
		Возврат SUI_SimpleВызовСервера.ВыполнитьПроверкуСвязиПубликацииИБНаСервере(ДанныеАутентификации);
	#Иначе
		
		Результат = Новый Структура();
		Результат.Вставить("Выполнено", Ложь);
		Результат.Вставить("ТекстСообщения", "");
		
		Попытка
			
			АдресПубликацииИБ = SUI_SimpleВызовСервера.ПолучитьАдресПубликацииИнформационнойБазы();
			СтруктураАдреса = ОбщегоНазначенияКлиентСервер.СтруктураURI(АдресПубликацииИБ);
			
			ПроверитьАдресПубликацииИнформационнойБазы(СтруктураАдреса);
			
			Если СтруктураАдреса.Схема = "https" Тогда
				ЗащищенноеСоединение = ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение();
			Иначе
				ЗащищенноеСоединение = Неопределено;
			КонецЕсли;
			
			Соединение = Новый HTTPСоединение(
				СтруктураАдреса.Хост, 			// Хост
				СтруктураАдреса.Порт, 			// Порт
				ДанныеАутентификации.Имя, 		// Аутентификация: Логин
				ДанныеАутентификации.Пароль,	// Аутентификация: Пароль
				,								// Прокси
				10, 							// Таймаут
				ЗащищенноеСоединение);			// Защищенное соединение
			
			Запрос = Новый HTTPЗапрос(СтруктураАдреса.ПутьНаСервере + ПутьДоHTTPСервиса() + "/communication_test");
			
			РезультатЗапроса = Соединение.Получить(Запрос);
			
			Если РезультатЗапроса.КодСостояния = 200 Тогда
				Результат.Выполнено = Истина;
				Результат.ТекстСообщения = НСтр("ru = 'Проверка связи успешно выполнена.'");
			Иначе
				
				Если Результат.КодСостояния = 401 Тогда
					ТекстОшибки = НСтр("ru = 'Не удалось авторизоваться в сервисе.'");
				ИначеЕсли Результат.КодСостояния = 403 Тогда
					ТекстОшибки = НСтр("ru = 'Доступ запрещен.'");
				ИначеЕсли Результат.КодСостояния = 404 Тогда
					ТекстОшибки = НСтр("ru = 'Удаленный ресурс для проверки связи не найден.'");
				ИначеЕсли Результат.КодСостояния = 500 Тогда
					ТекстОшибки = НСтр("ru = 'Внутренняя ошибка сервиса.'");
				Иначе
					ТекстОшибки = РезультатЗапроса.ПолучитьТелоКакСтроку();
				КонецЕсли;
				
				ВызватьИсключение СтрШаблон("[%1]: %2", РезультатЗапроса.КодСостояния, ТекстОшибки);
				
			КонецЕсли;
			
		Исключение
			Результат.ТекстСообщения = СтрШаблон(
				НСтр("ru = 'Проверка связи не выполнена.
				|
				|Проверьте адрес публикации информационной базы в Центре настроек или обратитесь к техническому специалисту.
				|
				|%1'"), ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
		Возврат Результат;
		
	#КонецЕсли
	
КонецФункции

#КонецОбласти
