
#Область ПрограммныйИнтерфейс

// Возвращает имя расширения
// Возвращаемое значение:
//   Строка	- Имя расширения
Функция ИмяРасширения() Экспорт
	Возврат НСтр("ru = 'Simple'");
КонецФункции

// Возвращает представление текущего расширения
// Возвращаемое значение:
//   Строка	- Представление расширения
Функция Представление() Экспорт
	Возврат НСтр("ru = 'Simple'");
КонецФункции

// Возвращает текущую версию расширения
// Возвращаемое значение:
//   Строка	- Текущая версия расширения
Функция Версия() Экспорт
	Возврат SUI_SimpleВызовСервера.Версия();
КонецФункции

// Возвращает префикс объектов расширения
// Возвращаемое значение:
//   Строка	- Префикс объектов расширения
Функция Префикс() Экспорт 
	Возврат "SUI_";
КонецФункции

// Возвращает почту для техподдержки
// Возвращаемое значение:
//   Строка	- Почта для техподдержки
Функция ПочтаТехподдержки() Экспорт 
	Возврат "help@simple-kit.ru";
КонецФункции

// Возвращает адрес для скачивания apk файла
// Возвращаемое значение:
//   Строка  - адрес для скачивания apk файла
Функция АдресAPKМобильногоПриложения() Экспорт 
	Возврат "https://www.simple-kit.ru/files/251/";
КонецФункции

// Путь до HTTP cервиса Simple.
// 
// Возвращаемое значение:
//  Строка - Путь до HTTP cервиса на сервере
Функция ПутьДоHTTPСервиса() Экспорт
	
	Возврат "/hs/simple_accounting";
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПроверитьАдресПубликацииИнформационнойБазы(СтруктураАдреса) Экспорт
	
	// Проверка Хоста адреса публикации
	SUI_ОбщегоНазначенияКлиентСервер.Проверить(
		Не ПустаяСтрока(СтруктураАдреса.Хост),
		НСтр("ru = 'Не удалось определить хост адреса публикации информационной базы.'"));
	
	// Проверка Протокола передачи данных в адресе публикации
	SUI_ОбщегоНазначенияКлиентСервер.Проверить(
		Не ПустаяСтрока(СтруктураАдреса.Схема),
		НСтр("ru = 'Не указан протокол передачи данных в адреса публикации информационной базы.'"));
	
	// Проверка Протокола передачи данных в адресе публикации
	SUI_ОбщегоНазначенияКлиентСервер.Проверить(
		СтруктураАдреса.Схема = "http" Или СтруктураАдреса.Схема = "https",
		СтрШаблон(НСтр("ru = 'Протокол передачи данных ""%1"" адреса публикации информационной базы не поддерживается.
		|Поддерживаемые протоколы http и https.'"), СтруктураАдреса.Схема));
	
КонецПроцедуры

Функция ВыполнитьПроверкуСвязиПубликацииИБ(ДанныеАутентификации) Экспорт
	
	#Если ВебКлиент Тогда
		Возврат SUI_SimpleВызовСервера.ВыполнитьПроверкуСвязиПубликацииИБНаСервере(ДанныеАутентификации);
	#Иначе
		
		АдресПубликацииИБ = SUI_SimpleВызовСервера.ПолучитьАдресПубликацииИнформационнойБазы();
		СтруктураАдреса = SUI_ОбщегоНазначенияКлиентСервер.СтруктураURI(АдресПубликацииИБ);
		
		ПроверитьАдресПубликацииИнформационнойБазы(СтруктураАдреса);
		
		Если СтруктураАдреса.Схема = "https" Тогда
			ЗащищенноеСоединение = ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение();
		Иначе
			ЗащищенноеСоединение = Неопределено;
		КонецЕсли;
		
		Соединение = Новый HTTPСоединение(
			СтруктураАдреса.Хост, 			// Хост
			СтруктураАдреса.Порт, 			// Порт
			ДанныеАутентификации.Имя, 		// Аутентификация: Логин
			ДанныеАутентификации.Пароль,	// Аутентификация: Пароль
			,								// Прокси
			10, 							// Таймаут
			ЗащищенноеСоединение);			// Защищенное соединение
		
		Запрос = Новый HTTPЗапрос(СтруктураАдреса.ПутьНаСервере + ПутьДоHTTPСервиса() + "/communication_test");
		
		ТекстОшибки = "";
		
		Попытка
			РезультатЗапроса = Соединение.Получить(Запрос);
		Исключение
			Ошибка = ИнформацияОбОшибке();
			ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(Ошибка);
		КонецПопытки;
		
		Если ПустаяСтрока(ТекстОшибки) Тогда
			
			Если РезультатЗапроса.КодСостояния >= 300 И РезультатЗапроса.КодСостояния <= 399 Тогда
				
				НовыйАдресРесурса = SUI_HTTPСервисКлиентСервер.ПолучитьЗначениеЗаголовка(
					РезультатЗапроса.Заголовки, "Location", Тип("Строка"));
				
				ТекстОшибки = НСтр("ru = 'Ресурс был перемещён.
				|
				|Новый адрес ресурса: %1'");
				
				ТекстОшибки = СтрШаблон(ТекстОшибки, НовыйАдресРесурса);
				
			ИначеЕсли РезультатЗапроса.КодСостояния = 401 Тогда
				
				ТекстОшибки = НСтр("ru = 'Не удалось авторизоваться.
				|
				|Вероятные причины:
				| 1. Не правильный логин или пароль.'");
				
			ИначеЕсли РезультатЗапроса.КодСостояния = 403 Тогда
				
				ТекстОшибки = НСтр("ru = 'Доступ к ресурсу запрещен.
				|
				|Вероятные причины:
				| 1. У пользователя нет прав на использование HTTP сервиса Simple.'");
				
			ИначеЕсли РезультатЗапроса.КодСостояния = 404 Тогда
				
				ТекстОшибки = НСтр("ru = 'Удаленный ресурс не найден.
				|
				|Вероятные причины:
				| 1. Веб-сервис не опубликован в конфигурации 1С.
				| 2. Некорректный URL-адрес (ошибка в пути или параметрах).
				| 3. Не включена опция ""Публиковать HTTP-сервисы расширений по умолчанию"" при публикации базы.
				| 4. Веб-сервер (IIS/Apache) неправильно настроен для работы с 1С.
				| 5. Брандмауэр или антивирус блокируют соединение.'");
				
			ИначеЕсли РезультатЗапроса.КодСостояния = 500 Тогда
				
				ТекстОшибки = НСтр("ru = 'Внутренняя ошибка сервиса.
				|
				|Обратитесь к техническому специалисту.'");
				
			ИначеЕсли РезультатЗапроса.КодСостояния <> 200 Тогда
				
				ТекстОшибки = НСтр("ru = 'Не удалось определить результат проверки связи.'");
				
				ТелоКакСтрока = РезультатЗапроса.ПолучитьТелоКакСтроку();
				
				Если СтрДлина(ТелоКакСтрока) > 997 Тогда
					ТелоКакСтрока = Лев(ТелоКакСтрока, 997) + "...";
				КонецЕсли;
				
				Если Не ПустаяСтрока(ТелоКакСтрока) Тогда
					
					ТекстОшибки = СтрШаблон("%1
					|
					|%2", ТекстОшибки, ТелоКакСтрока);
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если Не ПустаяСтрока(ТекстОшибки) Тогда
				ТекстОшибки = СтрШаблон("[%1] %2", РезультатЗапроса.КодСостояния, ТекстОшибки);
			КонецЕсли;
			
		КонецЕсли;
		
		Результат = Новый Структура();
		Результат.Вставить("Выполнено", Ложь);
		Результат.Вставить("ТекстОшибки", "");
		
		Если ПустаяСтрока(ТекстОшибки) Тогда
			Результат.Выполнено = Истина;
		Иначе
			
			Результат.Выполнено = Ложь;
			Результат.ТекстОшибки = СтрШаблон(НСтр("ru = 'Проверка связи не выполнена.
			|
			|%1'"), ТекстОшибки);
			
		КонецЕсли;
		
		Возврат Результат;
		
	#КонецЕсли
	
КонецФункции

#КонецОбласти
