
#Область ПрограммныйИнтерфейс

// Возвращает имя расширения
// Возвращаемое значение:
//   Строка	- Имя расширения
Функция ИмяРасширения() Экспорт
	Возврат НСтр("ru = 'Simple'");
КонецФункции

// Возвращает представление текущего расширения
// Возвращаемое значение:
//   Строка	- Представление расширения
Функция Представление() Экспорт
	Возврат НСтр("ru = 'Simple'");
КонецФункции

// Возвращает текущую версию расширения
// Возвращаемое значение:
//   Строка	- Текущая версия расширения
Функция Версия() Экспорт
	Возврат SUI_SimpleВызовСервера.Версия();
КонецФункции

// Возвращает префикс объектов расширения
// Возвращаемое значение:
//   Строка	- Префикс объектов расширения
Функция Префикс() Экспорт 
	Возврат "SUI_";
КонецФункции

// Возвращает почту для техподдержки
// Возвращаемое значение:
//   Строка	- Почта для техподдержки
Функция ПочтаТехподдержки() Экспорт 
	Возврат "help@simple-kit.ru";
КонецФункции

// Возвращает адрес для скачивания apk файла
// Возвращаемое значение:
//   Строка  - адрес для скачивания apk файла
Функция АдресAPKМобильногоПриложения() Экспорт 
	Возврат "https://www.simple-kit.ru/files/251/";
КонецФункции

// Путь до HTTP cервиса Simple.
// 
// Возвращаемое значение:
//  Строка - Путь до HTTP cервиса на сервере
Функция ПутьДоHTTPСервиса() Экспорт
	
	Возврат "/hs/simple_accounting";
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПроверитьАдресПубликацииИнформационнойБазы(СтруктураАдреса) Экспорт
	
	// Проверка Хоста адреса публикации
	SUI_ОбщегоНазначенияКлиентСервер.Проверить(
		Не ПустаяСтрока(СтруктураАдреса.Хост),
		НСтр("ru = 'Не удалось определить хост адреса публикации информационной базы.'"));
	
	// Проверка Протокола передачи данных в адресе публикации
	SUI_ОбщегоНазначенияКлиентСервер.Проверить(
		Не ПустаяСтрока(СтруктураАдреса.Схема),
		НСтр("ru = 'Не указан протокол передачи данных в адреса публикации информационной базы.'"));
	
	// Проверка Протокола передачи данных в адресе публикации
	SUI_ОбщегоНазначенияКлиентСервер.Проверить(
		СтруктураАдреса.Схема = "http" Или СтруктураАдреса.Схема = "https",
		СтрШаблон(НСтр("ru = 'Протокол передачи данных ""%1"" адреса публикации информационной базы не поддерживается.
		|Поддерживаемые протоколы http и https.'"), СтруктураАдреса.Схема));
	
КонецПроцедуры

Функция ВыполнитьПроверкуСвязиПубликацииИБ(ДанныеАутентификации) Экспорт
	
	#Если ВебКлиент Тогда
		Возврат SUI_SimpleВызовСервера.ВыполнитьПроверкуСвязиПубликацииИБНаСервере(ДанныеАутентификации);
	#Иначе
		
		Результат = Новый Структура();
		Результат.Вставить("Выполнено", Ложь);
		Результат.Вставить("ТекстСообщения", "");
		
		АдресПубликацииИБ = SUI_SimpleВызовСервера.ПолучитьАдресПубликацииИнформационнойБазы();
		СтруктураАдреса = SUI_ОбщегоНазначенияКлиентСервер.СтруктураURI(АдресПубликацииИБ);
		
		ПроверитьАдресПубликацииИнформационнойБазы(СтруктураАдреса);
		
		Если СтруктураАдреса.Схема = "https" Тогда
			ЗащищенноеСоединение = ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение();
		Иначе
			ЗащищенноеСоединение = Неопределено;
		КонецЕсли;
		
		Соединение = Новый HTTPСоединение(
			СтруктураАдреса.Хост, 			// Хост
			СтруктураАдреса.Порт, 			// Порт
			ДанныеАутентификации.Имя, 		// Аутентификация: Логин
			ДанныеАутентификации.Пароль,	// Аутентификация: Пароль
			,								// Прокси
			10, 							// Таймаут
			ЗащищенноеСоединение);			// Защищенное соединение
		
		Запрос = Новый HTTPЗапрос(СтруктураАдреса.ПутьНаСервере + ПутьДоHTTPСервиса() + "/communication_test");
		
		ТекстОшибки = "";
		
		Попытка
			РезультатЗапроса = Соединение.Получить(Запрос);
		Исключение
			Ошибка = ИнформацияОбОшибке();
			ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(Ошибка);
		КонецПопытки;
		
		Если ПустаяСтрока(ТекстОшибки) Тогда
			
			Если РезультатЗапроса.КодСостояния = 200 Тогда
				Результат.Выполнено = Истина;
				Результат.ТекстСообщения = НСтр("ru = 'Проверка связи успешно выполнена.'");
			Иначе
				
				Если РезультатЗапроса.КодСостояния = 401 Тогда
					ТекстОшибки = НСтр("ru = 'Не удалось авторизоваться.'");
				ИначеЕсли РезультатЗапроса.КодСостояния = 403 Тогда
					ТекстОшибки = НСтр("ru = 'Доступ запрещен.'");
				ИначеЕсли РезультатЗапроса.КодСостояния = 404 Тогда
					ТекстОшибки = НСтр("ru = 'Удаленный ресурс не найден.'");
				ИначеЕсли РезультатЗапроса.КодСостояния = 500 Тогда
					ТекстОшибки = НСтр("ru = 'Внутренняя ошибка сервиса.'");
				ИначеЕсли РезультатЗапроса.КодСостояния = 301 Или 
					РезультатЗапроса.КодСостояния = 302 Или 
					РезультатЗапроса.КодСостояния = 308 Тогда
					
					ТекстОшибки = НСтр("ru = 'Удаленный ресурс был перемещён.'");
					
					НовыйАдресРесурса = РезультатЗапроса.Заголовки.Получить("Location");
					
					Если ЗначениеЗаполнено(НовыйАдресРесурса) Тогда
						
						ТекстСообщенияРесурса = СтрШаблон(НСтр("ru = '[%1] Новый адрес ресурса: %2'"), 
							РезультатЗапроса.КодСостояния, НовыйАдресРесурса);
						
						#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
							ОбщегоНазначения.СообщитьПользователю(ТекстСообщенияРесурса);
						#Иначе
							ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщенияРесурса);
						#КонецЕсли
						
					КонецЕсли;
					
				Иначе
					ТекстОшибки = РезультатЗапроса.ПолучитьТелоКакСтроку();
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если Не ПустаяСтрока(ТекстОшибки) Тогда
			
			Результат.Выполнено = Ложь;
			Результат.ТекстСообщения = СтрШаблон(НСтр("ru = 'Проверка связи не выполнена.
			|
			|Проверьте адрес публикации информационной базы в Центре настроек или обратитесь к техническому специалисту.
			|
			|%1'"), ТекстОшибки);
			
		КонецЕсли;
		
		Возврат Результат;
		
	#КонецЕсли
	
КонецФункции

#КонецОбласти
