
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СменитьОтображениеДанных();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выгрузить(Команда)
	
	МаксимальноеКоличествоЗаписейВыгрузки = 100;
	
	Если Элементы.Список.ВыделенныеСтроки.Количество() > МаксимальноеКоличествоЗаписейВыгрузки Тогда
		ПредставлениеКоличествоЗаписей = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
			НСтр("ru = ';%1 записи;;%1 записей;%1 записей;%1 записей'"), МаксимальноеКоличествоЗаписейВыгрузки, , "ЧГ=0;");
		ТекстПредупреждения = СтрШаблон(НСтр("ru = 'Выберите не более %1'"), ПредставлениеКоличествоЗаписей);
		ПоказатьПредупреждение(, ТекстПредупреждения, 15, НСтр("ru = 'Выгрузка логирования'"));
	Иначе
		
		РезультатВыполнения = ПодготовитьФайлВыгрузкиНаСервере();
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.Заголовок = НСтр("ru = 'Формирование файла выгрузки логирования HTTP запросов'");
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ПодготовитьФайлВыгрузкиЗавершение", ЭтотОбъект);
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображениеДанных(Команда)
	
	СменитьОтображениеДанных();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СменитьОтображениеДанных()
	
	Элементы.ФормаОтображениеДанных.Пометка = Не Элементы.ФормаОтображениеДанных.Пометка;
	
	Элементы.ГруппаТекущиеДанные.Видимость = Элементы.ФормаОтображениеДанных.Пометка;
	Элементы.СписокГруппаДанныеЗапросаОтвета.Видимость = Не Элементы.ФормаОтображениеДанных.Пометка;
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьФайлВыгрузкиНаСервере()
	
	ПараметрыПроцедуры = Новый Структура();
	ПараметрыПроцедуры.Вставить("КлючиЗаписей", Элементы.Список.ВыделенныеСтроки);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = 
		СтрШаблон(НСтр("ru = '%1. Подготовка файла выгрузки логирования HTTP запросов'"), 
		SUI_SimpleКлиентСервер.Представление());
	
	РезультатВыполнения = ДлительныеОперации.ВыполнитьВФоне(
		"РегистрыСведений.SUI_ЛогированиеHTTPЗапросов.ПодготовитьФайлВыгрузкиЛогированияHTTPЗапросовВФоне",
		ПараметрыПроцедуры, ПараметрыВыполнения);
	
	Если РезультатВыполнения.Статус = "Ошибка" Тогда
		ВызватьИсключение РезультатВыполнения.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	Возврат РезультатВыполнения;
	
КонецФункции

&НаКлиенте
Процедура ПодготовитьФайлВыгрузкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		Оповещение = Новый ОписаниеОповещения("СохранитьФайлВыгрузкиЗавершение", ЭтотОбъект);
		
		ИмяФайла = СтрШаблон("%1_HTTPLogs_%2.zip",
			SUI_SimpleКлиентСервер.Представление(), 
			Формат(ОбщегоНазначенияКлиент.ДатаСеанса(), "ДФ=dd_MM_yyyy_HH_mm_ss;"));
		
		ПараметрыСохраненияФайла = ФайловаяСистемаКлиент.ПараметрыСохраненияФайла();
		ПараметрыСохраненияФайла.Диалог.Заголовок = 
			СтрШаблон(НСтр("ru = 'Сохраните файл выгрузки логирования HTTP запросов %1'"),
			SUI_SimpleКлиентСервер.Представление());
			
		ФайловаяСистемаКлиент.СохранитьФайл(Оповещение, Результат.АдресРезультата, ИмяФайла, ПараметрыСохраненияФайла);
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайлВыгрузкиЗавершение(СохраненныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если СохраненныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СохраненныеФайлы.Количество() > 0 Тогда
		ФайловаяСистемаКлиент.ОткрытьПроводник(СохраненныеФайлы[0].ПолноеИмя);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
