
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	ТипЗначениеДанныеЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипЗначениеДанныеЗаполнения = Тип("Структура") Или
		ТипЗначениеДанныеЗаполнения = Тип("ФиксированнаяСтруктура") Тогда
		
		Если ДанныеЗаполнения.Свойство("ВладелецФайла") Тогда
			ВладелецФайла = ДанныеЗаполнения.ВладелецФайла;
		КонецЕсли;

		Если ДанныеЗаполнения.Свойство("Наименование") Тогда
			Наименование = ДанныеЗаполнения.Наименование;
		КонецЕсли;

		Если Не ЗначениеЗаполнено(Наименование) Тогда
			Наименование = Строка(ВладелецФайла);
		КонецЕсли;
		
		Если ДанныеЗаполнения.Свойство("ПутьКФайлу") Тогда
			ДополнительныеСвойства.Вставить("ПутьКФайлу", ДанныеЗаполнения.ПутьКФайлу);
		КонецЕсли;
		
		Если ДанныеЗаполнения.Свойство("ДвоичныеДанные") Тогда
			ДополнительныеСвойства.Вставить("ДвоичныеДанные", ДанныеЗаполнения.ДвоичныеДанные);
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если ДополнительныеСвойства.Свойство("ОтключитьПроверкуВладельцаФайла") Тогда
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, 
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("ВладелецФайла"));
	КонецЕсли;

КонецПроцедуры

//@skip-check data-exchange-load
Процедура ПередЗаписью(Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	SUI_ПрисоединенныеФайлыОбщие.Ссылка
		|ИЗ
		|	Справочник.SUI_ПрисоединенныеФайлыОбщие КАК SUI_ПрисоединенныеФайлыОбщие
		|ГДЕ
		|	SUI_ПрисоединенныеФайлыОбщие.ВладелецФайла = &ВладелецФайла
		|	И SUI_ПрисоединенныеФайлыОбщие.Ссылка <> &ТекущаяСсылка";
	
	Запрос.УстановитьПараметр("ТекущаяСсылка", Ссылка);
	Запрос.УстановитьПараметр("ВладелецФайла", ВладелецФайла);
	
	РезультатЗапроса = Запрос.Выполнить();

	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Для ""%1"" уже существует файл ""%2""'"), ВладелецФайла, Выборка.Ссылка);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		Возврат;
	КонецЕсли;

	Если ДополнительныеСвойства.Свойство("ПутьКФайлу") Тогда
		
		ДанныеПутиКФайлу = Справочники.SUI_ПрисоединенныеФайлыОбщие.ПолучитьСведенияОПутиФайла(ДополнительныеСвойства.ПутьКФайлу);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеПутиКФайлу);
		
		Если ДополнительныеСвойства.Свойство("НаименованиеИзПутиКФайлу") Тогда
			Наименование = ОбщегоНазначенияКлиентСервер.ПолучитьИмяСРасширением(ИмяФайла, Расширение);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ДвоичныеДанные") Тогда
		ДанныеДвоичныхДанных = Справочники.SUI_ПрисоединенныеФайлыОбщие.ПолучитьСведенияОДвоичныхДанных(ДополнительныеСвойства.ДвоичныеДанные);
	Иначе
		ДанныеДвоичныхДанных = Справочники.SUI_ПрисоединенныеФайлыОбщие.ПолучитьСведенияОДвоичныхДанных(ФайлХранилище.Получить());
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеДвоичныхДанных.ДвоичныеДанные) Тогда
		ФайлХранилище = Новый ХранилищеЗначения(ДанныеДвоичныхДанных.ДвоичныеДанные, Новый СжатиеДанных(9));
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеДвоичныхДанных);
	Иначе
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не загружены данные файла'"), , , , Отказ);
		Возврат;
	КонецЕсли;

	Если ЭтоНовый() Тогда
		
		ДатаСоздания = ТекущаяДатаСеанса();
		
		УстановитьПривилегированныйРежим(Истина);
		Автор = Пользователи.ТекущийПользователь();
		УстановитьПривилегированныйРежим(Ложь);

	ИначеЕсли КонтрольнаяСумма <> ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "КонтрольнаяСумма") Тогда
				
		ДатаМодификации = ТекущаяДатаСеанса();
	
		УстановитьПривилегированныйРежим(Истина);
		Модифицировал = Пользователи.ТекущийПользователь();
		УстановитьПривилегированныйРежим(Ложь);
	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
