
#Область ПрограммныйИнтерфейс

Функция ПараметрыДобавленияЗаписиЛогирования(HTTPЗапрос, HTTPОтвет) Экспорт
	
	Параметры = Новый Структура();
	
	Параметры.Вставить("HTTPЗапрос", HTTPЗапрос);
	Параметры.Вставить("HTTPОтвет", HTTPОтвет);
	Параметры.Вставить("ИдентификаторУстройства");
	Параметры.Вставить("HTTPСоединение");
	Параметры.Вставить("Метод");
	
	Возврат Параметры;
	
КонецФункции

Процедура ДобавитьЗаписьЛогирования(ПараметрыДобавления) Экспорт
	
	СообщениеЛогирования = Новый Структура();
	СообщениеЛогирования.Вставить("ИдентификаторУстройства", "");
	СообщениеЛогирования.Вставить("КодСостояния", 		0);
	СообщениеЛогирования.Вставить("Метод", 				ПредопределенноеЗначение("Перечисление.SUI_HTTPМетоды.ПустаяСсылка"));
	СообщениеЛогирования.Вставить("БазовыйURL", 		"");
	СообщениеЛогирования.Вставить("ОтносительныйURL", 	"");
	СообщениеЛогирования.Вставить("ВерсияПриложения", 	"");
	СообщениеЛогирования.Вставить("ДанныеЗапроса", 		"");
	СообщениеЛогирования.Вставить("ДанныеОтвета", 		"");
	СообщениеЛогирования.Вставить("ОтветЕстьДанные", 	Ложь);
	СообщениеЛогирования.Вставить("ОтветЖдать", 		Ложь);
	СообщениеЛогирования.Вставить("ОтветКоманда", 		Ложь);
	СообщениеЛогирования.Вставить("ОтветНетДанных", 	Ложь);
	
	Попытка
		
		ТипHTTPЗапрос = ТипЗнч(ПараметрыДобавления.HTTPЗапрос);
		ТипHTTPОтвет = ТипЗнч(ПараметрыДобавления.HTTPОтвет);
		
		SUI_ОбщегоНазначенияКлиентСервер.Проверить(ТипHTTPЗапрос = Тип("HTTPЗапрос") Или ТипHTTPЗапрос = Тип("HTTPСервисЗапрос"),
			НСтр("ru = 'Не передан параметр HTTP запроса.'"));
		
		SUI_ОбщегоНазначенияКлиентСервер.Проверить(ТипHTTPОтвет = Тип("HTTPОтвет") Или ТипHTTPОтвет = Тип("HTTPСервисОтвет"),
			НСтр("ru = 'Не передан параметр HTTP ответ.'"));
		
		СообщениеЛогирования.ИдентификаторУстройства = ПараметрыДобавления.ИдентификаторУстройства;
		СообщениеЛогирования.КодСостояния = ПараметрыДобавления.HTTPОтвет.КодСостояния;
		СообщениеЛогирования.Метод = ПараметрыДобавления.Метод;
		
		Заголовки = ПолучитьЗаголовки(ПараметрыДобавления.HTTPЗапрос, ПараметрыДобавления.HTTPОтвет);
		
		ПараметрыURL = Новый Соответствие();
		ПараметрыЗапроса = Новый Соответствие();
		
		Если ТипHTTPЗапрос = Тип("HTTPЗапрос") Тогда
			
			SUI_ОбщегоНазначенияКлиентСервер.Проверить(ТипЗнч(ПараметрыДобавления.HTTPСоединение) = Тип("HTTPСоединение"),
				НСтр("ru = 'Не передан параметр HTTP соединения.'"));
			
			Если Не ЗначениеЗаполнено(СообщениеЛогирования.ИдентификаторУстройства) Тогда
				СообщениеЛогирования.ИдентификаторУстройства = 
					SUI_HTTPСервисКлиентСервер.ПолучитьИдентификаторУстройства(Заголовки.Ответ);
			КонецЕсли;
			
			СообщениеЛогирования.ВерсияПриложения = 
				SUI_HTTPСервисКлиентСервер.ПолучитьВерсиюПриложения(Заголовки.Ответ);
			
			АдресИПараметрыURL = АдресИПараметрыHTTPЗапросаИСоединения(
				ПараметрыДобавления.HTTPЗапрос, ПараметрыДобавления.HTTPСоединение);
			
			СообщениеЛогирования.БазовыйURL = АдресИПараметрыURL.БазовыйURL;
			СообщениеЛогирования.ОтносительныйURL = АдресИПараметрыURL.ОтносительныйURL;
			ПараметрыURL = АдресИПараметрыURL.ПараметрыURL;
			
		ИначеЕсли ТипHTTPЗапрос = Тип("HTTPСервисЗапрос") Тогда
			                   
			СообщениеЛогирования.ИдентификаторУстройства =
				SUI_HTTPСервисКлиентСервер.ПолучитьИдентификаторУстройства(Заголовки.Запрос);
			
			СообщениеЛогирования.ВерсияПриложения =
				SUI_HTTPСервисКлиентСервер.ПолучитьВерсиюПриложения(Заголовки.Запрос);
				
			СообщениеЛогирования.Метод = SUI_ЛогированиеHTTPЗапросовВызовСервера.HTTPМетодПоСтроке(
				ПараметрыДобавления.HTTPЗапрос.HTTPМетод);
			
			СообщениеЛогирования.БазовыйURL = ПараметрыДобавления.HTTPЗапрос.БазовыйURL;
			СообщениеЛогирования.ОтносительныйURL = ПараметрыДобавления.HTTPЗапрос.ОтносительныйURL;
			
			// Проверка включения логирования HTTP сервиса
			Если Не SUI_ЛогированиеHTTPЗапросовВызовСервера
				.ЛогированиеHTTPСервисаДоступно(СообщениеЛогирования.ОтносительныйURL) Тогда
				Возврат;
			КонецЕсли;
			
			#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
				ПараметрыURL = SUI_ОбщегоНазначения.СкопироватьРекурсивно(
					ПараметрыДобавления.HTTPЗапрос.ПараметрыURL, Ложь);
				ПараметрыЗапроса = SUI_ОбщегоНазначения.СкопироватьРекурсивно(
					ПараметрыДобавления.HTTPЗапрос.ПараметрыЗапроса, Ложь);
			#Иначе
				ПараметрыURL = ОбщегоНазначенияКлиент.СкопироватьРекурсивно(
					ПараметрыДобавления.HTTPЗапрос.ПараметрыURL, Ложь);
				ПараметрыЗапроса = ОбщегоНазначенияКлиент.СкопироватьРекурсивно(
					ПараметрыДобавления.HTTPЗапрос.ПараметрыЗапроса, Ложь);
			#КонецЕсли
						
		КонецЕсли;
		
		SUI_ОбщегоНазначенияКлиентСервер.Проверить(
			ТипЗнч(СообщениеЛогирования.Метод) = Тип("ПеречислениеСсылка.SUI_HTTPМетоды"),
			НСтр("ru = 'Не удалось определить HTTP метод.'"));
		
		#Область ДанныеHTTPЗапрос
		
			СообщениеЛогирования.ДанныеЗапроса = Новый Структура();
			
			// HTTPЗапрос - Method
			СообщениеЛогирования.ДанныеЗапроса.Вставить("Method", Строка(СообщениеЛогирования.Метод));
			
			// HTTPЗапрос - URL
			СообщениеЛогирования.ДанныеЗапроса.Вставить("URL", Новый Структура());
			СообщениеЛогирования.ДанныеЗапроса.URL.Вставить("Absolute", 	
				СообщениеЛогирования.БазовыйURL + СообщениеЛогирования.ОтносительныйURL);
			СообщениеЛогирования.ДанныеЗапроса.URL.Вставить("Base", 		СообщениеЛогирования.БазовыйURL);
			СообщениеЛогирования.ДанныеЗапроса.URL.Вставить("Relative", 	СообщениеЛогирования.ОтносительныйURL);
			
			// HTTPЗапрос - Headers
			СообщениеЛогирования.ДанныеЗапроса.Вставить("Headers", Заголовки.Запрос);
		
			// HTTPЗапрос - Parameters
			СообщениеЛогирования.ДанныеЗапроса.Вставить("Parameters", Новый Структура());
			СообщениеЛогирования.ДанныеЗапроса.Parameters.Вставить("URL", 	ПараметрыURL);
			СообщениеЛогирования.ДанныеЗапроса.Parameters.Вставить("Query", 	ПараметрыЗапроса);
			
			// HTTPЗапрос - Body
			СообщениеЛогирования.ДанныеЗапроса.Вставить("Body");
			
			ТелоЗапрос = SUI_HTTPСервисКлиентСервер.ПолучитьТелоИзHTTPСервисЗапросОтвет(ПараметрыДобавления.HTTPЗапрос);
			ТелоЗапрос = SUI_ОбщегоНазначенияКлиентСервер.УдалитьНедопустимыеСимволыВXML(ТелоЗапрос);
			
			Если Не ПустаяСтрока(ТелоЗапрос) Тогда
				
				ТипКонтента = SUI_HTTPСервисКлиентСервер.ПолучитьТипКонтента(Заголовки.Запрос);
				Если СтрНайти(НРег(ТипКонтента), "application/json") > 0 Тогда
					СообщениеЛогирования.ДанныеЗапроса.Body = ДанныеJSON(ТелоЗапрос, Истина);
				Иначе
					СообщениеЛогирования.ДанныеЗапроса.Body = ТелоЗапрос;
				КонецЕсли;
				
			КонецЕсли;
			
			СообщениеЛогирования.ДанныеЗапроса = SUI_ОбщегоНазначенияКлиентСервер.ДанныеВСтрокуJSON(
				СообщениеЛогирования.ДанныеЗапроса);
			
		#КонецОбласти // ДанныеHTTPЗапрос
		
		#Область ДанныеHTTPОтвет
			
			СообщениеЛогирования.ДанныеОтвета = Новый Структура();
			СообщениеЛогирования.ДанныеОтвета.Вставить("StatusCode", 	СообщениеЛогирования.КодСостояния);
			СообщениеЛогирования.ДанныеОтвета.Вставить("Headers", 		Заголовки.Ответ);
			СообщениеЛогирования.ДанныеОтвета.Вставить("Body");
			
			ТелоОтвет = SUI_HTTPСервисКлиентСервер.ПолучитьТелоИзHTTPСервисЗапросОтвет(ПараметрыДобавления.HTTPОтвет);
			ТелоОтвет = SUI_ОбщегоНазначенияКлиентСервер.УдалитьНедопустимыеСимволыВXML(ТелоОтвет);
			
			Если Не ПустаяСтрока(ТелоОтвет) Тогда
				
				ТипКонтента = SUI_HTTPСервисКлиентСервер.ПолучитьТипКонтента(Заголовки.Ответ);
				Если СтрНайти(НРег(ТипКонтента), "application/json") > 0 Тогда
					
					СообщениеЛогирования.ДанныеОтвета.Body = ДанныеJSON(ТелоОтвет, Истина);
					
					Если ТипЗнч(СообщениеЛогирования.ДанныеОтвета.Body) = Тип("Соответствие") Тогда
						
						ФорматДанныхОтвета = СообщениеЛогирования.ДанныеОтвета.Body.Получить("format");
						Если ФорматДанныхОтвета <> Неопределено Тогда
							
							Если ФорматДанныхОтвета = SUI_ПакетыДанныхКлиентСервер.ФорматПакета_НетДанных() Тогда
								СообщениеЛогирования.ОтветНетДанных = Истина;
							ИначеЕсли ФорматДанныхОтвета = SUI_ПакетыДанныхКлиентСервер.ФорматПакета_ЕстьДанные() Тогда
								СообщениеЛогирования.ОтветЕстьДанные = Истина;
							ИначеЕсли ФорматДанныхОтвета = SUI_ПакетыДанныхКлиентСервер.ФорматПакета_Ждать() Тогда
								СообщениеЛогирования.ОтветЖдать = Истина;
							ИначеЕсли ФорматДанныхОтвета = SUI_ПакетыДанныхКлиентСервер.ФорматПакета_Команда() Тогда
								СообщениеЛогирования.ОтветКоманда = Истина;
							КонецЕсли;
							
						КонецЕсли;
					
					КонецЕсли;
					
				Иначе
					СообщениеЛогирования.ДанныеОтвета.Body = ТелоОтвет;
				КонецЕсли;
				
			КонецЕсли;
			
			СообщениеЛогирования.ДанныеОтвета = SUI_ОбщегоНазначенияКлиентСервер.ДанныеВСтрокуJSON(
				СообщениеЛогирования.ДанныеОтвета);
			
		#КонецОбласти // ДанныеHTTPОтвет
		
		//TODO: artem - 27.11.2024 - Илья Сандалов проверить работу без этой конструкции
//		Если ПараметрыURL.Получить("mode") = "SyncCommand" И ПараметрыURL.Получить("listener") = "get_data" Тогда
//			
//			Если ТипЗнч(ДанныеHTTPОтвет.Body) = Тип("Структура") Или ТипЗнч(ДанныеHTTPОтвет.Body) = Тип("Массив") Тогда
//				
//				Для Каждого СтрокаДокумент Из ДанныеHTTPОтвет.Body Цикл
//					
//					Если СтрокаДокумент.Свойство("RS_docs_barcodes") Тогда
//						
//						Для Каждого СтрокаКМ Из СтрокаДокумент.RS_docs_barcodes	Цикл
//							СтрокаКМ.barcode_from_scanner = SUI_ОбщегоНазначенияКлиентСервер.УдалитьНедопустимыеСимволыВXML(
//								СтрокаКМ.barcode_from_scanner);	
//						КонецЦикла;
//						
//					КонецЕсли;
//					
//					Если СтрокаДокумент.Свойство("RS_barc_flow") Тогда
//						
//						Для Каждого СтрокаКМ Из СтрокаДокумент.RS_barc_flow	Цикл
//							СтрокаКМ.barcode = SUI_ОбщегоНазначенияКлиентСервер.УдалитьНедопустимыеСимволыВXML(СтрокаКМ.barcode);	
//						КонецЦикла;
//						
//					КонецЕсли;
//					
//					Если СтрокаДокумент.Свойство("RS_docs_series") Тогда
//						
//						Для Каждого СтрокаКМ Из СтрокаДокумент.RS_docs_series Цикл
//							СтрокаКМ.name = SUI_ОбщегоНазначенияКлиентСервер.УдалитьНедопустимыеСимволыВXML(СтрокаКМ.name);
//							СтрокаКМ.number = SUI_ОбщегоНазначенияКлиентСервер.УдалитьНедопустимыеСимволыВXML(СтрокаКМ.number);
//						КонецЦикла;
//						
//					КонецЕсли;
//					
//				КонецЦикла;
//				
//			КонецЕсли;
//	
//		КонецЕсли;
		
	Исключение
		Ошибка = ИнформацияОбОшибке();
		SUI_ЖурналРегистрацииВызовСервера.ЗаписьВЖурналРегистрации(ИмяСобытия(), 
			ПредопределенноеЗначение("УровеньЖурналаРегистрации.Ошибка"), , , Ошибка);
		#Если НЕ Сервер И НЕ ТолстыйКлиентОбычноеПриложение И НЕ ВнешнееСоединение Тогда
			ТекстСообщенияОбОшибке = СтрШаблон(НСтр("ru = 'Не удалось сформировать сообщение логирования по причине:
			|%1
			|Подробнее см. Журнал регистрации.'"), ОбработкаОшибок.КраткоеПредставлениеОшибки(Ошибка));
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщенияОбОшибке);
		#КонецЕсли
		Возврат;
	КонецПопытки;
	
	Попытка
		SUI_ЛогированиеHTTPЗапросовВызовСервера.ЗаписатьСообщениеЛогирования(СообщениеЛогирования);
	Исключение
		Ошибка = ИнформацияОбОшибке();
		SUI_ЖурналРегистрацииВызовСервера.ЗаписьВЖурналРегистрации(ИмяСобытия(), 
			ПредопределенноеЗначение("УровеньЖурналаРегистрации.Ошибка"), , , Ошибка);
		#Если НЕ Сервер И НЕ ТолстыйКлиентОбычноеПриложение И НЕ ВнешнееСоединение Тогда
			ТекстСообщенияОбОшибке = СтрШаблон(НСтр("ru = 'Не удалось создать сообщение логирования по причине:
			|%1
			|Подробнее см. Журнал регистрации.'"), ОбработкаОшибок.КраткоеПредставлениеОшибки(Ошибка));
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщенияОбОшибке);
		#КонецЕсли
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ДанныеJSON(Строка, ПрочитатьВСоответствие = Ложь) Экспорт
	
	Если Не ЗначениеЗаполнено(Строка) Тогда
		Возврат ?(ПрочитатьВСоответствие, Новый Соответствие(), Новый Структура());
	КонецЕсли;
	
	ДанныеИзСтроки = SUI_ОбщегоНазначенияКлиентСервер.ДанныеИзСтрокиJSON(Строка, ПрочитатьВСоответствие);
	
	Если ДанныеИзСтроки = Неопределено Тогда
		Возврат ?(ПрочитатьВСоответствие, Новый Соответствие(), Новый Структура());
	Иначе
		Возврат ДанныеИзСтроки;
	КонецЕсли;
	
КонецФункции

Функция ИмяСобытия(ВложенноеСобытие = "") Экспорт
	Возврат НСтр("ru = 'Логирование'") + ?(ЗначениеЗаполнено(ВложенноеСобытие), ". " + ВложенноеСобытие, "");
КонецФункции

Функция КлючиРегламентныхЗаданий() Экспорт
	
	Ключи = Новый Структура();
	Ключи.Вставить("ВыполнитьОчисткуЛогов", "Simple90f40a701efe0ccc2cc2b7eed87c2b75");
	
	Возврат Новый ФиксированнаяСтруктура(Ключи);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СкрываемыеЗначенияЗаголовков()
	
	Возврат SUI_ОбщегоНазначенияКлиентСервер.МассивЗначений(
		"Authorization",
		"authorization");
		
КонецФункции

Функция ПолучитьЗаголовки(HTTPЗапрос, HTTPОтвет)
	
	Результат = Новый Структура("Запрос, Ответ", Новый Соответствие(), Новый Соответствие());
	
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		Результат.Запрос = SUI_ОбщегоНазначения.СкопироватьРекурсивно(HTTPЗапрос.Заголовки, Ложь);
		Результат.Ответ = SUI_ОбщегоНазначения.СкопироватьРекурсивно(HTTPОтвет.Заголовки, Ложь);
	#Иначе
		Результат.Запрос = ОбщегоНазначенияКлиент.СкопироватьРекурсивно(HTTPЗапрос.Заголовки, Ложь);
		Результат.Ответ = ОбщегоНазначенияКлиент.СкопироватьРекурсивно(HTTPОтвет.Заголовки, Ложь);
	#КонецЕсли
	
	Для Каждого СкрываемыйЗаголовок Из СкрываемыеЗначенияЗаголовков() Цикл
		
		Если Результат.Запрос.Получить(СкрываемыйЗаголовок) <> Неопределено Тогда
			Результат.Запрос.Вставить(СкрываемыйЗаголовок, "hidden");
		КонецЕсли;
		
		Если Результат.Ответ.Получить(СкрываемыйЗаголовок) <> Неопределено Тогда
			Результат.Ответ.Вставить(СкрываемыйЗаголовок, "hidden");
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция АдресИПараметрыHTTPЗапросаИСоединения(HTTPЗапрос, Соединение)
	
	Результат = Новый Структура();
	Результат.Вставить("БазовыйURL", "");
	Результат.Вставить("ОтносительныйURL", "");
	Результат.Вставить("ПараметрыURL", Новый Соответствие());
	
	Если Соединение.ЗащищенноеСоединение = Неопределено Тогда
		Результат.БазовыйURL = "http://";
	Иначе
		Результат.БазовыйURL = "https://";
	КонецЕсли;
	
	Результат.БазовыйURL = Результат.БазовыйURL + Соединение.Сервер + Формат(Соединение.Порт, "ЧДЦ=0; ЧН='""""'; ЧГ=0;");
	
	ПозицияНачалаПараметров = СтрНайти(HTTPЗапрос.АдресРесурса, "?");
	Если ПозицияНачалаПараметров > 0 Тогда
		
		Результат.ОтносительныйURL = Лев(HTTPЗапрос.АдресРесурса, ПозицияНачалаПараметров - 1);
		
		СтрокаПараметровURL = Сред(HTTPЗапрос.АдресРесурса, ПозицияНачалаПараметров + 1);
		
		Для Каждого ПараметрURL Из СтроковыеФункцииКлиентСервер.ПараметрыИзСтроки(СтрокаПараметровURL, "&") Цикл
			Результат.ПараметрыURL.Вставить(ПараметрURL.Ключ, ПараметрURL.Значение);
		КонецЦикла;
		
	Иначе
		Результат.ОтносительныйURL = HTTPЗапрос.АдресРесурса;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
