
#Область ПрограммныйИнтерфейс

// Подготовить данные записи логирования.
// 
// Параметры:
//  HTTPЗапрос - HTTPЗапрос - HTTP запрос
//  HTTPОтвет - HTTPОтвет - HTTP ответ
//  МобильноеУстройство - ПланОбменаСсылка.SUI_МобильныеУстройства - Мобильное устройство
//  ДополнительныеДанные - Структура, Неопределено - см. SUI_ЛогированиеHTTPЗапросовКлиентСервер.ДополнительныеДанныеСтруктура
// 
// Возвращаемое значение:
//  Структура - Подготовить данные записи логирования:
// * Метод - ПеречислениеСсылка.SUI_HTTPМетоды - Метод
// * МобильноеУстройство - ПланОбменаСсылка.SUI_МобильныеУстройства - Мобильное устройство
// * БазовыйURL - Строка - Базовый URL
// * ОтносительныйURL - Строка - Относительный URL
// * КодСостояния - Число - Код состояния
// * Причина - Строка, Неопределено - Причина
// * Данные - Строка - Данные HTTP запроса и ответа строкой JSON
Функция ПодготовитьДанныеЗаписиЛогирования(HTTPЗапрос, HTTPОтвет, МобильноеУстройство, ДополнительныеДанные = Неопределено) Экспорт
	
	Данные = ДополнительныеДанныеСтруктура();
	Данные.Вставить("КодСостояния");	
	Данные.Вставить("МобильноеУстройство", 	МобильноеУстройство);
	Данные.Вставить("ВерсияПриложения");
	Данные.Вставить("ИдентификаторУстройства");
	
	ЗаполнитьЗначенияСвойств(Данные, HTTPЗапрос); 
	ЗаполнитьЗначенияСвойств(Данные, HTTPОтвет); 
	
	Если ДополнительныеДанные <> Неопределено Тогда 
		ЗаполнитьЗначенияСвойств(Данные, ДополнительныеДанные); 
		ДополнительныеДанные.Вставить("Метод", Данные.HTTPМетод);
	КонецЕсли; 
	
	Если ТипЗнч(Данные.HTTPМетод) = Тип("Строка") Тогда 
		Данные.Вставить("Метод", SUI_ЛогированиеHTTPЗапросовВызовСервера.HTTPМетодПоСтроке(HTTPЗапрос.HTTPМетод));
	ИначеЕсли ТипЗнч(Данные.HTTPМетод) = Тип("ПеречислениеСсылка.SUI_HTTPМетоды") Тогда
		Данные.Вставить("Метод", Данные.HTTPМетод);	
	КонецЕсли;  
	
	Данные.Удалить("HTTPМетод");
	
	Данные.Вставить("Данные", ПолучитьДанныеЛога(HTTPЗапрос, HTTPОтвет, ДополнительныеДанные));

	Возврат Данные;
	
КонецФункции

Функция ДополнительныеДанныеСтруктура() Экспорт
	
	Данные = Новый Структура();
	
	Данные.Вставить("HTTPМетод");
	Данные.Вставить("ПараметрыURL");	
	Данные.Вставить("БазовыйURL");
	Данные.Вставить("ОтносительныйURL");
	
	Возврат Данные;
	
КонецФункции // ДополнительныеДанныеСтруктура()

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ДанныеJSON(Строка, ПрочитатьВСоответствие = Ложь) Экспорт
	
	Если Не ЗначениеЗаполнено(Строка) Тогда
		Возврат ?(ПрочитатьВСоответствие, Новый Соответствие(), Новый Структура());
	КонецЕсли;
	
	Возврат SUI_ОбщегоНазначенияКлиентСервер.ДанныеИзСтрокиJSON(Строка, ПрочитатьВСоответствие);

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеЛога(HTTPЗапрос, HTTPОтвет, ДополнительныеДанные)
	
	Данные = Новый Структура();
	Данные.Вставить("ДанныеЗапроса");
	Данные.Вставить("ДанныеОтвета");
	
	ТипСтруктурыОтвета = Новый Структура();
	ТипСтруктурыОтвета.Вставить("ОтветКоманда", 	Ложь);
	ТипСтруктурыОтвета.Вставить("ОтветЖдать", 		Ложь);
	ТипСтруктурыОтвета.Вставить("ОтветНетДанных", 	Ложь);
	ТипСтруктурыОтвета.Вставить("ОтветЕстьДанные", 	Ложь);
	
	Данные.Вставить("ТипСтруктурыОтвета", ТипСтруктурыОтвета);
	
	сткHTTPЗапрос = Новый Структура("БазовыйURL, ОтносительныйURL, ПараметрыURL, ПараметрыЗапроса, Заголовки, HTTPМетод", "", "");
	сткHTTPОтвет = Новый Структура("Причина, КодСостояния, Заголовки");
	
	ЗаполнитьЗначенияСвойств(сткHTTPЗапрос, HTTPЗапрос);
	ЗаполнитьЗначенияСвойств(сткHTTPОтвет, HTTPОтвет);
	
	// Скрыть токен авторизации
	Если сткHTTPЗапрос.Заголовки.Получить("Authorization") <> Неопределено Тогда
		
		#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
			сткHTTPЗапрос.Заголовки = ОбщегоНазначения.СкопироватьРекурсивно(сткHTTPЗапрос.Заголовки, Ложь);
		#Иначе
			сткHTTPЗапрос.Заголовки = ОбщегоНазначенияКлиент.СкопироватьРекурсивно(сткHTTPЗапрос.Заголовки, Ложь);
		#КонецЕсли
		
		сткHTTPЗапрос.Заголовки.Вставить("Authorization", "hidden");
		
		сткHTTPЗапрос.Заголовки = Новый ФиксированноеСоответствие(сткHTTPЗапрос.Заголовки);
		
	КонецЕсли;
	
	Если ДополнительныеДанные <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(сткHTTPЗапрос, ДополнительныеДанные);
		ЗаполнитьЗначенияСвойств(сткHTTPОтвет, ДополнительныеДанные); 	
	КонецЕсли;
	
	// ДанныеHTTPЗапрос
	#Область ДанныеHTTPЗапрос
	
	ДанныеHTTPЗапрос = Новый Структура();
	
	// HTTPЗапрос - Method
	ДанныеHTTPЗапрос.Вставить("Method", Строка(сткHTTPЗапрос.HTTPМетод));
	
	// HTTPЗапрос - URL
	ДанныеHTTPЗапрос.Вставить("URL", Новый Структура());
	ДанныеHTTPЗапрос.URL.Вставить("Absolute", 	сткHTTPЗапрос.БазовыйURL + сткHTTPЗапрос.ОтносительныйURL);
	ДанныеHTTPЗапрос.URL.Вставить("Base", 		сткHTTPЗапрос.БазовыйURL);
	ДанныеHTTPЗапрос.URL.Вставить("Relative", 	сткHTTPЗапрос.ОтносительныйURL);
	
	// HTTPЗапрос - Headers
	ДанныеHTTPЗапрос.Вставить("Headers", сткHTTPЗапрос.Заголовки);

	// HTTPЗапрос - Parameters
	ДанныеHTTPЗапрос.Вставить("Parameters", Новый Структура());
	ДанныеHTTPЗапрос.Parameters.Вставить("URL", 	сткHTTPЗапрос.ПараметрыURL);
	ДанныеHTTPЗапрос.Parameters.Вставить("Query", 	сткHTTPЗапрос.ПараметрыЗапроса);
	
	// HTTPЗапрос - Body
	ТелоЗапрос = ОбщегоНазначенияКлиентСервер.УдалитьНедопустимыеСимволыXML(
		SUI_HTTPСервисКлиентСервер.ПолучитьТелоИзHTTPСервисЗапросОтвет(HTTPЗапрос));
	
	Если ЗначениеЗаполнено(ТелоЗапрос) Тогда
		ТипКонтента = ДанныеHTTPЗапрос.Headers.Получить("Content-Type");
		Если ТипКонтента <> Неопределено И СтрНайти(ТипКонтента, "application/json") > 0 Тогда
			ТелоЗапрос = ДанныеJSON(ТелоЗапрос);
		КонецЕсли;
	Иначе
		ТелоЗапрос = Неопределено;
	КонецЕсли;
	
	ДанныеHTTPЗапрос.Вставить("Body", ТелоЗапрос);
	
	
	#КонецОбласти
	
	// ДанныеHTTPОтвет
	#Область ДанныеHTTPОтвет

	ДанныеHTTPОтвет = Новый Структура();
	ДанныеHTTPОтвет.Вставить("StatusCode", 	сткHTTPОтвет.КодСостояния);
	ДанныеHTTPОтвет.Вставить("Headers", 	сткHTTPОтвет.Заголовки);
	ДанныеHTTPОтвет.Вставить("Body", ОбщегоНазначенияКлиентСервер.УдалитьНедопустимыеСимволыXML(
		SUI_HTTPСервисКлиентСервер.ПолучитьТелоИзHTTPСервисЗапросОтвет(HTTPОтвет)));
	
	Если СтрНайти(ДанныеHTTPОтвет.Body, СтрШаблон("""format"": ""%1"",", SUI_ПакетыДанныхКлиентСервер.ФорматПакета_НетДанных())) Тогда
		Данные.ТипСтруктурыОтвета.ОтветНетДанных = Истина;
	ИначеЕсли СтрНайти(ДанныеHTTPОтвет.Body, СтрШаблон("""format"": ""%1"",", SUI_ПакетыДанныхКлиентСервер.ФорматПакета_ЕстьДанные())) Тогда
		Данные.ТипСтруктурыОтвета.ОтветЕстьДанные = Истина;
	ИначеЕсли СтрНайти(ДанныеHTTPОтвет.Body, СтрШаблон("""format"": ""%1"",", SUI_ПакетыДанныхКлиентСервер.ФорматПакета_Ждать())) Тогда
		Данные.ТипСтруктурыОтвета.ОтветЖдать = Истина;
	ИначеЕсли СтрНайти(ДанныеHTTPОтвет.Body, СтрШаблон("""format"": ""%1"",", SUI_ПакетыДанныхКлиентСервер.ФорматПакета_Команда())) Тогда
		Данные.ТипСтруктурыОтвета.ОтветКоманда = Истина;
	КонецЕсли;
	
	ТипКонтента = ДанныеHTTPОтвет.Headers.Получить("Content-Type");
	Если ТипКонтента <> Неопределено И СтрНайти(ТипКонтента, "application/json") > 0 Тогда
		ДанныеHTTPОтвет.Вставить("Body", ДанныеJSON(ДанныеHTTPОтвет.Body));
	ИначеЕсли Не ЗначениеЗаполнено(ДанныеHTTPОтвет.Body) Тогда
		ДанныеHTTPОтвет.Вставить("Body");
	КонецЕсли;
	
	#КонецОбласти

	Если ДанныеHTTPЗапрос.Parameters.URL = "/?mode=SyncCommand&listener=get_data" Тогда
		
		Если ТипЗнч(ДанныеHTTPОтвет.Body) = Тип("Структура") Или ТипЗнч(ДанныеHTTPОтвет.Body) = Тип("Массив") Тогда
			
			Для Каждого СтрокаДокумент Из ДанныеHTTPОтвет.Body Цикл
				
				Если СтрокаДокумент.Свойство("RS_docs_barcodes") Тогда
					
					Для Каждого СтрокаКМ Из СтрокаДокумент.RS_docs_barcodes	Цикл
						СтрокаКМ.barcode_from_scanner = ОбщегоНазначенияКлиентСервер.УдалитьНедопустимыеСимволыXML(СтрокаКМ.barcode_from_scanner);	
					КонецЦикла;
					
				КонецЕсли;
				
				Если СтрокаДокумент.Свойство("RS_barc_flow") Тогда
					
					Для Каждого СтрокаКМ Из СтрокаДокумент.RS_barc_flow	Цикл
						СтрокаКМ.barcode = ОбщегоНазначенияКлиентСервер.УдалитьНедопустимыеСимволыXML(СтрокаКМ.barcode);	
					КонецЦикла;
					
				КонецЕсли;
				
				Если СтрокаДокумент.Свойство("RS_docs_series") Тогда
					
					Для Каждого СтрокаКМ Из СтрокаДокумент.RS_docs_series Цикл
						СтрокаКМ.name = ОбщегоНазначенияКлиентСервер.УдалитьНедопустимыеСимволыXML(СтрокаКМ.name);
						СтрокаКМ.number = ОбщегоНазначенияКлиентСервер.УдалитьНедопустимыеСимволыXML(СтрокаКМ.number);
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;

	КонецЕсли;

	Данные.ДанныеЗапроса = SUI_ОбщегоНазначенияВызовСервера.СтрокаJSON(ДанныеHTTPЗапрос);
	Данные.ДанныеОтвета = SUI_ОбщегоНазначенияВызовСервера.СтрокаJSON(ДанныеHTTPОтвет);
	
	Возврат Данные;
	
КонецФункции

#КонецОбласти
