
#Область ПрограммныйИнтерфейс

Функция ПараметрыДобавленияЗаписиЛогирования(HTTPЗапрос, HTTPОтвет) Экспорт
	
	Параметры = Новый Структура();
	
	Параметры.Вставить("HTTPЗапрос", HTTPЗапрос);
	Параметры.Вставить("HTTPОтвет", HTTPОтвет);
	Параметры.Вставить("ИдентификаторУстройства");
	Параметры.Вставить("HTTPСоединение");
	Параметры.Вставить("Метод");
	
	Возврат Параметры;
	
КонецФункции

Функция ПолучитьЗаголовки(HTTPЗапрос, HTTPОтвет)
	
	Результат = Новый Структура("Запрос, Ответ", Новый Соответствие(), Новый Соответствие());
	
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		Результат.Запрос = ОбщегоНазначения.СкопироватьРекурсивно(HTTPЗапрос.Заголовки, Ложь);
		Результат.Ответ = ОбщегоНазначения.СкопироватьРекурсивно(HTTPОтвет.Заголовки, Ложь);
	#Иначе
		Результат.Запрос = ОбщегоНазначенияКлиент.СкопироватьРекурсивно(HTTPЗапрос.Заголовки, Ложь);
		Результат.Ответ = ОбщегоНазначенияКлиент.СкопироватьРекурсивно(HTTPОтвет.Заголовки, Ложь);
	#КонецЕсли
	
	Для Каждого СкрываемыйЗаголовок Из СкрываемыеЗначенияЗаголовков() Цикл
		
		Если Результат.Запрос.Получить(СкрываемыйЗаголовок) <> Неопределено Тогда
			Результат.Запрос.Вставить(СкрываемыйЗаголовок, "hidden");
		КонецЕсли;
		
		Если Результат.Ответ.Получить(СкрываемыйЗаголовок) <> Неопределено Тогда
			Результат.Ответ.Вставить(СкрываемыйЗаголовок, "hidden");
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция АдресИПараметрыHTTPЗапросаИСоединения(HTTPЗапрос, Соединение)
	
	Результат = Новый Структура();
	Результат.Вставить("БазовыйURL", "");
	Результат.Вставить("ОтносительныйURL", "");
	Результат.Вставить("ПараметрыURL", Новый Соответствие());
	
	Если Соединение.ЗащищенноеСоединение = Неопределено Тогда
		Результат.БазовыйURL = "http://";
	Иначе
		Результат.БазовыйURL = "https://";
	КонецЕсли;
	
	Результат.БазовыйURL = Результат.БазовыйURL + Соединение.Сервер + Формат(Соединение.Порт, "ЧДЦ=0; ЧН='""""'; ЧГ=0;");
	
	ПозицияНачалаПараметров = СтрНайти(HTTPЗапрос.АдресРесурса, "?");
	Если ПозицияНачалаПараметров > 0 Тогда
		
		Результат.ОтносительныйURL = Лев(HTTPЗапрос.АдресРесурса, ПозицияНачалаПараметров - 1);
		
		СтрокаПараметровURL = Сред(HTTPЗапрос.АдресРесурса, ПозицияНачалаПараметров + 1);
		
		Для Каждого ПараметрURL Из СтроковыеФункцииКлиентСервер.ПараметрыИзСтроки(СтрокаПараметровURL, "&") Цикл
			Результат.ПараметрыURL.Вставить(ПараметрURL.Ключ, ПараметрURL.Значение);
		КонецЦикла;
		
	Иначе
		Результат.ОтносительныйURL = HTTPЗапрос.АдресРесурса;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьЗаписьЛогирования(ПараметрыДобавления) Экспорт
	
	СообщениеЛогирования = Новый Структура();
	СообщениеЛогирования.Вставить("ИдентификаторУстройства", "");
	СообщениеЛогирования.Вставить("КодСостояния", 		0);
	СообщениеЛогирования.Вставить("Метод", 				ПредопределенноеЗначение("Перечисление.SUI_HTTPМетоды.ПустаяСсылка"));
	СообщениеЛогирования.Вставить("БазовыйURL", 		"");
	СообщениеЛогирования.Вставить("ОтносительныйURL", 	"");
	СообщениеЛогирования.Вставить("ВерсияПриложения", 	"");
	СообщениеЛогирования.Вставить("ДанныеЗапроса", 		"");
	СообщениеЛогирования.Вставить("ДанныеОтвета", 		"");
	СообщениеЛогирования.Вставить("ОтветЕстьДанные", 	Ложь);
	СообщениеЛогирования.Вставить("ОтветЖдать", 		Ложь);
	СообщениеЛогирования.Вставить("ОтветКоманда", 		Ложь);
	СообщениеЛогирования.Вставить("ОтветНетДанных", 	Ложь);
	
	Попытка
		
		ТипHTTPЗапрос = ТипЗнч(ПараметрыДобавления.HTTPЗапрос);
		ТипHTTPОтвет = ТипЗнч(ПараметрыДобавления.HTTPОтвет);
		
		ОбщегоНазначенияКлиентСервер.Проверить(ТипHTTPЗапрос = Тип("HTTPСервисЗапрос") Или ТипHTTPЗапрос = Тип("HTTPЗапрос"),
			НСтр("ru = 'Не передан параметр HTTP запроса.'"));
		
		ОбщегоНазначенияКлиентСервер.Проверить(ТипHTTPОтвет = Тип("HTTPСервисОтвет") Или ТипHTTPОтвет = Тип("HTTPОтвет"),
			НСтр("ru = 'Не передан параметр HTTP ответ.'"));
		
		СообщениеЛогирования.ИдентификаторУстройства = ПараметрыДобавления.ИдентификаторУстройства;
		СообщениеЛогирования.КодСостояния = ПараметрыДобавления.HTTPОтвет.КодСостояния;
		СообщениеЛогирования.Метод = ПараметрыДобавления.Метод;
		
		Заголовки = ПолучитьЗаголовки(ПараметрыДобавления.HTTPЗапрос, ПараметрыДобавления.HTTPОтвет);
		
		ПараметрыURL = Новый Соответствие();
		ПараметрыЗапроса = Новый Соответствие();
		
		Если ТипHTTPЗапрос = Тип("HTTPСервисЗапрос") Тогда
			
			СообщениеЛогирования.ИдентификаторУстройства =
				SUI_HTTPСервисКлиентСервер.ПолучитьИдентификаторУстройства(Заголовки.Запрос);
			
			СообщениеЛогирования.ВерсияПриложения =
				SUI_HTTPСервисКлиентСервер.ПолучитьВерсиюПриложения(Заголовки.Запрос);
				
			СообщениеЛогирования.Метод = SUI_ЛогированиеHTTPЗапросовВызовСервера.HTTPМетодПоСтроке(
				ПараметрыДобавления.HTTPЗапрос.HTTPМетод);
			
			СообщениеЛогирования.БазовыйURL = ПараметрыДобавления.HTTPЗапрос.БазовыйURL;
			СообщениеЛогирования.ОтносительныйURL = ПараметрыДобавления.HTTPЗапрос.ОтносительныйURL;
			
			#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
				ПараметрыURL = ОбщегоНазначения.СкопироватьРекурсивно(
					ПараметрыДобавления.HTTPЗапрос.ПараметрыURL, Ложь);
				ПараметрыЗапроса = ОбщегоНазначения.СкопироватьРекурсивно(
					ПараметрыДобавления.HTTPЗапрос.ПараметрыЗапроса, Ложь);
			#Иначе
				ПараметрыURL = ОбщегоНазначенияКлиент.СкопироватьРекурсивно(
					ПараметрыДобавления.HTTPЗапрос.ПараметрыURL, Ложь);
				ПараметрыЗапроса = ОбщегоНазначенияКлиент.СкопироватьРекурсивно(
					ПараметрыДобавления.HTTPЗапрос.ПараметрыЗапроса, Ложь);
			#КонецЕсли
			
		ИначеЕсли ТипHTTPЗапрос = Тип("HTTPЗапрос") Тогда
			
			ОбщегоНазначенияКлиентСервер.Проверить(ТипЗнч(ПараметрыДобавления.Соединение) = Тип("HTTPСоединение"),
				НСтр("ru = 'Не передан параметр HTTP соединения.'"));
			
			Если Не ЗначениеЗаполнено(СообщениеЛогирования.ИдентификаторУстройства) Тогда
				СообщениеЛогирования.ИдентификаторУстройства = 
					SUI_HTTPСервисКлиентСервер.ПолучитьИдентификаторУстройства(Заголовки.Ответ);
			КонецЕсли;
			
			СообщениеЛогирования.ВерсияПриложения = 
				SUI_HTTPСервисКлиентСервер.ПолучитьВерсиюПриложения(Заголовки.Ответ);
			
			АдресИПараметрыURL = АдресИПараметрыHTTPЗапросаИСоединения(
				ПараметрыДобавления.HTTPЗапрос, ПараметрыДобавления.Соединение);
			
			СообщениеЛогирования.БазовыйURL = АдресИПараметрыURL.БазовыйURL;
			СообщениеЛогирования.ОтносительныйURL = АдресИПараметрыURL.ОтносительныйURL;
			ПараметрыURL = АдресИПараметрыURL.ПараметрыURL;
			
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.Проверить(
			ТипЗнч(СообщениеЛогирования.Метод) = Тип("ПеречислениеСсылка.SUI_HTTPМетоды"),
			НСтр("ru = 'Не удалось определить HTTP метод.'"));
		
		#Область ДанныеHTTPЗапрос
		
			СообщениеЛогирования.ДанныеЗапроса = Новый Структура();
			
			// HTTPЗапрос - Method
			СообщениеЛогирования.ДанныеЗапроса.Вставить("Method", Строка(СообщениеЛогирования.Метод));
			
			// HTTPЗапрос - URL
			СообщениеЛогирования.ДанныеЗапроса.Вставить("URL", Новый Структура());
			СообщениеЛогирования.ДанныеЗапроса.URL.Вставить("Absolute", 	
				СообщениеЛогирования.БазовыйURL + СообщениеЛогирования.ОтносительныйURL);
			СообщениеЛогирования.ДанныеЗапроса.URL.Вставить("Base", 		СообщениеЛогирования.БазовыйURL);
			СообщениеЛогирования.ДанныеЗапроса.URL.Вставить("Relative", 	СообщениеЛогирования.ОтносительныйURL);
			
			// HTTPЗапрос - Headers
			СообщениеЛогирования.ДанныеЗапроса.Вставить("Headers", Заголовки.Запрос);
		
			// HTTPЗапрос - Parameters
			СообщениеЛогирования.ДанныеЗапроса.Вставить("Parameters", Новый Структура());
			СообщениеЛогирования.ДанныеЗапроса.Parameters.Вставить("URL", 	ПараметрыURL);
			СообщениеЛогирования.ДанныеЗапроса.Parameters.Вставить("Query", 	ПараметрыЗапроса);
			
			// HTTPЗапрос - Body
			СообщениеЛогирования.ДанныеЗапроса.Вставить("Body");
			
			ТелоЗапрос = SUI_HTTPСервисКлиентСервер.ПолучитьТелоИзHTTPСервисЗапросОтвет(ПараметрыДобавления.HTTPЗапрос);
			ТелоЗапрос = ОбщегоНазначенияКлиентСервер.УдалитьНедопустимыеСимволыXML(ТелоЗапрос);
			
			Если Не ПустаяСтрока(ТелоЗапрос) Тогда
				
				ТипКонтента = Заголовки.Запрос.Получить("Content-Type");
				Если ТипКонтента <> Неопределено И СтрНайти(НРег(ТипКонтента), "application/json") > 0 Тогда
					СообщениеЛогирования.ДанныеЗапроса.Body = ДанныеJSON(ТелоЗапрос, Истина);
				КонецЕсли;
				
			КонецЕсли;
			
			СообщениеЛогирования.ДанныеЗапроса = SUI_ОбщегоНазначенияКлиентСервер.ДанныеВСтрокуJSON(
				СообщениеЛогирования.ДанныеЗапроса);
			
		#КонецОбласти // ДанныеHTTPЗапрос
		
		#Область ДанныеHTTPОтвет
			
			СообщениеЛогирования.ДанныеОтвета = Новый Структура();
			СообщениеЛогирования.ДанныеОтвета.Вставить("StatusCode", 	СообщениеЛогирования.КодСостояния);
			СообщениеЛогирования.ДанныеОтвета.Вставить("Headers", 		Заголовки.Ответ);
			СообщениеЛогирования.ДанныеОтвета.Вставить("Body");
			
			ТелоОтвет = SUI_HTTPСервисКлиентСервер.ПолучитьТелоИзHTTPСервисЗапросОтвет(ПараметрыДобавления.HTTPОтвет);
			ТелоОтвет = ОбщегоНазначенияКлиентСервер.УдалитьНедопустимыеСимволыXML(ТелоОтвет);
			
			Если Не ПустаяСтрока(ТелоОтвет) Тогда
				
				ТипКонтента = Заголовки.Ответ.Получить("Content-Type");
				Если ТипКонтента <> Неопределено И СтрНайти(НРег(ТипКонтента), "application/json") > 0 Тогда
					
					СообщениеЛогирования.ДанныеОтвета.Body = ДанныеJSON(ТелоОтвет, Истина);
					
					ФорматДанныхОтвета = СообщениеЛогирования.ДанныеОтвета.Body.Получить("format");
					Если ФорматДанныхОтвета <> Неопределено Тогда
						
						Если ФорматДанныхОтвета = SUI_ПакетыДанныхКлиентСервер.ФорматПакета_НетДанных() Тогда
							СообщениеЛогирования.ОтветНетДанных = Истина;
						ИначеЕсли ФорматДанныхОтвета = SUI_ПакетыДанныхКлиентСервер.ФорматПакета_ЕстьДанные() Тогда
							СообщениеЛогирования.ОтветЕстьДанные = Истина;
						ИначеЕсли ФорматДанныхОтвета = SUI_ПакетыДанныхКлиентСервер.ФорматПакета_Ждать() Тогда
							СообщениеЛогирования.ОтветЖдать = Истина;
						ИначеЕсли ФорматДанныхОтвета = SUI_ПакетыДанныхКлиентСервер.ФорматПакета_Команда() Тогда
							СообщениеЛогирования.ОтветКоманда = Истина;
						КонецЕсли;
						
					КонецЕсли;
					
				Иначе
					СообщениеЛогирования.ДанныеОтвета.Body = ТелоОтвет;
				КонецЕсли;
				
			КонецЕсли;
			
			СообщениеЛогирования.ДанныеОтвета = SUI_ОбщегоНазначенияКлиентСервер.ДанныеВСтрокуJSON(
				СообщениеЛогирования.ДанныеОтвета);
			
		#КонецОбласти // ДанныеHTTPОтвет
		
		//TODO: artem - 27.11.2024 - Илья Сандалов проверить работу без этой конструкции
//		Если ПараметрыURL.Получить("mode") = "SyncCommand" И ПараметрыURL.Получить("listener") = "get_data" Тогда
//			
//			Если ТипЗнч(ДанныеHTTPОтвет.Body) = Тип("Структура") Или ТипЗнч(ДанныеHTTPОтвет.Body) = Тип("Массив") Тогда
//				
//				Для Каждого СтрокаДокумент Из ДанныеHTTPОтвет.Body Цикл
//					
//					Если СтрокаДокумент.Свойство("RS_docs_barcodes") Тогда
//						
//						Для Каждого СтрокаКМ Из СтрокаДокумент.RS_docs_barcodes	Цикл
//							СтрокаКМ.barcode_from_scanner = ОбщегоНазначенияКлиентСервер.УдалитьНедопустимыеСимволыXML(
//								СтрокаКМ.barcode_from_scanner);	
//						КонецЦикла;
//						
//					КонецЕсли;
//					
//					Если СтрокаДокумент.Свойство("RS_barc_flow") Тогда
//						
//						Для Каждого СтрокаКМ Из СтрокаДокумент.RS_barc_flow	Цикл
//							СтрокаКМ.barcode = ОбщегоНазначенияКлиентСервер.УдалитьНедопустимыеСимволыXML(СтрокаКМ.barcode);	
//						КонецЦикла;
//						
//					КонецЕсли;
//					
//					Если СтрокаДокумент.Свойство("RS_docs_series") Тогда
//						
//						Для Каждого СтрокаКМ Из СтрокаДокумент.RS_docs_series Цикл
//							СтрокаКМ.name = ОбщегоНазначенияКлиентСервер.УдалитьНедопустимыеСимволыXML(СтрокаКМ.name);
//							СтрокаКМ.number = ОбщегоНазначенияКлиентСервер.УдалитьНедопустимыеСимволыXML(СтрокаКМ.number);
//						КонецЦикла;
//						
//					КонецЕсли;
//					
//				КонецЦикла;
//				
//			КонецЕсли;
//	
//		КонецЕсли;
		
	Исключение
		Ошибка = ИнформацияОбОшибке();
		SUI_ЖурналРегистрацииВызовСервера.ЗаписьВЖурналРегистрации(ИмяСобытия(), 
			ПредопределенноеЗначение("УровеньЖурналаРегистрации.Ошибка"), , , Ошибка);
		#Если НЕ Сервер И НЕ ТолстыйКлиентОбычноеПриложение И НЕ ВнешнееСоединение Тогда
			ТекстСообщенияОбОшибке = СтрШаблон(НСтр("ru = 'Не удалось сформировать сообщение логирования по причине:
			|%1
			|Подробнее см. Журнал регистрации.'"), ОбработкаОшибок.КраткоеПредставлениеОшибки(Ошибка));
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщенияОбОшибке);
		#КонецЕсли
		Возврат;
	КонецПопытки;
	
	Попытка
		SUI_ЛогированиеHTTPЗапросовВызовСервера.ЗаписатьСообщениеЛогирования(СообщениеЛогирования);
	Исключение
		Ошибка = ИнформацияОбОшибке();
		SUI_ЖурналРегистрацииВызовСервера.ЗаписьВЖурналРегистрации(ИмяСобытия(), 
			ПредопределенноеЗначение("УровеньЖурналаРегистрации.Ошибка"), , , Ошибка);
		#Если НЕ Сервер И НЕ ТолстыйКлиентОбычноеПриложение И НЕ ВнешнееСоединение Тогда
			ТекстСообщенияОбОшибке = СтрШаблон(НСтр("ru = 'Не удалось создать сообщение логирования по причине:
			|%1
			|Подробнее см. Журнал регистрации.'"), ОбработкаОшибок.КраткоеПредставлениеОшибки(Ошибка));
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщенияОбОшибке);
		#КонецЕсли
	КонецПопытки;
	
КонецПроцедуры

// Подготовить данные записи логирования.
// 
// Параметры:
//  HTTPЗапрос - HTTPЗапрос - HTTP запрос
//  HTTPОтвет - HTTPОтвет - HTTP ответ
//  МобильноеУстройство - ПланОбменаСсылка.SUI_МобильныеУстройства - Мобильное устройство
//  ДополнительныеДанные - Структура, Неопределено - см. SUI_ЛогированиеHTTPЗапросовКлиентСервер.ДополнительныеДанныеСтруктура
// 
// Возвращаемое значение:
//  Структура - Подготовить данные записи логирования:
// * Метод - ПеречислениеСсылка.SUI_HTTPМетоды - Метод
// * МобильноеУстройство - ПланОбменаСсылка.SUI_МобильныеУстройства - Мобильное устройство
// * БазовыйURL - Строка - Базовый URL
// * ОтносительныйURL - Строка - Относительный URL
// * КодСостояния - Число - Код состояния
// * Причина - Строка, Неопределено - Причина
// * Данные - Строка - Данные HTTP запроса и ответа строкой JSON
Функция ПодготовитьДанныеЗаписиЛогирования(HTTPЗапрос, HTTPОтвет, МобильноеУстройство, ДополнительныеДанные = Неопределено) Экспорт
	
	Данные = ДополнительныеДанныеСтруктура();
	Данные.Вставить("КодСостояния");	
	Данные.Вставить("МобильноеУстройство", 	МобильноеУстройство);
	Данные.Вставить("ВерсияПриложения");
	Данные.Вставить("ИдентификаторУстройства");
	
	ЗаполнитьЗначенияСвойств(Данные, HTTPЗапрос); 
	ЗаполнитьЗначенияСвойств(Данные, HTTPОтвет); 
	
	Если ДополнительныеДанные <> Неопределено Тогда 
		ЗаполнитьЗначенияСвойств(Данные, ДополнительныеДанные); 
		ДополнительныеДанные.Вставить("Метод", Данные.HTTPМетод);
	КонецЕсли; 
	
	Если ТипЗнч(Данные.HTTPМетод) = Тип("Строка") Тогда 
		Данные.Вставить("Метод", SUI_ЛогированиеHTTPЗапросовВызовСервера.HTTPМетодПоСтроке(HTTPЗапрос.HTTPМетод));
	ИначеЕсли ТипЗнч(Данные.HTTPМетод) = Тип("ПеречислениеСсылка.SUI_HTTPМетоды") Тогда
		Данные.Вставить("Метод", Данные.HTTPМетод);	
	КонецЕсли;  
	
	Данные.Удалить("HTTPМетод");
	
	Данные.Вставить("Данные", ПолучитьДанныеЛога(HTTPЗапрос, HTTPОтвет, ДополнительныеДанные));

	Возврат Данные;
	
КонецФункции

Функция ДополнительныеДанныеСтруктура() Экспорт
	
	Данные = Новый Структура();
	
	Данные.Вставить("HTTPМетод");
	Данные.Вставить("ПараметрыURL");	
	Данные.Вставить("БазовыйURL");
	Данные.Вставить("ОтносительныйURL");
	
	Возврат Данные;
	
КонецФункции // ДополнительныеДанныеСтруктура()

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ДанныеJSON(Строка, ПрочитатьВСоответствие = Ложь) Экспорт
	
	Если Не ЗначениеЗаполнено(Строка) Тогда
		Возврат ?(ПрочитатьВСоответствие, Новый Соответствие(), Новый Структура());
	КонецЕсли;
	
	Возврат SUI_ОбщегоНазначенияКлиентСервер.ДанныеИзСтрокиJSON(Строка, ПрочитатьВСоответствие);
	
КонецФункции

Функция ИмяСобытия(ВложенноеСобытие = "") Экспорт
	Возврат НСтр("ru = 'Логирование'") + ?(ЗначениеЗаполнено(ВложенноеСобытие), ". " + ВложенноеСобытие, "");
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеЛога(HTTPЗапрос, HTTPОтвет, ДополнительныеДанные)
	
	Данные = Новый Структура();
	Данные.Вставить("ДанныеЗапроса");
	Данные.Вставить("ДанныеОтвета");
	
	ТипСтруктурыОтвета = Новый Структура();
	ТипСтруктурыОтвета.Вставить("ОтветКоманда", 	Ложь);
	ТипСтруктурыОтвета.Вставить("ОтветЖдать", 		Ложь);
	ТипСтруктурыОтвета.Вставить("ОтветНетДанных", 	Ложь);
	ТипСтруктурыОтвета.Вставить("ОтветЕстьДанные", 	Ложь);
	
	Данные.Вставить("ТипСтруктурыОтвета", ТипСтруктурыОтвета);
	
	сткHTTPЗапрос = Новый Структура("БазовыйURL, ОтносительныйURL, ПараметрыURL, ПараметрыЗапроса, Заголовки, HTTPМетод", "", "");
	сткHTTPОтвет = Новый Структура("Причина, КодСостояния, Заголовки");
	
	ЗаполнитьЗначенияСвойств(сткHTTPЗапрос, HTTPЗапрос);
	ЗаполнитьЗначенияСвойств(сткHTTPОтвет, HTTPОтвет);
	
	// Скрыть токен авторизации
	Если сткHTTPЗапрос.Заголовки.Получить("Authorization") <> Неопределено Тогда
		
		#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
			сткHTTPЗапрос.Заголовки = ОбщегоНазначения.СкопироватьРекурсивно(сткHTTPЗапрос.Заголовки, Ложь);
		#Иначе
			сткHTTPЗапрос.Заголовки = ОбщегоНазначенияКлиент.СкопироватьРекурсивно(сткHTTPЗапрос.Заголовки, Ложь);
		#КонецЕсли
		
		сткHTTPЗапрос.Заголовки.Вставить("Authorization", "hidden");
		
		сткHTTPЗапрос.Заголовки = Новый ФиксированноеСоответствие(сткHTTPЗапрос.Заголовки);
		
	КонецЕсли;
	
	Если ДополнительныеДанные <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(сткHTTPЗапрос, ДополнительныеДанные);
		ЗаполнитьЗначенияСвойств(сткHTTPОтвет, ДополнительныеДанные); 	
	КонецЕсли;
	
	// ДанныеHTTPЗапрос
	#Область ДанныеHTTPЗапрос
	
	ДанныеHTTPЗапрос = Новый Структура();
	
	// HTTPЗапрос - Method
	ДанныеHTTPЗапрос.Вставить("Method", Строка(сткHTTPЗапрос.HTTPМетод));
	
	// HTTPЗапрос - URL
	ДанныеHTTPЗапрос.Вставить("URL", Новый Структура());
	ДанныеHTTPЗапрос.URL.Вставить("Absolute", 	сткHTTPЗапрос.БазовыйURL + сткHTTPЗапрос.ОтносительныйURL);
	ДанныеHTTPЗапрос.URL.Вставить("Base", 		сткHTTPЗапрос.БазовыйURL);
	ДанныеHTTPЗапрос.URL.Вставить("Relative", 	сткHTTPЗапрос.ОтносительныйURL);
	
	// HTTPЗапрос - Headers
	ДанныеHTTPЗапрос.Вставить("Headers", сткHTTPЗапрос.Заголовки);

	// HTTPЗапрос - Parameters
	ДанныеHTTPЗапрос.Вставить("Parameters", Новый Структура());
	ДанныеHTTPЗапрос.Parameters.Вставить("URL", 	сткHTTPЗапрос.ПараметрыURL);
	ДанныеHTTPЗапрос.Parameters.Вставить("Query", 	сткHTTPЗапрос.ПараметрыЗапроса);
	
	// HTTPЗапрос - Body
	ТелоЗапрос = ОбщегоНазначенияКлиентСервер.УдалитьНедопустимыеСимволыXML(
		SUI_HTTPСервисКлиентСервер.ПолучитьТелоИзHTTPСервисЗапросОтвет(HTTPЗапрос));
	
	Если ЗначениеЗаполнено(ТелоЗапрос) Тогда
		ТипКонтента = ДанныеHTTPЗапрос.Headers.Получить("Content-Type");
		Если ТипКонтента <> Неопределено И СтрНайти(ТипКонтента, "application/json") > 0 Тогда
			ТелоЗапрос = ДанныеJSON(ТелоЗапрос);
		КонецЕсли;
	Иначе
		ТелоЗапрос = Неопределено;
	КонецЕсли;
	
	ДанныеHTTPЗапрос.Вставить("Body", ТелоЗапрос);
	
	
	#КонецОбласти
	
	// ДанныеHTTPОтвет
	#Область ДанныеHTTPОтвет

	ДанныеHTTPОтвет = Новый Структура();
	ДанныеHTTPОтвет.Вставить("StatusCode", 	сткHTTPОтвет.КодСостояния);
	ДанныеHTTPОтвет.Вставить("Headers", 	сткHTTPОтвет.Заголовки);
	ДанныеHTTPОтвет.Вставить("Body", ОбщегоНазначенияКлиентСервер.УдалитьНедопустимыеСимволыXML(
		SUI_HTTPСервисКлиентСервер.ПолучитьТелоИзHTTPСервисЗапросОтвет(HTTPОтвет)));
	
	Если СтрНайти(ДанныеHTTPОтвет.Body, СтрШаблон("""format"": ""%1"",", SUI_ПакетыДанныхКлиентСервер.ФорматПакета_НетДанных())) Тогда
		Данные.ТипСтруктурыОтвета.ОтветНетДанных = Истина;
	ИначеЕсли СтрНайти(ДанныеHTTPОтвет.Body, СтрШаблон("""format"": ""%1"",", SUI_ПакетыДанныхКлиентСервер.ФорматПакета_ЕстьДанные())) Тогда
		Данные.ТипСтруктурыОтвета.ОтветЕстьДанные = Истина;
	ИначеЕсли СтрНайти(ДанныеHTTPОтвет.Body, СтрШаблон("""format"": ""%1"",", SUI_ПакетыДанныхКлиентСервер.ФорматПакета_Ждать())) Тогда
		Данные.ТипСтруктурыОтвета.ОтветЖдать = Истина;
	ИначеЕсли СтрНайти(ДанныеHTTPОтвет.Body, СтрШаблон("""format"": ""%1"",", SUI_ПакетыДанныхКлиентСервер.ФорматПакета_Команда())) Тогда
		Данные.ТипСтруктурыОтвета.ОтветКоманда = Истина;
	КонецЕсли;
	
	ТипКонтента = ДанныеHTTPОтвет.Headers.Получить("Content-Type");
	Если ТипКонтента <> Неопределено И СтрНайти(ТипКонтента, "application/json") > 0 Тогда
		ДанныеHTTPОтвет.Вставить("Body", ДанныеJSON(ДанныеHTTPОтвет.Body));
	ИначеЕсли Не ЗначениеЗаполнено(ДанныеHTTPОтвет.Body) Тогда
		ДанныеHTTPОтвет.Вставить("Body");
	КонецЕсли;
	
	#КонецОбласти

	Если ДанныеHTTPЗапрос.Parameters.URL = "/?mode=SyncCommand&listener=get_data" Тогда
		
		Если ТипЗнч(ДанныеHTTPОтвет.Body) = Тип("Структура") Или ТипЗнч(ДанныеHTTPОтвет.Body) = Тип("Массив") Тогда
			
			Для Каждого СтрокаДокумент Из ДанныеHTTPОтвет.Body Цикл
				
				Если СтрокаДокумент.Свойство("RS_docs_barcodes") Тогда
					
					Для Каждого СтрокаКМ Из СтрокаДокумент.RS_docs_barcodes	Цикл
						СтрокаКМ.barcode_from_scanner = ОбщегоНазначенияКлиентСервер.УдалитьНедопустимыеСимволыXML(СтрокаКМ.barcode_from_scanner);	
					КонецЦикла;
					
				КонецЕсли;
				
				Если СтрокаДокумент.Свойство("RS_barc_flow") Тогда
					
					Для Каждого СтрокаКМ Из СтрокаДокумент.RS_barc_flow	Цикл
						СтрокаКМ.barcode = ОбщегоНазначенияКлиентСервер.УдалитьНедопустимыеСимволыXML(СтрокаКМ.barcode);	
					КонецЦикла;
					
				КонецЕсли;
				
				Если СтрокаДокумент.Свойство("RS_docs_series") Тогда
					
					Для Каждого СтрокаКМ Из СтрокаДокумент.RS_docs_series Цикл
						СтрокаКМ.name = ОбщегоНазначенияКлиентСервер.УдалитьНедопустимыеСимволыXML(СтрокаКМ.name);
						СтрокаКМ.number = ОбщегоНазначенияКлиентСервер.УдалитьНедопустимыеСимволыXML(СтрокаКМ.number);
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;

	КонецЕсли;

	Данные.ДанныеЗапроса = SUI_ОбщегоНазначенияВызовСервера.СтрокаJSON(ДанныеHTTPЗапрос);
	Данные.ДанныеОтвета = SUI_ОбщегоНазначенияВызовСервера.СтрокаJSON(ДанныеHTTPОтвет);
	
	Возврат Данные;
	
КонецФункции

Функция СкрываемыеЗначенияЗаголовков()
	
	Возврат SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.МассивЗначений(
		"Authorization",
		"authorization");
		
КонецФункции

#КонецОбласти
