
#Область ПрограммныйИнтерфейс

// Открыть сообщение обмена для повторной обработки.
// 
// Параметры:
//  КлючЗаписи - РегистрСведенийКлючЗаписи.SUI_СообщенияОбменаДанными - Ключ записи регистра сведений SUI_СообщенияОбменаДанными
//  ОповещениеОЗавершении - ОписаниеОповещения - Выполняемое оповещение после сброса признака
Процедура ОткрытьСообщениеДляПовторнойОбработки(КлючЗаписи, ОповещениеОЗавершении) Экспорт
	
	Контекст = Новый Структура();
	Контекст.Вставить("КлючЗаписи", КлючЗаписи);
	Контекст.Вставить("ОповещениеОЗавершении", ОповещениеОЗавершении);
	
	Оповещение = Новый ОписаниеОповещения("СброситьПризнакОбработкиСообщенияПослеПодтверждения", ЭтотОбъект, Контекст);
	
	ТекстВопроса = НСтр("ru = 'Вы действиетльно открыть сообщение для повторной обработки?'");
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СброситьПризнакОбработкиСообщенияПослеПодтверждения(Ответ, Контекст) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Результат = SUI_СообщенияОбменаДаннымиВызовСервера.ОткрытьСообщениеДляПовторнойОбработки(Контекст.КлючЗаписи);
		
		Если Результат Тогда
			ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъекта(Контекст.КлючЗаписи);
		КонецЕсли;
		
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Если Контекст.ОповещениеОЗавершении <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(Контекст.ОповещениеОЗавершении, Результат);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
