
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Не Параметры.Свойство("ИмяОбъектаМетаданных") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	СхемаКомпоновкиДанных = Справочники.SUI_НастройкиДокументов.СформироватьСхемуКомпоновкиДанных(Параметры.ИмяОбъектаМетаданных);

	Если СхемаКомпоновкиДанных = Неопределено Тогда
		Отказ = Истина;
		Возврат;	
	КонецЕсли;
	
	Если Параметры.Свойство("НастройкиКомпоновкиДанных") И ТипЗнч(Параметры.НастройкиКомпоновкиДанных) = Тип("НастройкиКомпоновкиДанных") Тогда
		SUI_КомпоновкаДанныхСервер.ИнициализироватьКомпоновщикНастроек(КомпоновщикНастроек, СхемаКомпоновкиДанных, Параметры.НастройкиКомпоновкиДанных);
	Иначе
		SUI_КомпоновкаДанныхСервер.ИнициализироватьКомпоновщикНастроек(КомпоновщикНастроек, СхемаКомпоновкиДанных);
	КонецЕсли;
	
	Заголовок = НСтр("ru = 'Настройки отбора документов'");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаСохранить(Команда)
	Закрыть(ПодготовитьНастройкиКомпоновкиДляЗакрытия());
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПодготовитьНастройкиКомпоновкиДляЗакрытия()
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	Возврат ПоместитьВоВременноеХранилище(Настройки);
	
КонецФункции

#КонецОбласти
