
#Область ПрограммныйИнтерфейс

// Выполнить функцию.
// Для БСП ред. 3.1 см. ДлительныеОперации.ВыполнитьФункцию
// Для БСП ред. 3.0 см. ДлительныеОперации.ВыполнитьВФоне
// 
// Параметры:
//  ПараметрыВыполнения - ФормаКлиентскогоПриложения - форма, из которой из которой выполняется вызов;
//  ИмяФункции - Строка - имя экспортной функции общего модуля, модуля менеджера объекта
// или модуля обработки, которую необходимо выполнить в фоне.
// Например, "МойОбщийМодуль.МояПроцедура", "Отчет.ЗагруженныеДанные.Сформировать"
// или "Обработка.ЗагрузкаДанных.МодульОбъекта.Загрузить".
//  Параметр1 - Произвольный - произвольные параметры вызова функции. Количество параметров может быть от 0 до 7.
//  Параметр2 - Произвольный -
//  Параметр3 - Произвольный -
//  Параметр4 - Произвольный -
//  Параметр5 - Произвольный -
//  Параметр6 - Произвольный -
//  Параметр7 - Произвольный -
// 
// Возвращаемое значение:
//  Структура -- 
//  Для БСП ред. 3.1 
// 		См. ДлительныеОперации.ВыполнитьФункцию
// 	Для БСП ред. 3.0 
// 		См. ДлительныеОперации.ВыполнитьВФоне
// @skip-check method-too-many-params
Функция ВыполнитьФункцию(Знач ПараметрыВыполнения, ИмяФункции, Знач Параметр1 = Неопределено,
	Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено, Знач Параметр4 = Неопределено,
	Знач Параметр5 = Неопределено, Знач Параметр6 = Неопределено, Знач Параметр7 = Неопределено) Экспорт

	Если СтрНачинаетсяС(СтандартныеПодсистемыСервер.ВерсияБиблиотеки(), "3.1") Тогда
		Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ИмяФункции, Параметр1,
			Параметр2, Параметр3, Параметр4, Параметр5, Параметр6, Параметр7);
	Иначе
		ПараметрыВызова = СписокПараметров(Параметр1, Параметр2, Параметр3, Параметр4, Параметр5, Параметр6, Параметр7);
		ПодготовитьПараметрыВыполненияВФоне(ПараметрыВыполнения, Истина);
		Возврат ДлительныеОперации.ВыполнитьВФоне(ИмяФункции, ПараметрыВызова, ПараметрыВыполнения);
	КонецЕсли;

КонецФункции

// Параметры выполнения функции.
// Для БСП ред. 3.1 см. ДлительныеОперации.ПараметрыВыполненияФункции
// Для БСП ред. 3.0 см. ДлительныеОперации.ПараметрыВыполненияВФоне
// 
// Параметры:
//   ИдентификаторФормы - УникальныйИдентификатор - уникальный идентификатор формы, 
//                        во временное хранилище которой надо поместить результат выполнения процедуры.
// 
// Возвращаемое значение:
//  Структура -- 
//  Для БСП ред. 3.1 
// 		См. ДлительныеОперации.ПараметрыВыполненияФункции
// 	Для БСП ред. 3.0 
// 		См. ДлительныеОперации.ПараметрыВыполненияВФоне
Функция ПараметрыВыполненияФункции(Знач ИдентификаторФормы) Экспорт
	
	Если СтрНачинаетсяС(СтандартныеПодсистемыСервер.ВерсияБиблиотеки(), "3.1") Тогда
		Возврат ДлительныеОперации.ПараметрыВыполненияФункции(ИдентификаторФормы);
	Иначе
		Возврат ДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторФормы);
	КонецЕсли;
	
КонецФункции

// Выполнить процедуру.
// Для БСП ред. 3.1 см. ДлительныеОперации.ВыполнитьПроцедуру
// Для БСП ред. 3.0 см. ДлительныеОперации.ВыполнитьВФоне
// 
// Параметры:
//
//  ПараметрыВыполнения - см. ДлительныеОперации.ПараметрыВыполненияПроцедуры
//
//  ИмяПроцедуры - Строка - имя экспортной процедуры общего модуля, модуля менеджера объекта 
//                          или модуля обработки, которую необходимо выполнить в фоне.
//                          Например, "МойОбщийМодуль.МояПроцедура", "Отчет.ЗагруженныеДанные.Сформировать"
//                          или "Обработка.ЗагрузкаДанных.МодульОбъекта.Загрузить". 
//
//  Параметр1 - Произвольный - произвольные параметры вызова процедуры. Количество параметров может быть от 0 до 7.
//  Параметр2 - Произвольный
//  Параметр3 - Произвольный
//  Параметр4 - Произвольный
//  Параметр5 - Произвольный
//  Параметр6 - Произвольный
//  Параметр7 - Произвольный
// 
// Возвращаемое значение:
//  Структура -- 
//  Для БСП ред. 3.1 
// 		См. ДлительныеОперации.ВыполнитьПроцедуру
// 	Для БСП ред. 3.0 
// 		См. ДлительныеОперации.ВыполнитьВФоне
// @skip-check method-too-many-params
//@skip-check method-optional-parameter-before-required
Функция ВыполнитьПроцедуру(Знач ПараметрыВыполнения = Неопределено, ИмяПроцедуры, Знач Параметр1 = Неопределено,
	Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено, Знач Параметр4 = Неопределено,
	Знач Параметр5 = Неопределено, Знач Параметр6 = Неопределено, Знач Параметр7 = Неопределено) Экспорт
	
	Если СтрНачинаетсяС(СтандартныеПодсистемыСервер.ВерсияБиблиотеки(), "3.1") Тогда
		Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, ИмяПроцедуры, Параметр1,
			Параметр2, Параметр3, Параметр4, Параметр5, Параметр6, Параметр7);
	Иначе
		ПараметрыВызова = СписокПараметров(Параметр1, Параметр2, Параметр3, Параметр4,
			Параметр5, Параметр6, Параметр7);
		ПараметрыВыполнения = ПодготовитьПараметрыВыполненияВФоне(ПараметрыВыполнения, Ложь);
		Возврат ДлительныеОперации.ВыполнитьВФоне(ИмяПроцедуры, ПараметрыВызова, ПараметрыВыполнения);
	КонецЕсли;
	
КонецФункции

// Параметры выполнения процедуры.
// Для БСП ред. 3.1 см. ДлительныеОперации.ПараметрыВыполненияПроцедуры
// Для БСП ред. 3.0 см. ДлительныеОперации.ПараметрыВыполненияВФоне
// 
// Параметры:
//   ИдентификаторФормы - УникальныйИдентификатор - уникальный идентификатор формы, 
//                        во временное хранилище которой надо поместить результат выполнения процедуры.
// 
// Возвращаемое значение:
//  Структура -- 
//  Для БСП ред. 3.1 
// 		См. ДлительныеОперации.ПараметрыВыполненияПроцедуры
// 	Для БСП ред. 3.0 
// 		См. ДлительныеОперации.ПараметрыВыполненияВФоне
Функция ПараметрыВыполненияПроцедуры(Знач ИдентификаторФормы = Неопределено) Экспорт
	
	Если СтрНачинаетсяС(СтандартныеПодсистемыСервер.ВерсияБиблиотеки(), "3.1") Тогда
		Возврат ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	Иначе
		Если ИдентификаторФормы = Неопределено Тогда
			ИдентификаторФормы = Новый УникальныйИдентификатор();
		КонецЕсли;
		Возврат ДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторФормы);
	КонецЕсли;
	
КонецФункции

Функция РезультатОперации(РезультатВыполнения) Экспорт
	
	ВозвращаемыйРезультат = Неопределено;
	
	Если РезультатВыполнения <> Неопределено Тогда
		
		//
		
	КонецЕсли;

	Возврат ВозвращаемыйРезультат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СписокПараметров(Знач Параметр1, Знач Параметр2, Знач Параметр3, Знач Параметр4,
	Знач Параметр5, Знач Параметр6, Знач Параметр7)
	
	ПереданныеПараметры = Новый Массив;
	ПереданныеПараметры.Добавить(Параметр7);
	ПереданныеПараметры.Добавить(Параметр6);
	ПереданныеПараметры.Добавить(Параметр5);
	ПереданныеПараметры.Добавить(Параметр4);
	ПереданныеПараметры.Добавить(Параметр3);
	ПереданныеПараметры.Добавить(Параметр2);
	ПереданныеПараметры.Добавить(Параметр1);
	
	Результат = Новый Массив;
	
	Для Каждого Параметр Из ПереданныеПараметры Цикл
		Если Результат.Количество() = 0 И Параметр = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Результат.Вставить(0, Параметр);
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

Функция ПодготовитьПараметрыВыполненияВФоне(ПереданныйПараметр, ДляФункции)
	
	Перем Результат, Идентификатор;
	
	Если ЗначениеЗаполнено(ПереданныйПараметр) Тогда

		Если ТипЗнч(ПереданныйПараметр) = Тип("Структура") Тогда
			Результат = ПереданныйПараметр;
		ИначеЕсли ДляФункции Тогда
			
			Если ТипЗнч(ПереданныйПараметр) = Тип("ФормаКлиентскогоПриложения") Тогда
				Идентификатор = ПереданныйПараметр.УникальныйИдентификатор;
			ИначеЕсли ТипЗнч(ПереданныйПараметр) = Тип("УникальныйИдентификатор") Тогда
				Идентификатор = ПереданныйПараметр;
			КонецЕсли;

		КонецЕсли;
		
	КонецЕсли;
	
	Если Результат = Неопределено Тогда
		Результат = ДлительныеОперации.ПараметрыВыполненияВФоне(Идентификатор);
	КонецЕсли;
	
	Результат.Вставить("ЭтоФункция", ДляФункции);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
