
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//@skip-check bsl-variable-name-invalid
#Область ПрограммныйИнтерфейс

Функция ПараметрыПолученияСообщений() Экспорт
	
	Параметры = Новый Структура();
	
	Параметры.Вставить("Первые", 0);
	Параметры.Вставить("ID");
	Параметры.Вставить("Отправитель");
	Параметры.Вставить("Получатель");
	Параметры.Вставить("ДатаЗаписиБольше");
	Параметры.Вставить("ДатаЗаписиМеньше");
	Параметры.Вставить("ТолькоНеОбработанные", Истина);
	
	Возврат Параметры;
	
КонецФункции

Функция ПолучитьСообщения(Параметры) Экспорт
	Возврат ЗапросПолученияСообщений(Параметры).Выполнить();
КонецФункции

Функция ПолучитьСообщенияПоОтправителю(Отправитель) Экспорт
	
	ПараметрыПолучения = ПараметрыПолученияСообщений();
	ПараметрыПолучения.Отправитель = Отправитель;
	
	Возврат ПолучитьСообщения(ПараметрыПолучения);
	
КонецФункции

Функция ПолучитьСообщенияПоПолучателю(Получатель) Экспорт
	
	ПараметрыПолучения = ПараметрыПолученияСообщений();
	ПараметрыПолучения.Получатель = Получатель;
	
	Возврат ПолучитьСообщения(ПараметрыПолучения);
	
КонецФункции

Функция ПолучитьПервоеСообщение(Параметры, ПолучитьИзХранилища = Истина) Экспорт
	
	Перем ДанныеСообщения;
	
	ПараметрыПолучения = ПараметрыПолученияСообщений();
	ПараметрыПолучения.Первые = 1;
	ПараметрыПолучения.ID = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ID");
	ПараметрыПолучения.Отправитель = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Отправитель");
	ПараметрыПолучения.Получатель = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Получатель");
	
	РезультатЗапроса = ПолучитьСообщения(ПараметрыПолучения);
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		ДанныеСообщения = SUI_ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Выборка);
		
		Если ПолучитьИзХранилища Тогда
			ДанныеСообщения.Данные = ДанныеСообщения.Данные.Получить();
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДанныеСообщения;
	
КонецФункции

Функция ПолучитьПервоеСообщениеПоОтправителю(Отправитель, ПолучитьИзХранилища = Истина) Экспорт
	
	ПараметрыПолучения = ПараметрыПолученияСообщений();
	ПараметрыПолучения.Отправитель = Отправитель;
	
	Возврат ПолучитьПервоеСообщение(ПараметрыПолучения, ПолучитьИзХранилища);
	
КонецФункции

Функция ПолучитьПервоеСообщениеПоПолучателю(Получатель, ПолучитьИзХранилища = Истина) Экспорт
	
	ПараметрыПолучения = ПараметрыПолученияСообщений();
	ПараметрыПолучения.Получатель = Получатель;
	
	Возврат ПолучитьПервоеСообщение(ПараметрыПолучения, ПолучитьИзХранилища);
	
КонецФункции

Функция ПолучитьСообщениеПоИдентификатору(ID, ПолучитьИзХранилища = Истина) Экспорт
	
	ПараметрыПолучения = ПараметрыПолученияСообщений();
	ПараметрыПолучения.ID = ID;
	
	Возврат ПолучитьПервоеСообщение(ПараметрыПолучения, ПолучитьИзХранилища);
	
КонецФункции

Функция Создать(Отправитель, Получатель, Знач Данные, Приоритет = 5, Знач ВидДанных = Неопределено, Знач ДополнительныеДанные = Неопределено) Экспорт
	
	ОписаниеТипаВидДанных = Новый ОписаниеТипов("ПеречислениеСсылка.SUI_ВидыДанныхСообщенийОбменаДанными");
	ВидДанных = ОписаниеТипаВидДанных.ПривестиЗначение(ВидДанных);
	Если ВидДанных.Пустая() Тогда
		ВидДанных = Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.Значение;
	КонецЕсли;
	
	ОписаниеТипаСтруктура = Новый ОписаниеТипов("Структура");
	ДополнительныеДанные = ОписаниеТипаСтруктура.ПривестиЗначение(ДополнительныеДанные);
	
	МеткаВремени = 0;
	Если ДополнительныеДанные.Свойство("МеткаВремени") Тогда
		МеткаВремени = SUI_ОбщегоНазначения.ОписаниеТипаЧисло(30).ПривестиЗначение(ДополнительныеДанные.МеткаВремени);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(МеткаВремени) Тогда
		МеткаВремени = ТекущаяУниверсальнаяДатаВМиллисекундах();
	КонецЕсли;
	
	ДатаЗаписи = Дата(1, 1, 1);
	Если ДополнительныеДанные.Свойство("ДатаЗаписи") Тогда
		ДатаЗаписи = SUI_ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя).ПривестиЗначение(ДополнительныеДанные.ДатаЗаписи);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаЗаписи) Тогда
		ДатаЗаписи = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Сворачивать = Истина;
	Если ДополнительныеДанные.Свойство("Сворачивать") Тогда
		Сворачивать = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеДанные, "Сворачивать", Ложь, Тип("Булево"));
	КонецЕсли;
	
	Если ВидДанных <> Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.Значение Тогда
		Сворачивать = Ложь;
	КонецЕсли;
	
	Ключи = Неопределено;
	Если ДополнительныеДанные.Свойство("Ключи") Тогда
		
		ТипЗначенияКлючей = ТипЗнч(ДополнительныеДанные.Ключи);
		
		Если ТипЗначенияКлючей = Тип("Массив") Или ТипЗначенияКлючей = Тип("ФиксированныйМассив") Тогда
			Ключи = СтрСоединить(ДополнительныеДанные.Ключи, ";");
		ИначеЕсли ТипЗначенияКлючей = Тип("СписокЗначений") Тогда
			Ключи = СтрСоединить(ДополнительныеДанные.Ключи.ВыгрузитьЗначения(), ";");
		ИначеЕсли ТипЗначенияКлючей = Тип("Структура") Или ТипЗначенияКлючей = Тип("ФиксированнаяСтруктура") Или
			ТипЗначенияКлючей = Тип("Соответствие") Или ТипЗначенияКлючей = Тип("ФиксированноеСоответствие") Тогда
			
			Ключи = Новый Массив;
			Для Каждого КлючИЗначение Из ДополнительныеДанные.Ключи Цикл
				Ключи.Добавить(КлючИЗначение.Ключ + "=" + КлючИЗначение.Значение);
			КонецЦикла;

			Ключи = СтрСоединить(Ключи, ";");
			
		Иначе
			Ключи = SUI_ОбщегоНазначения.ОписаниеТипаСтрока(500).ПривестиЗначение(ДополнительныеДанные.Ключи);
		КонецЕсли;
		
	КонецЕсли;
	
	Данные = ПодготовитьДанныеСообщенияКЗаписи(Данные, ВидДанных);
	
	Если Данные = Неопределено Тогда
		ИдентификаторЗаписи = Неопределено;
	Иначе
		
		ИдентификаторЗаписи = НРег(SUI_ОбщегоНазначения.КонтрольнаяСуммаСтрокой(
			SUI_ОбщегоНазначенияКлиентСервер.МассивЗначений(
				Отправитель, 
				Получатель, 
				Новый УникальныйИдентификатор(), 
				МеткаВремени), 
			ХешФункция.SHA1)
		);
		
		МенеджерЗаписи = СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.ID 			= ИдентификаторЗаписи;
		МенеджерЗаписи.Отправитель 	= Отправитель;
		МенеджерЗаписи.Получатель 	= Получатель;
		МенеджерЗаписи.ДатаЗаписи 	= ДатаЗаписи;
		МенеджерЗаписи.Приоритет	= Приоритет;
		МенеджерЗаписи.ВидДанных 	= ВидДанных;
		МенеджерЗаписи.Данные		= Данные;
		МенеджерЗаписи.МеткаВремени	= МеткаВремени;
		МенеджерЗаписи.Сворачивать 	= Сворачивать;
		МенеджерЗаписи = Ключи;
		
		МенеджерЗаписи.Записать(Истина);
		
	КонецЕсли;
	
	Возврат ИдентификаторЗаписи;
	
КонецФункции

Функция ОбновитьСообщение(Знач КлючЗаписиИлиИдентификатор, Знач Данные) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СообщенияОбменаДанными.ID,
		|	СообщенияОбменаДанными.Отправитель,
		|	СообщенияОбменаДанными.Получатель,
		|	СообщенияОбменаДанными.ВидДанных
		|ИЗ
		|	РегистрСведений.SUI_СообщенияОбменаДанными КАК СообщенияОбменаДанными
		|ГДЕ
		|	СообщенияОбменаДанными.ID = &ID
		|	И ВЫБОР
		|		КОГДА &Отправитель = НЕОПРЕДЕЛЕНО
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ СообщенияОбменаДанными.Отправитель = &Отправитель
		|	КОНЕЦ
		|	И ВЫБОР
		|		КОГДА &Получатель = НЕОПРЕДЕЛЕНО
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ СообщенияОбменаДанными.Получатель = &Получатель
		|	КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	СообщенияОбменаДанными.МеткаВремени";
	
	Если ТипЗнч(КлючЗаписиИлиИдентификатор) = Тип("РегистрСведенийКлючЗаписи.SUI_СообщенияОбменаДанными") Тогда
		
		ОшибкиКлючаЗаписи = Новый Массив();
		
		Если КлючЗаписиИлиИдентификатор.Пустой() Тогда
			ОшибкиКлючаЗаписи.Добавить(НСтр("ru = 'Передан пустой ключ записи'"));
		Иначе
			
			Если ПустаяСтрока(КлючЗаписиИлиИдентификатор.ID) Тогда
				ОшибкиКлючаЗаписи.Добавить(НСтр("ru = 'Не заполнен ID'"));
			КонецЕсли;
			
			Если КлючЗаписиИлиИдентификатор.Отправитель.Пустая() Тогда
				ОшибкиКлючаЗаписи.Добавить(НСтр("ru = 'Не заполнен Отправитель'"));
			КонецЕсли;
			
			Если КлючЗаписиИлиИдентификатор.Получатель.Пустая() Тогда
				ОшибкиКлючаЗаписи.Добавить(НСтр("ru = 'Не заполнен Получатель'"));
			КонецЕсли;
			
			Если КлючЗаписиИлиИдентификатор.Отправитель = КлючЗаписиИлиИдентификатор.Получатель Тогда
				ОшибкиКлючаЗаписи.Добавить(НСтр("ru = 'Отправитель не может быть равен получателю'"));
			КонецЕсли;
			
		КонецЕсли;
		
		SUI_ОбщегоНазначенияКлиентСервер.Проверить(ОшибкиКлючаЗаписи.Количество() = 0,
			СтрШаблон(НСтр("ru = 'Ключ записи содержит ошибки:
			|%1'"), СтрСоединить(ОшибкиКлючаЗаписи, Символы.ПС)),
			"РегистрыСведений.SUI_СообщенияОбменаДанными.ОбновитьСообщение");
		
		Запрос.УстановитьПараметр("ID", КлючЗаписиИлиИдентификатор.ID);
		Запрос.УстановитьПараметр("Отправитель", КлючЗаписиИлиИдентификатор.Отправитель);
		Запрос.УстановитьПараметр("Получатель", КлючЗаписиИлиИдентификатор.Получатель);
		
	ИначеЕсли ТипЗнч(КлючЗаписиИлиИдентификатор) = Тип("Строка") Тогда
		
		SUI_ОбщегоНазначенияКлиентСервер.Проверить(Не ПустаяСтрока(КлючЗаписиИлиИдентификатор),
			НСтр("ru = 'Передан пустой идентификатор сообщения обмена данными'"),
			"РегистрыСведений.SUI_СообщенияОбменаДанными.ОбновитьСообщение");
		
		Запрос.УстановитьПараметр("ID", КлючЗаписиИлиИдентификатор);
		Запрос.УстановитьПараметр("Отправитель", Неопределено);
		Запрос.УстановитьПараметр("Получатель", Неопределено);
		
	Иначе
		
		SUI_ОбщегоНазначенияКлиентСервер.Проверить(Не ПустаяСтрока(КлючЗаписиИлиИдентификатор),
			НСтр("ru = 'Не передан параметр КлючЗаписиИлиИдентификатор'"),
			"РегистрыСведений.SUI_СообщенияОбменаДанными.ОбновитьСообщение");
		
	КонецЕсли;
	
	Если Данные.Свойство("ID") Тогда
		Данные.Удалить("ID");
	КонецЕсли;
	
	Если Данные.Свойство("Отправитель") Тогда
		Данные.Удалить("Отправитель");
	КонецЕсли;
	
	Если Данные.Свойство("Получатель") Тогда
		Данные.Удалить("Получатель");
	КонецЕсли;
	
	Если Данные.Свойство("МеткаВремени") Тогда
		Данные.Удалить("МеткаВремени");
	КонецЕсли;
	
	Если Данные.Свойство("ВидДанных") Тогда
		
		SUI_ОбщегоНазначенияКлиентСервер.Проверить(
			ТипЗнч(Данные.ВидДанных) = Тип("ПеречислениеСсылка.SUI_ВидыДанныхСообщенийОбменаДанными") 
			И Не Данные.ВидДанных.Пустая(), 
			НСтр("ru = 'Не верный вид данных'"), 
			"РегистрыСведений.SUI_СообщенияОбменаДанными.ОбновитьСообщение");
		
	КонецЕсли;
	
	Если Данные.Свойство("СообщенияОбработки") Тогда
		
		ОписаниеТипаМассив = Новый ОписаниеТипов("ФиксированныйМассив");
		СообщенияОбработки = ОписаниеТипаМассив.ПривестиЗначение(Данные.СообщенияОбработки);
		
		Если СообщенияОбработки.Количество() > 0 Тогда
			Данные.Вставить("СообщенияОбработки", Новый ХранилищеЗначения(СообщенияОбработки, Новый СжатиеДанных(9)));
		Иначе
			Данные.Удалить("СообщенияОбработки");
		КонецЕсли;
		
	КонецЕсли;
	
	Если Данные.Свойство("ОшибкаОбработки") Тогда
		
		Если ТипЗнч(Данные.ОшибкаОбработки) = Тип("ИнформацияОбОшибке") Тогда
			Данные.Вставить("ОшибкаОбработки", ОбработкаОшибок.КраткоеПредставлениеОшибки(Данные.ОшибкаОбработки));
		Иначе
			Данные.Удалить("ОшибкаОбработки");
		КонецЕсли;
		
	КонецЕсли;
	
	Если Данные.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.SUI_СообщенияОбменаДанными");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ID", "ID");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Отправитель", "Отправитель");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Получатель", "Получатель");
		Блокировка.Заблокировать();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если Данные.Свойство("Данные") Тогда
				Данные.Данные = ПодготовитьДанныеСообщенияКЗаписи(Данные.Данные, 
					?(Данные.Свойство("ВидДанных"), Данные.ВидДанных, Выборка.ВидДанных));
				SUI_ОбщегоНазначенияКлиентСервер.Проверить(Данные.Данные <> Неопределено,
					НСтр("ru = 'Неудалось создать сообщение обмена данными. Сообщение не содержит данные.'"));
			КонецЕсли;
			
			Запись = СоздатьМенеджерЗаписи();
			Запись.ID = Выборка.ID;
			Запись.Отправитель = Выборка.Отправитель;
			Запись.Получатель = Выборка.Получатель;
			
			Запись.Прочитать();
			
			Если Запись.Выбран() Тогда
				
				ЗаполнитьЗначенияСвойств(Запись, Данные);
				
				Если Запись.ВидДанных = Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.JSON Тогда
					Запись.Сворачивать = Ложь;
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(Запись.Обработано) Тогда
					Запись.СообщенияОбработки = Неопределено;
					Запись.ОшибкаОбработки = Неопределено;
				КонецЕсли;
				
				Запись.Записать(Истина);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

Процедура Удалить(ID = Неопределено, Отправитель = Неопределено, Получатель = Неопределено) Экспорт
	
	НачатьТранзакцию();
	
	Попытка

		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.SUI_СообщенияОбменаДанными");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
		
		Если ID <> Неопределено Тогда
			ЭлементБлокировки.УстановитьЗначение("ID", ID);
		КонецЕсли;
		
		Если Отправитель <> Неопределено Тогда
			ЭлементБлокировки.УстановитьЗначение("Отправитель", Отправитель);
		КонецЕсли;
		
		Если Получатель <> Неопределено Тогда
			ЭлементБлокировки.УстановитьЗначение("Получатель", Получатель);
		КонецЕсли;
		
		Блокировка.Заблокировать();
		
		НаборЗаписей = СоздатьНаборЗаписей();
		
		Если ID <> Неопределено Тогда
			НаборЗаписей.Отбор.ID.Установить(ID);
		КонецЕсли;
		
		Если Отправитель <> Неопределено Тогда
			НаборЗаписей.Отбор.Отправитель.Установить(Отправитель);
		КонецЕсли;
		
		Если Получатель <> Неопределено Тогда
			НаборЗаписей.Отбор.Получатель.Установить(Получатель);
		КонецЕсли;
	
		НаборЗаписей.Записать(Истина);

		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьКоличествоСообщений(Параметры) Экспорт
	
	Результат = 0;
	
	УстановитьПривилегированныйРежим(Истина);
	
	РезультатЗапроса = ЗапросПолученияСообщений(Параметры, Истина).Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат = Выборка.ВсегоСообщений;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьКоличествоСообщенийПоМобильнымУстройствам(Отправитель = Неопределено, Получатель = Неопределено) Экспорт
	
	Параметры = ПараметрыПолученияСообщений();
	Параметры.Отправитель = Отправитель;
	Параметры.Получатель = Получатель;
	
	SUI_ОбщегоНазначенияКлиентСервер.Проверить(Параметры.Отправитель <> Неопределено Или Параметры.Получатель <> Неопределено,
		НСтр("ru = 'Для получения количества сообщений необходимо указать отправителя или получателя'"));
	
	Возврат ПолучитьКоличествоСообщений(Параметры);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗапросПолученияСообщений(Параметры, ПолучениеКоличества = Ложь)
	
	ВыборПервого = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Первые", 0, Тип("Число"));
	
	Запрос = Новый Запрос;
	
	Если ПолучениеКоличества Тогда
		Запрос.Текст =
			"ВЫБРАТЬ
			|	КОЛИЧЕСТВО(СообщенияОбменаДанными.ID) КАК ВсегоСообщений
			|ИЗ
			|	РегистрСведений.SUI_СообщенияОбменаДанными КАК СообщенияОбменаДанными
			|ГДЕ
			|	ВЫБОР
			|		КОГДА &Отправитель = НЕОПРЕДЕЛЕНО
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ СообщенияОбменаДанными.Отправитель = &Отправитель
			|	КОНЕЦ
			|	И ВЫБОР
			|		КОГДА &Получатель = НЕОПРЕДЕЛЕНО
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ СообщенияОбменаДанными.Получатель = &Получатель
			|	КОНЕЦ
			|	И ВЫБОР
			|		КОГДА &ДатаЗаписиБольше = НЕОПРЕДЕЛЕНО
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ СообщенияОбменаДанными.ДатаЗаписи > &ДатаЗаписиБольше
			|	КОНЕЦ
			|	И ВЫБОР
			|		КОГДА &ДатаЗаписиМеньше = НЕОПРЕДЕЛЕНО
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ СообщенияОбменаДанными.ДатаЗаписи < &ДатаЗаписиМеньше
			|	КОНЕЦ
			|	И ВЫБОР
			|		КОГДА СообщенияОбменаДанными.Получатель = &ЭтотУзел
			|			ТОГДА СообщенияОбменаДанными.Обработано = ДАТАВРЕМЯ(1,1,1)
			|		ИНАЧЕ ИСТИНА
			|	КОНЕЦ";
	Иначе
		Запрос.Текст =
			"ВЫБРАТЬ " + ?(ВыборПервого = 0, "", "ПЕРВЫЕ " + Формат(ВыборПервого, "ЧДЦ=0; ЧГ=0;")) + "
			|	СообщенияОбменаДанными.ID,
			|	СообщенияОбменаДанными.Отправитель,
			|	СообщенияОбменаДанными.Получатель,
			|	СообщенияОбменаДанными.Данные,
			|	СообщенияОбменаДанными.ДатаЗаписи,
			|	СообщенияОбменаДанными.Приоритет,
			|	СообщенияОбменаДанными.ВидДанных,
			|	СообщенияОбменаДанными.МеткаВремени
			|ИЗ
			|	РегистрСведений.SUI_СообщенияОбменаДанными КАК СообщенияОбменаДанными
			|ГДЕ
			|	ВЫБОР
			|		КОГДА &ID = НЕОПРЕДЕЛЕНО
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ СообщенияОбменаДанными.ID = &ID
			|	КОНЕЦ
			|	И ВЫБОР
			|		КОГДА &Отправитель = НЕОПРЕДЕЛЕНО
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ СообщенияОбменаДанными.Отправитель = &Отправитель
			|	КОНЕЦ
			|	И ВЫБОР
			|		КОГДА &Получатель = НЕОПРЕДЕЛЕНО
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ СообщенияОбменаДанными.Получатель = &Получатель
			|	КОНЕЦ
			|	И ВЫБОР
			|		КОГДА &ДатаЗаписиБольше = НЕОПРЕДЕЛЕНО
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ СообщенияОбменаДанными.ДатаЗаписи > &ДатаЗаписиБольше
			|	КОНЕЦ
			|	И ВЫБОР
			|		КОГДА &ДатаЗаписиМеньше = НЕОПРЕДЕЛЕНО
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ СообщенияОбменаДанными.ДатаЗаписи < &ДатаЗаписиМеньше
			|	КОНЕЦ
			|	И ВЫБОР
			|		КОГДА СообщенияОбменаДанными.Получатель = &ЭтотУзел
			|			ТОГДА СообщенияОбменаДанными.Обработано = ДАТАВРЕМЯ(1,1,1)
			|		ИНАЧЕ ИСТИНА
			|	КОНЕЦ
			|
			|УПОРЯДОЧИТЬ ПО
			|	Приоритет УБЫВ,
			|	МеткаВремени";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ЭтотУзел", 			ПланыОбмена.SUI_МобильныеУстройства.ЭтотУзел());
	Запрос.УстановитьПараметр("ID", 				SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ID"));
	Запрос.УстановитьПараметр("Отправитель", 		SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Отправитель"));
	Запрос.УстановитьПараметр("Получатель", 		SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Получатель"));
	Запрос.УстановитьПараметр("ДатаЗаписиБольше", 	SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ДатаЗаписиБольше"));
	Запрос.УстановитьПараметр("ДатаЗаписиМеньше", 	SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ДатаЗаписиМеньше"));
	
	Возврат Запрос;
	
КонецФункции

Функция ПодготовитьДанныеСообщенияКЗаписи(Знач Сообщение, ВидДанных)
	
	Если ТипЗнч(Сообщение) = Тип("Строка") И ЭтоАдресВременногоХранилища(Сообщение) Тогда
		Адрес = Сообщение;
		Сообщение = ПолучитьИзВременногоХранилища(Адрес);
		УдалитьИзВременногоХранилища(Адрес);
	КонецЕсли;
	
	Если ВидДанных = Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.JSON Тогда
		Сообщение = SUI_СообщенияОбменаДанными.ДанныеСообщенияВJSON(Сообщение);
	КонецЕсли;
	
	Если Сообщение = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат Новый ХранилищеЗначения(Сообщение, Новый СжатиеДанных(9));
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
