
#Область ПрограммныйИнтерфейс

// Ключ регламентных заданий Simple.
// 
// Возвращаемое значение:
//  Строка - Ключ регламентных заданий Simple
Функция КлючРегламентныхЗаданийSimple() Экспорт
	
	Возврат "Simplea5cc3a36a7ac607b62234eb11b68b5ce";
	
КонецФункции

// Параметры окна запуска регламентного задания.
// 
// Параметры:
//  Ключ - Строка - Ключ регламентного задания
//  УникальныйИдентификатор - УникальныйИдентификатор, Неопределено - Идентификатор регламентного задания
// 
// Возвращаемое значение:
//  Структура - Параметры запуска регламентного задания:
// * Ключ - Строка - Ключ регламентного задания
// * УникальныйИдентификатор - УникальныйИдентификатор, Неопределено - Идентификатор регламентного задания
// * ОжидатьЗавершения - Булево - Признак ожидания завершения регламентного задания
// * ЗакрытьПриУспешномЗавершении - Булево - Закрывать при успешном завершении
// * ЗакрытьПриОшибке - Булево - Закрывать при ошибке
// * ТолькоИспользуемые - Булево - Только используемые регламентные задания
Функция ПараметрыОкнаЗапускаРегламентногоЗадания(Ключ, УникальныйИдентификатор = Неопределено) Экспорт
	
	Параметры = Новый Структура();
	Параметры.Вставить("Ключ", 							Ключ);
	Параметры.Вставить("УникальныйИдентификатор", 		УникальныйИдентификатор);
	Параметры.Вставить("ОжидатьЗавершения", 			Истина);
	Параметры.Вставить("ЗакрытьПриУспешномЗавершении", 	Истина);
	Параметры.Вставить("ЗакрытьПриОшибке", 				Ложь);
	Параметры.Вставить("ТолькоИспользуемые", 			Истина);
	
	Возврат Параметры;
	
КонецФункции

#КонецОбласти
