
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СформироватьДанныеЗаписи(Отправитель, Получатель) Экспорт
	
	Результат = Новый Структура();
	
	Результат.Вставить("Отправитель", Отправитель);
	Результат.Вставить("Получатель", Получатель);
	Результат.Вставить("МеткаВремени", ТекущаяУниверсальнаяДатаВМиллисекундах());
	Результат.Вставить("ДатаЗаписи", ТекущаяДатаСеанса());
	Результат.Вставить("ID", НРег(ОбщегоНазначения.КонтрольнаяСуммаСтрокой(
		SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.МассивЗначений(
			Отправитель, 
			Получатель, 
			Новый УникальныйИдентификатор(), 
			Результат.МеткаВремени
		), 
	ХешФункция.SHA1)));
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

Функция СоздатьСообщение(Отправитель, Получатель, Сообщение) Экспорт
	
	РезультатID = СформироватьДанныеЗаписи(Отправитель, Получатель);
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, РезультатID);
	МенеджерЗаписи.Сообщение = СокрЛП(Сообщение);
	
	МенеджерЗаписи.Записать(Истина);
	
	Возврат МенеджерЗаписи.ID;
	
КонецФункции

#КонецОбласти

#КонецЕсли
