
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТипЗапроса = "ПолучитьДанные";
	ЗапросТекст = "SELECT * FROM RS_docs";
	ИнициализироватьТаблицыМобильногоУстройства();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТаблицаЗаголовковОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИсторияЗапросов

&НаКлиенте
Процедура ИсторияЗапросовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элементы.ИсторияЗапросов.ТекущиеДанные <> Неопределено Тогда
		ЗапросТекст = Элементы.ИсторияЗапросов.ТекущиеДанные.Запрос;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицыДокументов

&НаКлиенте
Процедура ТаблицыДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элементы.ТаблицыДокументов.ТекущиеДанные <> Неопределено Тогда 
		ЗапросТекст = СтрШаблон("SELECT * FROM %1", Элементы.ТаблицыДокументов.ТекущиеДанные.НазваниеТаблицы);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьЗапрос(Команда) 
	
	ОчиститьСообщения();
	
	Если МобильноеУстройство.Пустая() И Не ЗначениеЗаполнено(IPАдрес) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Не заполнен мобильный клиент и IP адрес'")));	
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура("Запрос", ЗапросТекст);
	
	Если Не ИсторияЗапросов.НайтиСтроки(ПараметрыОтбора).Количество() Тогда
		НоваяСтрокаЗапросов = ИсторияЗапросов.Добавить();	
		НоваяСтрокаЗапросов.Запрос = ЗапросТекст;
	КонецЕсли; 
	
	Если ТипЗапроса = "ОтправитьДанные" Тогда
		ОтправитьSQLЗапросМобильныйКлиент(ПолучитьIPАдресПользователя(МобильноеУстройство, IPАдрес), "ExecSQL", ЗапросТекст, "&params=&db_name=SimpleKeep");   	
	Иначе
		ОтправитьSQLЗапросМобильныйКлиент(ПолучитьIPАдресПользователя(МобильноеУстройство, IPАдрес), "SQLQuery", "_", "&query=" + ЗапросТекст + "&params=&db_name=SimpleKeep");		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//@skip-check object-deprecated
&НаКлиенте
Функция ОтправитьSQLЗапросМобильныйКлиент(АдресТерминала, Команда, SQLЗапрос, Параметры)
	
	Если АдресТерминала = "" Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не передан IP адрес'"));
		Возврат ""; 
	КонецЕсли;
	
	Если SQLЗапрос = "" Тогда 
		Возврат ""; 
	КонецЕсли; 
	
	Если SQLЗапрос = "_" Тогда 
		SQLЗапрос = ""; 
	КонецЕсли;

	Соединение = Новый HTTPСоединение(АдресТерминала, , , , , 4);
	
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Content-Type","Application/json; charset=utf-8");
	
	Запрос = Новый HTTPЗапрос("/?mode=" + Команда + Параметры, Заголовки);
	
	Если ЗначениеЗаполнено(SQLЗапрос) Тогда
		Запрос.УстановитьТелоИзСтроки(SQLЗапрос, КодировкаТекста.UTF8);
	КонецЕсли;
	
	Попытка
		ОтветСервера = Соединение.ОтправитьДляОбработки(Запрос);
		Ответ = ОтветСервера.ПолучитьТелоКакСтроку();
		
		Если ТипЗапроса = "ПолучитьДанные" И Ответ <> "нет записей" Тогда
			Результат = СформироватьТаблицуРезультат(Ответ);
			Если Результат <> Неопределено Тогда
				ТаблицаЗаголовков = Результат;
			КонецЕсли;
		КонецЕсли;
		
	Исключение
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Возникла исключительная ошибка при выполнении запроса: %1.
		|Подробнее: %2'"), SUI_SimpleКлиентСервер.Представление(), КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));	
	КонецПопытки;
	
КонецФункции

&НаСервереБезКонтекста
Функция СформироватьТаблицуРезультат(Знач ТекстJSON)
	
	ТабДок = Новый ТабличныйДокумент;
	
	ЦветСветлоСерый = Новый Цвет(224, 224, 224);
	ЦветУровень1 = Новый Цвет(248, 242, 216);
	ЦветУровень2 = Новый Цвет(251, 249, 236);
	
	ВесьДокумент = ТабДок.Область("T");
	ВесьДокумент.ЦветРамки = Новый Цвет(204, 192, 133);
	ВесьДокумент.АвтоОтступ = 1;
	
	ТабДок.Область(1, 1).Текст = "Имя";
	ТабДок.Область("C1").ШиринаКолонки = 24;
	
	ОбластьЗаголовки = ТабДок.Область(1, 1, 1, 2);
	ОбластьЗаголовки.ЦветФона = Новый Цвет(244, 236, 197);
	ОбластьЗаголовки.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	ОбластьЗаголовки.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
	
	ТабДок.ФиксацияСверху = 1;
	ТабДок.ФиксацияСлева = 1;
	
	РеквизитыИТаблицы = ПолучитьРеквизитыИТаблицы(ТекстJSON);
	
	ТабДок.Область(1, 2).Текст = "Значение";

	ТекущаяСтрока = 2;
	
	Для Каждого Реквизит Из РеквизитыИТаблицы.Реквизиты Цикл
		ОбластьЯчейки = ТабДок.Область(ТекущаяСтрока, 1);
		Если ТипЗнч(Реквизит.Значение) = Тип("Структура") Тогда
			ОбластьЯчейки.Текст = Реквизит.Ключ;
			ОбластьЯчейки.ЦветФона = ЦветУровень1;
			ТабДок.НачатьГруппуСтрок(, Ложь);
			ТекущаяСтрока = ТекущаяСтрока + 1;
			Для Каждого КлючИЗначение Из Реквизит.Значение Цикл
				ОбластьЯчейки = ТабДок.Область(ТекущаяСтрока, 1);
				ОбластьЯчейки.Текст = КлючИЗначение.Ключ;
				ОбластьЯчейки.ЦветФона = ЦветУровень2;
				ТабДок.Область(ТекущаяСтрока, 2).Текст = КлючИЗначение.Значение;
				ТекущаяСтрока = ТекущаяСтрока + 1;
			КонецЦикла;
			ТабДок.ЗакончитьГруппуСтрок();
		Иначе
			ОбластьЯчейки.Текст = Реквизит.Ключ;
			ОбластьЯчейки.ЦветФона = ЦветУровень2;
			ТабДок.Область(ТекущаяСтрока, 2).Текст = Реквизит.Значение;
			ТекущаяСтрока = ТекущаяСтрока + 1;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Таблица Из РеквизитыИТаблицы.Таблицы Цикл
		
		ОбластьЯчейки = ТабДок.Область(ТекущаяСтрока, 1);
		ОбластьЯчейки.Текст = Таблица.Ключ;
		ОбластьЯчейки.ЦветФона = ЦветУровень1;
		
		ОбластьЯчейки = ТабДок.Область(ТекущаяСтрока, 2);
		ОбластьЯчейки.Текст = "Таблица (" + XMLСтрока(Таблица.Значение.Количество()) + ")";
		ОбластьЯчейки.ЦветФона = ЦветСветлоСерый;
		ОбластьЯчейки.Расшифровка = Таблица.Значение;
		
		ТекущаяСтрока = ТекущаяСтрока + 1;
	КонецЦикла;
	
	ОбластьКолонка = ТабДок.Область("C2");
	ОбластьКолонка.ШиринаКолонки = 40;
	ОбластьКолонка.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Обрезать;
	
	РабочаяОбласть = ТабДок.Область(1, 1, ТабДок.ВысотаТаблицы, ТабДок.ШиринаТаблицы);
	Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
	РабочаяОбласть.ГраницаСправа = Линия;
	РабочаяОбласть.ГраницаСнизу = Линия;
	
	Возврат ТабДок
	
КонецФункции // СформироватьТаблицуРезультат()

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьРеквизитыИТаблицы(СтрокаJSON)
	
	Реквизиты = Новый Структура;
	Таблицы = Новый Структура;
	Результат = Новый Структура("Реквизиты,Таблицы", Реквизиты, Таблицы);
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	Данные = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	Для Каждого КлючИЗначение Из Данные Цикл
		Значение = КлючИЗначение.Значение;
		ТипЗначения = ТипЗнч(Значение);
		Если ТипЗначения = Тип("Строка") И Лев(Значение, 1) = "{" Тогда
			ЧтениеJSON.УстановитьСтроку(СтрЗаменить(Значение, "#", ""));
			РезультатЧтения = ПрочитатьJSON(ЧтениеJSON);
			Если РезультатЧтения.Количество() = 1 И РезультатЧтения.Свойство("value") Тогда
				Если ТипЗнч(РезультатЧтения.value) = Тип("Массив") Тогда
					Таблицы.Вставить(КлючИЗначение.Ключ, РезультатЧтения.value);
				Иначе
					Реквизиты.Вставить(КлючИЗначение.Ключ, РезультатЧтения.value);
				КонецЕсли;
			Иначе
				Реквизиты.Вставить(КлючИЗначение.Ключ, Значение);
			КонецЕсли;
		ИначеЕсли ТипЗначения = Тип("Массив") Тогда
			Таблицы.Вставить(КлючИЗначение.Ключ, Значение);
		Иначе
			Реквизиты.Вставить(КлючИЗначение.Ключ, Значение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат
	
КонецФункции

&НаКлиенте
Процедура ТаблицаЗаголовковПриАктивизации(Элемент)
	
	ТекущаяОбласть = ТаблицаЗаголовков.ТекущаяОбласть;
	Если ТекущаяОбласть.Лево <> ТекущаяОбласть.Право Или ТекущаяОбласть.Верх <> ТекущаяОбласть.Низ
		Или ТекущаяОбласть.ТипОбласти <> ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
		Возврат;
	КонецЕсли;
	
	Расшифровка = ТекущаяОбласть.Расшифровка;
	Если ТипЗнч(Расшифровка) = Тип("Массив") И Расшифровка.Количество() > 0 Тогда
		
		ИменаПолей = Новый Массив;
		Для Каждого СтрРасш Из Расшифровка Цикл
			Для Каждого КлючИЗначение Из СтрРасш Цикл
				Если ИменаПолей.Найти(КлючИЗначение.Ключ) = Неопределено Тогда
					ИменаПолей.Добавить(КлючИЗначение.Ключ);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		ТаблицаСодержание = Новый ТабличныйДокумент;
		
		ВесьДокумент = ТаблицаСодержание.Область("T");
		ВесьДокумент.ЦветРамки = Новый Цвет(204, 192, 133);
		Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
		
		ТаблицаСодержание.Область(1, 1).Текст = "N";
		ТаблицаСодержание.Область("C1").ШиринаКолонки = 6;
		
		Для НомерСтроки = 1 По Расшифровка.Количество() Цикл
			ТаблицаСодержание.Область(НомерСтроки + 1, 1).Текст = НомерСтроки;
		КонецЦикла;
		
		ОбластьЗаголовки = ТаблицаСодержание.Область(1, 1, 1, ИменаПолей.Количество() + 1);
		ОбластьЗаголовки.ЦветФона = Новый Цвет(244, 236, 197);
		ОбластьЗаголовки.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
		ОбластьЗаголовки.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
		
		ТаблицаСодержание.ФиксацияСверху = 1;
		ТаблицаСодержание.ФиксацияСлева = 1;
		
		НомерКолонки = 2;
		
		Для Каждого ИмяПоля Из ИменаПолей Цикл
			
			ТаблицаСодержание.Область(1, НомерКолонки).Текст = ИмяПоля;
			
			МаксимальнаяДлина = СтрДлина(ИмяПоля);
			
			НомерСтроки = 2;
			Для Каждого Стр Из Расшифровка Цикл
				Если Стр.Свойство(ИмяПоля) Тогда
					МаксимальнаяДлина = Макс(МаксимальнаяДлина, СтрДлина(СтрПолучитьСтроку(Стр[ИмяПоля], 1)));
					ТаблицаСодержание.Область(НомерСтроки, НомерКолонки).Текст = Стр[ИмяПоля]
				КонецЕсли;
				НомерСтроки = НомерСтроки + 1;
			КонецЦикла;
			
			ТаблицаСодержание.Область("C" + XMLСтрока(НомерКолонки)).ШиринаКолонки = Макс(Мин(МаксимальнаяДлина * 1.1, 40), 6);
			
			НомерКолонки = НомерКолонки + 1;
		КонецЦикла;
		
		РабочаяОбласть = ТаблицаСодержание.Область(1, 1, ТаблицаСодержание.ВысотаТаблицы, ТаблицаСодержание.ШиринаТаблицы);
		
		РабочаяОбласть.ГраницаСправа = Линия;
		РабочаяОбласть.ГраницаСнизу = Линия;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьIPАдресПользователя(Знач SUI_МобильныеУстройства = Неопределено, Знач IPАдрес = Неопределено)
	
	Если SUI_МобильныеУстройства.Пустая() Тогда
		Возврат СтрШаблон("%1:%2", IPАдрес, "8095");	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВЫБОР
		|		КОГДА SUI_МобильныеУстройства.IPАдрес ЕСТЬ NULL
		|		ИЛИ SUI_МобильныеУстройства.IPАдрес = ""0.0.0.0""
		|			ТОГДА """"
		|		ИНАЧЕ SUI_МобильныеУстройства.IPАдрес
		|	КОНЕЦ КАК IPАдрес,
		|	ЕСТЬNULL(SUI_МобильныеУстройства.Порт, 0) КАК Порт
		|ИЗ
		|	ПланОбмена.SUI_МобильныеУстройства КАК SUI_МобильныеУстройства
		|ГДЕ
		|	SUI_МобильныеУстройства.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", SUI_МобильныеУстройства);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Если Выборка.Порт = 0 Тогда
			Возврат Выборка.IPАдрес;
		ИначеЕсли Не ПустаяСтрока(Выборка.IPАдрес) Тогда
			Возврат СтрШаблон("%1:%2", Выборка.IPАдрес, Формат(Выборка.Порт,"ЧЦ=5; ЧДЦ=0; ЧГ="));
		Иначе
			Возврат "";
		КонецЕсли;
	
	КонецЕсли;
	
КонецФункции // ПолучитьIPАдресПользователя()

&НаКлиенте
Процедура ИнициализироватьТаблицыМобильногоУстройства()

	НоваяСтрока = ТаблицыДокументов.Добавить();
	НоваяСтрока.НазваниеТаблицы = "RS_docs";
	НоваяСтрока.Колонки = "id_doc, doc_type, doc_n, doc_date,
	|id_countragents, id_warehouse, verified, sent, 
	|add_mark_selection, created_at, control,
	|is_group_scan, is_barc_flow, allow_fact_input,
	|is_completed, barcode, additional_details";
	
	НоваяСтрока = ТаблицыДокументов.Добавить();
	НоваяСтрока.НазваниеТаблицы = "RS_docs_table";
	НоваяСтрока.Колонки = "id, id_doc, 
	|id_good, id_properties, id_series, id_unit, 
	|qtty, d_qtty, qtty_plan,
	|price, id_price, sent,
	|last_updated, is_plan, id_cell, use_series, additional_details";
	
	НоваяСтрока = ТаблицыДокументов.Добавить();
	НоваяСтрока.НазваниеТаблицы = "RS_docs_barcodes";
	НоваяСтрока.Колонки = "id, id_doc, 
	|id_good, id_properties, id_series, id_unit, 
	|mark_code, barcode_from_scanner, is_plan,
	|approved, GTIN, Series";
	
	НоваяСтрока = ТаблицыДокументов.Добавить();
	НоваяСтрока.НазваниеТаблицы = "RS_barc_flow";
	НоваяСтрока.Колонки = "id, id_doc, 
	|barcode, barcode_qtty, last_updated";
	
	НоваяСтрока = ТаблицыДокументов.Добавить();
	НоваяСтрока.НазваниеТаблицы = "RS_adr_docs";
	НоваяСтрока.Колонки = "id_doc, doc_type, doc_n, doc_date,
	|id_warehouse, verified, sent, 
	|add_mark_selection, created_at, control,
	|allow_fact_input, is_completed, barcode, additional_details";
	
		
	НоваяСтрока = ТаблицыДокументов.Добавить();
	НоваяСтрока.НазваниеТаблицы = "RS_adr_docs_table";
	НоваяСтрока.Колонки = "id, id_doc, 
	|id_good, id_properties, id_series, id_unit, 
	|qtty, qtty_plan, sent,
	|last_updated, is_plan, id_cell, table_type, use_series, additional_details";
	
		
	НоваяСтрока = ТаблицыДокументов.Добавить();
	НоваяСтрока.НазваниеТаблицы = "RS_docs_series";
	НоваяСтрока.Колонки = "id, id_doc, 
	|id_good, id_properties, id_series, id_warehouse, 
	|qtty, name, best_before,
	|number, production_date, id_cell";
	
		
	НоваяСтрока = ТаблицыДокументов.Добавить();
	НоваяСтрока.НазваниеТаблицы = "RS_prices";
	НоваяСтрока.Колонки = "id, id_price_types, 
	|id_goods, id_properties, price, id_unit";
	
		
	НоваяСтрока = ТаблицыДокументов.Добавить();
	НоваяСтрока.НазваниеТаблицы = "RS_doc_types";
	НоваяСтрока.Колонки = "doc_type, is_adr_storage";
	
		
	НоваяСтрока = ТаблицыДокументов.Добавить();
	НоваяСтрока.НазваниеТаблицы = "RS_price_types";
	НоваяСтрока.Колонки = "id, name";
	
		
	НоваяСтрока = ТаблицыДокументов.Добавить();
	НоваяСтрока.НазваниеТаблицы = "RS_warehouses";
	НоваяСтрока.Колонки = "id, name";
	
		
	НоваяСтрока = ТаблицыДокументов.Добавить();
	НоваяСтрока.НазваниеТаблицы = "RS_countragents";
	НоваяСтрока.Колонки = "id, name, full_name, inn, kpp";
	
		
	НоваяСтрока = ТаблицыДокументов.Добавить();
	НоваяСтрока.НазваниеТаблицы = "RS_types_goods";
	НоваяСтрока.Колонки = "id, name, use_mark";

		
	НоваяСтрока = ТаблицыДокументов.Добавить();
	НоваяСтрока.НазваниеТаблицы = "RS_goods";
	НоваяСтрока.Колонки = "id, code, name, art, unit, type_good, description, search_string";
	
		
	НоваяСтрока = ТаблицыДокументов.Добавить();
	НоваяСтрока.НазваниеТаблицы = "RS_properties";
	НоваяСтрока.Колонки = "id, id_owner, name";
	
		
	НоваяСтрока = ТаблицыДокументов.Добавить();
	НоваяСтрока.НазваниеТаблицы = "RS_series";
	НоваяСтрока.Колонки = "id, name, best_before, type_goods, number, production_date";
	
		
	НоваяСтрока = ТаблицыДокументов.Добавить();
	НоваяСтрока.НазваниеТаблицы = "RS_classifier_units";
	НоваяСтрока.Колонки = "id, code, name";
	
		
	НоваяСтрока = ТаблицыДокументов.Добавить();
	НоваяСтрока.НазваниеТаблицы = "RS_units";
	НоваяСтрока.Колонки = "id, id_owner, code, name, nominator, denominator, int_reduction";
	
		
	НоваяСтрока = ТаблицыДокументов.Добавить();
	НоваяСтрока.НазваниеТаблицы = "RS_marking_codes";
	НоваяСтрока.Колонки = "id, mark_code, id_good, id_property, id_series, id_unit";
	
		
	НоваяСтрока = ТаблицыДокументов.Добавить();
	НоваяСтрока.НазваниеТаблицы = "RS_barcodes";
	НоваяСтрока.Колонки = "id, barcode, id_good, id_property, id_series, id_unit, ratio";
	
		
	НоваяСтрока = ТаблицыДокументов.Добавить();
	НоваяСтрока.НазваниеТаблицы = "RS_cells";
	НоваяСтрока.Колонки = "id, name, barcode";

		
	НоваяСтрока = ТаблицыДокументов.Добавить();
	НоваяСтрока.НазваниеТаблицы = "RS_employees";
	НоваяСтрока.Колонки = "id, full_name, auth_string";
	
		
	НоваяСтрока = ТаблицыДокументов.Добавить();
	НоваяСтрока.НазваниеТаблицы = "Error_log";
	НоваяСтрока.Колонки = "log, timestamp";
	
КонецПроцедуры

#КонецОбласти
