
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	РазрешитьЗакрытие = Ложь;
	
	ВремяНачалаОбновления = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ВремяНачалаОбновления");
	ВремяОкончанияОбновления = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ВремяОкончанияОбновления");
	КраткоеПредставлениеОшибки = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "КраткоеПредставлениеОшибки");
	ПодробноеПредставлениеОшибки = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ПодробноеПредставлениеОшибки");

	Если ПустаяСтрока(КраткоеПредставлениеОшибки) Тогда
		КраткоеПредставлениеОшибки = НСтр("ru = 'Не удалось получить текст ошибки'");
	КонецЕсли;

	Элементы.НадписьКраткогоПредставленияОшибки.Заголовок = КраткоеПредставлениеОшибки;
	Элементы.ГруппаПодробноеПредставлениеОшибки.Видимость = Не ПустаяСтрока(ПодробноеПредставлениеОшибки);

	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Ошибка обновления данных %1'"), SUI_SimpleКлиентСервер.Представление());
		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

	Если Отказ И ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если Не РазрешитьЗакрытие Тогда
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗавершитьРаботуПрограммы(Команда)
	РазрешитьЗакрытие = Истина;
	Закрыть(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПерезапуститьРаботуПрограммы(Команда)
	РазрешитьЗакрытие = Истина;
	Закрыть(Истина);
КонецПроцедуры

#КонецОбласти
