
#Область ПрограммныйИнтерфейс

Функция ДобавитьПользовательскийОбъект(КоллекцияОбъектов, Имя, Описание = "", ФактическийТип = Неопределено, 
	СсылочныйТип = Неопределено, ИсключитьИзРедактораBSL = Ложь) Экспорт
	
	ПользовательскийОбъект = Новый Структура("name", Имя);
	
	Если СсылочныйТип <> Неопределено Тогда
		ПользовательскийОбъект.Вставить("ref", СсылочныйТип);
	КонецЕсли;
	
	Если Не ПустаяСтрока(Описание) Тогда
		ПользовательскийОбъект.Вставить("description", Описание);
	КонецЕсли;
	
	Если ТипЗнч(ФактическийТип)= Тип("Тип") Или ТипЗнч(ФактическийТип)= Тип("Строка") Тогда
		ПользовательскийОбъект.Вставить("type", ФактическийТип);
	КонецЕсли;
	
	Если ИсключитьИзРедактораBSL Тогда
		ПользовательскийОбъект.Вставить("exclude_bsl");
	КонецЕсли;
	
	КоллекцияОбъектов.Вставить(Имя, ПользовательскийОбъект);
	
	Возврат ПользовательскийОбъект;
	
КонецФункции

Функция ДобавитьСвойствоПользовательскогоОбъекта(ПользовательскийОбъект, Имя, Представление = "", Описание = "", 
	ФактическийТип = Неопределено, СсылочныйТип = Неопределено, ИсключитьИзРедактораBSL = Ложь) Экспорт
	
	СвойствоОбъекта = Новый Структура("name", Имя);
	
	Если Не ПустаяСтрока(Представление) Тогда
		СвойствоОбъекта.Вставить("preview", Представление);
	КонецЕсли;
	
	Если СсылочныйТип <> Неопределено Тогда
		СвойствоОбъекта.Вставить("ref", СсылочныйТип);
	КонецЕсли;
	
	Если Не ПустаяСтрока(Описание) Тогда
		СвойствоОбъекта.Вставить("description", Описание);
	КонецЕсли;
	
	Если ТипЗнч(ФактическийТип)= Тип("Тип") Или ТипЗнч(ФактическийТип)= Тип("Строка") Тогда
		СвойствоОбъекта.Вставить("type", ФактическийТип);
	КонецЕсли;
	
	Если Не ПользовательскийОбъект.Свойство("properties") Тогда
		ПользовательскийОбъект.Вставить("properties", Новый Структура());
	КонецЕсли;
	
	Если ИсключитьИзРедактораBSL Тогда
		СвойствоОбъекта.Вставить("exclude_bsl");
	КонецЕсли;
	
	ПользовательскийОбъект.properties.Вставить(Имя, СвойствоОбъекта);
	
	Возврат СвойствоОбъекта;
	
КонецФункции

#КонецОбласти
