
#Область ПрограммныйИнтерфейс

// Результат успех.
// 
// Параметры:
//  Данные - Произвольный - Данные
//  КодСостояния - Число - Код состояния
// 
// Возвращаемое значение:
//  Структура - Результат успех:
// * КодСостояния - Число - Код состояния
// * Данные - Произвольный - Данные успешного ответа
// * Заголовки - Соответствие - Дополнительные заголовки успешного ответа
//@skip-check doc-comment-collection-item-type
Функция РезультатУспех(Данные, КодСостояния = 200) Экспорт
	
	Результат = СтруктураРезультата(КодСостояния, Данные);
	
	Если Результат.КодСостояния < 200 Или Результат.КодСостояния > 299 Тогда
		Результат.КодСостояния = 200;
	КонецЕсли;
	
	//@skip-check constructor-function-return-section
	Возврат Результат
	
КонецФункции

// Результат ошибка.
// 
// Параметры:
//  Ошибка - ИнформацияОбОшибке, Строка, Массив, ФиксированныйМассив, Структура, ФиксированнаяСтруктура, Соответствие, ФиксированноеСоответствие - Ошибка
//  КодСостояния - Число - Код состояния
// 
// Возвращаемое значение:
//  Структура - Результат ошибка:
// * КодСостояния - Число - Код состояния
// * Данные - Структура - Данные ошибки:
// ** error - Строка - Текстовое представление ошибки
// ** errors - Массив, ФиксированныйМассив, Структура, ФиксированнаяСтруктура, Соответствие, ФиксированноеСоответствие - Коллекция из строк переданных ошибок в параметре ошибка
// * Заголовки - Соответствие - Дополнительные заголовки ответа ошибки
//@skip-check doc-comment-collection-item-type
Функция РезультатОшибка(Ошибка, КодСостояния = 500) Экспорт
	
	ТипОшибки = ТипЗнч(Ошибка);
	
	СтруктураОшибки = Новый Структура("error");
	
	Если ТипОшибки = Тип("ИнформацияОбОшибке") Тогда
		СтруктураОшибки.error = Строка(ОбработкаОшибок.ПредставлениеОшибкиДляПользователя(Ошибка));
	ИначеЕсли ТипОшибки = Тип("Строка") Тогда
		СтруктураОшибки.error = Ошибка;
	ИначеЕсли ТипОшибки = Тип("Массив") Или ТипОшибки = Тип("ФиксированныйМассив") Или
		ТипОшибки = Тип("Структура") Или ТипОшибки = Тип("ФиксированнаяСтруктура") Или
		ТипОшибки = Тип("Соответствие") Или ТипОшибки = Тип("ФиксированноеСоответствие") Тогда
		СтруктураОшибки.error = НСтр("ru = 'Есть ошибки'");
		СтруктураОшибки.Вставить("errors", Ошибка);
	Иначе
		СтруктураОшибки.error = СтрШаблон(НСтр("ru = 'Не удалось обработать ошибку (Тип ошибки: %1)'"), ТипОшибки);
	КонецЕсли;
	
	Результат = СтруктураРезультата(КодСостояния, СтруктураОшибки);
	
	Если Результат.КодСостояния < 400 Или Результат.КодСостояния > 599 Тогда
		Результат.КодСостояния = 500;
	КонецЕсли;
	
	//@skip-check constructor-function-return-section
	Возврат Результат
	
КонецФункции

// Добавить заголовок в результат.
// 
// Параметры:
//  Результат - Структура - Результат см. SUI_HTTPСервис.РезультатУспех или см. SUI_HTTPСервис.РезультатОшибка
//  Имя - Строка - Имя заголовка
//  Значение - Строка, Число, Булево, Дата - Значение заголовка
Процедура ДобавитьЗаголовокВРезультат(Результат, Имя, Значение) Экспорт
	
	Результат.Заголовки.Вставить(Имя, SUI_ОбщегоНазначенияКлиентСервер.ПривестиКПростомуТипу(Значение));
	
КонецПроцедуры

Функция ПрочитатьКакGZip(Знач Данные, ВернутьСтрокой = Ложь) Экспорт
	
	ОписаниеТипаДвоичныеДанные = Новый ОписаниеТипов("ДвоичныеДанные");
	Если ЗначениеЗаполнено(ОписаниеТипаДвоичныеДанные.ПривестиЗначение(Данные)) Тогда
		Данные = SUI_HTTPКонектор.ПрочитатьGZip(Данные);
	Иначе
		Данные = ОписаниеТипаДвоичныеДанные.ПривестиЗначение(Неопределено);
	КонецЕсли;
	
	Если ВернутьСтрокой Тогда
		Данные = ПолучитьСтрокуИзДвоичныхДанных(Данные);
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции

Функция ЗаписатьКакGZip(Данные) Экспорт
	
	ОписаниеТипаДвоичныеДанные = Новый ОписаниеТипов("ДвоичныеДанные");
	Если ЗначениеЗаполнено(ОписаниеТипаДвоичныеДанные.ПривестиЗначение(Данные)) Тогда
		Возврат SUI_HTTPКонектор.ЗаписатьGZip(Данные);
	Иначе
		Возврат ОписаниеТипаДвоичныеДанные.ПривестиЗначение(Неопределено);
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Сформировать HTTP ответ по результату.
// 
// Параметры:
//  Результат - Структура - Результат см. SUI_HTTPСервис.РезультатУспех или см. SUI_HTTPСервис.РезультатОшибка
//  ЗаголовкиHTTPЗапроса - ФиксированноеСоответствие - Заголовки HTTP запроса
// 
// Возвращаемое значение:
//  HTTPСервисОтвет - HTTP ответ
//@skip-check doc-comment-collection-item-type
Функция СформироватьHTTPОтвет(Знач Результат, ЗаголовкиHTTPЗапроса) Экспорт
	
	HTTPОтвет = Новый HTTPСервисОтвет(Результат.КодСостояния);

	HTTPОтвет.Заголовки.Вставить("Content-Type", 	"application/json; charset=utf-8");
	HTTPОтвет.Заголовки.Вставить("Cache-Control", 	"no-cache");

	Если Результат.Заголовки <> Неопределено Тогда
		
		Для Каждого Заголовок Из Результат.Заголовки Цикл
			HTTPОтвет.Заголовки.Вставить(Заголовок.Ключ, Заголовок.Значение);
		КонецЦикла;
		
	КонецЕсли;
	
	ТипДанных = ТипЗнч(Результат.Данные);
	
	Если ТипДанных <> Тип("ДвоичныеДанные") И ТипДанных <> Тип("Строка") Тогда
		Результат.Данные = СтрокаJSON(Результат.Данные);
		ТипДанных = Тип("Строка");
	КонецЕсли;
	
	СжатьДанные = SUI_HTTPСервисКлиентСервер.ИспользуетсяСжатие(ЗаголовкиHTTPЗапроса);
	
	Если СжатьДанные И ТипДанных = Тип("Строка") И Не ПустаяСтрока(Результат.Данные) Тогда
		Результат.Данные = ПолучитьДвоичныеДанныеИзСтроки(Результат.Данные, КодировкаТекста.UTF8, Ложь);
		ТипДанных = Тип("ДвоичныеДанные");
	КонецЕсли;
	
	Если СжатьДанные И ТипДанных = Тип("ДвоичныеДанные") Тогда
		Результат.Данные = ЗаписатьКакGZip(Результат.Данные);
		HTTPОтвет.Заголовки.Вставить("Content-Encoding", "gzip");
	КонецЕсли;
	
	Если ТипДанных = Тип("ДвоичныеДанные") Тогда
		HTTPОтвет.УстановитьТелоИзДвоичныхДанных(Результат.Данные);
		HTTPОтвет.Заголовки.Вставить("Content-Disposition", "attachment");
	Иначе
		HTTPОтвет.УстановитьТелоИзСтроки(Результат.Данные, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	КонецЕсли;
	
	Возврат HTTPОтвет;
	
КонецФункции

// Функция - Сформировать ответ перенаправление
//
// Параметры:
//  HTTPСервисЗапрос - HTTPСервисЗапрос - HTTP запрос 
//  РесурсНаправление - Строка - Путь перенаправления
// 
// Возвращаемое значение:
//  HTTPСервисОтвет - HTTP ответ перенаправления
//
Функция СформироватьОтветПеренаправление(HTTPСервисЗапрос, РесурсНаправление) Экспорт 
	
	Ответ = Новый HTTPСервисОтвет(301);
	
	Для Каждого Заголовок Из HTTPСервисЗапрос.Заголовки Цикл
		Ответ.Заголовки.Вставить(Заголовок.Ключ, Заголовок.Значение);
	КонецЦикла;

	ПараметрыЗапроса = Новый Массив();	
	Для Каждого ПараметрЗапроса Из HTTPСервисЗапрос.ПараметрыЗапроса Цикл
		ПараметрыЗапроса.Добавить(ПараметрЗапроса.Ключ + "=" + ПараметрЗапроса.Значение);
	КонецЦикла;
	
	Ответ.Заголовки.Вставить("Location", HTTPСервисЗапрос.БазовыйURL + РесурсНаправление 
		+ ?(ЗначениеЗаполнено(ПараметрыЗапроса), "?" + СтрСоединить(ПараметрыЗапроса, "&"), ""));
		
	Ответ.УстановитьТелоИзСтроки(HTTPСервисЗапрос.ПолучитьТелоКакСтроку(), КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
		
	Возврат Ответ;
	
КонецФункции

// Параметры обработки HTTPСервис запроса.
// 
// Возвращаемое значение:
//  Структура - Параметры обработки HTTPСервис запроса:
// * ВосстанавливатьСсылкиИдентификаторов - Булево - Восстановить ссылки из идентификаторов Simple
// * ПроверятьСсылкиПриВосстановлении - Булево - Выполнять проверку ссылки при восстановлении из идентификаторов Simple
// * ПрочитатьПараметрыИзТела - Булево - Прочитать параметры из тела запроса
// * ИменаПараметровДатыВТеле - Строка - Имена параметров дат в теле запроса
Функция ПараметрыОбработкиЗапроса() Экспорт
	
	ПараметрыОбработки = Новый Структура();
	
	ПараметрыОбработки.Вставить("ВосстанавливатьСсылкиИдентификаторов", Истина);
	ПараметрыОбработки.Вставить("ПроверятьСсылкиПриВосстановлении", Истина);
	ПараметрыОбработки.Вставить("ПрочитатьПараметрыИзТела", Ложь);
	ПараметрыОбработки.Вставить("ИменаПараметровДатыВТеле", "");
	
	Возврат ПараметрыОбработки;
	
КонецФункции

// Обработать HTTPСервис запрос.
// 
// Параметры:
//  Запрос - HTTPСервисЗапрос - Запрос HTTP сервиса
//  ПараметрыОбработки - Структура - Параметры обработки запроса см.SUI_HTTPСервис.ПараметрыОбработкиЗапроса
// 
// Возвращаемое значение:
//  Структура - Обработать HTTPСервис запрос:
// * Заголовки - Соответствие из Произвольный - Заголовки запроса
// * Параметры - Соответствие из Произвольный - Параметры запроса
// * Тело - Строка - Тело запроса
// * ЕстьБазовыеПраваБСП - Булево - Наличие базовых прав БСП
// * РезультатОтвет - Структура, Неопределено - 
// * МобильноеУстройство - Структура - :
// ** Ссылка - ПланОбменаСсылка.SUI_МобильныеУстройства - Ссылка на мобильное устройство
// ** Идентификатор - Строка - Идентификатор мобильного устройства
// ** ВерсияПриложения - Строка - Версия мобильного приложения
// ** ОтключитьЛогирование - Булево - Признак отключения логирования для мобильного устройства
Функция ОбработатьЗапрос(Запрос, ПараметрыОбработки = Неопределено) Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("Заголовки", 			Новый ФиксированноеСоответствие(Новый Соответствие()));
	Результат.Вставить("Параметры", 			Новый ФиксированноеСоответствие(Новый Соответствие()));
	Результат.Вставить("Тело", 					"");
	Результат.Вставить("ЕстьБазовыеПраваБСП", 	Ложь);
	Результат.Вставить("РезультатОтвет");
	
	РезультатМобильноеУстройство = Новый Структура();
	РезультатМобильноеУстройство.Вставить("Ссылка", 				ПланыОбмена.SUI_МобильныеУстройства.ПустаяСсылка());
	РезультатМобильноеУстройство.Вставить("Идентификатор", 			"");
	РезультатМобильноеУстройство.Вставить("ВерсияПриложения", 		"");
	РезультатМобильноеУстройство.Вставить("ОтключитьЛогирование", 	Ложь);
	Результат.Вставить("МобильноеУстройство", РезультатМобильноеУстройство);
	
	Если ПараметрыОбработки = Неопределено Тогда
		ПараметрыОбработки = ПараметрыОбработкиЗапроса();
	КонецЕсли;
	
	Попытка
		
		Результат.ЕстьБазовыеПраваБСП = SUI_ИнтеграцияВКонфигурацию.ЕстьБазовыеПраваБСП();
		
		Если Не Результат.ЕстьБазовыеПраваБСП Тогда
			Результат.РезультатОтвет = РезультатОшибка(НСтр("ru = 'Отсутствуют базовые права БСП.'"), 403);
		Иначе
			
			// Скопировать заголовки запроса
			Результат.Заголовки = ОбщегоНазначения.СкопироватьРекурсивно(Запрос.Заголовки, Истина);
			
			// Прочитать тело запроса
			Результат.Тело = SUI_HTTPСервисКлиентСервер.ПолучитьТелоИзHTTPСервисЗапросОтвет(Запрос);
			
			// Прочитать параметры запроса
			Результат.Параметры = ПрочитатьПараметрыЗапроса(Запрос, ПараметрыОбработки, Результат.Тело);
			
			// Получить идентификатор устройства
			Результат.МобильноеУстройство.Идентификатор = SUI_HTTPСервисКлиентСервер
				.ПолучитьИдентификаторУстройства(Результат.Заголовки);
			
			// Получить версию приложения
			Результат.МобильноеУстройство.ВерсияПриложения = SUI_HTTPСервисКлиентСервер
				.ПолучитьВерсиюПриложения(Результат.Заголовки);
			
			// Получить наименование пользователя user-name
			НаименованиеПользователя = SUI_ОбщегоНазначения.ОписаниеТипаСтрока(100).ПривестиЗначение(
				Результат.Параметры.Получить("user-name"));
			
			// Заполнить данные мобильного устройства
			ДанныеМобильногоУстройства = ПолучитьДанныеМобильногоУстройства(
				Результат.МобильноеУстройство.Идентификатор, НаименованиеПользователя);
			ЗаполнитьЗначенияСвойств(Результат.МобильноеУстройство, ДанныеМобильногоУстройства);
			
			Если ДанныеМобильногоУстройства.Свойство("Ошибка") Тогда
				Результат.РезультатОтвет = РезультатОшибка(
					ДанныеМобильногоУстройства.Ошибка.Текст, ДанныеМобильногоУстройства.Ошибка.Код);
			Иначе
				// Записать сеанс мобильного устройства
				SUI_МобильныеУстройстваСервер.ЗаписатьСеанс(
					Результат.МобильноеУстройство.Ссылка,
					Результат.МобильноеУстройство.ВерсияПриложения);
			КонецЕсли;
			
		КонецЕсли;
		
	Исключение
		Ошибка = ИнформацияОбОшибке();
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(
			SUI_HTTPСервисКлиентСервер.ИмяСобытия(НСтр("ru = 'Обработка входящего запроса'")), , 
			Метаданные.ОбщиеМодули.SUI_HTTPСервис, , Ошибка);
		Результат.РезультатОтвет = РезультатОшибка(ОбработкаОшибок.КраткоеПредставлениеОшибки(Ошибка), 500);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#Область JSON

Функция СтрокаJSON(Данные) Экспорт
	
	Если ТипыКПреобразованиюВJSON().Найти(ТипЗнч(Данные)) = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(, Символы.Таб));
	ЗаписатьJSON(ЗаписьJSON, Данные, , "ПреобразованиеДанныхJSON", SUI_ОбщегоНазначения);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

Функция ТипыКПреобразованиюВJSON() Экспорт
	
	Типы = Новый Массив();
	
	Типы.Добавить(Тип("Строка"));
	Типы.Добавить(Тип("Число"));
	Типы.Добавить(Тип("Булево"));
	Типы.Добавить(Тип("Дата"));
	Типы.Добавить(Тип("Структура"));
	Типы.Добавить(Тип("ФиксированнаяСтруктура"));
	Типы.Добавить(Тип("Соответствие"));
	Типы.Добавить(Тип("ФиксированноеСоответствие"));
	Типы.Добавить(Тип("Массив"));
	Типы.Добавить(Тип("ФиксированныйМассив"));
	
	Возврат Новый ФиксированныйМассив(Типы);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СтруктураРезультата(КодСостояния, Данные)
	
	СтруктураРезультата = Новый Структура();
	
	СтруктураРезультата.Вставить("КодСостояния", 
		SUI_ОбщегоНазначения.ОписаниеТипаЧисло(3, 0, ДопустимыйЗнак.Неотрицательный).ПривестиЗначение(КодСостояния));
	СтруктураРезультата.Вставить("Данные", Данные);
	СтруктураРезультата.Вставить("Заголовки", Новый Соответствие());
	
	Возврат СтруктураРезультата;
	
КонецФункции

Функция ПолучитьДанныеМобильногоУстройства(ИдентификаторУстройства, НаименованиеПользователя = "")
	
	Результат = Новый Структура();
	Результат.Вставить("Ссылка", ПланыОбмена.SUI_МобильныеУстройства.ПустаяСсылка());
	Результат.Вставить("ОтключитьЛогирование", Ложь);
	
	Ошибка = Новый Структура();
	Ошибка.Вставить("Код", 0);
	Ошибка.Вставить("Текст", "");
	
	Если ПустаяСтрока(ИдентификаторУстройства) Тогда
		Ошибка.Код = 400;
		Ошибка.Текст = НСтр("ru = 'Не удалось определить идентификатор мобильного устройства.'");
	КонецЕсли;
	
	Если Ошибка.Код = 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ИдентификаторУстройства", ИдентификаторУстройства);
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Ссылка,
			|	ОтключитьЛогирование,
			|	ПометкаУдаления
			|ИЗ
			|	ПланОбмена.SUI_МобильныеУстройства
			|ГДЕ
			|	Код = &ИдентификаторУстройства
			|	И НЕ ЭтотУзел";
		
		ПакетыЗапроса = Новый Структура();
		ПакетыЗапроса.Вставить("Данные", 0);
		
		Если ПолучитьФункциональнуюОпцию("SUI_ИспользоватьЗапросыАвторизацииМУ") Тогда
			
			Запрос.Текст = Запрос.Текст + 
				ОбщегоНазначения.РазделительПакетаЗапросов() + 
				"ВЫБРАТЬ ПЕРВЫЕ 1
				|	ИдентификаторУстройства
				|ИЗ
				|	РегистрСведений.SUI_ЗапросыАвторизацииМобильныхУстройств
				|ГДЕ
				|	ИдентификаторУстройства = &ИдентификаторУстройства";
			
			ПакетыЗапроса.Вставить("ЗапросыАвторизации", 1);
			
		КонецЕсли;
		
		РезультатыЗапроса = Запрос.ВыполнитьПакет();
		
		Если Не РезультатыЗапроса[ПакетыЗапроса.Данные].Пустой() Тогда
			
			Выборка = РезультатыЗапроса[ПакетыЗапроса.Данные].Выбрать();
			Выборка.Следующий();
			ЗаполнитьЗначенияСвойств(Результат, Выборка);
			
			Если Выборка.ПометкаУдаления Тогда
				Ошибка.Код = 403;
				Ошибка.Текст = НСтр("ru = 'Доступ запрещен. Мобильное устройство заблокировано.'");
			КонецЕсли;
			
		КонецЕсли;
		
		Если Ошибка.Код = 0 И Результат.Ссылка.Пустая() Тогда
			
			// Создать запрос авторизации
			Если ПакетыЗапроса.Свойство("ЗапросыАвторизации") Тогда
				
				Если РезультатыЗапроса[ПакетыЗапроса.ЗапросыАвторизации].Пустой() Тогда
					SUI_МобильныеУстройстваСервер.СоздатьЗапросАвторизации(ИдентификаторУстройства, НаименованиеПользователя);
				КонецЕсли;
				
				Ошибка.Код = 403;
				Ошибка.Текст = НСтр("ru = 'Запрос авторизации принят. Ожидайте подтверждения администратором.'");
				
			// Создать мобильное устройство
			Иначе
				
				Результат.Ссылка = SUI_МобильныеУстройстваСервер.СоздатьМобильноеУстройство(
					ИдентификаторУстройства, НаименованиеПользователя);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Ошибка.Код > 0 Тогда
		Результат.Вставить("Ошибка", Ошибка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПрочитатьПараметрыЗапроса(Запрос, ПараметрыОбработкиЗапроса, ТелоЗапроса)
	
	ПараметрыЗапроса = Новый Соответствие();
	
	Для Каждого ПараметрURL Из Запрос.ПараметрыURL Цикл
		ПараметрыЗапроса.Вставить(ПараметрURL.Ключ, ПараметрURL.Значение);
	КонецЦикла;
	
	Для Каждого ПараметрЗапроса Из Запрос.ПараметрыЗапроса Цикл
		ПараметрыЗапроса.Вставить(ПараметрЗапроса.Ключ, ПараметрЗапроса.Значение);
	КонецЦикла;
	
	Если ПараметрыОбработкиЗапроса.ПрочитатьПараметрыИзТела И Не ПустаяСтрока(ТелоЗапроса) Тогда
		
		ИменаСвойствДатыВТелеЗапроса = ПараметрыОбработкиЗапроса.ИменаПараметровДатыВТеле;
		
		ТипИменаПараметровДаты = ТипЗнч(ИменаСвойствДатыВТелеЗапроса);
		
		Если ТипИменаПараметровДаты = Тип("Строка") Тогда
			ИменаСвойствДатыВТелеЗапроса = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(
				ИменаСвойствДатыВТелеЗапроса, , Истина, Истина);
		ИначеЕсли ТипИменаПараметровДаты <> Тип("Массив") Тогда
			ИменаСвойствДатыВТелеЗапроса = Новый Массив();
		КонецЕсли;
		
		ПараметрыИзТелаЗапроса = SUI_ОбщегоНазначенияКлиентСервер.ДанныеИзСтрокиJSON(
			ТелоЗапроса, Ложь, ИменаСвойствДатыВТелеЗапроса);
		
		Если ТипЗнч(ПараметрыИзТелаЗапроса) = Тип("Структура") Тогда
			
			Для Каждого ПараметрИзТелаЗапроса Из ПараметрыИзТелаЗапроса Цикл
				ПараметрыЗапроса.Вставить(ПараметрИзТелаЗапроса.Ключ, ПараметрИзТелаЗапроса.Значение);
			КонецЦикла;
			
		КонецЕсли;

	КонецЕсли;
	
	Если ПараметрыОбработкиЗапроса.ВосстанавливатьСсылкиИдентификаторов Тогда
		SUI_ИнтеграцияВКонфигурацию.ВосстановитьСсылкиИдентификаторовSimple(ПараметрыЗапроса, , 
			ПараметрыОбработкиЗапроса.ПроверятьСсылкиПриВосстановлении);
	КонецЕсли;
	
	Возврат Новый ФиксированноеСоответствие(ПараметрыЗапроса);
		
КонецФункции

#КонецОбласти
