
#Область ПрограммныйИнтерфейс

// HTTPШаблоны расширения.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - HTTPШаблоны расширения:
// * Имя - Строка - Имя шаблона
// * Синоним - Строка - Синоним шаблона
// * Шаблон - Строка - Адрес шаблона
Функция HTTPШаблоныРасширения() Экспорт 
	
	Шаблоны = Новый ТаблицаЗначений();
	Шаблоны.Колонки.Добавить("Имя", 	ОбщегоНазначения.ОписаниеТипаСтрока(150), НСтр("ru = 'Имя'"));
	Шаблоны.Колонки.Добавить("Синоним", ОбщегоНазначения.ОписаниеТипаСтрока(150), НСтр("ru = 'Синоним'"));
	Шаблоны.Колонки.Добавить("Шаблон", 	ОбщегоНазначения.ОписаниеТипаСтрока(200), НСтр("ru = 'URL'"));
	
	ШаблоныРасширения = SUI_HTTPСервисПовтИсп.ШаблоныРасширения();
	
	Для Каждого ШаблонРасширения Из ШаблоныРасширения Цикл
		ЗаполнитьЗначенияСвойств(Шаблоны.Добавить(), ШаблонРасширения.Значение);
	КонецЦикла;
	
	Возврат Шаблоны;
	
КонецФункции

// Результат успех.
// 
// Параметры:
//  Данные - Произвольный - Данные
//  КодСостояния - Число - Код состояния
// 
// Возвращаемое значение:
//  Структура - Результат успех:
// * КодСостояния - Число - Код состояния
// * Данные - Произвольный - Данные успешного ответа
// * Заголовки - Соответствие - Дополнительные заголовки успешного ответа
//@skip-check doc-comment-collection-item-type
Функция РезультатУспех(Данные, КодСостояния = 200) Экспорт
	
	Результат = СтруктураРезультата(КодСостояния, Данные);
	
	Если Результат.КодСостояния < 200 Или Результат.КодСостояния > 299 Тогда
		Результат.КодСостояния = 200;
	КонецЕсли;
	
	//@skip-check constructor-function-return-section
	Возврат Результат
	
КонецФункции

// Результат ошибка.
// 
// Параметры:
//  Ошибка - ИнформацияОбОшибке, Строка, Массив, ФиксированныйМассив, Структура, ФиксированнаяСтруктура, Соответствие, ФиксированноеСоответствие - Ошибка
//  КодСостояния - Число - Код состояния
// 
// Возвращаемое значение:
//  Структура - Результат ошибка:
// * КодСостояния - Число - Код состояния
// * Данные - Структура - Данные ошибки:
// ** error - Строка - Текстовое представление ошибки
// ** errors - Массив, ФиксированныйМассив, Структура, ФиксированнаяСтруктура, Соответствие, ФиксированноеСоответствие - Коллекция из строк переданных ошибок в параметре ошибка
// * Заголовки - Соответствие - Дополнительные заголовки ответа ошибки
//@skip-check doc-comment-collection-item-type
Функция РезультатОшибка(Ошибка, КодСостояния = 500) Экспорт
	
	ТипОшибки = ТипЗнч(Ошибка);
	
	СтруктураОшибки = Новый Структура("error");
	
	Если ТипОшибки = Тип("ИнформацияОбОшибке") Тогда
		СтруктураОшибки.error = Строка(ОбработкаОшибок.ПредставлениеОшибкиДляПользователя(Ошибка));
	ИначеЕсли ТипОшибки = Тип("Строка") Тогда
		СтруктураОшибки.error = Ошибка;
	ИначеЕсли ТипОшибки = Тип("Массив") Или ТипОшибки = Тип("ФиксированныйМассив") Или
		ТипОшибки = Тип("Структура") Или ТипОшибки = Тип("ФиксированнаяСтруктура") Или
		ТипОшибки = Тип("Соответствие") Или ТипОшибки = Тип("ФиксированноеСоответствие") Тогда
		СтруктураОшибки.error = НСтр("ru = 'Есть ошибки'");
		СтруктураОшибки.Вставить("errors", Ошибка);
	Иначе
		СтруктураОшибки.error = СтрШаблон(НСтр("ru = 'Не удалось обработать ошибку (Тип ошибки: %1)'"), ТипОшибки);
	КонецЕсли;
	
	Результат = СтруктураРезультата(КодСостояния, СтруктураОшибки);
	
	Если Результат.КодСостояния < 400 Или Результат.КодСостояния > 599 Тогда
		Результат.КодСостояния = 500;
	КонецЕсли;
	
	//@skip-check constructor-function-return-section
	Возврат Результат
	
КонецФункции

// Добавить заголовок в результат.
// 
// Параметры:
//  Результат - Структура - Результат см. SUI_HTTPСервис.РезультатУспех или см. SUI_HTTPСервис.РезультатОшибка
//  Имя - Строка - Имя заголовка
//  Значение - Строка, Число, Булево, Дата - Значение заголовка
Процедура ДобавитьЗаголовокВРезультат(Результат, Имя, Значение) Экспорт
	
	Результат.Заголовки.Вставить(Имя, SUI_ОбщегоНазначенияКлиентСервер.ПривестиКПростомуТипу(Значение));
	
КонецПроцедуры

Функция ИспользуетсяСжатие(Заголовки) Экспорт
	Возврат (СтрНайти(SUI_ОбщегоНазначенияКлиентСервер.ЗначениеСоответствия(Заголовки, "Content-Encoding", "", Тип("Строка")), "gzip") > 0
		Или СтрНайти(SUI_ОбщегоНазначенияКлиентСервер.ЗначениеСоответствия(Заголовки, "Simple-Content-Encoding", "", Тип("Строка")), "gzip") > 0);
КонецФункции

Функция ПрочитатьКакGZip(Знач Данные, ВернутьСтрокой = Ложь) Экспорт
	
	ОписаниеТипаДвоичныеДанные = Новый ОписаниеТипов("ДвоичныеДанные");
	Если ЗначениеЗаполнено(ОписаниеТипаДвоичныеДанные.ПривестиЗначение(Данные)) Тогда
		Данные = SUI_HTTPКонектор.ПрочитатьGZip(Данные);
	Иначе
		Данные = ОписаниеТипаДвоичныеДанные.ПривестиЗначение(Неопределено);
	КонецЕсли;
	
	Если ВернутьСтрокой Тогда
		Данные = ПолучитьСтрокуИзДвоичныхДанных(Данные);
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции

Функция ЗаписатьКакGZip(Данные) Экспорт
	
	ОписаниеТипаДвоичныеДанные = Новый ОписаниеТипов("ДвоичныеДанные");
	Если ЗначениеЗаполнено(ОписаниеТипаДвоичныеДанные.ПривестиЗначение(Данные)) Тогда
		Возврат SUI_HTTPКонектор.ЗаписатьGZip(Данные);
	Иначе
		Возврат ОписаниеТипаДвоичныеДанные.ПривестиЗначение(Неопределено);
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Сформировать HTTP ответ по результату.
// 
// Параметры:
//  Результат - Структура - Результат см. SUI_HTTPСервис.РезультатУспех или см. SUI_HTTPСервис.РезультатОшибка
//  ЗаголовкиHTTPЗапроса - ФиксированноеСоответствие - Заголовки HTTP запроса
// 
// Возвращаемое значение:
//  HTTPСервисОтвет - HTTP ответ
//@skip-check doc-comment-collection-item-type
Функция СформироватьHTTPОтвет(Знач Результат, ЗаголовкиHTTPЗапроса) Экспорт
	
	HTTPОтвет = Новый HTTPСервисОтвет(Результат.КодСостояния);

	HTTPОтвет.Заголовки.Вставить("Content-Type", 	"application/json; charset=utf-8");
	HTTPОтвет.Заголовки.Вставить("Cache-Control", 	"no-cache");

	Если Результат.Заголовки <> Неопределено Тогда
		
		Для Каждого Заголовок Из Результат.Заголовки Цикл
			HTTPОтвет.Заголовки.Вставить(Заголовок.Ключ, Заголовок.Значение);
		КонецЦикла;
		
	КонецЕсли;
	
	ТипДанных = ТипЗнч(Результат.Данные);
	
	Если ТипДанных <> Тип("ДвоичныеДанные") И ТипДанных <> Тип("Строка") Тогда
		Результат.Данные = СтрокаJSON(Результат.Данные);
		ТипДанных = Тип("Строка");
	КонецЕсли;
	
	СжатьДанные = SUI_HTTPСервисКлиентСервер.ИспользуетсяСжатие(ЗаголовкиHTTPЗапроса);
	
	Если СжатьДанные И ТипДанных = Тип("Строка") И Не ПустаяСтрока(Результат.Данные) Тогда
		Результат.Данные = ПолучитьДвоичныеДанныеИзСтроки(Результат.Данные, КодировкаТекста.UTF8, Ложь);
		ТипДанных = Тип("ДвоичныеДанные");
	КонецЕсли;
	
	Если СжатьДанные И ТипДанных = Тип("ДвоичныеДанные") Тогда
		Результат.Данные = ЗаписатьКакGZip(Результат.Данные);
		HTTPОтвет.Заголовки.Вставить("Content-Encoding", "gzip");
	КонецЕсли;
	
	Если ТипДанных = Тип("ДвоичныеДанные") Тогда
		HTTPОтвет.УстановитьТелоИзДвоичныхДанных(Результат.Данные);
		HTTPОтвет.Заголовки.Вставить("Content-Disposition", "attachment");
	Иначе
		HTTPОтвет.УстановитьТелоИзСтроки(Результат.Данные, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	КонецЕсли;
	
	Возврат HTTPОтвет;
	
КонецФункции

// Функция - Сформировать ответ перенаправление
//
// Параметры:
//  HTTPСервисЗапрос - HTTPСервисЗапрос - HTTP запрос 
//  РесурсНаправление - Строка - Путь перенаправления
// 
// Возвращаемое значение:
//  HTTPСервисОтвет - HTTP ответ перенаправления
//
Функция СформироватьОтветПеренаправление(HTTPСервисЗапрос, РесурсНаправление) Экспорт 
	
	Ответ = Новый HTTPСервисОтвет(301);
	
	Для Каждого Заголовок Из HTTPСервисЗапрос.Заголовки Цикл
		Ответ.Заголовки.Вставить(Заголовок.Ключ, Заголовок.Значение);
	КонецЦикла;

	ПараметрыЗапроса = Новый Массив();	
	Для Каждого ПараметрЗапроса Из HTTPСервисЗапрос.ПараметрыЗапроса Цикл
		ПараметрыЗапроса.Добавить(ПараметрЗапроса.Ключ + "=" + ПараметрЗапроса.Значение);
	КонецЦикла;
	
	Ответ.Заголовки.Вставить("Location", HTTPСервисЗапрос.БазовыйURL + РесурсНаправление 
		+ ?(ЗначениеЗаполнено(ПараметрыЗапроса), "?" + СтрСоединить(ПараметрыЗапроса, "&"), ""));
		
	Ответ.УстановитьТелоИзСтроки(HTTPСервисЗапрос.ПолучитьТелоКакСтроку(), КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
		
	Возврат Ответ;
	
КонецФункции

// Обработать входящий запрос.
// 
// Параметры:
//  HTTPСервисЗапрос - HTTPСервисЗапрос - HTTP запрос
//  ПараметрыОбработкиВходящегоЗапроса - Структура - см. SUI_HTTPСервисКлиентСервер.ПараметрыОбработкиВходящегоЗапроса
//
// Возвращаемое значение:
//  Структура - Данные HTTP запроса
//@skip-check doc-comment-complex-type-with-link
Функция ОбработатьВходящийЗапрос(HTTPСервисЗапрос, Знач ПараметрыОбработкиВходящегоЗапроса = Неопределено) Экспорт
	
	Если ПараметрыОбработкиВходящегоЗапроса = Неопределено Тогда
		ПараметрыОбработкиВходящегоЗапроса = SUI_HTTPСервисКлиентСервер.ПараметрыОбработкиВходящегоЗапроса();
	КонецЕсли;
	
	ДанныеЗапроса = Новый Структура();
	ДанныеЗапроса.Вставить("РезультатОтвет");
	ДанныеЗапроса.Вставить("ИмяПользователя",
		ОбщегоНазначения.ОписаниеТипаСтрока(100).ПривестиЗначение(HTTPСервисЗапрос.ПараметрыЗапроса.Получить("user-name")));
	ДанныеЗапроса.Вставить("Заголовки", HTTPСервисЗапрос.Заголовки);
	ДанныеЗапроса.Вставить("Тело", SUI_HTTPСервисКлиентСервер.ПолучитьТелоИзHTTPСервисЗапросОтвет(HTTPСервисЗапрос));
	ДанныеЗапроса.Вставить("Параметры", Новый Соответствие());
	
	Для Каждого ПараметрURL Из HTTPСервисЗапрос.ПараметрыURL Цикл
		ДанныеЗапроса.Параметры.Вставить(ПараметрURL.Ключ, ПараметрURL.Значение);
	КонецЦикла;
	
	Для Каждого ПараметрЗапроса Из HTTPСервисЗапрос.ПараметрыЗапроса Цикл
		ДанныеЗапроса.Параметры.Вставить(ПараметрЗапроса.Ключ, ПараметрЗапроса.Значение);
	КонецЦикла;
	
	Если ПараметрыОбработкиВходящегоЗапроса.ПрочитатьПараметрыИзТела И Не ПустаяСтрока(ДанныеЗапроса.Тело) Тогда
		
		Если ТипЗнч(ПараметрыОбработкиВходящегоЗапроса.ИменаПараметровДатыВТеле) = Тип("Строка") Тогда
			ИменаСвойствДатыВТелеЗапроса = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(
				ПараметрыОбработкиВходящегоЗапроса.ИменаПараметровДатыВТеле, , Истина, Истина);
		ИначеЕсли ТипЗнч(ПараметрыОбработкиВходящегоЗапроса.ИменаПараметровДатыВТеле) <> Тип("Массив") Тогда 
			ИменаСвойствДатыВТелеЗапроса = Новый Массив();
		КонецЕсли;
		
		ПараметрыИзТелаЗапроса = SUI_ОбщегоНазначенияКлиентСервер.ДанныеИзСтрокиJSON(ДанныеЗапроса.Тело, Ложь, ИменаСвойствДатыВТелеЗапроса);
		
		Если ТипЗнч(ПараметрыИзТелаЗапроса) = Тип("Структура") Тогда
			
			Для Каждого ПараметрИзТелаЗапроса Из ПараметрыИзТелаЗапроса Цикл
				ДанныеЗапроса.Параметры.Вставить(ПараметрИзТелаЗапроса.Ключ, ПараметрИзТелаЗапроса.Значение);
			КонецЦикла;
			
		КонецЕсли;

	КонецЕсли;
	
	ДанныеЗапроса.Вставить("ИдентификаторУстройства", 
		SUI_HTTPСервисКлиентСервер.ПолучитьИдентификаторУстройства(ДанныеЗапроса.Заголовки));
	
	ДанныеЗапроса.Вставить("ВерсияПриложения", 
		SUI_HTTPСервисКлиентСервер.ПолучитьВерсиюПриложения(ДанныеЗапроса.Заголовки));
	
	Если ПараметрыОбработкиВходящегоЗапроса.ВосстанавливатьСсылкиИдентификаторов Тогда
		SUI_ИнтеграцияВКонфигурацию.ВосстановитьСсылкиИдентификаторовSimple(ДанныеЗапроса.Параметры, , 
			ПараметрыОбработкиВходящегоЗапроса.ПроверятьСсылкиПриВосстановлении);
	КонецЕсли;
	
	ДанныеМобильногоУстройства(ДанныеЗапроса);
	
	Если ДанныеЗапроса.РезультатОтвет = Неопределено Тогда
		
		Если Не ДанныеЗапроса.УстройствоАвторизовано Тогда
			ДанныеЗапроса.РезультатОтвет = РезультатОшибка(НСтр("ru = 'Не удалось авторизовать мобильное устройство'"), 403);
		ИначеЕсли ДанныеЗапроса.МобильноеУстройствоЗаблокировано Тогда
			ДанныеЗапроса.РезультатОтвет = РезультатОшибка(НСтр("ru = 'Мобильное устройство заблокировано'"), 403);
		КонецЕсли;
	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеЗапроса.МобильноеУстройство) Тогда

		// Записать сеанс мобильного устройства
		SUI_МобильныеУстройстваСервер.ЗаписатьСеанс(ДанныеЗапроса.МобильноеУстройство, ДанныеЗапроса.ВерсияПриложения);
	
	КонецЕсли;

	//@skip-check constructor-function-return-section
	Возврат ДанныеЗапроса;
	
КонецФункции

// Установить заголовки ответа проверки обновления.
// 
// Параметры:
//  РезультатОтвет - Структура - см. SUI_HTTPСервис.РезультатУспех
//  ДанныеЗапроса - Структура - см. SUI_HTTPСервис.ОбработатьВходящийЗапрос
//@skip-check doc-comment-complex-type-with-link
Процедура УстановитьЗаголовкиОтветаПроверкиОбновления(РезультатОтвет, ДанныеЗапроса) Экспорт
	
	// [07.06.2024] artem: Врем. откл.
	Возврат;
	
	//@skip-check bsl-legacy-check-method-for-statements-after-return
	Если РезультатОтвет.КодСостояния < 300 Тогда
		
		ДанныеОПоследнейВерсии = Справочники.SUI_КонфигурацииПриложений.ПолучитьПоследнююНовуюВерсию(
			SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗапроса, "ВерсияПриложения"),
			SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗапроса, "ИспользованиеТестовыхВерсийПриложений"));
		
		Если ДанныеОПоследнейВерсии <> Неопределено Тогда
			ДобавитьЗаголовокВРезультат(РезультатОтвет, "New-App-Version", ДанныеОПоследнейВерсии.Версия);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#Область JSON

Функция СтрокаJSON(Данные) Экспорт
	
	Если ТипыКПреобразованиюВJSON().Найти(ТипЗнч(Данные)) = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(, Символы.Таб));
	ЗаписатьJSON(ЗаписьJSON, Данные, , "ПреобразованиеДанныхJSON", SUI_ОбщегоНазначения);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

Функция ТипыКПреобразованиюВJSON() Экспорт
	
	Типы = Новый Массив();
	
	Типы.Добавить(Тип("Строка"));
	Типы.Добавить(Тип("Число"));
	Типы.Добавить(Тип("Булево"));
	Типы.Добавить(Тип("Дата"));
	Типы.Добавить(Тип("Структура"));
	Типы.Добавить(Тип("ФиксированнаяСтруктура"));
	Типы.Добавить(Тип("Соответствие"));
	Типы.Добавить(Тип("ФиксированноеСоответствие"));
	Типы.Добавить(Тип("Массив"));
	Типы.Добавить(Тип("ФиксированныйМассив"));
	
	Возврат Новый ФиксированныйМассив(Типы);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СтруктураРезультата(КодСостояния, Данные)
	
	СтруктураРезультата = Новый Структура();
	
	СтруктураРезультата.Вставить("КодСостояния", 
		ОбщегоНазначения.ОписаниеТипаЧисло(3, 0, ДопустимыйЗнак.Неотрицательный).ПривестиЗначение(КодСостояния));
	СтруктураРезультата.Вставить("Данные", Данные);
	СтруктураРезультата.Вставить("Заголовки", Новый Соответствие());
	
	Возврат СтруктураРезультата;
	
КонецФункции

// Данные мобильного устройства.
// 
// Параметры:
//  ДанныеЗапроса - Структура - Данные запроса
Процедура ДанныеМобильногоУстройства(ДанныеЗапроса)
	
	ДанныеЗапроса.Вставить("УстройствоАвторизовано",				Ложь);
	ДанныеЗапроса.Вставить("МобильноеУстройство", 					ПланыОбмена.SUI_МобильныеУстройства.ПустаяСсылка());
	ДанныеЗапроса.Вставить("МобильноеУстройствоЗаблокировано", 		Ложь);
	ДанныеЗапроса.Вставить("ЕстьЗапросАвторизации", 				Ложь);
	ДанныеЗапроса.Вставить("ИспользованиеТестовыхВерсийПриложений", Ложь);
	
	Если ЗначениеЗаполнено(ДанныеЗапроса.ИдентификаторУстройства) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	SUI_МобильныеУстройства.Ссылка КАК МобильноеУстройство,
			|	SUI_МобильныеУстройства.ПометкаУдаления КАК МобильноеУстройствоЗаблокировано
			|ИЗ
			|	ПланОбмена.SUI_МобильныеУстройства КАК SUI_МобильныеУстройства
			|ГДЕ
			|	SUI_МобильныеУстройства.Код = &ИдентификаторУстройства
			|	И НЕ SUI_МобильныеУстройства.ЭтотУзел
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА &ЗапросыАвторизацииИспользуются
			|			ТОГДА КОЛИЧЕСТВО(SUI_ЗапросыАвторизацииМобильныхУстройств.ИдентификаторУстройства) > 0
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК ЕстьЗапросАвторизации
			|ИЗ
			|	РегистрСведений.SUI_ЗапросыАвторизацииМобильныхУстройств КАК SUI_ЗапросыАвторизацииМобильныхУстройств
			|ГДЕ
			|	SUI_ЗапросыАвторизацииМобильныхУстройств.ИдентификаторУстройства = &ИдентификаторУстройства";
		
		Запрос.УстановитьПараметр("ИдентификаторУстройства", ДанныеЗапроса.ИдентификаторУстройства);
		Запрос.УстановитьПараметр("ЗапросыАвторизацииИспользуются", ПолучитьФункциональнуюОпцию("SUI_ИспользоватьЗапросыАвторизацииМУ"));
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		Если Не РезультатЗапроса[0].Пустой() Тогда
			Выборка = РезультатЗапроса[0].Выбрать();
			Выборка.Следующий();
			ЗаполнитьЗначенияСвойств(ДанныеЗапроса, Выборка);
		КонецЕсли;
		
		Если Не РезультатЗапроса[1].Пустой() Тогда
			Выборка = РезультатЗапроса[1].Выбрать();
			Выборка.Следующий();
			ЗаполнитьЗначенияСвойств(ДанныеЗапроса, Выборка);
		КонецЕсли;

		Если Не ЗначениеЗаполнено(ДанныеЗапроса.МобильноеУстройство) Тогда
			
			Если Запрос.Параметры.ЗапросыАвторизацииИспользуются Тогда
				
				Если Не ДанныеЗапроса.ЕстьЗапросАвторизации Тогда
					SUI_МобильныеУстройстваСервер.СоздатьЗапросАвторизации(ДанныеЗапроса.ИдентификаторУстройства,
						ДанныеЗапроса.ИмяПользователя);
					ДанныеЗапроса.ЕстьЗапросАвторизации = Истина;
				КонецЕсли;

			Иначе
				
				SUI_МобильныеУстройстваСервер.СоздатьМобильноеУстройство(
					ДанныеЗапроса.ИдентификаторУстройства, ДанныеЗапроса.ИмяПользователя);
				
				РезультатЗапроса = Запрос.ВыполнитьПакет();
				
				Если Не РезультатЗапроса[0].Пустой() Тогда
					Выборка = РезультатЗапроса[0].Выбрать();
					Выборка.Следующий();
					ЗаполнитьЗначенияСвойств(ДанныеЗапроса, Выборка);
				КонецЕсли;
			
			КонецЕсли;

		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ДанныеЗапроса.МобильноеУстройство) Тогда
				
			Если Запрос.Параметры.ЗапросыАвторизацииИспользуются Тогда
			
				Если ДанныеЗапроса.ЕстьЗапросАвторизации Тогда
					ДанныеЗапроса.РезультатОтвет = РезультатОшибка(
						НСтр("ru = 'Запрос авторизации принят. Ожидайте подтверждения администратором.'"), 403);
				Иначе
					ВызватьИсключение НСтр("ru = 'Не удалось создать запрос авторизации мобильного клиента'");
				КонецЕсли;
				
			Иначе
				ВызватьИсключение НСтр("ru = 'Не удалось создать мобильное устройство'");
			КонецЕсли;
				
		КонецЕсли;
		
	Иначе
		ДанныеЗапроса.РезультатОтвет = РезультатОшибка(НСтр("ru = 'Не удалось определить идентификатор устройства.'"), 400);
	КонецЕсли;
	
	Если ДанныеЗапроса.РезультатОтвет = Неопределено И ДанныеЗапроса.МобильноеУстройствоЗаблокировано Тогда
		ДанныеЗапроса.РезультатОтвет = РезультатОшибка(НСтр("ru = 'Доступ запрещен. Мобильное устройство заблокировано.'"), 403);
	Иначе
		ДанныеЗапроса.УстройствоАвторизовано = (ЗначениеЗаполнено(ДанныеЗапроса.МобильноеУстройство) И Не ДанныеЗапроса.ЕстьЗапросАвторизации);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
