#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	SUI_ИнтеграцияВКонфигурацию.УстановитьДействиеОткрытияИдентификаторов(ЭтотОбъект, "id_");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура SUI_Переопределяемый_ОткрытиеИдентификатора(Элемент, СтандартнаяОбработка)
	SUI_ИнтеграцияВКонфигурациюКлиент.ОткрытиеИдентификатора(Неопределено, 
		Элемент.ТекстРедактирования, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти