
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Ссылка") Тогда
		
		Ссылка = Параметры.Ссылка;
		
		Если ЗначениеЗаполнено(Ссылка) Тогда
			
			ИдентификаторSimple = SUI_ИнтеграцияВКонфигурацию.ИдентификаторSimpleПоСсылке(Ссылка);
			
			Если Не ЗначениеЗаполнено(ИдентификаторSimple) Тогда
				SUI_ОбщегоНазначения.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Не удалось получить идентификатор Simple для %1.'"), Ссылка));
			КонецЕсли;
			
		Иначе
			SUI_ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru = 'Не удалось определить ссылку для получения идентификатора Simple.'"));
		КонецЕсли;
		
	ИначеЕсли Параметры.Свойство("ИдентификаторSimple") Тогда
		
		ИдентификаторSimple = Параметры.ИдентификаторSimple;
		
		Если SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(ИдентификаторSimple) Тогда
			
			Ссылка = ПолучитьСсылкуПоИдентификатору(ИдентификаторSimple);
			
			Если Не ЗначениеЗаполнено(Ссылка) Тогда
				SUI_ОбщегоНазначения.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Не удалось получить ссылку по идентификатору Simple ""%1"".'"), ИдентификаторSimple));
			КонецЕсли;
			
		Иначе
			SUI_ОбщегоНазначения.СообщитьПользователю(СтрШаблон(
				НСтр("ru = 'Переданный идентификатор ""%1"" не является идентификатором Simple.'"), ИдентификаторSimple));
		КонецЕсли;
		
	КонецЕсли;
	
	Заголовок = СтрШаблон(НСтр("ru = 'Идентификатор %1'"), SUI_SimpleКлиентСервер.Представление());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИдентификаторSimpleПриИзменении(Элемент)
	
	Если SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(ИдентификаторSimple) Тогда
		Ссылка = ПолучитьСсылкуПоИдентификатору(ИдентификаторSimple);
	Иначе
		Ссылка = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаПерейтиПоСсылке(Команда)
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		ПоказатьЗначение(, Ссылка);
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьСсылкуПоИдентификатору(ID)
	Возврат SUI_ИнтеграцияВКонфигурацию.СсылкаПоИдентификаторуSimple(ID);
КонецФункции

#КонецОбласти
