
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗагрузитьЗначенияДляВыбора(Параметры.ЗначенияДляВыбора);

	Если Параметры.Свойство("Заголовок") Тогда
		Заголовок = Параметры.Заголовок;
		АвтоЗаголовок = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Закрыть(Элементы.Список.ТекущиеДанные.Значение);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	Закрыть(Элементы.Список.ТекущиеДанные.Значение);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьЗначенияДляВыбора(ЗначенияДляВыбора)

	Если ТипЗнч(ЗначенияДляВыбора) = Тип("СписокЗначений") Тогда
		
		Список.ТипЗначения = ЗначенияДляВыбора.ТипЗначения;
		
		Для Каждого ЗначениеДляВыбора Из ЗначенияДляВыбора Цикл
			ЗаполнитьЗначенияСвойств(Список.Добавить(), ЗначениеДляВыбора);
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ЗначенияДляВыбора) = Тип("Массив") Тогда
		Список.ЗагрузитьЗначения(ЗначенияДляВыбора);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
