
#Область ПрограммныйИнтерфейс

Процедура УдалитьДанныеДокументовОбмена(ДокументыОбмена) Экспорт
	SUI_ДокументыОбмена.УдалитьДокументыОбмена(ДокументыОбмена);
КонецПроцедуры	

Функция ДанныеДокументаОбменаКЗагрузкеВДокумент(ПараметрыОперации, ИдентификаторФормы) Экспорт

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторФормы);
	Возврат ДлительныеОперации.ВыполнитьВФоне("SUI_ДокументыОбмена.ДанныеДокументаОбменаКЗагрузкеВДокумент", 
		ПараметрыОперации, ПараметрыВыполнения);
		
КонецФункции

Функция ДанныеДокументаДополнительные(ПараметрыОперации, ИдентификаторФормы) Экспорт

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторФормы);
	Возврат ДлительныеОперации.ВыполнитьВФоне("SUI_ДокументыОбмена.ДанныеДокументаДополнительные", 
		ПараметрыОперации, ПараметрыВыполнения);
		
КонецФункции

Функция ДокументОбменаСодержитДанныеПотокаШтрихкодов(ДокументСсылка, НастройкаДокумента) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Новый Структура("ЭтоДокументСборШК,ЕстьПотокШК", Ложь, Истина);
	
	Если ДокументСсылка.Метаданные() = Метаданные.Документы.SUI_СборШтрихкодов Тогда
		Результат.ЭтоДокументСборШК = Истина;
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	КОЛИЧЕСТВО(SUI_docs_tbl_barcode_flow.sid) > 0 КАК ЕстьПотокШК
			|ИЗ
			|	РегистрСведений.SUI_docs КАК SUI_docs
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.SUI_docs_tbl_barcode_flow КАК SUI_docs_tbl_barcode_flow
			|		ПО SUI_docs.sid = SUI_docs_tbl_barcode_flow.sid_doc
			|ГДЕ
			|	SUI_docs.id_doc = &id_doc
			|	И SUI_docs.НастройкаДокумента = &НастройкаДокумента";
		
		Запрос.УстановитьПараметр("id_doc", SUI_ИнтеграцияВКонфигурацию.ИдентификаторSimpleПоСсылке(ДокументСсылка));
		Запрос.УстановитьПараметр("НастройкаДокумента", НастройкаДокумента);
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Результат.ЕстьПотокШК = Выборка.ЕстьПотокШК;
	
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция ПолучитьSIDДокументаОбменаПоСсылкеДокумента(ДокументСсылка, НастройкаДокумента = Неопределено) Экспорт
	Возврат SUI_ДокументыОбмена.ПолучитьSIDДокументовОбмена(ДокументСсылка, НастройкаДокумента);
КонецФункции

Функция ЭтоДокументГрупповогоПересчета(ДокументСсылка)Экспорт
	
	Возврат SUI_ДокументыОбмена.ЭтоДокументГрупповогоПересчета(ДокументСсылка);
		
КонецФункции 

Функция ДокументНуждаетсяВОбработке(ДокументСсылка)Экспорт
	
	Возврат SUI_ДокументыОбмена.ДокументНуждаетсяВОбработке(ДокументСсылка);
		
КонецФункции 
           
Функция ЗавершитьГрупповойПересчетДокумента(Знач Документ, ИнтерактивноеЗавершение = Истина) Экспорт
	
	Если Не SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(Документ) Тогда
		
		Документ = SUI_ИнтеграцияВКонфигурацию.ИдентификаторSimpleПоСсылке(Документ);
		
		Если Документ = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат РегистрыСведений.SUI_docs_tbl_goods_delta.ЗагрузитьИтогиПересчетаВТоварыДокументаОбмена(Документ);
		
КонецФункции

Функция ДокументБылВыгружен(Документ, ИсключаемыеСостояния = Неопределено, НастройкаДокумента = Неопределено) Экспорт
	Возврат SUI_ДокументыОбмена.ДокументБылВыгружен(Документ, ИсключаемыеСостояния, НастройкаДокумента);
КонецФункции

Функция ПолучитьШтрихкодыМаркировкиДокументаОбмена(ДокументСсылка, НастройкаДокумента = Неопределено, ИдентификаторФормы = Неопределено) Экспорт
	
	ПараметрыПроцедуры = Новый Структура();
	ПараметрыПроцедуры.Вставить("ДокументСсылка", ДокументСсылка);
	ПараметрыПроцедуры.Вставить("НастройкаДокумента", НастройкаДокумента);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"SUI_ДокументыОбмена.ПолучитьШтрихкодыМаркировкиДокументаОбмена", 
		ПараметрыПроцедуры, 
		ДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторФормы));
	
КонецФункции

#КонецОбласти
