
#Область ПрограммныйИнтерфейс

Процедура УдалитьДанныеДокументовОбмена(ДокументыОбмена) Экспорт
	SUI_ДокументыОбмена.УдалитьДокументыОбмена(ДокументыОбмена);
КонецПроцедуры	

Функция ДанныеДокументаОбменаКЗагрузкеВДокумент(ПараметрыОперации, ИдентификаторФормы) Экспорт

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторФормы);
	Возврат ДлительныеОперации.ВыполнитьВФоне("SUI_ДокументыОбмена.ДанныеДокументаОбменаКЗагрузкеВДокумент", 
		ПараметрыОперации, ПараметрыВыполнения);
		
КонецФункции

Функция ДанныеДокументаДополнительные(ПараметрыОперации, ИдентификаторФормы) Экспорт

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторФормы);
	Возврат ДлительныеОперации.ВыполнитьВФоне("SUI_ДокументыОбмена.ДанныеДокументаДополнительные", 
		ПараметрыОперации, ПараметрыВыполнения);
		
КонецФункции

Функция ДокументОбменаСодержитДанныеПотокаШтрихкодов(ДокументСсылка, НастройкаДокумента) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Новый Структура();
	Результат.Вставить("ЭтоДокументСборШК", (ДокументСсылка.Метаданные() = Метаданные.Документы.SUI_СборШтрихкодов));
	Результат.Вставить("ЕстьПотокШК", Результат.ЭтоДокументСборШК);
	
	Если Не Результат.ЭтоДокументСборШК И
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкаДокумента, "СборШтрихкодов") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ПотокШтрихкодов.sid
			|ИЗ
			|	РегистрСведений.SUI_docs КАК ДокументыОбмена
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.SUI_docs_tbl_barcode_flow КАК ПотокШтрихкодов
			|		ПО ДокументыОбмена.sid = ПотокШтрихкодов.sid_doc
			|		И НЕ ПотокШтрихкодов.ЭтоШтрихкодКМ
			|		И НЕ ПотокШтрихкодов.ЭтоШтрихкодSSCC
			|ГДЕ
			|	ДокументыОбмена.id_doc = &id_doc
			|	И ДокументыОбмена.НастройкаДокумента = &НастройкаДокумента";
		
		Запрос.УстановитьПараметр("id_doc", SUI_ИнтеграцияВКонфигурацию.ИдентификаторSimpleПоСсылке(ДокументСсылка));
		Запрос.УстановитьПараметр("НастройкаДокумента", НастройкаДокумента);
		
		Результат.ЕстьПотокШК = Не Запрос.Выполнить().Пустой();
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция ПолучитьSIDДокументаОбменаПоСсылкеДокумента(ДокументСсылка, НастройкаДокумента = Неопределено) Экспорт
	Возврат SUI_ДокументыОбмена.ПолучитьSIDДокументовОбмена(ДокументСсылка, НастройкаДокумента);
КонецФункции

Функция ЭтоДокументГрупповогоПересчета(ДокументСсылка)Экспорт
	
	Возврат SUI_ДокументыОбмена.ЭтоДокументГрупповогоПересчета(ДокументСсылка);
		
КонецФункции 

Функция ВыполнитьПроверкуОбработкиДанныхДокументаПередЗагрузкой(ДокументСсылка) Экспорт
	
	Возврат SUI_ДокументыОбмена.ВыполнитьПроверкуОбработкиДанныхДокументаПередЗагрузкой(ДокументСсылка);
	
КонецФункции
           
Функция ЗавершитьГрупповойПересчетДокумента(Документ, ИнтерактивноеЗавершение = Истина) Экспорт
	
	ИдентификаторДокумента = SUI_ИнтеграцияВКонфигурацию.ИдентификаторSimpleПоСсылке(Документ);
	
	Возврат РегистрыСведений.SUI_docs_tbl_goods_delta.ЗагрузитьИтогиПересчетаВТоварыДокументаОбмена(ИдентификаторДокумента);
		
КонецФункции

Функция ДокументБылВыгружен(Документ, ИсключаемыеСостояния = Неопределено, НастройкаДокумента = Неопределено) Экспорт
	Возврат SUI_ДокументыОбмена.ДокументБылВыгружен(Документ, ИсключаемыеСостояния, НастройкаДокумента);
КонецФункции

Функция ПолучитьШтрихкодыМаркировкиДокументаОбмена(ДокументСсылка, НастройкаДокумента = Неопределено, ИдентификаторФормы = Неопределено) Экспорт
	
	ПараметрыПроцедуры = Новый Структура();
	ПараметрыПроцедуры.Вставить("ДокументСсылка", ДокументСсылка);
	ПараметрыПроцедуры.Вставить("НастройкаДокумента", НастройкаДокумента);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"SUI_ДокументыОбмена.ПолучитьШтрихкодыМаркировкиДокументаОбмена", 
		ПараметрыПроцедуры, 
		ДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторФормы));
	
КонецФункции

#КонецОбласти
