
#Область ПрограммныйИнтерфейс

Функция ВыгрузитьДокументОбменаВФоне(ДокументОснование, ПараметрыВыгрузкиДокументаОбмена, ФормаУникальныйИдентификатор) Экспорт
	
	ПараметрыПроцедуры = Новый Структура();
	ПараметрыПроцедуры.Вставить("ДокументОснование", ДокументОснование);
	ПараметрыПроцедуры.Вставить("ПараметрыВыгрузкиДокументаОбмена", ПараметрыВыгрузкиДокументаОбмена);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("SUI_ДокументыОбмена.ВыгрузитьДокументОбменаВФоне", ПараметрыПроцедуры, 
		ДлительныеОперации.ПараметрыВыполненияВФоне(ФормаУникальныйИдентификатор));
	
КонецФункции

Функция УдалитьДокументыОбменаВФоне(ДокументыОбменаКУдалению, ФормаУникальныйИдентификатор) Экспорт
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("SUI_ДокументыОбмена.УдалитьДокументыОбменаВФоне", 
		ДокументыОбменаКУдалению, ДлительныеОперации.ПараметрыВыполненияВФоне(ФормаУникальныйИдентификатор));
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗарегистрироватьДокументыОбменаКВыгрузке(ДокументыКРегистрации) Экспорт
	
	Для Каждого ДокументКРегистрации Из ДокументыКРегистрации Цикл
		ПланыОбмена.ЗарегистрироватьИзменения(ДокументКРегистрации.Значение, ДокументКРегистрации.Ключ);
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = '%1 был зарегистрирован к выгрузке.'"), ДокументКРегистрации.Ключ));
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
