
#Область ПрограммныйИнтерфейс

Процедура УдалитьДанныеДокументовОбмена(ДокументыОбмена) Экспорт
	SUI_ДокументыОбмена.УдалитьДокументыОбмена(ДокументыОбмена);
КонецПроцедуры	

Функция ДанныеДокументаОбменаКЗагрузкеВДокумент(ПараметрыОперации, ИдентификаторФормы) Экспорт

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторФормы);
	Возврат ДлительныеОперации.ВыполнитьВФоне("SUI_ДокументыОбмена.ДанныеДокументаОбменаКЗагрузкеВДокумент", 
		ПараметрыОперации, ПараметрыВыполнения);
		
КонецФункции

Функция ДанныеДокументаДополнительные(ПараметрыОперации, ИдентификаторФормы) Экспорт

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторФормы);
	Возврат ДлительныеОперации.ВыполнитьВФоне("SUI_ДокументыОбмена.ДанныеДокументаДополнительные", 
		ПараметрыОперации, ПараметрыВыполнения);
		
КонецФункции

Функция ДокументОбменаСодержитДанныеПотокаШтрихкодов(ДокументСсылка, НастройкаДокумента) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Новый Структура();
	Результат.Вставить("ЕстьПотокШК", Ложь);
	
	Если ДокументСсылка.Метаданные() = Метаданные.Документы.SUI_СборШтрихкодов Или
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкаДокумента, "СборШтрихкодов") Тогда
		Результат.Вставить("ЭтоДокументСборШК", Истина);
	Иначе
		Результат.Вставить("ЭтоДокументСборШК", Ложь);
	КонецЕсли;
	
	Если Результат.ЭтоДокументСборШК Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	SUI_docs_tbl_barcode_flow.sid
			|ИЗ
			|	РегистрСведений.SUI_docs КАК SUI_docs
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.SUI_docs_tbl_barcode_flow КАК SUI_docs_tbl_barcode_flow
			|		ПО SUI_docs.sid = SUI_docs_tbl_barcode_flow.sid_doc
			|		И НЕ SUI_docs_tbl_barcode_flow.ЭтоШтрихкодКМ
			|		И НЕ SUI_docs_tbl_barcode_flow.ЭтоШтрихкодSSCC
			|ГДЕ
			|	SUI_docs.id_doc = &id_doc
			|	И SUI_docs.НастройкаДокумента = &НастройкаДокумента";
		
		Запрос.УстановитьПараметр("id_doc", SUI_ИнтеграцияВКонфигурацию.ИдентификаторSimpleПоСсылке(ДокументСсылка));
		Запрос.УстановитьПараметр("НастройкаДокумента", НастройкаДокумента);
		
		Результат.ЕстьПотокШК = Не Запрос.Выполнить().Пустой();
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция ПолучитьSIDДокументаОбменаПоСсылкеДокумента(ДокументСсылка, НастройкаДокумента = Неопределено) Экспорт
	Возврат SUI_ДокументыОбмена.ПолучитьSIDДокументовОбмена(ДокументСсылка, НастройкаДокумента);
КонецФункции

Функция ЭтоДокументГрупповогоПересчета(ДокументСсылка)Экспорт
	
	Возврат SUI_ДокументыОбмена.ЭтоДокументГрупповогоПересчета(ДокументСсылка);
		
КонецФункции 

Функция ДокументНуждаетсяВОбработке(ДокументСсылка)Экспорт
	
	Возврат SUI_ДокументыОбмена.ДокументНуждаетсяВОбработке(ДокументСсылка);
		
КонецФункции 
           
Функция ЗавершитьГрупповойПересчетДокумента(Документ, ИнтерактивноеЗавершение = Истина) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДокументыОбмена.sid КАК sid,
		|	ДокументыОбмена.id_doc КАК id_doc,
		|	ДокументыОбмена.МобильноеУстройство КАК МобильноеУстройство
		|ИЗ
		|	РегистрСведений.SUI_docs КАК ДокументыОбмена
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.SUI_НастройкиДокументов КАК НастройкиДокументов
		|		ПО ДокументыОбмена.НастройкаДокумента = НастройкиДокументов.Ссылка
		|ГДЕ
		|	ДокументыОбмена.id_doc = &id_doc
		|	И НастройкиДокументов.ГрупповоеСканирование";
	
	Если SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(Документ) Тогда
		Запрос.УстановитьПараметр("id_doc", Документ);
	Иначе
		Запрос.УстановитьПараметр("id_doc", SUI_ИнтеграцияВКонфигурацию.ИдентификаторSimpleПоСсылке(Документ));
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
		
	ДополнительныеПараметры = Новый Структура();
	
	ДополнительныеПараметры.Вставить("sid", Выборка.sid);
	
	Если ИнтерактивноеЗавершение Тогда
		ДополнительныеПараметры.Вставить("ИнтерактивноеЗавершение");
	КонецЕсли;
	
	Возврат SUI_ОбменДаннымиСервер.ЗавершитьГрупповойПересчетДокумента(Выборка.МобильноеУстройство, Выборка.id_doc, 
		ДополнительныеПараметры);
		
КонецФункции

Функция ДокументБылВыгружен(Документ, ИсключаемыеСостояния = Неопределено, НастройкаДокумента = Неопределено) Экспорт
	Возврат SUI_ДокументыОбмена.ДокументБылВыгружен(Документ, ИсключаемыеСостояния, НастройкаДокумента);
КонецФункции

Функция ПолучитьШтрихкодыМаркировкиДокументаОбмена(ДокументСсылка, НастройкаДокумента = Неопределено, ИдентификаторФормы = Неопределено) Экспорт
	
	ПараметрыПроцедуры = Новый Структура();
	ПараметрыПроцедуры.Вставить("ДокументСсылка", ДокументСсылка);
	ПараметрыПроцедуры.Вставить("НастройкаДокумента", НастройкаДокумента);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"SUI_ДокументыОбмена.ПолучитьШтрихкодыМаркировкиДокументаОбмена", 
		ПараметрыПроцедуры, 
		ДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторФормы));
	
КонецФункции

#КонецОбласти
