
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ТаблицаИнтеграции = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ТаблицаИнтеграции");
	
	Если Не ЗначениеЗаполнено(ТаблицаИнтеграции) Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Не удалось опредлелить таблицу дополнительных настроек'"), , , , Отказ);
		Возврат;
	КонецЕсли;
	
	Если ТекущийМодульМенеджер().ТаблицыИнтеграцииДополнительныхНастроек().Найти(ТаблицаИнтеграции) = Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(
			НСтр("ru = 'Для таблицы ""%1"" не предусмотренны дополнительные настройки'"), ТаблицаИнтеграции), , , , Отказ);
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИмяФормыНастройки = "";
	
	Если ТаблицаИнтеграции = ПредопределенноеЗначение("Перечисление.SUI_ТаблицыИнтеграции.СерииНоменклатуры") Тогда
		ИмяФормыНастройки = "РегистрСведений.SUI_ДополнительныеНастройкиТаблицИнтеграции.Форма.ДополнительныеНастройки_СерииНоменклатуры";
	ИначеЕсли ТаблицаИнтеграции = ПредопределенноеЗначение("Перечисление.SUI_ТаблицыИнтеграции.ШтрихкодыНоменклатуры") Тогда
		ИмяФормыНастройки = "РегистрСведений.SUI_ДополнительныеНастройкиТаблицИнтеграции.Форма.ДополнительныеНастройки_ШтрихкодыНоменклатуры";
	ИначеЕсли ТаблицаИнтеграции = ПредопределенноеЗначение("Перечисление.SUI_ТаблицыИнтеграции.ШтрихкодыУпаковок") Тогда
		ИмяФормыНастройки = "РегистрСведений.SUI_ДополнительныеНастройкиТаблицИнтеграции.Форма.ДополнительныеНастройки_ШтрихкодыУпаковок";
	КонецЕсли;
	
	Если Не ПустаяСтрока(ИмяФормыНастройки) Тогда
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ПриЗакрытииФормыДополнительнойНастройки", ЭтотОбъект);
		ОткрытьФорму(ИмяФормыНастройки, , ЭтотОбъект, УникальныйИдентификатор, Окно, , ОповещениеОЗавершении);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ТекущийМодульМенеджер()
	Возврат РегистрыСведений.SUI_ДополнительныеНастройкиТаблицИнтеграции;
КонецФункции

&НаКлиенте
Процедура ПриЗакрытииФормыДополнительнойНастройки(Результат, ДополнительныеПараметры) Экспорт
	
	Если Открыта() Тогда
		Закрыть(НастройкиЗаписаны);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
