
#Область ПрограммныйИнтерфейс

Процедура ПоместитьБиблиотекуВХранилище(Адрес) Экспорт
	
	ДвоичныеДанныеБиблиотеки = ПолучитьОбщийМакет("SUI_БиблиотекаРедакторJSON");

	КаталогНаСервере = ПолучитьИмяВременногоФайла();
	СоздатьКаталог(КаталогНаСервере);

	Поток = ДвоичныеДанныеБиблиотеки.ОткрытьПотокДляЧтения();

	ЧтениеZIP = Новый ЧтениеZipФайла(Поток);
	ЧтениеZIP.ИзвлечьВсе(КаталогНаСервере, РежимВосстановленияПутейФайловZIP.Восстанавливать);

	СтруктураБиблиотеки = Новый Соответствие();

	ФайлыАрхива = НайтиФайлы(КаталогНаСервере, "*", Истина);
	Для Каждого ФайлБиблиотеки Из ФайлыАрхива Цикл
		КлючФайла = СтрЗаменить(ФайлБиблиотеки.ПолноеИмя, КаталогНаСервере + ПолучитьРазделительПути(), "");
		Если Не ФайлБиблиотеки.ЭтоКаталог() Тогда
			СтруктураБиблиотеки.Вставить(КлючФайла, Новый ДвоичныеДанные(ФайлБиблиотеки.ПолноеИмя));
		КонецЕсли;
	КонецЦикла;

	ПоместитьВоВременноеХранилище(СтруктураБиблиотеки, Адрес);

	Попытка
		УдалитьФайлы(КаталогНаСервере);
	Исключение
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
