
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	SUI_РегламентныеЗадания.ВыполнитьПроверкуПрав(Отказ, Ложь);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	КлючЗадания = Параметры.Ключ;
	
	SUI_ОбщегоНазначенияКлиентСервер.Проверить(Не ПустаяСтрока(КлючЗадания),
		НСтр("ru = 'Не установлены параметры: ""Ключ""!'"));
	
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("Установленные", Истина);
	ПараметрыОтбора.Вставить("Ключ", КлючЗадания);
	
	Если ЗначениеЗаполнено(Параметры.УникальныйИдентификатор) Тогда
		ПараметрыОтбора.Вставить("УникальныйИдентификатор", Параметры.УникальныйИдентификатор);
	КонецЕсли;
	
	НайденныеРегламентныеЗадания = SUI_РегламентныеЗадания.ПолучитьРегламентныеЗадания(ПараметрыОтбора);
	
	Если НайденныеРегламентныеЗадания.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Не найдено регламентное задание!'");
		SUI_ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		Возврат;
	КонецЕсли;
	
	Задание = НайденныеРегламентныеЗадания[0];
	
	Если Параметры.ТолькоИспользуемые И Не Задание.Использование Тогда
		
		Для индекс = 1 По НайденныеРегламентныеЗадания.Количество() - 1 Цикл
			
			Задание = НайденныеРегламентныеЗадания[индекс];
			
			Если Задание.Использование Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если Не Задание.Использование Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Регламентное задание ""%1"" выключено.'"), Задание.Наименование);
			SUI_ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ИдентификаторРегламентногоЗадания = Задание.УникальныйИдентификатор;
	НаименованиеРегламентногоЗадания = Задание.Наименование;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОтобразитьПроцессВыполнения(НСтр("ru = 'Запуск регламентного задания'"));
	
	ПодключитьОбработчикОжидания("ЗапуститьРегламентноеЗадание", 0.1, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НадписьРезультатВыполненияОшибкаНажатие(Элемент)
	
	Если ПустаяСтрока(ТекстОшибкиВыполнения) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПросмотраОшибки = Новый Структура();
	ПараметрыПросмотраОшибки.Вставить("КраткоеПредставлениеОшибки", ТекстОшибкиВыполнения);
	ПараметрыПросмотраОшибки.Вставить("ПредставлениеРегламентногоЗадания", НаименованиеРегламентногоЗадания);
	
	ОткрытьФорму("Обработка.SUI_РегламентныеЗадания.Форма.ПросмотрОшибки", ПараметрыПросмотраОшибки, ЭтотОбъект, 
		УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтменитьВыполнение(Команда)
	
	Если ЗначениеЗаполнено(ИдентификаторФоновогоЗадания) Тогда
		ОтменитьВыполнениеНаСервере(КлючЗадания, ИдентификаторФоновогоЗадания);
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОтобразитьПроцессВыполнения(Знач Информация = "")
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаДлительнаяОперация;
	
	Если ПустаяСтрока(Информация) Тогда
		Информация = НСтр("ru = 'Выполняется регламентное задание'");
	КонецЕсли;
	
	Элементы.НадписьПроцессВыполнения.Заголовок = Информация;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьУспехВыполнения()
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаУспешногоЗавершения;
	
	Элементы.НадписьРезультатВыполненияУспешно.Заголовок = ПредставлениеСостоянияВыполнения;
	
	Если Не Параметры.ОжидатьЗавершения Или Параметры.ЗакрытьПриУспешномЗавершении Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьОшибкуВыполнения()
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЗавершенияСОшибкой;
	
	Если ПустаяСтрока(ТекстОшибкиВыполнения) Тогда
		Информация = ПредставлениеСостоянияВыполнения;
	Иначе
		
		Если СтрДлина(ТекстОшибкиВыполнения) > 40 Тогда
			Информация = Лев(ТекстОшибкиВыполнения, 37) + "...";
		Иначе
			Информация = ТекстОшибкиВыполнения;
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.НадписьРезультатВыполненияОшибка.Заголовок = Информация;
	
	Если Не Параметры.ОжидатьЗавершения Или Параметры.ЗакрытьПриОшибке Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьРегламентноеЗадание() Экспорт
	
	РезультатВыполнения = ЗапуститьРегламентноеЗаданиеНаСервере(КлючЗадания, ИдентификаторРегламентногоЗадания, 
		Параметры.ТолькоИспользуемые);
	
	ОбработатьРезультатВыполнения(РезультатВыполнения);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗапуститьРегламентноеЗаданиеНаСервере(Ключ, ИдентификаторРегламентногоЗадания, ТолькоИспользуемые)
	
	Возврат SUI_РегламентныеЗадания.ВыполнитьРегламентноеЗаданиеВручную(Ключ, 
		ИдентификаторРегламентногоЗадания, ТолькоИспользуемые);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультатВыполнения(РезультатВыполнения)
	
	ИдентификаторФоновогоЗадания = РезультатВыполнения.ИдентификаторФоновогоЗадания;
	ПредставлениеСостоянияВыполнения = РезультатВыполнения.Состояние;
	
	Если ЗначениеЗаполнено(РезультатВыполнения.ДатаЗапуска) Тогда
		
		ДатаЗапуска = РезультатВыполнения.ДатаЗапуска;
		
		Если ЗначениеЗаполнено(РезультатВыполнения.ДатаЗавершения) Тогда
			
			ДатаЗавершения = РезультатВыполнения.ДатаЗавершения;
			ЗатраченноеВремяПредставление = РезультатВыполнения.ЗатрченноеВремяПредставление;
			
		Иначе
			ЗатраченноеВремяПредставление = SUI_ОбщегоНазначенияКлиентСервер.ПолучитьПредставлениеРазницыВремени(
				ОбщегоНазначенияКлиент.ДатаСеанса() - ДатаЗапуска);
		КонецЕсли;
		
	КонецЕсли;
	
	ТекстОшибкиВыполнения = РезультатВыполнения.Ошибка;
	
	Если РезультатВыполнения.Выполняется Тогда
		
		Если Параметры.ОжидатьЗавершения Тогда
			
			Если СчетчикОжидания = 0 Тогда
				Интервал = 1;
				ОтобразитьПроцессВыполнения(НСтр("ru = 'Выполнение задания'"));
			Иначе
				
				ОтобразитьПроцессВыполнения(НСтр("ru = 'Ожидание завершения выполнения задания'"));
				
				Если СчетчикОжидания < 4 Тогда
					Интервал = 2;
				Иначе
					Интервал = 4;
				КонецЕсли;
				
			КонецЕсли;
			
			ПодключитьОбработчикОжидания("ОжиданиеЗавершенияВыполнения", Интервал, Истина);
			
			СчетчикОжидания = СчетчикОжидания + 1;
			
		Иначе
			ОтобразитьУспехВыполнения();
		КонецЕсли;
		
	Иначе
		
		Если ПустаяСтрока(ТекстОшибкиВыполнения) Тогда
			
			Если ПредставлениеСостоянияВыполнения = "Задание выполнено" Тогда
				ОтобразитьУспехВыполнения();
			Иначе
				ОтобразитьОшибкуВыполнения();
			КонецЕсли;
			
		Иначе
			ОтобразитьОшибкуВыполнения();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОжиданиеЗавершенияВыполнения() Экспорт
	
	РезультатВыполнения = ПолучитьИнформациюОФоновомЗадании(ИдентификаторФоновогоЗадания);
	
	ОбработатьРезультатВыполнения(РезультатВыполнения);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИнформациюОФоновомЗадании(ИдентификаторФоновогоЗадания)
	
	Возврат SUI_РегламентныеЗадания.ПолучитьИнформациюОФоновомЗадании(ИдентификаторФоновогоЗадания);
	
КонецФункции

&НаСервереБезКонтекста
Процедура ОтменитьВыполнениеНаСервере(Ключ, ИдентификаторФоновогоЗадания)
	
	ПараметрыОтмены = Новый Структура();
	ПараметрыОтмены.Вставить("Ключ", Ключ);
	ПараметрыОтмены.Вставить("ИдентификаторФоновогоЗадания", ИдентификаторФоновогоЗадания);
	
	SUI_РегламентныеЗадания.ОтменитьВыполнениеРегламентногоЗадания(ПараметрыОтмены);
	
КонецПроцедуры

#КонецОбласти
