
#Область СлужебныйПрограммныйИнтерфейс

Функция СписокДокументовКонфигурации() Экспорт
	
	СписокДокументов = Новый СписокЗначений();
	
	Для Каждого МетаданныеДокумента Из Метаданные.Документы Цикл
		СписокДокументов.Добавить(МетаданныеДокумента.Имя, МетаданныеДокумента.Синоним);
	КонецЦикла;
	
	Возврат СписокДокументов;
	
КонецФункции

Функция ОписаниеРеквизитовДокумента(ИмяДокумента) Экспорт
	
	ОписаниеДерево = Новый ДеревоЗначений();
	ОписаниеДерево.Колонки.Добавить("Имя", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	ОписаниеДерево.Колонки.Добавить("Синоним", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	ОписаниеДерево.Колонки.Добавить("Представление", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	ОписаниеДерево.Колонки.Добавить("Тип", Новый ОписаниеТипов("ОписаниеТипов"));
	ОписаниеДерево.Колонки.Добавить("ТипСтрокой", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	ОписаниеДерево.Колонки.Добавить("Комментарий", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	ОписаниеДерево.Колонки.Добавить("Подсказка", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	ОписаниеДерево.Колонки.Добавить("СтандартныйРеквизит", Новый ОписаниеТипов("Булево"));
	
	МетаданныеИсточник = ОбщегоНазначения.ОбъектМетаданныхПоПолномуИмени("Документ." + ИмяДокумента);
	
	СтрокаРеквизиты = ОписаниеДерево.Строки.Добавить();
	СтрокаРеквизиты.Имя = "Реквизиты";
	СтрокаРеквизиты.Синоним = НСтр("ru = 'Реквизиты'");
	СтрокаРеквизиты.Представление = СтрокаРеквизиты.Синоним;
	
	СтрокаТабличныеЧасти = ОписаниеДерево.Строки.Добавить();
	СтрокаТабличныеЧасти.Имя = "ТабличныеЧасти";
	СтрокаТабличныеЧасти.Синоним = НСтр("ru = 'Табличные части'");
	СтрокаТабличныеЧасти.Представление = СтрокаРеквизиты.Синоним;
	
	Если МетаданныеИсточник <> Неопределено Тогда
		
		Для Каждого МетаданныеРеквизита Из МетаданныеИсточник.СтандартныеРеквизиты Цикл
			ДобавитьОписаниеРеквизитаВСтрокеДерева(СтрокаРеквизиты, МетаданныеРеквизита, Истина);
		КонецЦикла;
		
		Для Каждого МетаданныеРеквизита Из МетаданныеИсточник.Реквизиты Цикл
			ДобавитьОписаниеРеквизитаВСтрокеДерева(СтрокаРеквизиты, МетаданныеРеквизита);
		КонецЦикла;
		
		Для Каждого МетаданныеТабличнойЧасти Из МетаданныеИсточник.ТабличныеЧасти Цикл
			
			СтрокаТабличнойЧасти = СтрокаТабличныеЧасти.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, МетаданныеТабличнойЧасти);
			СтрокаТабличнойЧасти.Представление = МетаданныеТабличнойЧасти.Представление();
			СтрокаТабличнойЧасти.ТипСтрокой = "ТабличнаяЧасть";
			
			Для Каждого МетаданныеРеквизита Из МетаданныеТабличнойЧасти.СтандартныеРеквизиты Цикл
				ДобавитьОписаниеРеквизитаВСтрокеДерева(СтрокаТабличнойЧасти, МетаданныеРеквизита, Истина);
			КонецЦикла;
			
			Для Каждого МетаданныеРеквизита Из МетаданныеТабличнойЧасти.Реквизиты Цикл
				ДобавитьОписаниеРеквизитаВСтрокеДерева(СтрокаТабличнойЧасти, МетаданныеРеквизита);
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ОписаниеДерево;
	
КонецФункции

Функция СписокДокументовВводимыхНаОсновании(ИмяДокумента) Экспорт
	
	СписокДокументовОснования = Новый СписокЗначений();
	
	МетаданныеДокументаИсточника = ОбщегоНазначения.ОбъектМетаданныхПоПолномуИмени("Документ." + ИмяДокумента);
	
	Если МетаданныеДокументаИсточника <> Неопределено Тогда
		
		Для Каждого МетаданныеДокумента Из Метаданные.Документы Цикл
			
			Если МетаданныеДокумента.ВводитсяНаОсновании.Содержит(МетаданныеДокументаИсточника) Тогда
				СписокДокументовОснования.Добавить(МетаданныеДокумента.Имя, МетаданныеДокумента.Представление());
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат СписокДокументовОснования;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьОписаниеРеквизитаВСтрокеДерева(Приемник, МетаданныеЗаполнения, СтандартныйРеквизит = Ложь)
	
	СтрокаРеквизита = Приемник.Строки.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаРеквизита, МетаданныеЗаполнения);
	
	СтрокаРеквизита.ТипСтрокой = SUI_ОбщегоНазначенияПереопределяемый.СтроковоеПредставлениеТипа(СтрокаРеквизита.Тип);
	СтрокаРеквизита.Представление = МетаданныеЗаполнения.Представление();
	СтрокаРеквизита.СтандартныйРеквизит = СтандартныйРеквизит;
	
	Если ПустаяСтрока(СтрокаРеквизита.Синоним) Тогда
		СтрокаРеквизита.Синоним = СтрокаРеквизита.Представление;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
