
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьИнформациюПароля();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьПароль(Команда)

	Оповещение = Новый ОписаниеОповещения("УстановитьПарольЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.SUI_ПользователиТСД.Форма.ФормаУстановкаПароля", Новый Структура("ТекущийПароль", Объект.Пароль), 
		ЭтотОбъект, УникальныйИдентификатор, , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьПарольЗавершение(НовыйПароль, ДополнительныеПараметры) Экспорт
	
	Если НовыйПароль <> Неопределено И НовыйПароль <> Объект.Пароль Тогда
		Объект.Пароль = НовыйПароль;
		ОбновитьИнформациюПароля();
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнформациюПароля()
	
	Если ПустаяСтрока(Объект.Пароль) Тогда
		Элементы.ГруппаПароль.Подсказка = НСтр("ru = 'Пустой пароль'");
	Иначе
		Элементы.ГруппаПароль.Подсказка = НСтр("ru = 'Пароль установлен'");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
