
#Область ОписаниеПеременных

Перем SUI_ПараметрыПриложения Экспорт;

#КонецОбласти

#Область ОбработчикиСобытий

&После("ПриНачалеРаботыСистемы")
Процедура SUI_ПриНачалеРаботыСистемы()
	
	#Если Не МобильныйКлиент Тогда
	SUI_SimpleКлиент.ПриНачалеРаботыСистемы();	
	#КонецЕсли
	
КонецПроцедуры

&После("ПередЗавершениемРаботыСистемы")
Процедура SUI_ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения)
	
	#Если Не МобильныйКлиент Тогда
	SUI_ФайловаяСистемаКлиент.ПриЗавершенииРаботыСистемы();	
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область Инициализация

SUI_ПараметрыПриложения = Новый Соответствие();

#КонецОбласти
