
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Сохранить признак использования редактора JSON.
// 
// Параметры:
//  Значение - Булево - Признак использования редактора JSON.
Процедура СохранитьПризнакИспользованияРедактораJSON(Значение) Экспорт
	
	ОписаниеТипаБулево = Новый ОписаниеТипов("Булево");
	SUI_ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
		КлючОбщейНастройкиИспользоватьРедакторКодаJSON(), 
		ОписаниеТипаБулево.ПривестиЗначение(Значение));
	
КонецПроцедуры

// Получить признак использования редактора JSON.
// 
// Возвращаемое значение:
//  Булево - Признак использования редактора JSON.
Функция ПолучитьПризнакИспользованияРедактораJSON() Экспорт
	
	Возврат SUI_ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		КлючОбщейНастройкиИспользоватьРедакторКодаJSON(), Ложь);
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция КлючОбщейНастройкиИспользоватьРедакторКодаJSON() Экспорт
	
	Возврат "ИспользоватьРедактораJSON";
	
КонецФункции

#КонецОбласти

#КонецЕсли
