
#Область ПрограммныйИнтерфейс

Процедура ВыгрузитьНастройки(Оповещение = Неопределено, ВыбранныеНастройки = Неопределено) Экспорт

	Идентификатор = Новый УникальныйИдентификатор();
	
	АдресНастройки = SUI_НастройкиДокументовВызовСервера.ПолучитьДанныеНастроекДляВыгрузки(Идентификатор, ВыбранныеНастройки);
	
	Если АдресНастройки = Неопределено Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			СтрШаблон(НСтр("ru = 'Настройки документов %1 отсутствуют в системе.'"), SUI_SimpleКлиентСервер.Представление()));
		
		Если ТипЗнч(Оповещение) = Тип("ОписаниеОповещения") Тогда
			ВыполнитьОбработкуОповещения(Оповещение, Неопределено);
		КонецЕсли;

		Возврат;
		
	КонецЕсли;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ВыгрузитьНастройкиЗавершение", ЭтотОбъект, Новый Структура("Оповещение", Оповещение));

	ПараметрыСохранения = ФайловаяСистемаКлиент.ПараметрыСохраненияФайла();
	
	ПараметрыСохранения.Диалог.Заголовок = СтрШаблон(НСтр("ru = 'Сохранение настроек документов %1'"), SUI_SimpleКлиентСервер.Представление());
	ПараметрыСохранения.Диалог.Фильтр = СтрШаблон(НСтр("ru = 'Настройки документов %1'"), SUI_SimpleКлиентСервер.Представление()) + " (*.xml)|*.xml";
	ПараметрыСохранения.Диалог.МножественныйВыбор = Ложь;
	
	ФайловаяСистемаКлиент.СохранитьФайл(ОповещениеОЗавершении, АдресНастройки,
		СтрШаблон(НСтр("ru = 'НастройкиДокументов%1.xml'"), SUI_SimpleКлиентСервер.ИмяРасширения()), ПараметрыСохранения);
	
КонецПроцедуры

Процедура ЗагрузитьНастройки(Оповещение = Неопределено) Экспорт

	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗагрузитьНастройкиЗавершение", ЭтотОбъект, 
		Новый Структура("ПерезаписыватьСуществующие, Оповещение", Ложь, Оповещение));
	
	ПараметрыЗагрузки = ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла();
	
	ПараметрыЗагрузки.Диалог.Заголовок = СтрШаблон(НСтр("ru = 'Загрузка настроек документов %1'"), SUI_SimpleКлиентСервер.Представление());
	ПараметрыЗагрузки.Диалог.Фильтр = СтрШаблон(НСтр("ru = 'Настройка документов %1'"), SUI_SimpleКлиентСервер.Представление()) + " (*.xml)|*.xml";
	ПараметрыЗагрузки.Диалог.МножественныйВыбор = Истина;
	
	ФайловаяСистемаКлиент.ЗагрузитьФайлы(ОповещениеОЗавершении, ПараметрыЗагрузки);
	
КонецПроцедуры

Процедура ЗаписатьВыбранныеНастройкиЗавершение(Оповещение = Неопределено, СтруктураЗагруженныхНастроек) Экспорт
	
	ОчиститьСообщения();
		
	РезультатЗагрузки = SUI_НастройкиДокументовВызовСервера.ЗагрузитьВыбранныеНастройкиИзФайла(СтруктураЗагруженныхНастроек);
	
	Если РезультатЗагрузки.Загружена Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Настройки были успешно записаны'"));
		
	Иначе
		
		Если РезультатЗагрузки.Свойство("Ошибка") Тогда
			ПоказатьПредупреждение(, СтрШаблон(НСтр("ru = 'ОШИБКА!
			|
			|%1'"), РезультатЗагрузки.Ошибка));
		Иначе
			ПоказатьПредупреждение(, СтрШаблон(НСтр("ru = 'ОШИБКА!
			|
			|Во время загрузки настроек документов %1 возникла ошибка.'"), SUI_SimpleКлиентСервер.Представление()));
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗнч(Оповещение) = Тип("ОписаниеОповещения") Тогда
		ВыполнитьОбработкуОповещения(Оповещение, РезультатЗагрузки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ВыгрузитьНастройкиЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если ТипЗнч(Результат) <> Тип("Массив") Или Результат.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Настройки документов %1 выгружены по пути %2'"), 
		SUI_SimpleКлиентСервер.Представление(), Результат[0].ПолноеИмя));
	
	Если ЭтоАдресВременногоХранилища(Результат[0].Хранение) Тогда
		УдалитьИзВременногоХранилища(Результат[0].Хранение);
	КонецЕсли;
	
	Если ТипЗнч(ДополнительныеПараметры.Оповещение) = Тип("ОписаниеОповещения") Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.Оповещение, Новый Структура("ПолноеИмя", Результат[0].ПолноеИмя));
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузитьНастройкиЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		
		Если ТипЗнч(ДополнительныеПараметры.Оповещение) = Тип("ОписаниеОповещения") Тогда
			ВыполнитьОбработкуОповещения(ДополнительныеПараметры.Оповещение, Неопределено);
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	ОчиститьСообщения();
	
	Для Каждого СтрокаРезультата Из Результат Цикл 
		
		
		РезультатЗагрузки = SUI_НастройкиДокументовВызовСервера.ПолучитьСписокНастроекИзФайла(СтрокаРезультата.Хранение, ДополнительныеПараметры.ПерезаписыватьСуществующие);
		
		Если Не РезультатЗагрузки.Свойство("АдресНастроек") Тогда
			
			Если РезультатЗагрузки.Свойство("Ошибка") Тогда
				ПоказатьПредупреждение(, СтрШаблон(НСтр("ru = 'ОШИБКА!
				|
				|%1'"), РезультатЗагрузки.Ошибка));
			Иначе
				ПоказатьПредупреждение(, СтрШаблон(НСтр("ru = 'ОШИБКА!
				|
				|Во время загрузки настроек документов %1 возникла ошибка.'"), SUI_SimpleКлиентСервер.Представление()));
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТипЗнч(ДополнительныеПараметры.Оповещение) = Тип("ОписаниеОповещения") Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.Оповещение, РезультатЗагрузки);
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти
