
#Область ПрограммныйИнтерфейс

Функция ЕстьВозможностьОткрытьЗагрузкуДокумента(СтатусОбработкиДОкумента, ДокументСсылка) Экспорт
	
	Если СтатусОбработкиДОкумента.ВсегоЗаданийОчереди > 0 Или СтатусОбработкиДОкумента.НеОбработанныхСообщенийОбмена > 0 Тогда
		
		Сообщения = Новый Массив();
		
		Если СтатусОбработкиДОкумента.ОткрытыхЗаданийВОчереди > 0 Тогда
			ТекстСообщения = НСтр("ru = 'Для документа %1 открыто %2 заданий в очереди заданий.
			|Дождитесь обработки и попробуйте снова.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ДокументСсылка, СтатусОбработкиДОкумента.ОткрытыхЗаданийВОчереди);
			Сообщения.Добавить(ТекстСообщения);
		КонецЕсли;
		
		Если СтатусОбработкиДОкумента.ВыполняющихсяЗаданийВОчереди > 0 Тогда
			ТекстСообщения = НСтр("ru = 'Для документа %1 выполняется %2 заданий в очереди заданий.
			|Дождитесь обработки и попробуйте снова.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ДокументСсылка, СтатусОбработкиДОкумента.ОткрытыхЗаданийВОчереди);
			Сообщения.Добавить(ТекстСообщения);
		КонецЕсли;
		
		Если СтатусОбработкиДОкумента.ЗаданийВОчередиСОшибкой > 0 Тогда
			ТекстСообщения = НСтр("ru = 'Для документа %1 в очереди заданий есть %2 заданий с ошибками.
			|Проверьте ошибки задний в очереди заданий и в журнале регистрации.
			|Для возобновления попробуйте переоткрыть задания или удалите.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ДокументСсылка, СтатусОбработкиДОкумента.ОткрытыхЗаданийВОчереди);
			Сообщения.Добавить(ТекстСообщения);
		КонецЕсли;
		
		Если СтатусОбработкиДОкумента.НеОбработанныхСообщенийОбмена > 0 Тогда
			ТекстСообщения = НСтр("ru = 'Для документа %1 в сообщениях обмена данными есть %2 сообщений.
			|Дождитесь обработки и попробуйте снова.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ДокументСсылка, СтатусОбработкиДОкумента.ОткрытыхЗаданийВОчереди);
			Сообщения.Добавить(ТекстСообщения);
		КонецЕсли;
		
		Для индекс = 0 По Сообщения.ВГраница() Цикл
			ОбщегоНазначенияКлиент.СообщитьПользователю(Сообщения[индекс]);
		КонецЦикла;
	
		Возврат Ложь;
		
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
