
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	НаименованиеПримера = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "НаименованиеПримера", "", Тип("Строка"));

	Для Каждого ЭлементСтраница Из Элементы.СтраницыПримеры.ПодчиненныеЭлементы Цикл
		ЭлементСтраница.Видимость = Ложь;
	КонецЦикла;

	Если НаименованиеПримера = "ПримерЗаполненияМобильногоУстройства" Тогда
		Элементы.СтраницыПримеры.ТекущаяСтраница = Элементы.ПримерЗаполненияМобильногоУстройства;
	ИначеЕсли НаименованиеПримера = "ПримерФормаРабочегоМестаОнлайн" Тогда
		Элементы.СтраницыПримеры.ТекущаяСтраница = Элементы.ПримерФормаРабочегоМестаОнлайн;
	ИначеЕсли НаименованиеПримера = "ПримерФормаРабочегоМестаОфлайн" Тогда
		Элементы.СтраницыПримеры.ТекущаяСтраница = Элементы.ПримерФормаРабочегоМестаОфлайн;
	Иначе
		Элементы.СтраницыПримеры.ТекущаяСтраница = Элементы.ПримерПустая;
	КонецЕсли;

	Элементы.СтраницыПримеры.ТекущаяСтраница.Видимость = Истина;

	Заголовок = НСтр("ru = 'Пример'");

КонецПроцедуры

#КонецОбласти
