
#Область ПрограммныйИнтерфейс

// Возвращает значение свойства структуры.
//
// Параметры:
//   Структура - Структура
//             - ФиксированнаяСтруктура - объект, из которого необходимо прочитать значение ключа.
//   Ключ - Строка - имя свойства структуры, для которого необходимо прочитать значение.
//   ЗначениеПоУмолчанию - Произвольный - возвращается когда в структуре нет значения по указанному ключу.
//   ОжидаемыйТип - ОписаниеТипов, Тип - Тип к которуму необходимо привести полученное значение.
//       Для скорости рекомендуется передавать только быстро вычисляемые значения (например примитивные типы),
//       а инициализацию более тяжелых значений выполнять после проверки полученного значения (только если это
//       требуется).
//
// Возвращаемое значение:
//   Произвольный - значение свойства структуры. ЗначениеПоУмолчанию если в структуре нет указанного свойства.
// 
Функция СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено, Знач ОжидаемыйТип = Неопределено) Экспорт
	
	Если ТипЗнч(Структура) <> Тип("Структура") 
		И ТипЗнч(Структура) <> Тип("ФиксированнаяСтруктура")
		И ТипЗнч(Структура) <> Тип("ДанныеФормыСтруктура") Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Если СтрНайти(Ключ, ".") > 0 Тогда
		Возврат СвойствоСтруктуры(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Структура, 
			Лев(Ключ, СтрНайти(Ключ, ".") - 1)), Сред(Ключ, СтрНайти(Ключ, ".")+1), ЗначениеПоУмолчанию, ОжидаемыйТип);
	Иначе
		
		ЗначениеКлюча = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию);
		
		Если ОжидаемыйТип <> Неопределено Тогда

			ТипЗначенияОжидаемыйТип = ТипЗнч(ОжидаемыйТип);
			
			Если ТипЗначенияОжидаемыйТип = Тип("Тип") Тогда
				ОжидаемыйТип = Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОжидаемыйТип));
			ИначеЕсли ТипЗначенияОжидаемыйТип <> Тип("ОписаниеТипов") Тогда
				ОжидаемыйТип = Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТипЗначенияОжидаемыйТип));
			КонецЕсли;
			
			ЗначениеКлюча = ОжидаемыйТип.ПривестиЗначение(ЗначениеКлюча);
			
		КонецЕсли;
		
		Возврат ЗначениеКлюча;
		
	КонецЕсли;
	
КонецФункции

// Возвращает значение значение соответствия по ключу.
//
// Параметры:
//   Соответствие - Соответствие
//             - ФиксированноеСоответствие - объект, из которого необходимо прочитать значение ключа.
//   Ключ - Строка - имя ключа свойства, для которого необходимо прочитать значение.
//   ЗначениеПоУмолчанию - Произвольный - возвращается когда в свойстве нет значения по указанному ключу.
//   ОжидаемыйТип - ОписаниеТипов, Тип - Тип к которуму необходимо привести полученное значение.
//
// Возвращаемое значение:
//   Произвольный - значение ключа соответствия. ЗначениеПоУмолчанию если в соответствии нет указанного ключа.
// 
//@skip-check doc-comment-collection-item-type
Функция ЗначениеСоответствия(Соответствие, Ключ, ЗначениеПоУмолчанию = Неопределено, Знач ОжидаемыйТип = Неопределено) Экспорт
	
	Если ТипЗнч(Соответствие) <> Тип("Соответствие") И ТипЗнч(Соответствие) <> Тип("ФиксированноеСоответствие") Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	ЗначениеКлюча = Соответствие.Получить(Ключ);
	
	Если ЗначениеКлюча = Неопределено Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Если ОжидаемыйТип <> Неопределено Тогда

		ТипЗначенияОжидаемыйТип = ТипЗнч(ОжидаемыйТип);
		
		Если ТипЗначенияОжидаемыйТип = Тип("Тип") Тогда
			ОжидаемыйТип = Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОжидаемыйТип));
		ИначеЕсли ТипЗначенияОжидаемыйТип <> Тип("ОписаниеТипов") Тогда
			ОжидаемыйТип = Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТипЗначенияОжидаемыйТип));
		КонецЕсли;
		
		ЗначениеКлюча = ОжидаемыйТип.ПривестиЗначение(ЗначениеКлюча);
		
	КонецЕсли;
	
	Возврат ЗначениеКлюча;
	
КонецФункции

// Параметры завершения работы. см. SUI_ОбщегоНазначенияКлиент.ВыполнитьЗавершениеРаботыСистемы
// 
// Возвращаемое значение:
//  Структура - Параметры завершения работы:
// * ЗапрашиватьВозможность - Булево - 
// * ПерезапуститьПриЗавершении - Булево - 
// * ДополнительныеПараметрыКоманднойСтроки - Строка, Неопределено -
// * ТекстПредупреждения - Строка, Неопределено -
Функция ПараметрыЗавершенияРаботы() Экспорт
	
	Параметры = Новый Структура();
	
	Параметры.Вставить("ЗапрашиватьВозможность", Ложь);
	Параметры.Вставить("ПерезапуститьПриЗавершении", Ложь);
	Параметры.Вставить("ДополнительныеПараметрыКоманднойСтроки");
	Параметры.Вставить("ТекстПредупреждения");
	
	//@skip-check constructor-function-return-section
	Возврат Параметры;
		
КонецФункции

// Описание типа булево.
// 
// Возвращаемое значение:
//  ОписаниеТипов - Описание типа булево
Функция ОписаниеТипаБулево() Экспорт
	Возврат Новый ОписаниеТипов("Булево");
КонецФункции

// Вес версии.
// 
// Параметры:
//  Версия - Строка - Версия строкой
// 
// Возвращаемое значение:
//  Число - Вес версии
Функция ВесВерсии(Знач Версия) Экспорт
	
	Вес = 0;
	
	Версия = SUI_СтроковыеФункцииКлиентСервер.ОбработатьСтрокуВерсии(Версия);
	
	Если Не СтрНачинаетсяС(Версия, ПустаяВерсия()) Тогда

		РазобраннаяВерсия = СтрРазделить(Версия, "-");
		
		Для индекс = 0 По РазобраннаяВерсия.ВГраница() Цикл
			
			Если индекс = 0 Тогда
				
				РазрядыВерсии = СтрРазделить(РазобраннаяВерсия[индекс], ".");
				
				Вес = Вес
					+ Число(РазрядыВерсии[0]) * 100000000000000000
					+ Число(РазрядыВерсии[1]) * 100000000000000
					+ Число(РазрядыВерсии[2]) * 100000000000
					+ Число(РазрядыВерсии[3]) * 100000000;

			ИначеЕсли индекс = 1 Тогда
				
				ИндексПредрелиза = ИменаПредрелизныхСборок().Найти(РазобраннаяВерсия[индекс]);
				
				Если ИндексПредрелиза = Неопределено Тогда
					Прервать;
				КонецЕсли;
				
				Вес = Вес + (ИндексПредрелиза+1)*10000;
				
			ИначеЕсли индекс = 2 Тогда
				Вес = Вес + Число(РазобраннаяВерсия[индекс]);
			Иначе
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Вес;
	
КонецФункции

// Доступные имена предрелизных сборок.
// 
// Возвращаемое значение:
//  Массив из Строка - Имена предрелизных сборок
Функция ИменаПредрелизныхСборок() Экспорт
	
	Имена = Новый Массив();
	
	Имена.Добавить("a");
	Имена.Добавить("alpha");
	Имена.Добавить("b");
	Имена.Добавить("beta");
	Имена.Добавить("r");
	Имена.Добавить("rc");
	
	Возврат Имена;
	
КонецФункции

// Пустая версия.
// 
// Возвращаемое значение:
//  Строка - Пустая версия строкой
Функция ПустаяВерсия() Экспорт
	Возврат "0.0.0.0";
КонецФункции

Функция ШаблонУникальногоИдентификатора() Экспорт
	
	ЧастиШаблона = Новый Массив();
	
	Для Индекс = 1 По 36 Цикл
		
		Если Индекс = 9 Или
			Индекс = 14 Или
			Индекс = 19 Или
			Индекс = 24 Тогда
			ЧастиШаблона.Добавить("[-]");
		Иначе
			ЧастиШаблона.Добавить("[A-Fa-f0-9]");
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтрСоединить(ЧастиШаблона);
	
КонецФункции

Функция ПривестиКПростомуТипу(Значение) Экспорт
	
	ОписаниеПростыхТипов = Новый ОписаниеТипов(МассивЗначений(Тип("Строка"), Тип("Число"), Тип("Дата"), Тип("Булево")));
	
	Возврат ОписаниеПростыхТипов.ПривестиЗначение(Значение);
	
КонецФункции

// Создает массив и помещает в него переданные значения.
//
// Параметры:
//  Значение1 - Произвольный - любое значение.
//  Значение2 - Произвольный
//  Значение3 - Произвольный
//  Значение4 - Произвольный
//
// Возвращаемое значение:
//  Массив - Значения в массиве
//  
// Пример:
//   Результат = ОбщегоНазначенияКлиентСервер.МассивЗначений(1, 2, 3);
//
Функция МассивЗначений(Знач Значение1, Знач Значение2 = Неопределено, Знач Значение3 = Неопределено, Знач Значение4 = Неопределено) Экспорт
	
	Результат = Новый Массив();
	
	Результат.Добавить(Значение1);
	
	Если Значение2 <> Неопределено Тогда
		Результат.Добавить(Значение2);
	КонецЕсли;
	
	Если Значение3 <> Неопределено Тогда
		Результат.Добавить(Значение3);
	КонецЕсли;
	
	Если Значение4 <> Неопределено Тогда
		Результат.Добавить(Значение4);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция КаталогВспомогательныхБиблиотекSimple(РабочийКаталогПользователя, Знач ВерсияРасширения) Экспорт
	
	Если Не ЗначениеЗаполнено(ВерсияРасширения) Тогда
		ВерсияРасширения = "0.1";
	КонецЕсли;
	
	Возврат ОбъединитьПути(РабочийКаталогПользователя, "sui_simple", Формат(ВерсияРасширения, "ЧГ=0;"), "lib");
	
КонецФункции

// Объединяет компоненты файлового пути, с учетом разделителей, принятых в данной ОС. 
// При этом корректно, без дублирования, обрабатываются уже существующие разделители пути.
// 
// Параметры:
//  Путь1 - Строка - Первая часть пути
//  Путь2 - Строка - Вторая часть пути
//  Путь3 - Строка, Неопределено - Третья часть пути
//  Путь4 - Строка, Неопределено - Четвертая часть пути
// 
// Возвращаемое значение:
//  Строка - Объединенный путь.
Функция ОбъединитьПути(Путь1, Путь2, Путь3 = Неопределено, Путь4 = Неопределено) Экспорт
	Разделитель = ПолучитьРазделительПути();
	
	МассивПути = СтрРазделить(Путь1, Разделитель, Ложь);
	
	Если СтрНачинаетсяС(Путь1, Разделитель) Тогда
		МассивПути.Вставить(0, "");
	КонецЕсли;
	
	ДопПути = Новый Массив;
	ДопПути.Добавить(Путь2);
	Если ЗначениеЗаполнено(Путь3) Тогда
		ДопПути.Добавить(Путь3);
	КонецЕсли;
	Если ЗначениеЗаполнено(Путь4) Тогда
		ДопПути.Добавить(Путь4);
	КонецЕсли;
	
	Для Каждого ТекПуть Из ДопПути Цикл
		МассивТекПути = СтрРазделить(ТекПуть, Разделитель, Ложь);
		
		Для Каждого ТекКусочекПути Из МассивТекПути Цикл
			МассивПути.Добавить(ТекКусочекПути);
		КонецЦикла;
	КонецЦикла;
	
	Возврат СтрСоединить(МассивПути, Разделитель);
	
КонецФункции

Функция ПолучитьДатуИзСтрокиISO8601(Знач ДатаСтрокой, ВызыватьИсключение = Ложь) Экспорт
	
	Результат = Дата(1, 1, 1);
	
	ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка");
	ДатаСтрокой = ОписаниеТипаСтрока.ПривестиЗначение(ДатаСтрокой);
	
	ПозицияРазделительЗоны = СтрНайти(ДатаСтрокой, "Z");
	Если ПозицияРазделительЗоны > 0 Тогда
		ДатаСтрокой = Лев(ДатаСтрокой, ПозицияРазделительЗоны - 1);
	КонецЕсли;
	
	СтрокаДата = ДатаСтрокой;
	СтрокаВремя = "";
	
	ПозицияРазделительВремени = СтрНайти(ДатаСтрокой, "T");
	Если ПозицияРазделительВремени > 0 Тогда
		СтрокаДата = Лев(ДатаСтрокой, ПозицияРазделительВремени - 1);
		СтрокаВремя = Сред(ДатаСтрокой, ПозицияРазделительВремени + 1);
	КонецЕсли;
	
	СРазделителями = СтрНайти(СтрокаДата, "-") > 0;
	
	Если (СРазделителями И СтрДлина(СтрокаДата) <> 10) Или
		(Не СРазделителями И СтрДлина(СтрокаДата) <> 8) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если Не ПустаяСтрока(СтрокаВремя) И 
		((СРазделителями И СтрДлина(СтрокаВремя) <> 8) Или
		(Не СРазделителями И СтрДлина(СтрокаВремя) <> 6)) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ДатаСтрокой = СтрокаДата;
	
	Если Не ПустаяСтрока(СтрокаВремя) Тогда
		ДатаСтрокой = ДатаСтрокой + ?(СРазделителями, " ", "") + СтрокаВремя;
	КонецЕсли;
	
	Попытка
		Результат = СтроковыеФункцииКлиентСервер.СтрокаВДату(ДатаСтрокой, ЧастиДаты.ДатаВремя);
	Исключение
		Если ВызыватьИсключение Тогда
			ВызватьИсключение;
		КонецЕсли;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#Область СериализацияJSON

// Данные из строки JSON. Если выполнение производится через ВебКлиент и переданы параметры:
// 	НастройкиСериализации, ИмяФункцииПреобразования, МодульФункцииПреобразования или ДополнительныеПараметрыФункцииПреобразования,
// 	то будет вызвано исключение. Для выполнения на ВебКлиенте с передачей параметров см. SUI_ОбщегоНазначенияВызовСервера.ДанныеИзСтрокиJSON
// 
//--------------------------------------------
//@skip-check method-too-many-params
//@skip-check doc-comment-collection-item-type
//
// Параметры:
//  СтрокаJSON - Строка - Строка JSON
//  ПрочитатьВСоответствие - Булево - Если установлено Истина, чтение объекта JSON будет выполнено в Соответствие. 
//  	Если установлено Ложь, объекты будут считываться в объект типа Структура. 
//  	Примечание. При десериализации объектов JSON в структуру необходимо помнить о требованиях к ключам структуры. 
//  	Если при десериализации объекта будет найдено имя свойства, недопустимое для ключа структуры, 
//  	то будет вызвано исключение.
//  ИменаСвойствСоЗначениямиДата - Массив, ФиксированныйМассив, Строка - Массив, элементы которого содержат имена свойств JSON, 
//  	для которых нужно вызывать восстановление даты из строки. 
//  	Если имя свойства указано в этом параметре и указано в параметре ИменаСвойствДляОбработкиВосстановления, 
//  	то для таких свойств восстановление осуществляется в функции восстановления. 
//  	Если восстановление даты из значения свойства невозможно, то будет сгенерировано исключение.
//  ОжидаемыйФорматДаты - ФорматДатыJSON - Ожидаемый формат даты при десериализации объекта в формате JSON. 
//  	Если в результате десериализации значение не является строкой и имеет формат даты, отличный от ожидаемого, 
//  	то будет вызвано исключение.
//  ИмяФункцииВосстановления - Строка - Данная функция вызывается при чтении каждого свойства и должна иметь следующие параметры:
//  	<Свойство> - значение типа Строка, указывается только при чтении объектов JSON,
//  	<Значение> - значение допустимого для сериализации типа,
//  	<ДополнительныеПараметры>
//  	Возвращаемое значение - произвольного типа. Если данный параметр задан и не задан параметр <МодульФункцииВосстановления>, 
//  	и наоборот, будет вызвано исключение. Если функция не установлена, то при вызове метода ПрочитатьJSON параметр <ИменаСвойствСоЗначениямиДата> игнорируется.
//  МодульФункцииВосстановления - Произвольный - Указывает модуль, процедура которого будет использована для восстановления значения.
//  ДополнительныеПараметрыФункцииВосстановления - Произвольный - Дополнительные параметры, которые будут переданы в функцию восстановления значений.
//  ИменаСвойствДляОбработкиВосстановления - Массив - Массив имен свойств JSON, для которых будет вызвана функция восстановления. 
//  	Параметр игнорируется, если не установлен параметр ИмяФункцииВосстановления.
// 
// Возвращаемое значение:
//  Произвольный, Null, Булево, Массив, Соответствие, Строка, Число, Неопределено - Данные из строки JSON
Функция ДанныеИзСтрокиJSON(СтрокаJSON, ПрочитатьВСоответствие = Истина, ИменаСвойствСоЗначениямиДата = Неопределено, 
	Знач ОжидаемыйФорматДаты = Неопределено, ИмяФункцииВосстановления = "", 
	МодульФункцииВосстановления = Неопределено, ДополнительныеПараметрыФункцииВосстановления = Неопределено, 
	ИменаСвойствДляОбработкиВосстановления = Неопределено) Экспорт
	
	ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка");
	Если ПустаяСтрока(ОписаниеТипаСтрока.ПривестиЗначение(СтрокаJSON)) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	#Если ВебКлиент Тогда
		
		Если ЗначениеЗаполнено(ИменаСвойствСоЗначениямиДата) Или
			ЗначениеЗаполнено(ОжидаемыйФорматДаты) Или ЗначениеЗаполнено(ИмяФункцииВосстановления) Или
			МодульФункцииВосстановления <> Неопределено Или ЗначениеЗаполнено(ДополнительныеПараметрыФункцииВосстановления) Или
			ЗначениеЗаполнено(ИменаСвойствДляОбработкиВосстановления) Тогда
			ВызватьИсключение НСтр("ru = 'Недопустимый  вызов в Web-клиенте'");	
		Иначе
			Возврат ЗначениеИзСтрокиJSON(СтрокаJSON, ПрочитатьВСоответствие);
		КонецЕсли;
		
	#Иначе
		
		Если ОжидаемыйФорматДаты = Неопределено Тогда
			ОжидаемыйФорматДаты = ФорматДатыJSON.ISO;
		КонецЕсли;
		
		ЧтениеJSON = Новый ЧтениеJSON();
		ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
		
		Данные = ПрочитатьJSON(ЧтениеJSON, ПрочитатьВСоответствие, ИменаСвойствСоЗначениямиДата, ОжидаемыйФорматДаты,
			ИмяФункцииВосстановления, МодульФункцииВосстановления, ДополнительныеПараметрыФункцииВосстановления, 
			ИменаСвойствДляОбработкиВосстановления);
		
		ЧтениеJSON.Закрыть();
		
		Возврат Данные;
		
	#КонецЕсли
	
КонецФункции

// Данные в строку JSON. Если выполнение производится через ВебКлиент и переданы параметры:
// 	НастройкиСериализации, ИмяФункцииПреобразования, МодульФункцииПреобразования или ДополнительныеПараметрыФункцииПреобразования,
// 	то будет вызвано исключение. Для выполнения на ВебКлиенте с передачей параметров см. SUI_ОбщегоНазначенияВызовСервера.ДанныеВСтрокуJSON
//--------------------------------------------
//@skip-check method-too-many-params
//@skip-check doc-comment-collection-item-type
//
// Параметры:
//  Значение - Строка, Число, Дата, Массив, ФиксированныйМассив, Структура, ФиксированнаяСтруктура, Соответствие, ФиксированноеСоответствие - Объект записи JSON
//  НастройкиСериализации - НастройкиСериализацииJSON - Настройки сериализации
//  ИмяФункцииПреобразования - Строка - Имя функции преобразования. 
//  	Данная функция вызывается для всех свойств, тип которых не поддерживает преобразование в формат JSON напрямую. 
//  	Она должна преобразовать Значение в значение допустимого для записи в JSON типа. 
//  	Функция должна предваряться директивой &&НаСервере или &&НаКлиенте. 
//  	Использование функции вне контекста формы или модуля, или команды не допускается. 
//  	Функция должна быть экспортной и иметь следующие параметры:
//  		<Свойство> - в параметр передается имя свойства, если выполняется запись структуры или соответствия,
//  		<Значение> - в параметр передается исходное значение,
//			<ДополнительныеПараметры> - дополнительные параметры, которые указаны в вызове метода ЗаписатьJSON,
//			<Отказ> - отказ от записи свойства.
//		Если функция возвращает объект, который не поддерживает преобразование в JSON, то будет вызвано исключение. 
//		Если данный параметр задан и не задан параметр <МодульФункцииПреобразования>, и наоборот, будет вызвано исключение.
//  МодульФункцииПреобразования - ОбщийМодуль - Указывает модуль, в котором реализована функция преобразования значения в значение формата JSON.
//  ДополнительныеПараметрыФункцииПреобразования - Произвольный - Дополнительные параметры, которые будут переданы в функцию преобразования.
// 
// Возвращаемое значение:
//  Строка - Данные в строку JSON
Функция ДанныеВСтрокуJSON(Значение, НастройкиСериализации = Неопределено, ИмяФункцииПреобразования = "", 
	МодульФункцииПреобразования = Неопределено, ДополнительныеПараметрыФункцииПреобразования = Неопределено) Экспорт
	
	#Если ВебКлиент Тогда
		
		Если ЗначениеЗаполнено(НастройкиСериализации) Или 
			ЗначениеЗаполнено(ИмяФункцииПреобразования) Или
			МодульФункцииПреобразования <> Неопределено Или 
			ЗначениеЗаполнено(ДополнительныеПараметрыФункцииПреобразования) Тогда
			ВызватьИсключение НСтр("ru = 'Недопустимый  вызов в Web-клиенте'");
		Иначе
			Возврат ЗначениеВСтрокуJSON(Значение);
		КонецЕсли;
		
	#Иначе
		
		ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(, Символы.Таб);
		
		ЗаписьJSON = Новый ЗаписьJSON();
		ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
		ЗаписатьJSON(ЗаписьJSON, Значение, НастройкиСериализации, ИмяФункцииПреобразования, МодульФункцииПреобразования,
			ДополнительныеПараметрыФункцииПреобразования);
			
		Возврат ЗаписьJSON.Закрыть();
		
	#КонецЕсли
	
КонецФункции

// Проверяет доступность типа к преобразованию в JSON.
// 
// Параметры:
//  ТипЗначения - Тип - Тип значения
// 
// Возвращаемое значение:
//  Булево - Тип доступен к преобразованию в JSON
Функция ТипыДоступенКПреобразованиюВJSON(ТипЗначения) Экспорт
	
	Если ТипЗначения = Тип("Строка") Или
		ТипЗначения = Тип("Число") Или
		ТипЗначения = Тип("Булево") Или
		ТипЗначения = Тип("Дата") Или
		ТипЗначения = Тип("Структура") Или
		ТипЗначения = Тип("ФиксированнаяСтруктура") Или
		ТипЗначения = Тип("Соответствие") Или
		ТипЗначения = Тип("ФиксированноеСоответствие") Или
		ТипЗначения = Тип("Массив") Или
		ТипЗначения = Тип("ФиксированныйМассив") Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РаботаСJSONВВебКлиенте

Функция ЗначениеИзСтрокиJSON(СтрокаJSON, ПрочитатьВСоответствие = Истина) Экспорт
	
	Возврат СледующееЗначениеИзСтрокиJSON(СтрокаJSON, СтрДлина(СтрокаJSON), ПрочитатьВСоответствие);
	
КонецФункции

Функция ЗначениеВСтрокуJSON(Значение, Уровень = 0) Экспорт
	
	Результат = "";
	
	ТипЗначения = ТипЗнч(Значение);
	Если ТипЗначения = Тип("Строка") Тогда
		Результат = Значение;
		Если СтрНайти(Результат, """") Тогда
			Результат = СтрЗаменить(Результат, """", "\""");
		КонецЕсли;
		Если СтрНайти(Результат, Символы.ПС) Тогда
			Результат = СтрЗаменить(Результат, Символы.ПС, "\n");
		КонецЕсли;
		Результат = """" + Результат + """";
	ИначеЕсли ТипЗначения = Тип("Число") Тогда
		Результат = Формат(Значение, "ЧРД=.; ЧН=0; ЧГ=0");
	ИначеЕсли ТипЗначения = Тип("Дата") Тогда
		Результат = """" + Формат(Значение, "ДФ=yyyy-MM-ddTHH:mm:ss; ДП=0001-01-01T00:00:00") + """";
	ИначеЕсли ТипЗначения = Тип("Булево") Тогда
		Результат = Формат(Значение, "БЛ=false; БИ=true")
	ИначеЕсли ТипЗначения = Тип("Неопределено") 
		ИЛИ ТипЗначения = Тип("Null") Тогда
		Результат = "null";
	ИначеЕсли ТипЗначения = Тип("Массив")
		ИЛИ ТипЗначения = Тип("ФиксированныйМассив") Тогда
		Результат = Результат + "[";
		Уровень = Уровень + 1;
		ПервыйЭлемент = Истина;
		Для Каждого Элемент Из Значение Цикл
			Если ПервыйЭлемент Тогда
				ПервыйЭлемент = Ложь;
			Иначе
				Результат = Результат + ", ";
			КонецЕсли;
			Результат = Результат + Символы.ПС + ОтступУровняВложенностиJSON(Уровень)
				+ ЗначениеВСтрокуJSON(Элемент, Уровень);
		КонецЦикла;
		Уровень = Уровень - 1;
		Результат = Результат + Символы.ПС + ОтступУровняВложенностиJSON(Уровень) + "]";
	ИначеЕсли ТипЗначения = Тип("Структура")
		ИЛИ ТипЗначения = Тип("ФиксированнаяСтруктура") Тогда
		Результат = Результат + "{";
		ПервыйЭлемент = Истина;
		Уровень = Уровень + 1;
		Для Каждого Элемент Из Значение Цикл
			Если ПервыйЭлемент Тогда
				ПервыйЭлемент = Ложь;
			Иначе
				Результат = Результат + ",";
			КонецЕсли;
			Результат = Результат + Символы.ПС + ОтступУровняВложенностиJSON(Уровень)
				+ """" + Элемент.Ключ  + """: " + ЗначениеВСтрокуJSON(Элемент.Значение, Уровень);
		КонецЦикла;
		Уровень = Уровень - 1;
		Результат = Результат + Символы.ПС + ОтступУровняВложенностиJSON(Уровень) + "}";
	Иначе
		ВызватьИсключение НСтр("ru = 'Передано значение недопустимого типа'");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СледующееЗначениеИзСтрокиJSON(СтрокаJSON, ДлинаСтроки, НомерСимвола = 1, ЕстьСледующее = Ложь, ПрочитатьВСоответствие = Истина)
	
	Результат = Неопределено;
	ТипЗначения = Неопределено;
	НачальныйНомер = 0;
	
	СимволЭкранирован = Ложь;
	ЕстьЭкранированиеКавычек = Ложь;
	ЕстьПереносСтроки = Ложь;
	
	Пока ДлинаСтроки > НомерСимвола Цикл
		
		КодСимвола = КодСимвола(СтрокаJSON, НомерСимвола);
		Если ТипЗначения = Неопределено Тогда
			
			Если КодСимвола = 123 Тогда // {
				Результат = ?(ПрочитатьВСоответствие, Новый Соответствие, Новый Структура);
				ТипЗначения = 1; // КлючСтруктуры
				
			ИначеЕсли КодСимвола = 91 Тогда // [
				Результат = Новый Массив;
				ТипЗначения = 3; // ЗначениеМассива
				
			ИначеЕсли КодСимвола = 34 Тогда // "
				ТипЗначения = 4; // Строка
				НачальныйНомер = НомерСимвола + 1;
				
			ИначеЕсли КодСимвола = 45 // -
				ИЛИ (КодСимвола >= 48 И КодСимвола <= 57) Тогда // 0...9
				ТипЗначения = 5; // Число
				НачальныйНомер = НомерСимвола;
				
			ИначеЕсли КодСимвола = 116 Тогда // t
				Результат = Истина;
				НомерСимвола = НомерСимвола + 3;
				ТипЗначения = 0; // Разделитель
				
			ИначеЕсли КодСимвола = 102 Тогда // f
				Результат = Ложь;
				НомерСимвола = НомерСимвола + 4;
				ТипЗначения = 0; // Разделитель
				
			ИначеЕсли КодСимвола = 110 Тогда // n
				Результат = Null;
				НомерСимвола = НомерСимвола + 3;
				ТипЗначения = 0; // Разделитель
				
			КонецЕсли;
			
		ИначеЕсли ТипЗначения = 4 Тогда // Строка
			
			Если КодСимвола = 34 Тогда // "
				Если СимволЭкранирован Тогда
					СимволЭкранирован = Ложь;
					ЕстьЭкранированиеКавычек = Истина;
				Иначе
					ЧислоСимволов = НомерСимвола - НачальныйНомер;
					Результат = Сред(СтрокаJSON, НачальныйНомер, ЧислоСимволов);
					Если ЕстьЭкранированиеКавычек Тогда
						Результат = СтрЗаменить(Результат, "\""", """");
					КонецЕсли;
					Если ЕстьПереносСтроки Тогда
						Результат = СтрЗаменить(Результат, "\n", Символы.ПС);
					КонецЕсли;
					НачальныйНомер = 0;
					ТипЗначения = 0; // Разделитель
				КонецЕсли;
			ИначеЕсли КодСимвола = 92 Тогда // \
				СимволЭкранирован = Истина;
			ИначеЕсли КодСимвола = 110 И СимволЭкранирован Тогда // n
				ЕстьПереносСтроки = Истина;
				СимволЭкранирован = Ложь;
			КонецЕсли;
			
		ИначеЕсли ТипЗначения = 5 Тогда // Число
			
			Если Не ((КодСимвола >= 48 И КодСимвола <= 57) // 0...9
				ИЛИ КодСимвола = 46) Тогда // .
				Результат = Число(Сред(СтрокаJSON, НачальныйНомер, НомерСимвола - НачальныйНомер));
				НачальныйНомер = 0;
				ТипЗначения = 0; // Разделитель
			КонецЕсли;
			
		ИначеЕсли ТипЗначения = 1 Тогда // КлючСтруктуры
			
			Если КодСимвола = 34 Тогда // "
				
				Если НачальныйНомер = 0 Тогда
					НачальныйНомер = НомерСимвола + 1;
				Иначе
					КлючСтруктуры = Сред(СтрокаJSON, НачальныйНомер, НомерСимвола - НачальныйНомер);
					НачальныйНомер = 0;
					ТипЗначения = 0; // Разделитель
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли ТипЗначения = 2 Тогда // ЗначениеСтруктуры
			ЕстьСледующее = Ложь;
			ЗначениеСтруктуры = СледующееЗначениеИзСтрокиJSON(СтрокаJSON, ДлинаСтроки, НомерСимвола, ЕстьСледующее, ПрочитатьВСоответствие);
			Результат.Вставить(КлючСтруктуры, ЗначениеСтруктуры);
			Если ЕстьСледующее Тогда
				ТипЗначения = 1; // КлючСтруктуры
			Иначе
				ТипЗначения = 0; // Разделитель
			КонецЕсли;
			
		ИначеЕсли ТипЗначения = 3 Тогда // ЗначениеМассива
			ЕстьСледующее = Ложь;
			ЗначениеМассива = СледующееЗначениеИзСтрокиJSON(СтрокаJSON, ДлинаСтроки, НомерСимвола, ЕстьСледующее, ПрочитатьВСоответствие);
			Результат.Добавить(ЗначениеМассива);
			Если Не ЕстьСледующее Тогда
				ТипЗначения = 0; // Разделитель
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТипЗначения <> 0 Тогда // Разделитель
			
		ИначеЕсли КодСимвола = 58 Тогда // :
			ТипЗначения = 2; // ЗначениеСтруктуры
			
		ИначеЕсли КодСимвола = 93 ИЛИ КодСимвола = 125 Тогда // ] или }
			Возврат Результат;
			
		ИначеЕсли КодСимвола = 44 Тогда // ,
			ЕстьСледующее = Истина;
			Возврат Результат;
			
		КонецЕсли;
		
		НомерСимвола = НомерСимвола + 1;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ОтступУровняВложенностиJSON(Уровень)
	
	Результат = "";
	
	Для Счетчик = 1 По Уровень Цикл
		Результат = Результат + Символы.Таб;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти
