
#Область ПрограммныйИнтерфейс

// Параметры завершения работы. см. SUI_ОбщегоНазначенияКлиент.ВыполнитьЗавершениеРаботыСистемы
// 
// Возвращаемое значение:
//  Структура - Параметры завершения работы:
// * ЗапрашиватьВозможность - Булево - 
// * ПерезапуститьПриЗавершении - Булево - 
// * ДополнительныеПараметрыКоманднойСтроки - Строка, Неопределено -
// * ТекстПредупреждения - Строка, Неопределено -
Функция ПараметрыЗавершенияРаботы() Экспорт
	
	Параметры = Новый Структура();
	
	Параметры.Вставить("ЗапрашиватьВозможность", Ложь);
	Параметры.Вставить("ПерезапуститьПриЗавершении", Ложь);
	Параметры.Вставить("ДополнительныеПараметрыКоманднойСтроки");
	Параметры.Вставить("ТекстПредупреждения");
	
	//@skip-check constructor-function-return-section
	Возврат Параметры;
		
КонецФункции

// Описание типа булево.
// 
// Возвращаемое значение:
//  ОписаниеТипов - Описание типа булево
Функция ОписаниеТипаБулево() Экспорт
	Возврат Новый ОписаниеТипов("Булево");
КонецФункции

// Вес версии.
// 
// Параметры:
//  Версия - Строка - Версия строкой
// 
// Возвращаемое значение:
//  Число - Вес версии
Функция ВесВерсии(Знач Версия) Экспорт
	
	Вес = 0;
	
	Версия = SUI_СтроковыеФункцииКлиентСервер.ОбработатьСтрокуВерсии(Версия);
	
	Если Не СтрНачинаетсяС(Версия, ПустаяВерсия()) Тогда

		РазобраннаяВерсия = СтрРазделить(Версия, "-");
		
		Для индекс = 0 По РазобраннаяВерсия.ВГраница() Цикл
			
			Если индекс = 0 Тогда
				
				РазрядыВерсии = СтрРазделить(РазобраннаяВерсия[индекс], ".");
				
				Вес = Вес
					+ Число(РазрядыВерсии[0]) * 100000000000000000
					+ Число(РазрядыВерсии[1]) * 100000000000000
					+ Число(РазрядыВерсии[2]) * 100000000000
					+ Число(РазрядыВерсии[3]) * 100000000;

			ИначеЕсли индекс = 1 Тогда
				
				ИндексПредрелиза = ИменаПредрелизныхСборок().Найти(РазобраннаяВерсия[индекс]);
				
				Если ИндексПредрелиза = Неопределено Тогда
					Прервать;
				КонецЕсли;
				
				Вес = Вес + (ИндексПредрелиза+1)*10000;
				
			ИначеЕсли индекс = 2 Тогда
				Вес = Вес + Число(РазобраннаяВерсия[индекс]);
			Иначе
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Вес;
	
КонецФункции

// Доступные имена предрелизных сборок.
// 
// Возвращаемое значение:
//  Массив из Строка - Имена предрелизных сборок
Функция ИменаПредрелизныхСборок() Экспорт
	
	Имена = Новый Массив();
	
	Имена.Добавить("a");
	Имена.Добавить("alpha");
	Имена.Добавить("b");
	Имена.Добавить("beta");
	Имена.Добавить("r");
	Имена.Добавить("rc");
	
	Возврат Имена;
	
КонецФункции

// Пустая версия.
// 
// Возвращаемое значение:
//  Строка - Пустая версия строкой
Функция ПустаяВерсия() Экспорт
	Возврат "0.0.0.0";
КонецФункции

Функция ШаблонУникальногоИдентификатора() Экспорт
	
	ЧастиШаблона = Новый Массив();
	
	Для Индекс = 1 По 36 Цикл
		
		Если Индекс = 9 Или
			Индекс = 14 Или
			Индекс = 19 Или
			Индекс = 24 Тогда
			ЧастиШаблона.Добавить("[-]");
		Иначе
			ЧастиШаблона.Добавить("[A-Fa-f0-9]");
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтрСоединить(ЧастиШаблона);
	
КонецФункции

Функция ПривестиКПростомуТипу(Значение) Экспорт
	
	ОписаниеПростыхТипов = Новый ОписаниеТипов(МассивЗначений(Тип("Строка"), Тип("Число"), Тип("Дата"), Тип("Булево")));
	
	Возврат ОписаниеПростыхТипов.ПривестиЗначение(Значение);
	
КонецФункции

Функция ОбъединитьПути(Путь1, Путь2, Путь3 = Неопределено, Путь4 = Неопределено) Экспорт
	Разделитель = ПолучитьРазделительПути();
	
	МассивПути = СтрРазделить(Путь1, Разделитель, Ложь);
	
	Если СтрНачинаетсяС(Путь1, Разделитель) Тогда
		МассивПути.Вставить(0, "");
	КонецЕсли;
	
	ДопПути = Новый Массив;
	ДопПути.Добавить(Путь2);
	Если ЗначениеЗаполнено(Путь3) Тогда
		ДопПути.Добавить(Путь3);
	КонецЕсли;
	Если ЗначениеЗаполнено(Путь4) Тогда
		ДопПути.Добавить(Путь4);
	КонецЕсли;
	
	Для Каждого ТекПуть Из ДопПути Цикл
		МассивТекПути = СтрРазделить(ТекПуть, Разделитель, Ложь);
		
		Для Каждого ТекКусочекПути Из МассивТекПути Цикл
			МассивПути.Добавить(ТекКусочекПути);
		КонецЦикла;
	КонецЦикла;
	
	Возврат СтрСоединить(МассивПути, Разделитель);
	
КонецФункции

Функция ПолучитьДатуИзСтрокиISO8601(Знач ДатаСтрокой, ВызыватьИсключение = Ложь) Экспорт
	
	Результат = Дата(1, 1, 1);
	
	ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка");
	ДатаСтрокой = ОписаниеТипаСтрока.ПривестиЗначение(ДатаСтрокой);
	
	ПозицияРазделительЗоны = СтрНайти(ДатаСтрокой, "Z");
	Если ПозицияРазделительЗоны > 0 Тогда
		ДатаСтрокой = Лев(ДатаСтрокой, ПозицияРазделительЗоны - 1);
	КонецЕсли;
	
	СтрокаДата = ДатаСтрокой;
	СтрокаВремя = "";
	
	ПозицияРазделительВремени = СтрНайти(ДатаСтрокой, "T");
	Если ПозицияРазделительВремени > 0 Тогда
		СтрокаДата = Лев(ДатаСтрокой, ПозицияРазделительВремени - 1);
		СтрокаВремя = Сред(ДатаСтрокой, ПозицияРазделительВремени + 1);
	КонецЕсли;
	
	СРазделителями = СтрНайти(СтрокаДата, "-") > 0;
	
	Если (СРазделителями И СтрДлина(СтрокаДата) <> 10) Или
		(Не СРазделителями И СтрДлина(СтрокаДата) <> 8) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если Не ПустаяСтрока(СтрокаВремя) И 
		((СРазделителями И СтрДлина(СтрокаВремя) <> 8) Или
		(Не СРазделителями И СтрДлина(СтрокаВремя) <> 6)) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ДатаСтрокой = СтрокаДата;
	
	Если Не ПустаяСтрока(СтрокаВремя) Тогда
		ДатаСтрокой = ДатаСтрокой + ?(СРазделителями, " ", "") + СтрокаВремя;
	КонецЕсли;
	
	Попытка
		Результат = СтроковыеФункцииКлиентСервер.СтрокаВДату(ДатаСтрокой, ЧастиДаты.ДатаВремя);
	Исключение
		Если ВызыватьИсключение Тогда
			ВызватьИсключение;
		КонецЕсли;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Возвращает представление прошедшего времени
//
// Параметры:
//  РазницаВремени  - Число - Высчитанная разница времени в секундах/милисекундах
//	ВремяВМилисекундах - Булево - Время передано в милисекундах
//
// Возвращаемое значение:
//   Строка   - Представление разницы времени
//
Функция ПолучитьПредставлениеРазницыВремени(РазницаВремени, ВремяВМилисекундах = Ложь) Экспорт
	
	РазмерЧаса = 3600;
	РазмерМинуты = 60;
	РазмерСекунды = 1;
	
	Если ВремяВМилисекундах Тогда
		
		РазмерЧаса = РазмерЧаса * 1000;
		РазмерМинуты = РазмерМинуты * 1000;
		РазмерСекунды = РазмерСекунды * 1000;
		
	КонецЕсли;
	
	Часов = Цел(РазницаВремени / РазмерЧаса);
	Минут = Цел((РазницаВремени - (Часов * РазмерЧаса)) / РазмерМинуты);
	Секунд = Цел((РазницаВремени - ((Часов * РазмерЧаса) + (Минут * РазмерМинуты))) / РазмерСекунды);
	
	Если ВремяВМилисекундах Тогда
		Милисекунд = РазницаВремени - ((Часов * РазмерЧаса) + (Минут * РазмерМинуты) + (Секунд * РазмерСекунды));
	Иначе
		Милисекунд = Цел((РазницаВремени - ((Часов * РазмерЧаса) + (Минут * РазмерМинуты) + (Секунд * РазмерСекунды))) * 1000);
	КонецЕсли;
	
	Время = Новый Массив();
	
	Если РазницаВремени >= РазмерЧаса Тогда
		Время.Добавить(СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
			НСтр("ru = ';%1 час;;%1 часа;%1 часов;%1 часа'"), Часов));
	КонецЕсли;
	
	Если РазницаВремени >= РазмерМинуты Тогда
		Время.Добавить(СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
			НСтр("ru = ';%1 минута;;%1 минуты;%1 минут;%1 минут'"), Минут));
	КонецЕсли;
	
	Если РазницаВремени >= РазмерСекунды и Секунд > 0 Тогда
		Время.Добавить(СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
			НСтр("ru = ';%1 секунда;;%1 секунды;%1 секунд;%1 секунд'"), Секунд));
	КонецЕсли;
	
	Если Милисекунд > 0 и РазницаВремени <= РазмерСекунды Тогда
		Время.Добавить(СтрШаблон(НСтр("ru = '%1 мс.'"), Формат(Милисекунд, "ЧГ=0;")));
	КонецЕсли;
	
	Если Время.Количество() > 0 Тогда
		Время = СтрСоединить(Время, " ");
	Иначе
		Время = НСтр("ru = '0 секунд'");
	КонецЕсли;
	
	Возврат Время;
	
КонецФункции

// Сравнить две строки версий. Сравнивает версии даже если версии не равны шаблону РР.{П|ПП}.ЗЗ.СС.
// см. ОбщегоНазначенияКлиентСервер.СравнитьВерсии
// 
// Параметры:
//  СтрокаВерсии1 - Строка - номер версии в формате РР.{П|ПП}.ЗЗ.СС.
//  СтрокаВерсии2 - Строка - второй сравниваемый номер версии.
// 
// Возвращаемое значение:
//  Число - больше 0, если СтрокаВерсии1 > СтрокаВерсии2; 0, если версии равны.
Функция СравнитьВерсии(Знач СтрокаВерсии1, Знач СтрокаВерсии2) Экспорт
	
	Версия1ДляБСП = МассивЗначений(0, 0, 0, 0);
	Версия2ДляБСП = МассивЗначений(0, 0, 0, 0);
	
	Версия1 = СтрРазделить(СтрокаВерсии1, ".");
	Если Версия1.Количество() < 4 Тогда
		
		ТекущийИндексДляБСП = Версия1ДляБСП.ВГраница();
		ТекущийИндекс = Версия1.ВГраница();
		Пока ТекущийИндекс >= 0 Цикл
			Версия1ДляБСП[ТекущийИндексДляБСП] = Версия1[ТекущийИндекс];
			ТекущийИндекс = ТекущийИндекс - 1;
			ТекущийИндексДляБСП = ТекущийИндексДляБСП - 1;
		КонецЦикла;
		
	ИначеЕсли Версия1.Количество() > 4 Тогда
		
		Для индекс = 0 По Версия1ДляБСП.ВГраница() Цикл
			Версия1ДляБСП[индекс] = Версия1[индекс];
		КонецЦикла;
		
	Иначе
		Версия1ДляБСП = Версия1;
	КонецЕсли;
	
	Версия2 = СтрРазделить(СтрокаВерсии2, ".");
	Если Версия2.Количество() < 4 Тогда
		
		ТекущийИндексДляБСП = Версия2ДляБСП.ВГраница();
		ТекущийИндекс = Версия2.ВГраница();
		Пока ТекущийИндекс >= 0 Цикл
			Версия2ДляБСП[ТекущийИндексДляБСП] = Версия2[ТекущийИндекс];
			ТекущийИндекс = ТекущийИндекс - 1;
			ТекущийИндексДляБСП = ТекущийИндексДляБСП - 1;
		КонецЦикла;
		
	ИначеЕсли Версия2.Количество() > 4 Тогда
		
		Для индекс = 0 По Версия2ДляБСП.ВГраница() Цикл
			Версия2ДляБСП[индекс] = Версия2[индекс];
		КонецЦикла;
		
	Иначе
		Версия2ДляБСП = Версия2;
	КонецЕсли;
	
	Возврат ОбщегоНазначенияКлиентСервер.СравнитьВерсии(
		СтрСоединить(Версия1ДляБСП, "."), СтрСоединить(Версия2ДляБСП, "."));
	
КонецФункции

#Область Данные

// Возвращает значение свойства структуры.
//
// Параметры:
//   Структура - Структура
//             - ФиксированнаяСтруктура - объект, из которого необходимо прочитать значение ключа.
//   Ключ - Строка - имя свойства структуры, для которого необходимо прочитать значение.
//   ЗначениеПоУмолчанию - Произвольный - возвращается когда в структуре нет значения по указанному ключу.
//   ОжидаемыйТип - ОписаниеТипов, Тип - Тип к которуму необходимо привести полученное значение.
//       Для скорости рекомендуется передавать только быстро вычисляемые значения (например примитивные типы),
//       а инициализацию более тяжелых значений выполнять после проверки полученного значения (только если это
//       требуется).
//
// Возвращаемое значение:
//   Произвольный - значение свойства структуры. ЗначениеПоУмолчанию если в структуре нет указанного свойства.
// 
Функция СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено, Знач ОжидаемыйТип = Неопределено) Экспорт
	
	Если ТипЗнч(Структура) <> Тип("Структура") 
		И ТипЗнч(Структура) <> Тип("ФиксированнаяСтруктура")
		И ТипЗнч(Структура) <> Тип("ДанныеФормыСтруктура") Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Если СтрНайти(Ключ, ".") > 0 Тогда
		Возврат СвойствоСтруктуры(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Структура, 
			Лев(Ключ, СтрНайти(Ключ, ".") - 1)), Сред(Ключ, СтрНайти(Ключ, ".")+1), ЗначениеПоУмолчанию, ОжидаемыйТип);
	Иначе
		
		ЗначениеКлюча = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию);
		
		Если ОжидаемыйТип <> Неопределено Тогда

			ТипЗначенияОжидаемыйТип = ТипЗнч(ОжидаемыйТип);
			
			Если ТипЗначенияОжидаемыйТип = Тип("Тип") Тогда
				ОжидаемыйТип = Новый ОписаниеТипов(ЗначениеВМассиве(ОжидаемыйТип));
			ИначеЕсли ТипЗначенияОжидаемыйТип <> Тип("ОписаниеТипов") Тогда
				ОжидаемыйТип = Новый ОписаниеТипов(ЗначениеВМассиве(ТипЗначенияОжидаемыйТип));
			КонецЕсли;
			
			ЗначениеКлюча = ОжидаемыйТип.ПривестиЗначение(ЗначениеКлюча);
			
		КонецЕсли;
		
		Возврат ЗначениеКлюча;
		
	КонецЕсли;
	
КонецФункции

// Возвращает значение значение соответствия по ключу.
//
// Параметры:
//   Соответствие - Соответствие
//             - ФиксированноеСоответствие - объект, из которого необходимо прочитать значение ключа.
//   Ключ - Строка - имя ключа свойства, для которого необходимо прочитать значение.
//   ЗначениеПоУмолчанию - Произвольный - возвращается когда в свойстве нет значения по указанному ключу.
//   ОжидаемыйТип - ОписаниеТипов, Тип - Тип к которуму необходимо привести полученное значение.
//
// Возвращаемое значение:
//   Произвольный - значение ключа соответствия. ЗначениеПоУмолчанию если в соответствии нет указанного ключа.
// 
//@skip-check doc-comment-collection-item-type
Функция ЗначениеСоответствия(Соответствие, Ключ, ЗначениеПоУмолчанию = Неопределено, Знач ОжидаемыйТип = Неопределено) Экспорт
	
	Если ТипЗнч(Соответствие) <> Тип("Соответствие") И ТипЗнч(Соответствие) <> Тип("ФиксированноеСоответствие") Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	ЗначениеКлюча = Соответствие.Получить(Ключ);
	
	Если ЗначениеКлюча = Неопределено Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Если ОжидаемыйТип <> Неопределено Тогда

		ТипЗначенияОжидаемыйТип = ТипЗнч(ОжидаемыйТип);
		
		Если ТипЗначенияОжидаемыйТип = Тип("Тип") Тогда
			ОжидаемыйТип = Новый ОписаниеТипов(ЗначениеВМассиве(ОжидаемыйТип));
		ИначеЕсли ТипЗначенияОжидаемыйТип <> Тип("ОписаниеТипов") Тогда
			ОжидаемыйТип = Новый ОписаниеТипов(ЗначениеВМассиве(ТипЗначенияОжидаемыйТип));
		КонецЕсли;
		
		ЗначениеКлюча = ОжидаемыйТип.ПривестиЗначение(ЗначениеКлюча);
		
	КонецЕсли;
	
	Возврат ЗначениеКлюча;
	
КонецФункции

// Вызывает исключение с текстом Сообщение, если Условие не равно Истина.
// Применяется для самодиагностики кода.
//
// Параметры:
//   Условие - Булево - если не равно Истина, то вызывается исключение.
//   Сообщение - Строка - текст сообщения. Если не задан, то исключение вызывается с сообщением по умолчанию.
//   КонтекстПроверки - Строка - например, имя процедуры или функции, в которой выполняется проверка.
//
Процедура Проверить(Знач Условие, Знач Сообщение = "", Знач КонтекстПроверки = "") Экспорт
	
	Если Условие <> Истина Тогда
		
		Если ПустаяСтрока(Сообщение) Тогда
			ТекстИсключения = НСтр("ru = 'Недопустимая операция'"); // Assertion failed
		Иначе
			ТекстИсключения = Сообщение;
		КонецЕсли;
		
		Если Не ПустаяСтрока(КонтекстПроверки) Тогда
			ТекстИсключения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1 в %2'"), ТекстИсключения, КонтекстПроверки);
		КонецЕсли;
		
		ВызватьИсключение ТекстИсключения;
		
	КонецЕсли;
	
КонецПроцедуры

// Создает массив и помещает в него переданное значение.
//
// Параметры:
//  Значение - Произвольный - любое значение.
//
// Возвращаемое значение:
//  Массив - массив из одного элемента.
//
Функция ЗначениеВМассиве(Знач Значение) Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(Значение);
	Возврат Результат;
	
КонецФункции

// Возвращает пустой уникальный идентификатор.
//
// Возвращаемое значение:
//  УникальныйИдентификатор - 00000000-0000-0000-0000-000000000000
//
Функция ПустойУникальныйИдентификатор() Экспорт
	
	Возврат Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	
КонецФункции

// Возвращает разность массивов. Разностью двух массивов является массив, содержащий
// все элементы первого массива, не существующие во втором массиве.
//
// Параметры:
//  Массив - Массив - массив элементов, из которого необходимо выполнить вычитание;
//  МассивВычитания - Массив - массив элементов, который будет вычитаться.
// 
// Возвращаемое значение:
//  Массив - разностью двух массивов.
//
// Пример:
//	//А = [1, 3, 5, 7];
//	//В = [3, 7, 9];
//	Результат = ОбщегоНазначенияКлиентСервер.РазностьМассивов(А, В);
//	//Результат = [1, 5];
//
Функция РазностьМассивов(Знач Массив, Знач МассивВычитания) Экспорт
	
	Результат = Новый Массив;
	Для Каждого Элемент Из Массив Цикл
		Если МассивВычитания.Найти(Элемент) = Неопределено Тогда
			Результат.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

// Дополняет массив МассивПриемник значениями из массива МассивИсточник.
//
// Параметры:
//  МассивПриемник - Массив - массив, в который необходимо добавить значения.
//  МассивИсточник - Массив - массив значений для заполнения.
//  ТолькоУникальныеЗначения - Булево - если истина, то в массив будут включены только уникальные значения.
//
Процедура ДополнитьМассив(МассивПриемник, МассивИсточник, ТолькоУникальныеЗначения = Ложь) Экспорт
	
	Если ТолькоУникальныеЗначения Тогда
		
		УникальныеЗначения = Новый Соответствие;
		
		Для Каждого Значение Из МассивПриемник Цикл
			УникальныеЗначения.Вставить(Значение, Истина);
		КонецЦикла;
		
		Для Каждого Значение Из МассивИсточник Цикл
			Если УникальныеЗначения[Значение] = Неопределено Тогда
				МассивПриемник.Добавить(Значение);
				УникальныеЗначения.Вставить(Значение, Истина);
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		Для Каждого Значение Из МассивИсточник Цикл
			МассивПриемник.Добавить(Значение);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Создает массив и помещает в него переданные значения.
//
// Параметры:
//  Значение1 - Произвольный - любое значение.
//  Значение2 - Произвольный
//  Значение3 - Произвольный
//  Значение4 - Произвольный
//
// Возвращаемое значение:
//  Массив - Значения в массиве
//  
// Пример:
//   Результат = SUI_ОбщегоНазначенияКлиентСервер.МассивЗначений(1, 2, 3);
//
Функция МассивЗначений(Знач Значение1, Знач Значение2 = Неопределено, Знач Значение3 = Неопределено, Знач Значение4 = Неопределено) Экспорт
	
	Результат = Новый Массив();
	
	Результат.Добавить(Значение1);
	
	Если Значение2 <> Неопределено Тогда
		Результат.Добавить(Значение2);
	КонецЕсли;
	
	Если Значение3 <> Неопределено Тогда
		Результат.Добавить(Значение3);
	КонецЕсли;
	
	Если Значение4 <> Неопределено Тогда
		Результат.Добавить(Значение4);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает копию исходного массива с уникальными значениями.
//
// Параметры:
//  Массив - Массив - массив произвольных значений.
//
// Возвращаемое значение:
//  Массив - массив уникальных элементов.
//
Функция СвернутьМассив(Знач Массив) Экспорт
	Результат = Новый Массив;
	ДополнитьМассив(Результат, Массив, Истина);
	Возврат Результат;
КонецФункции

// Проверяет наличие реквизита или свойства у произвольного объекта без обращения к метаданным.
//
// Параметры:
//  Объект       - Произвольный - объект, у которого нужно проверить наличие реквизита или свойства;
//  ИмяРеквизита - Строка       - имя реквизита или свойства.
//
// Возвращаемое значение:
//  Булево - Истина, если есть.
//
Функция ЕстьРеквизитИлиСвойствоОбъекта(Объект, ИмяРеквизита) Экспорт
	
	КлючУникальности   = Новый УникальныйИдентификатор;
	СтруктураРеквизита = Новый Структура(ИмяРеквизита, КлючУникальности);
	ЗаполнитьЗначенияСвойств(СтруктураРеквизита, Объект);
	
	Возврат СтруктураРеквизита[ИмяРеквизита] <> КлючУникальности;
	
КонецФункции

// Сравнивает элементы списков значений или массивов по значениям.
//
// Параметры:
//  Список1 - Массив
//          - СписокЗначений - сравниваемая коллекция элементов.
//  Список2 - Массив
//          - СписокЗначений - сравниваемая коллекция элементов.
//  СравниватьКоличествоЗначений - Булево - уточнение способа сравнения:
//                                          Ложь   - проверка вхождения значений одной коллекции в другую,
//                                          Истина - проверка вхождения значений одной коллекции в другую 
//                                          с учетом количества значений. По умолчанию Ложь.
//
// Возвращаемое значение:
//  Булево - Истина, если идентичны.
//
Функция СпискиЗначенийИдентичны(Список1, Список2, СравниватьКоличествоЗначений = Ложь) Экспорт
	
	Если СравниватьКоличествоЗначений Тогда
		Количество1 = Список1.Количество();
		Количество2 = Список2.Количество();
		Если Количество1 <> Количество2 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Соответствие1 = КоллекцияВСоответствие(Список1, СравниватьКоличествоЗначений);
	Соответствие2 = КоллекцияВСоответствие(Список2, СравниватьКоличествоЗначений);
	
	СпискиИдентичны = Истина;
	Если СравниватьКоличествоЗначений Тогда
		Для Каждого ЭлементСписка1 Из Соответствие1 Цикл
			Если Соответствие2[ЭлементСписка1.Ключ] <> ЭлементСписка1.Значение Тогда
				СпискиИдентичны = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для Каждого ЭлементСписка1 Из Соответствие1 Цикл
			Если Соответствие2[ЭлементСписка1.Ключ] = Неопределено Тогда
				СпискиИдентичны = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Не СпискиИдентичны Тогда
		Возврат СпискиИдентичны;
	КонецЕсли;
	
	Если СравниватьКоличествоЗначений Тогда
		Для Каждого ЭлементСписка2 Из Соответствие2 Цикл
			Если Соответствие1[ЭлементСписка2.Ключ] <> ЭлементСписка2.Значение Тогда
				СпискиИдентичны = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для Каждого ЭлементСписка2 Из Соответствие2 Цикл
			Если Соответствие1[ЭлементСписка2.Ключ] = Неопределено Тогда
				СпискиИдентичны = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат СпискиИдентичны;
	
КонецФункции

#КонецОбласти

#Область СериализацияXML

// Заменяет недопустимые символы в XML-строке на заданные символы.
//
// Параметры:
//   Текст - Строка - строка, в которой требуется выполнить замену недопустимых символов.
//   СимволЗамены - Строка - строка, на которую требуется выполнить замену недопустимого символа в XML-строке.
// 
// Возвращаемое значение:
//    Строка
//
Функция ЗаменитьНедопустимыеСимволыXML(Знач Текст, СимволЗамены = " ") Экспорт
	
#Если Не ВебКлиент Тогда
	ПозицияНачала = 1;
	Позиция = ОбработкаСтрокиXML.НайтиНедопустимыеСимволыXML(Текст, ПозицияНачала);
	Пока Позиция > 0 Цикл
		НедопустимыйСимвол = Сред(Текст, Позиция, 1);
		Текст = СтрЗаменить(Текст, НедопустимыйСимвол, СимволЗамены);
		ПозицияНачала = Позиция + СтрДлина(СимволЗамены);
		Если ПозицияНачала > СтрДлина(Текст) Тогда
			Прервать;
		КонецЕсли;
		Позиция = ОбработкаСтрокиXML.НайтиНедопустимыеСимволыXML(Текст, ПозицияНачала);
	КонецЦикла;
	
	Возврат Текст;
#Иначе
	// Коды символов от 0 до 2^16-1, которые метод НайтиНедопустимыеСимволыXML
	// считает недопустимыми: 0-8, 11-12, 14-31, 55296-57343.
	Итог = "";
	ДлинаСтроки = СтрДлина(Текст);
	
	Для НомерСимвола = 1 По ДлинаСтроки Цикл
		Символ = Сред(Текст, НомерСимвола, 1);
		КодСимвола = КодСимвола(Символ);
		
		Если КодСимвола < 9
		 Или КодСимвола > 10    И КодСимвола < 13
		 Или КодСимвола > 13    И КодСимвола < 32
		 Или КодСимвола > 55295 И КодСимвола < 57344 Тогда
			
			Символ = СимволЗамены;
		КонецЕсли;
		Итог = Итог + Символ;
	КонецЦикла;
	
	Возврат Итог;
#КонецЕсли
	
КонецФункции

// Удаляет недопустимые символы в XML-строке.
//
// Параметры:
//  Текст - Строка - строка, в которой требуется удалить недопустимые символы.
// 
// Возвращаемое значение:
//  Строка
//
Функция УдалитьНедопустимыеСимволыВXML(Знач Текст) Экспорт
	
	Возврат ЗаменитьНедопустимыеСимволыXML(Текст, "");
	
КонецФункции

#КонецОбласти

#Область СериализацияJSON

// Данные из строки JSON. Если выполнение производится через ВебКлиент и переданы параметры:
// 	НастройкиСериализации, ИмяФункцииПреобразования, МодульФункцииПреобразования или ДополнительныеПараметрыФункцииПреобразования,
// 	то будет вызвано исключение. Для выполнения на ВебКлиенте с передачей параметров см. SUI_ОбщегоНазначенияВызовСервера.ДанныеИзСтрокиJSON
// 
//--------------------------------------------
//@skip-check method-too-many-params
//@skip-check doc-comment-collection-item-type
//
// Параметры:
//  СтрокаJSON - Строка - Строка JSON
//  ПрочитатьВСоответствие - Булево - Если установлено Истина, чтение объекта JSON будет выполнено в Соответствие. 
//  	Если установлено Ложь, объекты будут считываться в объект типа Структура. 
//  	Примечание. При десериализации объектов JSON в структуру необходимо помнить о требованиях к ключам структуры. 
//  	Если при десериализации объекта будет найдено имя свойства, недопустимое для ключа структуры, 
//  	то будет вызвано исключение.
//  ИменаСвойствСоЗначениямиДата - Массив, ФиксированныйМассив, Строка - Массив, элементы которого содержат имена свойств JSON, 
//  	для которых нужно вызывать восстановление даты из строки. 
//  	Если имя свойства указано в этом параметре и указано в параметре ИменаСвойствДляОбработкиВосстановления, 
//  	то для таких свойств восстановление осуществляется в функции восстановления. 
//  	Если восстановление даты из значения свойства невозможно, то будет сгенерировано исключение.
//  ОжидаемыйФорматДаты - ФорматДатыJSON - Ожидаемый формат даты при десериализации объекта в формате JSON. 
//  	Если в результате десериализации значение не является строкой и имеет формат даты, отличный от ожидаемого, 
//  	то будет вызвано исключение.
//  ИмяФункцииВосстановления - Строка - Данная функция вызывается при чтении каждого свойства и должна иметь следующие параметры:
//  	<Свойство> - значение типа Строка, указывается только при чтении объектов JSON,
//  	<Значение> - значение допустимого для сериализации типа,
//  	<ДополнительныеПараметры>
//  	Возвращаемое значение - произвольного типа. Если данный параметр задан и не задан параметр <МодульФункцииВосстановления>, 
//  	и наоборот, будет вызвано исключение. Если функция не установлена, то при вызове метода ПрочитатьJSON параметр <ИменаСвойствСоЗначениямиДата> игнорируется.
//  МодульФункцииВосстановления - Произвольный - Указывает модуль, процедура которого будет использована для восстановления значения.
//  ДополнительныеПараметрыФункцииВосстановления - Произвольный - Дополнительные параметры, которые будут переданы в функцию восстановления значений.
//  ИменаСвойствДляОбработкиВосстановления - Массив - Массив имен свойств JSON, для которых будет вызвана функция восстановления. 
//  	Параметр игнорируется, если не установлен параметр ИмяФункцииВосстановления.
// 
// Возвращаемое значение:
//  Произвольный, Null, Булево, Массив, Соответствие, Строка, Число, Неопределено - Данные из строки JSON
Функция ДанныеИзСтрокиJSON(СтрокаJSON, ПрочитатьВСоответствие = Истина, ИменаСвойствСоЗначениямиДата = Неопределено, 
	Знач ОжидаемыйФорматДаты = Неопределено, ИмяФункцииВосстановления = "", 
	МодульФункцииВосстановления = Неопределено, ДополнительныеПараметрыФункцииВосстановления = Неопределено, 
	ИменаСвойствДляОбработкиВосстановления = Неопределено) Экспорт
	
	ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка");
	Если ПустаяСтрока(ОписаниеТипаСтрока.ПривестиЗначение(СтрокаJSON)) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	#Если ВебКлиент Тогда
		
		Если ЗначениеЗаполнено(ИменаСвойствСоЗначениямиДата) Или
			ЗначениеЗаполнено(ОжидаемыйФорматДаты) Или ЗначениеЗаполнено(ИмяФункцииВосстановления) Или
			МодульФункцииВосстановления <> Неопределено Или ЗначениеЗаполнено(ДополнительныеПараметрыФункцииВосстановления) Или
			ЗначениеЗаполнено(ИменаСвойствДляОбработкиВосстановления) Тогда
			ВызватьИсключение НСтр("ru = 'Недопустимый  вызов в Web-клиенте'");	
		Иначе
			Возврат ЗначениеИзСтрокиJSON(СтрокаJSON, ПрочитатьВСоответствие);
		КонецЕсли;
		
	#Иначе
		
		Если ОжидаемыйФорматДаты = Неопределено Тогда
			ОжидаемыйФорматДаты = ФорматДатыJSON.ISO;
		КонецЕсли;
		
		ЧтениеJSON = Новый ЧтениеJSON();
		ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
		
		Данные = ПрочитатьJSON(ЧтениеJSON, ПрочитатьВСоответствие, ИменаСвойствСоЗначениямиДата, ОжидаемыйФорматДаты,
			ИмяФункцииВосстановления, МодульФункцииВосстановления, ДополнительныеПараметрыФункцииВосстановления, 
			ИменаСвойствДляОбработкиВосстановления);
		
		ЧтениеJSON.Закрыть();
		
		Возврат Данные;
		
	#КонецЕсли
	
КонецФункции

// Данные в строку JSON. Если выполнение производится через ВебКлиент и переданы параметры:
// 	НастройкиСериализации, ИмяФункцииПреобразования, МодульФункцииПреобразования или ДополнительныеПараметрыФункцииПреобразования,
// 	то будет вызвано исключение. Для выполнения на ВебКлиенте с передачей параметров см. SUI_ОбщегоНазначенияВызовСервера.ДанныеВСтрокуJSON
//--------------------------------------------
//@skip-check method-too-many-params
//@skip-check doc-comment-collection-item-type
//
// Параметры:
//  Значение - Строка, Число, Дата, Массив, ФиксированныйМассив, Структура, ФиксированнаяСтруктура, Соответствие, ФиксированноеСоответствие - Объект записи JSON
//  НастройкиСериализации - НастройкиСериализацииJSON - Настройки сериализации
//  ИмяФункцииПреобразования - Строка - Имя функции преобразования. 
//  	Данная функция вызывается для всех свойств, тип которых не поддерживает преобразование в формат JSON напрямую. 
//  	Она должна преобразовать Значение в значение допустимого для записи в JSON типа. 
//  	Функция должна предваряться директивой &&НаСервере или &&НаКлиенте. 
//  	Использование функции вне контекста формы или модуля, или команды не допускается. 
//  	Функция должна быть экспортной и иметь следующие параметры:
//  		<Свойство> - в параметр передается имя свойства, если выполняется запись структуры или соответствия,
//  		<Значение> - в параметр передается исходное значение,
//			<ДополнительныеПараметры> - дополнительные параметры, которые указаны в вызове метода ЗаписатьJSON,
//			<Отказ> - отказ от записи свойства.
//		Если функция возвращает объект, который не поддерживает преобразование в JSON, то будет вызвано исключение. 
//		Если данный параметр задан и не задан параметр <МодульФункцииПреобразования>, и наоборот, будет вызвано исключение.
//  МодульФункцииПреобразования - ОбщийМодуль - Указывает модуль, в котором реализована функция преобразования значения в значение формата JSON.
//  ДополнительныеПараметрыФункцииПреобразования - Произвольный - Дополнительные параметры, которые будут переданы в функцию преобразования.
// 
// Возвращаемое значение:
//  Строка - Данные в строку JSON
Функция ДанныеВСтрокуJSON(Значение, НастройкиСериализации = Неопределено, ИмяФункцииПреобразования = "", 
	МодульФункцииПреобразования = Неопределено, ДополнительныеПараметрыФункцииПреобразования = Неопределено) Экспорт
	
	#Если ВебКлиент Тогда
		
		Если ЗначениеЗаполнено(НастройкиСериализации) Или 
			ЗначениеЗаполнено(ИмяФункцииПреобразования) Или
			МодульФункцииПреобразования <> Неопределено Или 
			ЗначениеЗаполнено(ДополнительныеПараметрыФункцииПреобразования) Тогда
			ВызватьИсключение НСтр("ru = 'Недопустимый  вызов в Web-клиенте'");
		Иначе
			Возврат ЗначениеВСтрокуJSON(Значение);
		КонецЕсли;
		
	#Иначе
		
		ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(, Символы.Таб);
		
		ЗаписьJSON = Новый ЗаписьJSON();
		ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
		ЗаписатьJSON(ЗаписьJSON, Значение, НастройкиСериализации, ИмяФункцииПреобразования, МодульФункцииПреобразования,
			ДополнительныеПараметрыФункцииПреобразования);
			
		Возврат ЗаписьJSON.Закрыть();
		
	#КонецЕсли
	
КонецФункции

// Проверяет доступность типа к преобразованию в JSON.
// 
// Параметры:
//  ТипЗначения - Тип - Тип значения
// 
// Возвращаемое значение:
//  Булево - Тип доступен к преобразованию в JSON
Функция ТипыДоступенКПреобразованиюВJSON(ТипЗначения) Экспорт
	
	Если ТипЗначения = Тип("Строка") Или
		ТипЗначения = Тип("Число") Или
		ТипЗначения = Тип("Булево") Или
		ТипЗначения = Тип("Дата") Или
		ТипЗначения = Тип("Структура") Или
		ТипЗначения = Тип("ФиксированнаяСтруктура") Или
		ТипЗначения = Тип("Соответствие") Или
		ТипЗначения = Тип("ФиксированноеСоответствие") Или
		ТипЗначения = Тип("Массив") Или
		ТипЗначения = Тип("ФиксированныйМассив") Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции

#КонецОбласти

#Область РаботаСФайлами

// Раскладывает полное имя файла на составляющие.
//
// Параметры:
//  ПолноеИмяФайла - Строка - полный путь к файлу или каталогу.
//  ЭтоКаталог - Булево - признак того, что передано имя каталога.
//
// Возвращаемое значение:
//   Структура - имя файла, разложенное на составные части (аналогично свойствам объекта Файл):
//     ПолноеИмя - Строка - полный путь к файлу, т.е. полностью соответствует входному параметру ПолноеИмяФайла.
//     Путь -Строка - путь к каталогу, в котором находится файл.
//     Имя - Строка - имя файла с расширением, без пути к файлу.
//     Расширение - Строка - расширение файла с точкой вначале.
//     ИмяБезРасширения - Строка - имя файла без расширения и без пути к файлу.
// 
// Пример:
//  ПолноеИмяФайла = "c:\temp\test.txt";
//  ЧастиИмениФайла = РазложитьПолноеИмяФайла(ПолноеИмяФайла);
//  
//  В результате структура полей будет заполнена следующим образом:
//    ПолноеИмя: "c:\temp\test.txt",
//    Путь: "c:\temp\",
//    Имя: "test.txt",
//    Расширение: ".txt",
//    ИмяБезРасширения: "test".
//
Функция РазложитьПолноеИмяФайла(Знач ПолноеИмяФайла, ЭтоКаталог = Ложь) Экспорт
	
	СтруктураИмениФайла = Новый Структура("ПолноеИмя,Путь,Имя,Расширение,ИмяБезРасширения");
	ЗаполнитьЗначенияСвойств(СтруктураИмениФайла, Новый Файл(ПолноеИмяФайла));
	
	Если СтруктураИмениФайла.Путь = ПолучитьРазделительПути() Тогда
		СтруктураИмениФайла.Путь = "";
	КонецЕсли;
	
	Возврат СтруктураИмениФайла;
	
КонецФункции

#КонецОбласти

#Область РегламентныеЗадания

// Преобразует РасписаниеРегламентногоЗадания в структуру.
//
// Параметры:
//  Расписание - РасписаниеРегламентногоЗадания - исходное расписание.
// 
// Возвращаемое значение:
//  Структура:
//    * ВремяЗавершения          - Дата
//    * ВремяКонца               - Дата
//    * ВремяНачала              - Дата
//    * ДатаКонца                - Дата
//    * ДатаНачала               - Дата
//    * ДеньВМесяце              - Дата
//    * ДеньНеделиВМесяце        - Число
//    * ДниНедели                - Число
//    * ИнтервалЗавершения       - Число
//    * Месяцы                   - Массив из Число
//    * ПаузаПовтора             - Число
//    * ПериодНедель             - Число
//    * ПериодПовтораВТечениеДня - Число
//    * ПериодПовтораДней        - Число
//    * ДетальныеРасписанияДня   - Массив из см. РасписаниеВСтруктуру 
//
Функция РасписаниеВСтруктуру(Знач Расписание) Экспорт
	
	ЗначениеРасписания = Расписание;
	Если ЗначениеРасписания = Неопределено Тогда
		ЗначениеРасписания = Новый РасписаниеРегламентногоЗадания();
	КонецЕсли;
	СписокПолей = "ВремяЗавершения,ВремяКонца,ВремяНачала,ДатаКонца,ДатаНачала,ДеньВМесяце,ДеньНеделиВМесяце,"
		+ "ДниНедели,ИнтервалЗавершения,Месяцы,ПаузаПовтора,ПериодНедель,ПериодПовтораВТечениеДня,ПериодПовтораДней";
	Результат = Новый Структура(СписокПолей);
	ЗаполнитьЗначенияСвойств(Результат, ЗначениеРасписания, СписокПолей);
	ДетальныеРасписанияДня = Новый Массив;
	Для каждого РасписаниеДля Из Расписание.ДетальныеРасписанияДня Цикл
		ДетальныеРасписанияДня.Добавить(РасписаниеВСтруктуру(РасписаниеДля));
	КонецЦикла;
	Результат.Вставить("ДетальныеРасписанияДня", ДетальныеРасписанияДня);
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Интернет

// Разбирает строку URI на составные части и возвращает в виде структуры.
// На основе RFC 3986.
//
// Параметры:
//  СтрокаURI - Строка - ссылка на ресурс в формате:
//                       <схема>://<логин>:<пароль>@<хост>:<порт>/<путь>?<параметры>#<якорь>.
//
// Возвращаемое значение:
//  Структура - составные части URI согласно формату:
//   * Схема         - Строка - схема из URI.
//   * Логин         - Строка - логин из URI.
//   * Пароль        - Строка - пароль из URI.
//   * ИмяСервера    - Строка - часть <хост>:<порт> из URI.
//   * Хост          - Строка - хост из URI.
//   * Порт          - Строка - порт из URI.
//   * ПутьНаСервере - Строка - часть <путь>?<параметры>#<якорь> из URI.
//
Функция СтруктураURI(Знач СтрокаURI) Экспорт
	
	СтрокаURI = СокрЛП(СтрокаURI);
	
	// схема
	Схема = "";
	Позиция = СтрНайти(СтрокаURI, "://");
	Если Позиция > 0 Тогда
		Схема = НРег(Лев(СтрокаURI, Позиция - 1));
		СтрокаURI = Сред(СтрокаURI, Позиция + 3);
	КонецЕсли;
	
	// Строка соединения и путь на сервере.
	СтрокаСоединения = СтрокаURI;
	ПутьНаСервере = "";
	Позиция = СтрНайти(СтрокаСоединения, "/");
	Если Позиция > 0 Тогда
		ПутьНаСервере = Сред(СтрокаСоединения, Позиция + 1);
		СтрокаСоединения = Лев(СтрокаСоединения, Позиция - 1);
	КонецЕсли;
	
	// Информация пользователя и имя сервера.
	СтрокаАвторизации = "";
	ИмяСервера = СтрокаСоединения;
	Позиция = СтрНайти(СтрокаСоединения, "@", НаправлениеПоиска.СКонца);
	Если Позиция > 0 Тогда
		СтрокаАвторизации = Лев(СтрокаСоединения, Позиция - 1);
		ИмяСервера = Сред(СтрокаСоединения, Позиция + 1);
	КонецЕсли;
	
	// логин и пароль
	Логин = СтрокаАвторизации;
	Пароль = "";
	Позиция = СтрНайти(СтрокаАвторизации, ":");
	Если Позиция > 0 Тогда
		Логин = Лев(СтрокаАвторизации, Позиция - 1);
		Пароль = Сред(СтрокаАвторизации, Позиция + 1);
	КонецЕсли;
	
	// хост и порт
	Хост = ИмяСервера;
	Порт = "";
	Позиция = СтрНайти(ИмяСервера, ":");
	Если Позиция > 0 Тогда
		Хост = Лев(ИмяСервера, Позиция - 1);
		Порт = Сред(ИмяСервера, Позиция + 1);
		Если Не СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Порт) Тогда
			Порт = "";
		КонецЕсли;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Схема", Схема);
	Результат.Вставить("Логин", Логин);
	Результат.Вставить("Пароль", Пароль);
	Результат.Вставить("ИмяСервера", ИмяСервера);
	Результат.Вставить("Хост", Хост);
	Результат.Вставить("Порт", ?(ПустаяСтрока(Порт), Неопределено, Число(Порт)));
	Результат.Вставить("ПутьНаСервере", ПутьНаСервере);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РаботаСJSONВВебКлиенте

Функция ЗначениеИзСтрокиJSON(СтрокаJSON, ПрочитатьВСоответствие = Истина) Экспорт
	
	Возврат СледующееЗначениеИзСтрокиJSON(СтрокаJSON, СтрДлина(СтрокаJSON), ПрочитатьВСоответствие);
	
КонецФункции

Функция ЗначениеВСтрокуJSON(Значение, Уровень = 0) Экспорт
	
	Результат = "";
	
	ТипЗначения = ТипЗнч(Значение);
	Если ТипЗначения = Тип("Строка") Тогда
		Результат = Значение;
		Если СтрНайти(Результат, """") Тогда
			Результат = СтрЗаменить(Результат, """", "\""");
		КонецЕсли;
		Если СтрНайти(Результат, Символы.ПС) Тогда
			Результат = СтрЗаменить(Результат, Символы.ПС, "\n");
		КонецЕсли;
		Результат = """" + Результат + """";
	ИначеЕсли ТипЗначения = Тип("Число") Тогда
		Результат = Формат(Значение, "ЧРД=.; ЧН=0; ЧГ=0");
	ИначеЕсли ТипЗначения = Тип("Дата") Тогда
		Результат = """" + Формат(Значение, "ДФ=yyyy-MM-ddTHH:mm:ss; ДП=0001-01-01T00:00:00") + """";
	ИначеЕсли ТипЗначения = Тип("Булево") Тогда
		Результат = Формат(Значение, "БЛ=false; БИ=true")
	ИначеЕсли ТипЗначения = Тип("Неопределено") 
		ИЛИ ТипЗначения = Тип("Null") Тогда
		Результат = "null";
	ИначеЕсли ТипЗначения = Тип("Массив")
		ИЛИ ТипЗначения = Тип("ФиксированныйМассив") Тогда
		Результат = Результат + "[";
		Уровень = Уровень + 1;
		ПервыйЭлемент = Истина;
		Для Каждого Элемент Из Значение Цикл
			Если ПервыйЭлемент Тогда
				ПервыйЭлемент = Ложь;
			Иначе
				Результат = Результат + ", ";
			КонецЕсли;
			Результат = Результат + Символы.ПС + ОтступУровняВложенностиJSON(Уровень)
				+ ЗначениеВСтрокуJSON(Элемент, Уровень);
		КонецЦикла;
		Уровень = Уровень - 1;
		Результат = Результат + Символы.ПС + ОтступУровняВложенностиJSON(Уровень) + "]";
	ИначеЕсли ТипЗначения = Тип("Структура")
		ИЛИ ТипЗначения = Тип("ФиксированнаяСтруктура") Тогда
		Результат = Результат + "{";
		ПервыйЭлемент = Истина;
		Уровень = Уровень + 1;
		Для Каждого Элемент Из Значение Цикл
			Если ПервыйЭлемент Тогда
				ПервыйЭлемент = Ложь;
			Иначе
				Результат = Результат + ",";
			КонецЕсли;
			Результат = Результат + Символы.ПС + ОтступУровняВложенностиJSON(Уровень)
				+ """" + Элемент.Ключ  + """: " + ЗначениеВСтрокуJSON(Элемент.Значение, Уровень);
		КонецЦикла;
		Уровень = Уровень - 1;
		Результат = Результат + Символы.ПС + ОтступУровняВложенностиJSON(Уровень) + "}";
	Иначе
		ВызватьИсключение НСтр("ru = 'Передано значение недопустимого типа'");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СледующееЗначениеИзСтрокиJSON(СтрокаJSON, ДлинаСтроки, НомерСимвола = 1, ЕстьСледующее = Ложь, ПрочитатьВСоответствие = Истина)
	
	Результат = Неопределено;
	ТипЗначения = Неопределено;
	НачальныйНомер = 0;
	
	СимволЭкранирован = Ложь;
	ЕстьЭкранированиеКавычек = Ложь;
	ЕстьПереносСтроки = Ложь;
	
	Пока ДлинаСтроки > НомерСимвола Цикл
		
		КодСимвола = КодСимвола(СтрокаJSON, НомерСимвола);
		Если ТипЗначения = Неопределено Тогда
			
			Если КодСимвола = 123 Тогда // {
				Результат = ?(ПрочитатьВСоответствие, Новый Соответствие, Новый Структура);
				ТипЗначения = 1; // КлючСтруктуры
				
			ИначеЕсли КодСимвола = 91 Тогда // [
				Результат = Новый Массив;
				ТипЗначения = 3; // ЗначениеМассива
				
			ИначеЕсли КодСимвола = 34 Тогда // "
				ТипЗначения = 4; // Строка
				НачальныйНомер = НомерСимвола + 1;
				
			ИначеЕсли КодСимвола = 45 // -
				ИЛИ (КодСимвола >= 48 И КодСимвола <= 57) Тогда // 0...9
				ТипЗначения = 5; // Число
				НачальныйНомер = НомерСимвола;
				
			ИначеЕсли КодСимвола = 116 Тогда // t
				Результат = Истина;
				НомерСимвола = НомерСимвола + 3;
				ТипЗначения = 0; // Разделитель
				
			ИначеЕсли КодСимвола = 102 Тогда // f
				Результат = Ложь;
				НомерСимвола = НомерСимвола + 4;
				ТипЗначения = 0; // Разделитель
				
			ИначеЕсли КодСимвола = 110 Тогда // n
				Результат = Null;
				НомерСимвола = НомерСимвола + 3;
				ТипЗначения = 0; // Разделитель
				
			КонецЕсли;
			
		ИначеЕсли ТипЗначения = 4 Тогда // Строка
			
			Если КодСимвола = 34 Тогда // "
				Если СимволЭкранирован Тогда
					СимволЭкранирован = Ложь;
					ЕстьЭкранированиеКавычек = Истина;
				Иначе
					ЧислоСимволов = НомерСимвола - НачальныйНомер;
					Результат = Сред(СтрокаJSON, НачальныйНомер, ЧислоСимволов);
					Если ЕстьЭкранированиеКавычек Тогда
						Результат = СтрЗаменить(Результат, "\""", """");
					КонецЕсли;
					Если ЕстьПереносСтроки Тогда
						Результат = СтрЗаменить(Результат, "\n", Символы.ПС);
					КонецЕсли;
					НачальныйНомер = 0;
					ТипЗначения = 0; // Разделитель
				КонецЕсли;
			ИначеЕсли КодСимвола = 92 Тогда // \
				СимволЭкранирован = Истина;
			ИначеЕсли КодСимвола = 110 И СимволЭкранирован Тогда // n
				ЕстьПереносСтроки = Истина;
				СимволЭкранирован = Ложь;
			КонецЕсли;
			
		ИначеЕсли ТипЗначения = 5 Тогда // Число
			
			Если Не ((КодСимвола >= 48 И КодСимвола <= 57) // 0...9
				ИЛИ КодСимвола = 46) Тогда // .
				Результат = Число(Сред(СтрокаJSON, НачальныйНомер, НомерСимвола - НачальныйНомер));
				НачальныйНомер = 0;
				ТипЗначения = 0; // Разделитель
			КонецЕсли;
			
		ИначеЕсли ТипЗначения = 1 Тогда // КлючСтруктуры
			
			Если КодСимвола = 34 Тогда // "
				
				Если НачальныйНомер = 0 Тогда
					НачальныйНомер = НомерСимвола + 1;
				Иначе
					КлючСтруктуры = Сред(СтрокаJSON, НачальныйНомер, НомерСимвола - НачальныйНомер);
					НачальныйНомер = 0;
					ТипЗначения = 0; // Разделитель
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли ТипЗначения = 2 Тогда // ЗначениеСтруктуры
			ЕстьСледующее = Ложь;
			ЗначениеСтруктуры = СледующееЗначениеИзСтрокиJSON(СтрокаJSON, ДлинаСтроки, НомерСимвола, ЕстьСледующее, ПрочитатьВСоответствие);
			Результат.Вставить(КлючСтруктуры, ЗначениеСтруктуры);
			Если ЕстьСледующее Тогда
				ТипЗначения = 1; // КлючСтруктуры
			Иначе
				ТипЗначения = 0; // Разделитель
			КонецЕсли;
			
		ИначеЕсли ТипЗначения = 3 Тогда // ЗначениеМассива
			ЕстьСледующее = Ложь;
			ЗначениеМассива = СледующееЗначениеИзСтрокиJSON(СтрокаJSON, ДлинаСтроки, НомерСимвола, ЕстьСледующее, ПрочитатьВСоответствие);
			Результат.Добавить(ЗначениеМассива);
			Если Не ЕстьСледующее Тогда
				ТипЗначения = 0; // Разделитель
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТипЗначения <> 0 Тогда // Разделитель
			
		ИначеЕсли КодСимвола = 58 Тогда // :
			ТипЗначения = 2; // ЗначениеСтруктуры
			
		ИначеЕсли КодСимвола = 93 ИЛИ КодСимвола = 125 Тогда // ] или }
			Возврат Результат;
			
		ИначеЕсли КодСимвола = 44 Тогда // ,
			ЕстьСледующее = Истина;
			Возврат Результат;
			
		КонецЕсли;
		
		НомерСимвола = НомерСимвола + 1;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ОтступУровняВложенностиJSON(Уровень)
	
	Результат = "";
	
	Для Счетчик = 1 По Уровень Цикл
		Результат = Результат + Символы.Таб;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СпискиЗначенийИдентичны

// Конвертирует массив или список значений в соответствие.
// 
// Параметры:
//  Коллекция - Массив, СписокЗначений
//  СравниватьКоличествоЗначений - Булево
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   * Ключ - Произвольный - значение коллекции.
//   * Значение - Число, Булево - при необходимости подсчета значений содержит количество значений, иначе Истина.
//
Функция КоллекцияВСоответствие(Коллекция, СравниватьКоличествоЗначений)
	
	ТипКоллекцииСписок = ТипЗнч(Коллекция) = Тип("СписокЗначений");
	Результат = Новый Соответствие;
	Если Не СравниватьКоличествоЗначений Тогда
		Для Каждого ЭлементКоллекции Из Коллекция Цикл
			Если ТипКоллекцииСписок Тогда
				Результат.Вставить(ЭлементКоллекции.Значение, Истина);
			Иначе
				Результат.Вставить(ЭлементКоллекции, Истина);
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для Каждого ЭлементКоллекции Из Коллекция Цикл
			
			Если ТипКоллекцииСписок Тогда
				Значение = ЭлементКоллекции.Значение;
			Иначе
				Значение = ЭлементКоллекции;
			КонецЕсли;
			
			Количество = Результат[Значение];
			Если Количество <> Неопределено Тогда
				Количество = Количество + 1;
			Иначе	
				Количество = 1;
			КонецЕсли;
			
			Результат[Значение] = Количество;
		КонецЦикла;
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти
