
#Область ПрограммныйИнтерфейс

Процедура ВыполнитьПолнуюВыгрузку(Знач МобильноеУстройство) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	РегистрыСведений.SUI_СостоянияМобильныхУстройств.СменитьСостояние(
		МобильноеУстройство, 
		Перечисления.SUI_СостоянияМобильныхУстройств.ЗапросПолнойВыгрузки);
	
КонецПроцедуры

Функция МобильноеУстройствоСуществует(ИдентификаторУстройства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	SUI_МобильныеУстройства.Ссылка
		|ИЗ
		|	ПланОбмена.SUI_МобильныеУстройства КАК SUI_МобильныеУстройства
		|ГДЕ
		|	SUI_МобильныеУстройства.Код = &ИдентификаторУстройства
		|	И НЕ SUI_МобильныеУстройства.ЭтотУзел";
	
	Запрос.УстановитьПараметр("ИдентификаторУстройства", ИдентификаторУстройства);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

Функция МобильноеУстройствоФильтр(МобильноеУстройство, ИсключитьПомеченныеНаУдаление = Истина) Экспорт
	
	ОписаниеТипаМобильноеУстройство = Новый ОписаниеТипов("ПланОбменаСсылка.SUI_МобильныеУстройства");
	МобильноеУстройствоРезультат = ОписаниеТипаМобильноеУстройство.ПривестиЗначение(МобильноеУстройство);
	
	Если МобильноеУстройствоРезультат = ПланыОбмена.SUI_МобильныеУстройства.ЭтотУзел() Тогда
		МобильноеУстройствоРезультат = ОписаниеТипаМобильноеУстройство.ПривестиЗначение(Неопределено);
	КонецЕсли;
	
	//@skip-check bsl-legacy-check-string-literal
	Если Не МобильноеУстройствоРезультат.Пустая() И 
		ИсключитьПомеченныеНаУдаление И
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(МобильноеУстройствоРезультат, "ПометкаУдаления") Тогда
		МобильноеУстройствоРезультат = ОписаниеТипаМобильноеУстройство.ПривестиЗначение(Неопределено);
	КонецЕсли;
	
	Возврат МобильноеУстройствоРезультат;
	
КонецФункции

Функция ВсеМобильныеУстройства(ВключаяСлужебноеУстройство = Ложь, ИсключитьПомеченныеНаУдаление = Истина) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	SUI_МобильныеУстройства.Ссылка КАК Ссылка
		|ИЗ
		|	ПланОбмена.SUI_МобильныеУстройства КАК SUI_МобильныеУстройства
		|ГДЕ
		|	НЕ SUI_МобильныеУстройства.ЭтотУзел
		|	И ВЫБОР
		|			КОГДА &ИсключитьПомеченныеНаУдаление
		|				ТОГДА НЕ SUI_МобильныеУстройства.ПометкаУдаления
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("ИсключитьПомеченныеНаУдаление", ИсключитьПомеченныеНаУдаление);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Процедура ЗаписатьСеанс(МобильноеУстройство, ВерсияПриложения = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(МобильноеУстройство) И
		МобильноеУстройство <> ПланыОбмена.SUI_МобильныеУстройства.ЭтотУзел() Тогда
		РегистрыСведений.SUI_СеансыМобильныхУстройств.Записать(МобильноеУстройство, ВерсияПриложения);
	КонецЕсли;
	
КонецПроцедуры

Функция СрокДействительностиСеансаВСекундах() Экспорт
	Возврат РегистрыСведений.SUI_СеансыМобильныхУстройств.СрокДействительностиСеансаВСекундах();
КонецФункции

Функция СоздатьМобильноеУстройство(ИдентификаторУстройства, ИмяПользователя) Экспорт
	
	МобильноеУстройство = ПланыОбмена.SUI_МобильныеУстройства.СоздатьУзел(); 
	МобильноеУстройство.Код = ИдентификаторУстройства;
	МобильноеУстройство.Наименование = МобильноеУстройство.Код;
	МобильноеУстройство.Записать();
	
	Возврат МобильноеУстройство.Ссылка;
	
КонецФункции

#Область ЗапросыАвторизации

Функция ПринятьЗапросАвторизацииУстройства(ИдентификаторУстройства) Экспорт
	
	ДанныеЗапросаАвторизации = ПолучитьЗапросАвторизации(ИдентификаторУстройства);
	
	Если Не ЗначениеЗаполнено(ДанныеЗапросаАвторизации) Тогда
		ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон(НСтр("ru = 'Запрос с идентификатором устройства %1 не найден.'"), ИдентификаторУстройства));
		Возврат Неопределено;
	КонецЕсли;
		
	НачатьТранзакцию();
	
	Попытка
		
		МобильноеУстройство = СоздатьМобильноеУстройство(
			ДанныеЗапросаАвторизации.ИдентификаторУстройства, ДанныеЗапросаАвторизации.ИмяПользователя);
		
		УдалитьЗапросАвторизации(ДанныеЗапросаАвторизации.ИдентификаторУстройства);
		
		ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон(НСтр("ru = 'Запрос авторизации устройства с идентификатором %1 принят.'"), ИдентификаторУстройства));
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(SUI_МобильныеУстройстваКлиентСервер.ИмяСобытия(), ,
			Метаданные.ОбщиеМодули.SUI_МобильныеУстройстваСервер, , ИнформацияОбОшибке());
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат МобильноеУстройство;
	
КонецФункции

Функция ПолучитьЗапросАвторизации(ИдентификаторУстройства) Экспорт
	
	ЗапросАвторизации = Неопределено;
	
	Если ПолучитьФункциональнуюОпцию("SUI_ИспользоватьЗапросыАвторизацииМУ") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ЗапросыАвторизации.ИдентификаторУстройства КАК ИдентификаторУстройства,
			|	ЗапросыАвторизации.ИмяПользователя,
			|	ЗапросыАвторизации.ДатаОбновления КАК ДатаЗапроса
			|ИЗ
			|	РегистрСведений.SUI_ЗапросыАвторизацииМобильныхУстройств КАК ЗапросыАвторизации
			|ГДЕ
			|	ЗапросыАвторизации.ИдентификаторУстройства = &ИдентификаторУстройства";
		
		Запрос.УстановитьПараметр("ИдентификаторУстройства", ИдентификаторУстройства);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			ЗапросАвторизации = Новый ФиксированнаяСтруктура(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Выборка));
		КонецЕсли;
	
	КонецЕсли;
	
	Возврат ЗапросАвторизации;
	
КонецФункции

Процедура СоздатьЗапросАвторизации(ИдентификаторУстройства, ИмяПользователя) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("SUI_ИспользоватьЗапросыАвторизацииМУ") Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		
		МенеджерЗаписи = РегистрыСведений.SUI_ЗапросыАвторизацииМобильныхУстройств.СоздатьМенеджерЗаписи();
	
		МенеджерЗаписи.ИдентификаторУстройства 	= ИдентификаторУстройства;
		МенеджерЗаписи.ИмяПользователя 			= ИмяПользователя;
		МенеджерЗаписи.ДатаОбновления 			= ТекущаяДатаСеанса();
		
		МенеджерЗаписи.Записать(Истина);
	
	Исключение
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(SUI_МобильныеУстройстваКлиентСервер.ИмяСобытия(НСтр("ru = 'Запросы авторизации'")), , 
			Метаданные.ОбщиеМодули.SUI_МобильныеУстройстваСервер, , ИнформацияОбОшибке());
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

Процедура УдалитьЗапросАвторизации(ИдентификаторУстройства) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("SUI_ИспользоватьЗапросыАвторизацииМУ") Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		
		НаборЗаписей = РегистрыСведений.SUI_ЗапросыАвторизацииМобильныхУстройств.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИдентификаторУстройства.Установить(ИдентификаторУстройства);
		НаборЗаписей.Записать(Истина);
	
	Исключение
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(SUI_МобильныеУстройстваКлиентСервер.ИмяСобытия(НСтр("ru = 'Запросы авторизации'")), , 
			Метаданные.ОбщиеМодули.SUI_МобильныеУстройстваСервер, , ИнформацияОбОшибке());
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПодписокНаСобытия

Процедура SUI_МобильноеУстройствоПередЗаписью(Источник, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ЭтоНовый() Тогда
		Источник.ДополнительныеСвойства.Вставить("ЭтоНовый");
	КонецЕсли;
	
	Если Источник.ЭтотУзел Тогда
		
		Источник.IPАдрес 			= "";
		Источник.Порт 				= 0;
		
	Иначе
		
		Источник.Код 		= ОбработатьСтрокуIDУстройства(Источник.Код);
		Источник.IPАдрес 	= ОбработатьСтрокуIPАдреса(Источник.IPАдрес);
		Источник.Порт 		= ?(Источник.Порт = 0, ПортМобильногоУстройстваПоУмолчанию(), Источник.Порт);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура SUI_МобильноеУстройствоПриЗаписи(Источник, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Источник.ЭтотУзел Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	SUI_МобильныеУстройства.Ссылка
			|ИЗ
			|	ПланОбмена.SUI_МобильныеУстройства КАК SUI_МобильныеУстройства
			|ГДЕ
			|	SUI_МобильныеУстройства.Ссылка <> &Ссылка
			|	И SUI_МобильныеУстройства.Код = &Код";
		
		Запрос.УстановитьПараметр("Код", Источник.Код);
		Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			ВызватьИсключение СтрШаблон(НСтр("ru = 'ID ""%1"" уже принадлежит мобильным устройствам:
			|%2'"), Источник.Код, СтрСоединить(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка"), Символы.ПС));
		КонецЕсли;
		
		Если Источник.ДополнительныеСвойства.Свойство("ЭтоНовый") Тогда
			
			// Заполнить всеми настройками документов
			НаборЗаписей = РегистрыСведений.SUI_ВладельцыНастроекДокументов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.МобильноеУстройство.Установить(Источник.Ссылка);
			НаборЗаписей.Заполнить(Новый Структура());
			Если НаборЗаписей.Количество() > 0 Тогда
				НаборЗаписей.Записать(Истина);
			КонецЕсли;
			
			ВыполнитьПолнуюВыгрузку(Источник.Ссылка);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура SUI_МобильноеУстройствоПередУдалением(Источник, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	ПланыОбмена.УдалитьРегистрациюИзменений(Источник.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОбновления

Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия 				= "1.0.2.1";
	Обработчик.Процедура 			= "SUI_МобильныеУстройстваСервер.УдалитьСлужебноеУстройство_1_0_2_1";
	Обработчик.РежимВыполнения 		= "Оперативно";
	Обработчик.Комментарий 			= НСтр("ru = 'Удаление служебного устройства'");
	
КонецПроцедуры

Процедура УдалитьСлужебноеУстройство_1_0_2_1() Экспорт
	
	Если Метаданные.ПланыОбмена.SUI_МобильныеУстройства.Реквизиты.Найти("Удалить_Служебный") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	SUI_МобильныеУстройства.Ссылка
		|ИЗ
		|	ПланОбмена.SUI_МобильныеУстройства КАК SUI_МобильныеУстройства
		|ГДЕ
		|	SUI_МобильныеУстройства.Удалить_Служебный";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		МУОбъект = Выборка.Ссылка.ПолучитьОбъект();
		МУОбъект.Удалить();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбработатьСтрокуIDУстройства(IDУстройства)
	Возврат SUI_СтроковыеФункцииКлиентСервер.ПривестиСтрокуКРазрешеннымСимволам(СокрЛП(НРег(IDУстройства)), 
		SUI_СтроковыеФункцииКлиентСервер.АлфавитЦифры() + SUI_СтроковыеФункцииКлиентСервер.АлфавитБуквыЛатинские());
КонецФункции

Функция ОбработатьСтрокуIPАдреса(Знач IPАдрес)
	
	IPАдрес = SUI_СтроковыеФункцииКлиентСервер.ПривестиСтрокуКРазрешеннымСимволам(СокрЛП(IPАдрес), 
		SUI_СтроковыеФункцииКлиентСервер.АлфавитЦифры() + ".");
		
	РазрядыIPАдрес = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(IPАдрес, ".", Истина);
	
	ОсталосьДобавитьРазрядов = (4 - РазрядыIPАдрес.Количество());
	
	Если ОсталосьДобавитьРазрядов > 0 Тогда
		Для индекс = 1 По ОсталосьДобавитьРазрядов Цикл
			РазрядыIPАдрес.Добавить("0");
		КонецЦикла;
	КонецЕсли;
	
	ОбработанныеРазряды = Новый Массив();
	Для индекс = 0 По 3 Цикл
		ОбработанныеРазряды.Добавить(СокрЛП(Лев(РазрядыIPАдрес[индекс], 3)));
	КонецЦикла;
	
	Возврат СтрСоединить(ОбработанныеРазряды, ".");
	
КонецФункции

Функция ПортМобильногоУстройстваПоУмолчанию()
	Возврат 8095;
КонецФункции

#КонецОбласти
