
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Выполнить произвольный алгоритм.
// 
// Параметры:
//  Алгоритм - Строка - Алгоритм
//  Параметры - Структура, Неопределено - Параметры алгоритма
//  ВыполнитьВПривилегированномРежиме - Булево - Выполнить алгоритм в привилегированном режиме
// 
// Возвращаемое значение:
//  Произвольный - Результат выполнения алгоритма
Функция ВыполнитьПроизвольныйАлгоритм(Алгоритм, Знач Параметры, ВыполнитьВПривилегированномРежиме = Ложь) Экспорт
	
	Если Параметры = Неопределено Тогда
		Параметры = Новый Структура();
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.Проверить(
		ТипЗнч(Параметры) = Тип("Структура"),
		НСтр("ru = 'Несоответствие типа параметры алгоритма.
		|Ожидаемый тип параметров алгоритма Структура или Неопеределено'"));
	
	Если Не Параметры.Свойство("Результат") Тогда
		Параметры.Вставить("Результат");
	КонецЕсли;
	
	Алгоритм = ОбщегоНазначения.ОписаниеТипаСтрока(0).ПривестиЗначение(Алгоритм);
	
	Если Не ПустаяСтрока(Алгоритм) Тогда
		
		Если ВыполнитьВПривилегированномРежиме Тогда
			УстановитьПривилегированныйРежим(Истина);
		КонецЕсли;
		
		ОбщегоНазначения.ВыполнитьВБезопасномРежиме(Алгоритм, Параметры);
		
		Если ВыполнитьВПривилегированномРежиме Тогда
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
	
	КонецЕсли;
	
	Результат = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Результат");
	
	Параметры.Вставить("Результат");
	
	Возврат Результат;
	
КонецФункции

Функция ДеревоОписанияВходныхДанных() Экспорт
	
	Дерево = Новый ДеревоЗначений();
	
	Дерево.Колонки.Добавить("Ключ", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	Дерево.Колонки.Добавить("Тип", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	Дерево.Колонки.Добавить("Описание", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	
	Возврат Дерево;
	
КонецФункции

// Выполнить алгоритм через метод конфигурации. Выполнение происходит через см. ОбщегоНазначения.ВыполнитьМетодКонфигурации.
// 
// Параметры:
//  ИмяМетода - Строка - имя экспортной процедуры в формате
//                   <имя объекта>.<имя процедуры>, где <имя объекта> - это
//                   общий модуль или модуль менеджера объекта.
//  Алгоритм - Строка - Код алгоритма.
//  Параметры - Массив из Произвольный - параметры передаются в процедуру <ИмяЭкспортнойПроцедуры>
//                       в порядке расположения элементов массива.
//  ВыполнитьВПривилегированномРежиме - Булево - Выполнить в привилегированном режиме.
// 
// Возвращаемое значение:
//  Массив из Произвольный - Параметры после выполнения алгоритма через метод конфигурации
Функция ВыполнитьАлгоритмЧерезМетодКонфигурации(ИмяМетода, Знач Алгоритм, Параметры, ВыполнитьВПривилегированномРежиме = Ложь) Экспорт
	
	Результат = Неопределено;
	
	Алгоритм = ОбщегоНазначения.ОписаниеТипаСтрока(0).ПривестиЗначение(Алгоритм);
	
	Если Не ПустаяСтрока(Алгоритм) Тогда
		
		Если ВыполнитьВПривилегированномРежиме Тогда
			УстановитьПривилегированныйРежим(Истина);
		КонецЕсли;
		
		ПараметрыМетода = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Алгоритм);
		
		ОписаниеТипаМассив = Новый ОписаниеТипов("Массив");
		Для Каждого Параметр Из ОписаниеТипаМассив.ПривестиЗначение(Параметры) Цикл
			ПараметрыМетода.Добавить(Параметр);
		КонецЦикла;
		
		ОбщегоНазначения.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
		
		Если ВыполнитьВПривилегированномРежиме Тогда
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
		
		Результат = Новый Массив();
		Для индекс = 1 По ПараметрыМетода.ВГраница() Цикл
			Результат.Добавить(ПараметрыМетода[индекс]);
		КонецЦикла;
		
	Иначе
		Результат = Параметры;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
