
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	ТЗВывод = Новый ТаблицаЗначений;
	ТЗВывод.Колонки.Добавить("Период");
	ТЗВывод.Колонки.Добавить("sid");
	ТЗВывод.Колонки.Добавить("id_doc");
	ТЗВывод.Колонки.Добавить("МобильныйКлиент");
	ТЗВывод.Колонки.Добавить("id_good");
	ТЗВывод.Колонки.Добавить("id_properties");
	ТЗВывод.Колонки.Добавить("id_series");
	ТЗВывод.Колонки.Добавить("id_cell");
	ТЗВывод.Колонки.Добавить("id_unit");
	ТЗВывод.Колонки.Добавить("id_price");
	ТЗВывод.Колонки.Добавить("price");
	ТЗВывод.Колонки.Добавить("d_qtty");
	ТЗВывод.Колонки.Добавить("use_series");
	ТЗВывод.Колонки.Добавить("ТипТаблицы");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	SUI_docs_tbl_goods_deltaСрезПоследних.Период КАК Период,
	               |	SUI_docs_tbl_goods_deltaСрезПоследних.sid КАК sid,
	               |	SUI_docs.id_doc КАК id_doc,
	               |	SUI_docs_tbl_goods_deltaСрезПоследних.МобильныйКлиент КАК МобильныйКлиент,
	               |	SUI_docs_tbl_goods_deltaСрезПоследних.id_good КАК id_good,
	               |	SUI_docs_tbl_goods_deltaСрезПоследних.id_properties КАК id_properties,
	               |	SUI_docs_tbl_goods_deltaСрезПоследних.id_series КАК id_series,
	               |	SUI_docs_tbl_goods_deltaСрезПоследних.id_cell КАК id_cell,
	               |	SUI_docs_tbl_goods_deltaСрезПоследних.id_unit КАК id_unit,
	               |	SUI_docs_tbl_goods_deltaСрезПоследних.id_price КАК id_price,
	               |	СУММА(SUI_docs_tbl_goods_deltaСрезПоследних.price) КАК price,
	               |	СУММА(SUI_docs_tbl_goods_deltaСрезПоследних.d_qtty) КАК d_qtty
	               |ИЗ
	               |	РегистрСведений.SUI_docs_tbl_goods_delta.СрезПоследних КАК SUI_docs_tbl_goods_deltaСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.SUI_docs КАК SUI_docs
	               |		ПО SUI_docs_tbl_goods_deltaСрезПоследних.sid_doc = SUI_docs.sid
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	SUI_docs_tbl_goods_deltaСрезПоследних.sid,
	               |	SUI_docs_tbl_goods_deltaСрезПоследних.МобильныйКлиент,
	               |	SUI_docs_tbl_goods_deltaСрезПоследних.Период,
	               |	SUI_docs_tbl_goods_deltaСрезПоследних.id_cell,
	               |	SUI_docs_tbl_goods_deltaСрезПоследних.id_series,
	               |	SUI_docs_tbl_goods_deltaСрезПоследних.id_unit,
	               |	SUI_docs_tbl_goods_deltaСрезПоследних.id_properties,
	               |	SUI_docs_tbl_goods_deltaСрезПоследних.id_good,
	               |	SUI_docs_tbl_goods_deltaСрезПоследних.id_price,
	               |	SUI_docs.id_doc";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
	
	Для Каждого СтрокаВыгрузки Из ВыборкаДетальныеЗаписи Цикл 
		
		СтруктураПриемник = Новый Структура; 
		
		SUI_ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаВыгрузки,СтруктураПриемник);   		
		SUI_ИнтеграцияВКонфигурацию.ВосстановитьСсылкиИдентификаторовSimple(СтруктураПриемник, ,Ложь);  
				
		ЗаполнитьЗначенияСвойств(ТЗВывод.Добавить(), СтруктураПриемник);
		
	КонецЦикла;
		
	Настройки = КомпоновщикНастроек.ПолучитьНастройки(); 
 
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных; 
 
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);	
	
	ВнешнийНаборДанных = Новый Структура("ПримерТаблицыЗначений", ТЗВывод); 
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных; 
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешнийНаборДанных, ДанныеРасшифровки); 
	
	ДокументРезультат.Очистить();
	
 	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент; 
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат); 
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
