
#Область ОписаниеПеременных

&НаКлиенте
Перем ТекущаяСтрокаМетаданных;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Данные = СформироватьСтруктуруМетаданных();
	СтруктураПредставленийМетаданных = Данные.СтруктураПредставлений;
	СтруктураИменМетаданных          = Данные.СтруктураИмен;
		
	ЗначениеВРеквизитФормы(Данные.Дерево, "ДеревоМетаданныхЭталон");
	
	ЗагрузитьЭталонВДеревоМетаданных();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(МобильноеУстройство) Тогда
		ПолучитьКоличествоИзменений();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура МобильноеУстройствоПриИзменении(Элемент)

	ЗагрузитьЭталонВДеревоМетаданных();

	Если ЗначениеЗаполнено(МобильноеУстройство) Тогда
		ПолучитьКоличествоИзменений();
		Элементы.ГруппаРегистрацияИзменений.Доступность = Истина;
	Иначе
		Элементы.ГруппаРегистрацияИзменений.Доступность = Ложь;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоМетаданных

&НаКлиенте
Процедура ДеревоМетаданныхПриАктивизацииСтроки(Элемент)
	
	Если Элементы.ДеревоМетаданных.ТекущаяСтрока <> ТекущаяСтрокаМетаданных Тогда
		ТекущаяСтрокаМетаданных  = Элементы.ДеревоМетаданных.ТекущаяСтрока;
		ПодключитьОбработчикОжидания("НастроитьРедактированиеИзменений", 0.0000001, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоМетаданныхПометкаПриИзменении(Элемент)
	ИзменениеПометки(Элементы.ДеревоМетаданных.ТекущаяСтрока);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьВсеДанные(Команда)
	ПолучитьКоличествоИзменений();
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьИзмененияПоОтбору(Команда)
	
	ТекущаяСтраница = Элементы.СтраницыДетализацииИзменений.ТекущаяСтраница;
	Если Элементы.ДеревоМетаданных.ТекущиеДанные = Неопределено Или
		(ТекущаяСтраница <> Элементы.СтраницаДетализацияИзмененийКонстант И 
		ТекущаяСтраница <> Элементы.СтраницаДетализацияИзмененийНаборовЗаписей И 
		ТекущаяСтраница <> Элементы.СтраницаДетализацияИзмененийСсылок) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(МобильноеУстройство) Тогда
		SUI_ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбрано мобильное устройство'"), , "МобильноеУстройство");
		Возврат;
	КонецЕсли;

	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("ПолноеИмяМетаданных", 	Элементы.ДеревоМетаданных.ТекущиеДанные.ПолноеИмяМетаданных);
	ПараметрыОткрытия.Вставить("ИдентификаторСтроки", 	Элементы.ДеревоМетаданных.ТекущиеДанные.ИдентификаторСтроки);
	ПараметрыОткрытия.Вставить("ТекущаяСтрока", 		Элементы.ДеревоМетаданных.ТекущаяСтрока);
	ПараметрыОткрытия.Вставить("Действие", 				"ЗарегистрироватьИзмененияПоОтбору");
	
	ОткрытьФормуВыбора(ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьИзмененияОдного(Команда)
	
	ТекущаяСтраница = Элементы.СтраницыДетализацииИзменений.ТекущаяСтраница;
	Если Элементы.ДеревоМетаданных.ТекущиеДанные = Неопределено Или
		(ТекущаяСтраница <> Элементы.СтраницаДетализацияИзмененийКонстант И 
		ТекущаяСтраница <> Элементы.СтраницаДетализацияИзмененийНаборовЗаписей И 
		ТекущаяСтраница <> Элементы.СтраницаДетализацияИзмененийСсылок) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(МобильноеУстройство) Тогда
		SUI_ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбрано мобильное устройство'"), , "МобильноеУстройство");
		Возврат;
	КонецЕсли;

	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("ПолноеИмяМетаданных", 	Элементы.ДеревоМетаданных.ТекущиеДанные.ПолноеИмяМетаданных);
	ПараметрыОткрытия.Вставить("ИдентификаторСтроки", 	Элементы.ДеревоМетаданных.ТекущиеДанные.ИдентификаторСтроки);
	ПараметрыОткрытия.Вставить("ТекущаяСтрока", 		Элементы.ДеревоМетаданных.ТекущаяСтрока);
	ПараметрыОткрытия.Вставить("Действие", 				"ЗарегистрироватьИзмененияОдного");
	
	ОткрытьФормуВыбора(ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьРегистрациюИзмененийПоОтбору(Команда)
	
	ТекущаяСтраница = Элементы.СтраницыДетализацииИзменений.ТекущаяСтраница;
	Если Элементы.ДеревоМетаданных.ТекущиеДанные = Неопределено Или
		(ТекущаяСтраница <> Элементы.СтраницаДетализацияИзмененийКонстант И 
		ТекущаяСтраница <> Элементы.СтраницаДетализацияИзмененийНаборовЗаписей И 
		ТекущаяСтраница <> Элементы.СтраницаДетализацияИзмененийСсылок) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(МобильноеУстройство) Тогда
		SUI_ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбрано мобильное устройство'"), , "МобильноеУстройство");
		Возврат;
	КонецЕсли;

	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("ПолноеИмяМетаданных", 	Элементы.ДеревоМетаданных.ТекущиеДанные.ПолноеИмяМетаданных);
	ПараметрыОткрытия.Вставить("ИдентификаторСтроки", 	Элементы.ДеревоМетаданных.ТекущиеДанные.ИдентификаторСтроки);
	ПараметрыОткрытия.Вставить("ТекущаяСтрока", 		Элементы.ДеревоМетаданных.ТекущаяСтрока);
	ПараметрыОткрытия.Вставить("Действие", 				"УдалитьРегистрациюИзмененийПоОтбору");
	
	ОткрытьФормуВыбора(ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьРегистрациюИзмененийОдного(Команда)
	
	ТекущаяСтраница = Элементы.СтраницыДетализацииИзменений.ТекущаяСтраница;
	Если Элементы.ДеревоМетаданных.ТекущиеДанные = Неопределено Или
		(ТекущаяСтраница <> Элементы.СтраницаДетализацияИзмененийКонстант И 
		ТекущаяСтраница <> Элементы.СтраницаДетализацияИзмененийНаборовЗаписей И 
		ТекущаяСтраница <> Элементы.СтраницаДетализацияИзмененийСсылок) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(МобильноеУстройство) Тогда
		SUI_ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбрано мобильное устройство'"), , "МобильноеУстройство");
		Возврат;
	КонецЕсли;
	
	ВыбранныеЗначения = Неопределено;
	
	Если ТекущаяСтраница = Элементы.СтраницаДетализацияИзмененийНаборовЗаписей Тогда
		
		
		Если Элементы.ДетализацияИзмененийНаборыЗаписей.ТекущиеДанные <> Неопределено И Не ПустаяСтрока(ИзмеренияНЗ) Тогда
			
			ВыбранныеЗначения = Новый Массив();
			
			ВыделенныеСтроки = Элементы.ДетализацияИзмененийНаборыЗаписей.ВыделенныеСтроки;
			Для Каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
			
				ТекущаяСтрока = Элементы.ДетализацияИзмененийНаборыЗаписей.ДанныеСтроки(ВыделеннаяСтрока);
				Если ТекущаяСтрока <> Неопределено Тогда
					ВыбранноеЗначение = Новый Структура(ИзмеренияНЗ);
					ЗаполнитьЗначенияСвойств(ВыбранноеЗначение, ТекущаяСтрока);
					ВыбранныеЗначения.Добавить(Новый ФиксированнаяСтруктура(ВыбранноеЗначение));
				КонецЕсли;
				
			КонецЦикла;

		КонецЕсли;
		
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаДетализацияИзмененийСсылок Тогда
		ТекущиеДанные = Элементы.ДетализацияИзмененийСсылки.ТекущиеДанные;
		ВыбранныеЗначения = ТекущиеДанные.Ссылка;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВыбранныеЗначения) Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("УдалитьРегистрациюИзмененийОдногоПодтверждение", ЭтотОбъект, ВыбранныеЗначения);
	ПоказатьВопрос(ОповещениеОЗавершении, НСтр("ru = 'Удалить регистрацию изменений по выделеным строкам?'"), РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьИзмененияОтмеченыхОбъектовКонфигурации(Команда)
	
	Если Не ЗначениеЗаполнено(МобильноеУстройство) Тогда
		SUI_ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбрано мобильное устройство'"), , "МобильноеУстройство");
		Возврат;
	КонецЕсли;
	
	ВыбранныеЗначения = ПолучитьОтмеченныеОбъектыМетаданных();
	
	Если ВыбранныеЗначения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗарегистрироватьИзмененияОтмеченыхОбъектовКонфигурацииПодтверждение", 
		ЭтотОбъект, ВыбранныеЗначения);
	ПоказатьВопрос(ОповещениеОЗавершении, НСтр("ru = 'Зарегистрировать изменения по отмеченным объектам конфигурации?
	|
	|Регистрация изменений по объектам конфигурации может занят продолжительное время.'"), РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьРегистрациюИзмененийОтмеченыхОбъектовКонфигурации(Команда)
	
	Если Не ЗначениеЗаполнено(МобильноеУстройство) Тогда
		SUI_ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбрано мобильное устройство'"), , "МобильноеУстройство");
		Возврат;
	КонецЕсли;
	
	ВыбранныеЗначения = ПолучитьОтмеченныеОбъектыМетаданных();
	
	Если ВыбранныеЗначения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("УдалитьРегистрациюИзмененийОтмеченыхОбъектовКонфигурацииПодтверждение", 
		ЭтотОбъект, ВыбранныеЗначения);
	ПоказатьВопрос(ОповещениеОЗавершении, НСтр("ru = 'Удалить регистрацию изменений по отмеченным объектам конфигурации?
	|
	|Удаление регистрации изменений по объектам конфигурации может занят продолжительное время.'"), РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьЭталонВДеревоМетаданных()
	
	Эталон = РеквизитФормыВЗначение("ДеревоМетаданныхЭталон", Тип("ДеревоЗначений"));
	ЗначениеВРеквизитФормы(Эталон, "ДеревоМетаданных");

КонецПроцедуры

&НаКлиенте
Процедура ПолучитьКоличествоИзменений()
	
	ДлительнаяОперация = ПолучитьКоличествоИзмененийНаСервере();
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПолучитьКоличествоИзмененийЗавершение", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоИзмененийНаСервере()
	
	ПараметрыПроцедуры = Новый Структура();
	ПараметрыПроцедуры.Вставить("СписокТаблиц", СтруктураИменМетаданных);
	ПараметрыПроцедуры.Вставить("СписокМобильныхУстройств", МобильноеУстройство);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Обработки.SUI_РегистрацияИзменений.ПолучитьКоличествоИзменений", 
		ПараметрыПроцедуры, ПараметрыВыполнения);

КонецФункции

&НаКлиенте
Процедура ПолучитьКоличествоИзмененийЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Сообщения <> Неопределено Тогда
		
		Для индекс = 0 По Результат.Сообщения.ВГраница() Цикл
			Результат.Сообщения[индекс].Сообщить();
		КонецЦикла;
		
	КонецЕсли;

	Если Результат.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение(, Результат.КраткоеПредставлениеОшибки);
		SUI_ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
		Возврат;
	КонецЕсли;

	Если Результат.Статус = "Выполнено" Тогда
		ЗаполнитьКоличествоРегистрацийВДеревеНаСервере(Результат.АдресРезультата);
		ОбновитьСодержимоеСтраницы();
		РазвернутьДеревоМетаданных();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКоличествоРегистрацийВДеревеНаСервере(АдресДанных)

	Данные = ПолучитьИзВременногоХранилища(АдресДанных);

	// Проставляем в дерево
	Фильтр = Новый Структура("ПолноеИмяМетаданных, МобильноеУстройство", Неопределено, МобильноеУстройство);
	Нули   = Новый Структура("КоличествоИзменений", 0);

	Для Каждого Корень Из ДеревоМетаданных.ПолучитьЭлементы() Цикл
		
		СуммаКорень = Новый Структура("КоличествоИзменений", 0);

		Для Каждого Группа Из Корень.ПолучитьЭлементы() Цикл
			
			СуммаГруппа = Новый Структура("КоличествоИзменений", 0);

			СписокМобильныхУстройств = Группа.ПолучитьЭлементы();
			
			Если СписокМобильныхУстройств.Количество() = 0 И СтруктураИменМетаданных.Свойство(Группа.ПолноеИмяМетаданных) Тогда
				// Коллекция узлов без узлов, просуммируем руками, авторегистрацию возьмем из структуры
				Для Каждого МетаИмя Из СтруктураИменМетаданных[Группа.ПолноеИмяМетаданных] Цикл
					Фильтр.ПолноеИмяМетаданных = МетаИмя;
					Найдено = Данные.НайтиСтроки(Фильтр);
					Если Найдено.Количество() > 0 Тогда
						Строка = Найдено[0];
						СуммаГруппа.КоличествоИзменений = СуммаГруппа.КоличествоИзменений + Строка.КоличествоИзменений;
					КонецЕсли;
				КонецЦикла;

			Иначе
				// Считаем по каждому узлу
				Для Каждого УзелМобильноеУстройство Из СписокМобильныхУстройств Цикл
					
					Фильтр.ПолноеИмяМетаданных = УзелМобильноеУстройство.ПолноеИмяМетаданных;
					Найдено = Данные.НайтиСтроки(Фильтр);
					Если Найдено.Количество() > 0 Тогда
						Строка = Найдено[0];
						ЗаполнитьЗначенияСвойств(УзелМобильноеУстройство, Строка, "КоличествоИзменений");
						СуммаГруппа.КоличествоИзменений = СуммаГруппа.КоличествоИзменений + Строка.КоличествоИзменений;
					Иначе
						ЗаполнитьЗначенияСвойств(УзелМобильноеУстройство, Нули);
					КонецЕсли;

				КонецЦикла;

			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(Группа, СуммаГруппа);
			СуммаКорень.КоличествоИзменений = СуммаКорень.КоличествоИзменений + Группа.КоличествоИзменений;

		КонецЦикла;

		ЗаполнитьЗначенияСвойств(Корень, СуммаКорень);

	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДеревоМетаданных()
	
	Для Каждого Строка Из ДеревоМетаданных.ПолучитьЭлементы() Цикл
		Элементы.ДеревоМетаданных.Развернуть(Строка.ПолучитьИдентификатор());
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРедактированиеИзменений()
	НастроитьРедактированиеИзмененийСервер(ТекущаяСтрокаМетаданных);
	НастроитьВидимостьКомандОбщегоМеню();
КонецПроцедуры

&НаСервере
Процедура НастроитьРедактированиеИзмененийСервер(ТекущаяСтрока)

	Данные = ДеревоМетаданных.НайтиПоИдентификатору(ТекущаяСтрока);
	Если Данные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ИзмеренияНЗ = "";
	ИмяТаблицы = Данные.ПолноеИмяМетаданных;
	Представление = Данные.Представление;
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ТекущиеМетаданные = МетаданныеПоПолномуИмени(ИмяТаблицы);

	Если ТекущиеМетаданные = 0 Тогда
		НастроитьПустуюСтраницу(Представление, ИмяТаблицы);
		ТекущаяСтраница = Элементы.СтраницаДетализацияИзмененийПустая;

	ИначеЕсли ТекущиеМетаданные = Метаданные.Константы Тогда
		// Все константы системы
		НастроитьСписокКонстант();
		ТекущаяСтраница = Элементы.СтраницаДетализацияИзмененийКонстант;

	ИначеЕсли ТипЗнч(ТекущиеМетаданные) = Тип("КоллекцияОбъектовМетаданных") Тогда
		// Все справочники, документы, и т.п.
		НастроитьПустуюСтраницу(Представление, ИмяТаблицы);
		ТекущаяСтраница = Элементы.СтраницаДетализацияИзмененийПустая;

	ИначеЕсли Метаданные.Константы.Содержит(ТекущиеМетаданные) Тогда
		// Одиночная константа
		НастроитьСписокКонстант(ИмяТаблицы, Представление);
		ТекущаяСтраница = Элементы.СтраницаДетализацияИзмененийКонстант;

	ИначеЕсли Метаданные.Справочники.Содержит(ТекущиеМетаданные) Или Метаданные.Документы.Содержит(ТекущиеМетаданные)
		Или Метаданные.ПланыВидовХарактеристик.Содержит(ТекущиеМетаданные) Или Метаданные.ПланыСчетов.Содержит(ТекущиеМетаданные)
		Или Метаданные.ПланыВидовРасчета.Содержит(ТекущиеМетаданные) Или Метаданные.БизнесПроцессы.Содержит(ТекущиеМетаданные)
		Или Метаданные.Задачи.Содержит(ТекущиеМетаданные) Тогда
		// Ссылочный тип
		НастроитьСписокСсылок(ИмяТаблицы, Представление);
		ТекущаяСтраница = Элементы.СтраницаДетализацияИзмененийСсылок;

	Иначе
		// Проверим на набор записей
		Измерения = СформироватьИзмеренияНабораЗаписей(ИмяТаблицы);
		Если Измерения <> Неопределено Тогда
			НастроитьНаборЗаписей(ИмяТаблицы, Измерения, Представление);
			ТекущаяСтраница = Элементы.СтраницаДетализацияИзмененийНаборовЗаписей;
		Иначе
			НастроитьПустуюСтраницу(Представление, ИмяТаблицы);
			ТекущаяСтраница = Элементы.СтраницаДетализацияИзмененийПустая;
		КонецЕсли;

	КонецЕсли;

	Элементы.СтраницыДетализацииИзменений.ТекущаяСтраница = ТекущаяСтраница;

КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимостьКомандОбщегоМеню()
	
	ТекущаяСтраница = Элементы.СтраницыДетализацииИзменений.ТекущаяСтраница;

	Если ТекущаяСтраница = Элементы.СтраницаДетализацияИзмененийСсылок Тогда
		Элементы.ЗарегистрироватьИзмененияОдного.Видимость = Истина;
	Иначе
		Элементы.ЗарегистрироватьИзмененияОдного.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЭкранироватьДвойныеКовычки(Строка)
	Возврат СтрЗаменить(Строка, """", """""");
КонецФункции

&НаСервере
Процедура НастроитьПустуюСтраницу(Наименование, ИмяТаблицы = Неопределено)

	Если ЗначениеЗаполнено(МобильноеУстройство) Тогда
		
		КоличествоИзменений = 0;
		Если ИмяТаблицы <> Неопределено Тогда
			Дерево = РеквизитФормыВЗначение("ДеревоМетаданных");
			Строка = Дерево.Строки.Найти(ИмяТаблицы, "ПолноеИмяМетаданных", Истина);
			Если Строка <> Неопределено Тогда
				КоличествоИзменений = Строка.КоличествоИзменений;
			КонецЕсли;
		КонецЕсли;
	
		Элементы.НадписьОписанияДетализации.Заголовок = СтрШаблон(
			НСтр("ru='%1
			|
			|Мобильное устройство: %2
			|Зарегистрировано изменений: %3
			|
			|Для регистрации или отмены регистрации изменений
			|выберите объект конфигурации и воспользуйтесь
			|командами ""Зарегистрировать"" или ""Отменить регистрацию""'"), 
		Наименование, МобильноеУстройство, Формат(КоличествоИзменений, "ЧДЦ=0; ЧН="));
		
	Иначе
		Элементы.НадписьОписанияДетализации.Заголовок = СтрШаблон(
			НСтр("ru='%1
			|
			|Выберите мобильное устройство для просмотра и редактирования регистрации изменений.'"), 
		Наименование);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьСписокКонстант(ИмяТаблицы = Неопределено, Наименование = "")

	Если ИмяТаблицы = Неопределено Тогда
		// Все константы
		Имена = СтруктураИменМетаданных.Константы;
		Представления = СтруктураПредставленийМетаданных.Константы;
	Иначе
		Имена = Новый Массив();
		Имена.Добавить(ИмяТаблицы);
		Представления = Новый Массив();
		Представления.Добавить(Наименование);
		Индекс = СтруктураИменМетаданных.Константы.Найти(ИмяТаблицы);
	КонецЕсли;
	
	Текст = "";
	Для Индекс = 0 По Имена.ВГраница() Цикл
		Имя = Имена[Индекс];
		Текст = Текст + ?(Текст = "", "ВЫБРАТЬ" + Символы.ПС, "ОБЪЕДИНИТЬ ВСЕ " + Символы.ПС + Символы.ПС + "ВЫБРАТЬ") + "
		|	2 КАК ИндексКартинки,
		|	""" + ЭкранироватьДвойныеКовычки(Представления[Индекс]) + """ КАК Наименование,
		|	""" + Имя + """ КАК ПолноеИмяМетаданных
		|ИЗ
		|	" + Имя + ".Изменения КАК ТаблицаИзменений
		|ГДЕ
		|	ТаблицаИзменений.Узел = &МобильноеУстройство
		|";
	КонецЦикла;

	ДетализацияИзмененийКонстанты.ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ИндексКартинки, Наименование, ПолноеИмяМетаданных
	|
	|{ВЫБРАТЬ
	|	ИндексКартинки, Наименование, ПолноеИмяМетаданных
	|}
	|
	|ИЗ (" + Текст + ") Данные
	|
	|{ГДЕ
	|	Наименование
	|}
	|";

	ЭлементыСписка = ДетализацияИзмененийКонстанты.Порядок.Элементы;
	Если ЭлементыСписка.Количество() = 0 Тогда
		Элемент = ЭлементыСписка.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
		Элемент.Поле = Новый ПолеКомпоновкиДанных("Наименование");
		Элемент.Использование = Истина;
	КонецЕсли;

	ДетализацияИзмененийКонстанты.Параметры.УстановитьЗначениеПараметра("МобильноеУстройство", МобильноеУстройство);
	ДетализацияИзмененийКонстанты.ДинамическоеСчитываниеДанных = Истина;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьСписокСсылок(ИмяТаблицы, Наименование)

	ДетализацияИзмененийСсылки.ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаИзменений.Ссылка КАК Ссылка
	|ИЗ
	|	" + ИмяТаблицы + ".Изменения КАК ТаблицаИзменений
	|ГДЕ
	|	ТаблицаИзменений.Узел = &МобильноеУстройство";	

	ДетализацияИзмененийСсылки.Параметры.УстановитьЗначениеПараметра("МобильноеУстройство", МобильноеУстройство);
	ДетализацияИзмененийСсылки.ДинамическоеСчитываниеДанных = Истина;
	//ДетализацияИзмененийСсылки.ОсновнаяТаблица = ИмяТаблицы;
	
	// Представление объекта
	ТекущиеМетаданные = МетаданныеПоПолномуИмени(ИмяТаблицы);
	ЗаголовокПредставленияСсылки = ТекущиеМетаданные.ПредставлениеОбъекта;
	Если ПустаяСтрока(ЗаголовокПредставленияСсылки) Тогда
		ЗаголовокПредставленияСсылки = Наименование;
	КонецЕсли;
	Элементы.ДетализацияИзмененийСсылокПредставлениеСсылки.Заголовок = ЗаголовокПредставленияСсылки;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьНаборЗаписей(ИмяТаблицы, Измерения, Наименование)

	ИзмеренияНабораЗаписей = Новый Массив();
	Выбрать = Новый Массив();
	Для Каждого Строка Из Измерения Цикл
		Выбрать.Добавить(СтрШаблон("ТаблицаИзменений.%1 КАК %1", Строка.Имя));
		ИзмеренияНабораЗаписей.Добавить(Строка.Имя);
	КонецЦикла;
	
	ИзмеренияНЗ = СтрСоединить(ИзмеренияНабораЗаписей, ",");

	ДетализацияИзмененийНаборыЗаписей.ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ИСТИНА КАК Зарегистрировано,
		|	" + СтрСоединить(Выбрать, "," + Символы.ПС) + "
		|ИЗ
		|	" + ИмяТаблицы + ".Изменения КАК ТаблицаИзменений
		|ГДЕ
		|	ТаблицаИзменений.Узел = &МобильноеУстройство";
	
	ДетализацияИзмененийНаборыЗаписей.Параметры.УстановитьЗначениеПараметра("МобильноеУстройство", МобильноеУстройство);
	
	// Добавляем в группу измерений
	ДобавитьКолонкиВТаблицуФормы(
		Элементы.ДетализацияИзмененийНаборыЗаписей, 
		"Порядок, Отбор, Группировка, СтандартнаяКартинка, Параметры, УсловноеОформление",
		Измерения, Элементы.ДетализацияИзмененийНаборыЗаписейГруппаИзмерений);
	
	ДетализацияИзмененийНаборыЗаписей.ДинамическоеСчитываниеДанных = Истина;
	ДетализацияИзмененийНаборыЗаписейИмяТаблицы = ИмяТаблицы;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСодержимоеСтраницы(Страница = Неопределено)
	
	ТекущаяСтраница = ?(Страница = Неопределено, Элементы.СтраницыДетализацииИзменений.ТекущаяСтраница, Страница);

	Если ТекущаяСтраница = Элементы.СтраницаДетализацияИзмененийСсылок Тогда
		Элементы.ДетализацияИзмененийСсылки.Обновить();

	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаДетализацияИзмененийКонстант Тогда
		Элементы.ДетализацияИзмененийКонстанты.Обновить();

	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаДетализацияИзмененийНаборовЗаписей Тогда
		Элементы.ДетализацияИзмененийНаборыЗаписей.Обновить();

	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаДетализацияИзмененийПустая Тогда
		
		Строка = Элементы.ДеревоМетаданных.ТекущаяСтрока;
		Если Строка <> Неопределено Тогда
			
			Данные = ДеревоМетаданных.НайтиПоИдентификатору(Строка);
			
			Если Данные <> Неопределено Тогда
				НастроитьПустуюСтраницу(Данные.Представление, Данные.ПолноеИмяМетаданных);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИзменениеПометки(Строка)
	ЭлементДанных = ДеревоМетаданных.НайтиПоИдентификатору(Строка);
	ЭлементДанных.Пометка = ЭлементДанных.Пометка % 2;
	ПроставитьПометкиВниз(ЭлементДанных);
	ПроставитьПометкиВверх(ЭлементДанных);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбора(Знач Контекст)

	НомерРазделителя = СтрНайти(Контекст.ПолноеИмяМетаданных, ".");
	Если ПустаяСтрока(Контекст.ПолноеИмяМетаданных) Или 
		Контекст.ИдентификаторСтроки = 0 Или 
		НомерРазделителя = 0 Тогда
		Возврат;
	КонецЕсли;

	Контекст.Вставить("ВидОбъекта", Лев(Контекст.ПолноеИмяМетаданных, НомерРазделителя-1));

	ПараметрыФормыВыбора = Новый Структура();
	Если Контекст.ВидОбъекта = "Справочник" И Контекст.Действие = "ЗарегистрироватьИзмененияОдного" Тогда
		ИмяФормыВыбора = Контекст.ПолноеИмяМетаданных + ".ФормаВыбора";
	Иначе

		ПараметрыФормыВыбора.Вставить("ПолноеИмяМетаданных", Контекст.ПолноеИмяМетаданных);
		ПараметрыФормыВыбора.Вставить("МобильноеУстройство", МобильноеУстройство);
		
		Если Контекст.Действие = "УдалитьРегистрациюИзмененийПоОтбору" Тогда
			ПараметрыФормыВыбора.Вставить("ТолькоИзменения");
		КонецЕсли;
		
		ИмяФормыВыбора = "Обработка.SUI_РегистрацияИзменений.Форма.ФормаВыбора";
		
	КонецЕсли;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОткрытьФормуВыбораЗавершение", ЭтотОбъект, Контекст);
	ОткрытьФорму(ИмяФормыВыбора, ПараметрыФормыВыбора, ЭтотОбъект, УникальныйИдентификатор, , , 
		ОповещениеОЗавершении, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораЗавершение(Знач ВыбранныеЗначения, Контекст) Экспорт

	Если Не ЗначениеЗаполнено(ВыбранныеЗначения) Тогда
		Возврат;
	КонецЕсли;

	ПараметрыВыполнения = ПараметрыВыполненияДействияНаУзлах(МобильноеУстройство, СтрНачинаетсяС(Контекст.Действие, "ЗарегистрироватьИзменения"));
	ПараметрыВыполнения.МетаданныеВыбранныхЗначений = Контекст.ПолноеИмяМетаданных;
	ПараметрыВыполнения.ВыбранныеЗначения = ВыбранныеЗначения;
	
	ДлительнаяОперация = ВыполнитьДействиеНаУзлахНаСервере(ПараметрыВыполнения);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ВыполнитьДействиеНаУзлахЗавершение", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьДействиеНаУзлахНаСервере(ПараметрыПроцедуры)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	Возврат ДлительныеОперации.ВыполнитьВФоне("Обработки.SUI_РегистрацияИзменений.ВыполнитьДействиеНаУзлах", 
		ПараметрыПроцедуры, ПараметрыВыполнения);

КонецФункции

&НаКлиенте
Процедура ВыполнитьДействиеНаУзлахЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	Если ЗначениеЗаполнено(Результат.Сообщения) Тогда
		
		Для индекс = 0 По Результат.Сообщения.ВГраница() Цикл
			Результат.Сообщения[индекс].Сообщить();
		КонецЦикла;
		
	КонецЕсли;

	Если Результат.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение(, Результат.КраткоеПредставлениеОшибки);
		SUI_ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
		Возврат;
	КонецЕсли;

	Если Результат.Статус = "Выполнено" Тогда
		
		Если ЗначениеЗаполнено(Результат.АдресРезультата) И ЭтоАдресВременногоХранилища(Результат.АдресРезультата) Тогда
			ОписаниеТипаБулево = Новый ОписаниеТипов("Булево");
			РезультатВыполнения = ОписаниеТипаБулево.ПривестиЗначение(ПолучитьИзВременногоХранилища(Результат.АдресРезультата));
		Иначе
			РезультатВыполнения = Ложь;
		КонецЕсли;
		
		Если РезультатВыполнения Тогда
			
			ПолучитьКоличествоИзменений();
			
			СнятьОтметкиОбъектовМетаданных = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, 
				"СнятьОтметкиОбъектовМетаданных", Ложь, Тип("Булево"));
			
			Если СнятьОтметкиОбъектовМетаданных Тогда
				СнятьОтметкиСОтмеченныхОбъектовМетаданных();
			КонецЕсли;
				
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПараметрыВыполненияДействияНаУзлах(МобильноеУстройство, РегистрацияИзменений)
	
	ПараметрыВыполнения = Новый Структура();
	
	ПараметрыВыполнения.Вставить("МобильноеУстройство", МобильноеУстройство);
	
	Если РегистрацияИзменений Тогда
		ПараметрыВыполнения.Вставить("ЗарегистрироватьИзменения");
	Иначе
		ПараметрыВыполнения.Вставить("УдалитьРегистрациюИзменений");
	КонецЕсли;
	
	ПараметрыВыполнения.Вставить("МетаданныеВыбранныхЗначений");
	ПараметрыВыполнения.Вставить("ВыбранныеЗначения");
	ПараметрыВыполнения.Вставить("ВыбранныеМетаданные");
	
	Возврат ПараметрыВыполнения;
	
КонецФункции

&НаКлиенте
Процедура УдалитьРегистрациюИзмененийОдногоПодтверждение(Ответ, ВыбранныеЗначения) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда

		ПараметрыВыполнения = ПараметрыВыполненияДействияНаУзлах(МобильноеУстройство, Ложь);
		ПараметрыВыполнения.МетаданныеВыбранныхЗначений = Элементы.ДеревоМетаданных.ТекущиеДанные.ПолноеИмяМетаданных;
		ПараметрыВыполнения.ВыбранныеЗначения = ВыбранныеЗначения;
		
		ДлительнаяОперация = ВыполнитьДействиеНаУзлахНаСервере(ПараметрыВыполнения);
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьСообщения = Истина;
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ВыполнитьДействиеНаУзлахЗавершение", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьИзмененияОтмеченыхОбъектовКонфигурацииПодтверждение(Ответ, ВыбранныеЗначения) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда

		ПараметрыВыполнения = ПараметрыВыполненияДействияНаУзлах(МобильноеУстройство, Истина);
		ПараметрыВыполнения.ВыбранныеМетаданные = ВыбранныеЗначения;
		
		ДлительнаяОперация = ВыполнитьДействиеНаУзлахНаСервере(ПараметрыВыполнения);
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ВыполнитьДействиеНаУзлахЗавершение", ЭтотОбъект,
			Новый Структура("СнятьОтметкиОбъектовМетаданных", Истина));
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьРегистрациюИзмененийОтмеченыхОбъектовКонфигурацииПодтверждение(Ответ, ВыбранныеЗначения) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда

		ПараметрыВыполнения = ПараметрыВыполненияДействияНаУзлах(МобильноеУстройство, Ложь);
		ПараметрыВыполнения.ВыбранныеМетаданные = ВыбранныеЗначения;
		
		ДлительнаяОперация = ВыполнитьДействиеНаУзлахНаСервере(ПараметрыВыполнения);
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ВыполнитьДействиеНаУзлахЗавершение", ЭтотОбъект,
			Новый Структура("СнятьОтметкиОбъектовМетаданных", Истина));
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОтмеченныеОбъектыМетаданных()
	
	ОтмеченныеОбъекты = Новый Массив();
	
	Для Каждого Корень Из ДеревоМетаданных.ПолучитьЭлементы() Цикл
		
		Если Корень.Пометка = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого Группа Из Корень.ПолучитьЭлементы() Цикл
			
			Если Группа.Пометка = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Для Каждого ОбъектГруппы Из Группа.ПолучитьЭлементы() Цикл
				
				Если ОбъектГруппы.Пометка = 1 Тогда
					ОтмеченныеОбъекты.Добавить(ОбъектГруппы.ПолноеИмяМетаданных);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ОтмеченныеОбъекты;
	
КонецФункции

&НаСервере
Процедура СнятьОтметкиСОтмеченныхОбъектовМетаданных()
	
	Для Каждого Корень Из ДеревоМетаданных.ПолучитьЭлементы() Цикл
		
		Если Корень.Пометка > 0 Тогда
			Корень.Пометка = 0;
		Иначе
			Продолжить;
		КонецЕсли;
		
		Для Каждого Группа Из Корень.ПолучитьЭлементы() Цикл
			
			Если Группа.Пометка > 0 Тогда
				Группа.Пометка = 0;
			Иначе
				Продолжить;
			КонецЕсли;
			
			Для Каждого ОбъектГруппы Из Группа.ПолучитьЭлементы() Цикл
				
				Если ОбъектГруппы.Пометка > 0 Тогда
					ОбъектГруппы.Пометка = 0;
				Иначе
					Продолжить;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьСтруктуруМетаданных()

	Дерево = Новый ДеревоЗначений();
	Колонки = Дерево.Колонки;
	Колонки.Добавить("Представление");
	Колонки.Добавить("ПолноеИмяМетаданных");
	Колонки.Добавить("ИндексКартинки");
	Колонки.Добавить("Пометка");
	Колонки.Добавить("ИдентификаторСтроки");
	Колонки.Добавить("КоличествоИзменений");
	
	// Корень
	СтрокаКорень = Дерево.Строки.Добавить();
	СтрокаКорень.Представление = SUI_SimpleКлиентСервер.Представление();
	СтрокаКорень.ИндексКартинки = 0;
	СтрокаКорень.ИдентификаторСтроки = 0;
	
	ТекПараметры = Новый Структура();
	ТекПараметры.Вставить("СтруктураИмен", 			Новый Структура());
	ТекПараметры.Вставить("СтруктураПредставлений", Новый Структура());
	ТекПараметры.Вставить("Строки", 				СтрокаКорень.Строки);

	Результат = Новый Структура("Дерево, СтруктураИмен, СтруктураПредставлений", 
		Дерево, ТекПараметры.СтруктураИмен, ТекПараметры.СтруктураПредставлений);

	ТекНомерСтроки = 1;
	СформироватьУровеньМетаданных(ТекНомерСтроки, ТекПараметры, 1, 	2, 	Ложь, 	"Константы", 				НСтр("ru='Константы'"));
	СформироватьУровеньМетаданных(ТекНомерСтроки, ТекПараметры, 3, 	4, 	Истина, "Справочники", 				НСтр("ru='Справочники'"));
	СформироватьУровеньМетаданных(ТекНомерСтроки, ТекПараметры, 5, 	6, 	Истина, "Последовательности", 		НСтр("ru='Последовательности'"));
	СформироватьУровеньМетаданных(ТекНомерСтроки, ТекПараметры, 7, 	8, 	Истина, "Документы", 				НСтр("ru='Документы'"));
	СформироватьУровеньМетаданных(ТекНомерСтроки, ТекПараметры, 9, 	10, Истина, "ПланыВидовХарактеристик", 	НСтр("ru='Планы видов характеристик'"));
	СформироватьУровеньМетаданных(ТекНомерСтроки, ТекПараметры, 11, 12, Истина, "ПланыСчетов", 				НСтр("ru='Планы счетов'"));
	СформироватьУровеньМетаданных(ТекНомерСтроки, ТекПараметры, 13, 14, Истина, "ПланыВидовРасчета", 		НСтр("ru='Планы видов расчета'"));
	СформироватьУровеньМетаданных(ТекНомерСтроки, ТекПараметры, 15, 16, Истина, "РегистрыСведений", 		НСтр("ru='Регистры сведений'"));
	СформироватьУровеньМетаданных(ТекНомерСтроки, ТекПараметры, 17, 18, Истина, "РегистрыНакопления", 		НСтр("ru='Регистры накопления'"));
	СформироватьУровеньМетаданных(ТекНомерСтроки, ТекПараметры, 19, 20, Истина, "РегистрыБухгалтерии", 		НСтр("ru='Регистры бухгалтерии'"));
	СформироватьУровеньМетаданных(ТекНомерСтроки, ТекПараметры, 21, 22, Истина, "РегистрыРасчета", 			НСтр("ru='Регистры расчета'"));
	СформироватьУровеньМетаданных(ТекНомерСтроки, ТекПараметры, 23, 24, Истина, "БизнесПроцессы", 			НСтр("ru='Бизнес-процессы'"));
	СформироватьУровеньМетаданных(ТекНомерСтроки, ТекПараметры, 25, 26, Истина, "Задачи", 					НСтр("ru='Задачи'"));

	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Процедура СформироватьУровеньМетаданных(ТекущийНомерСтроки, Параметры, ИндексКартинки, ИндексКартинкиУзлов,
	ДобавлятьПодчиненные, ИмяМетаданных, ПредставлениеМетаданных)

	ПредставленияУровня = Новый Массив();
	ИменаУровня         = Новый Массив();

	СтрокаГруппа = Параметры.Строки.Добавить();
	СтрокаГруппа.ИдентификаторСтроки 	= ТекущийНомерСтроки;
	СтрокаГруппа.ПолноеИмяМетаданных  	= ИмяМетаданных;
	СтрокаГруппа.Представление   		= ПредставлениеМетаданных;
	СтрокаГруппа.ИндексКартинки 		= ИндексКартинки;

	БылиПодчиненные = Ложь;
	Для Каждого ПодчиненныеМетаданные Из Метаданные[ИмяМетаданных] Цикл

		Если Метаданные.ПланыОбмена.SUI_МобильныеУстройства.Состав.Содержит(ПодчиненныеМетаданные) Тогда
			
			БылиПодчиненные = Истина;
			
			Если ДобавлятьПодчиненные Тогда
				
				ТекущийНомерСтроки = ТекущийНомерСтроки + 1;
				
				НовСтрока = СтрокаГруппа.Строки.Добавить();
				НовСтрока.ПолноеИмяМетаданных	= ПодчиненныеМетаданные.ПолноеИмя();
				НовСтрока.Представление    		= ПодчиненныеМетаданные.Представление();
				НовСтрока.ИндексКартинки  		= ИндексКартинкиУзлов;
				НовСтрока.ИдентификаторСтроки 	= ТекущийНомерСтроки;
				
			КонецЕсли;
			
			ИменаУровня.Добавить(ПодчиненныеМетаданные.ПолноеИмя());
			ПредставленияУровня.Добавить(ПодчиненныеМетаданные.Представление());

		КонецЕсли;

	КонецЦикла;

	Если БылиПодчиненные Тогда
		СтрокаГруппа.Строки.Сортировать("Представление");
		Параметры.СтруктураИмен.Вставить(ИмяМетаданных, ИменаУровня);
		Параметры.СтруктураПредставлений.Вставить(ИмяМетаданных, ПредставленияУровня);
	Иначе
		Параметры.Строки.Удалить(СтрокаГруппа);
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция МетаданныеПоПолномуИмени(ИмяМетаданных)

	Если ПустаяСтрока(ИмяМетаданных) Тогда
		Возврат 0;
	КонецЕсли;

	Значение = Метаданные.НайтиПоПолномуИмени(ИмяМетаданных);
	Если Значение = Неопределено Тогда
		Значение = Метаданные[ИмяМетаданных];
	КонецЕсли;

	Возврат Значение;
	
КонецФункции

&НаСервереБезКонтекста
Функция СформироватьИзмеренияНабораЗаписей(ИмяТаблицы, ВсеИзмерения = Ложь)

	Если ТипЗнч(ИмяТаблицы) = Тип("Строка") Тогда
		Мета = МетаданныеПоПолномуИмени(ИмяТаблицы);
	Иначе
		Мета = ИмяТаблицы;
	КонецЕсли;
	
	// Определяем ключевые поля
	Измерения = Новый ТаблицаЗначений;
	Колонки = Измерения.Колонки;
	Колонки.Добавить("Имя");
	Колонки.Добавить("ТипЗначения");
	Колонки.Добавить("Заголовок");

	Если Не ВсеИзмерения Тогда
		// Что-то регистрируемое
		НеУчитывать = "НомерСообщения, Узел,";

		Запрос = Новый Запрос("ВЫБРАТЬ * ИЗ " + Мета.ПолноеИмя() + ".Изменения ГДЕ ЛОЖЬ");
		ПустойРезультат = Запрос.Выполнить();
		Для Каждого КолонкаРезультата Из ПустойРезультат.Колонки Цикл
			ИмяКолонки = КолонкаРезультата.Имя;
			Если Найти(НеУчитывать, ИмяКолонки + ",") = 0 Тогда
				Строка = Измерения.Добавить();
				Строка.Имя         = ИмяКолонки;
				Строка.ТипЗначения = КолонкаРезультата.ТипЗначения;

				МетаИзм = Мета.Измерения.Найти(ИмяКолонки);
				Строка.Заголовок = ?(МетаИзм = Неопределено, ИмяКолонки, МетаИзм.Представление());
			КонецЕсли;
		КонецЦикла;

		Возврат Измерения;
	КонецЕсли;
	
	// Все измерения

	ЭтоРегистрСведений = Метаданные.РегистрыСведений.Содержит(Мета);
	
	// Регистратор
	Если Метаданные.РегистрыНакопления.Содержит(Мета) Или Метаданные.РегистрыБухгалтерии.Содержит(Мета)
		Или Метаданные.РегистрыРасчета.Содержит(Мета) Или (ЭтоРегистрСведений И Мета.РежимЗаписи
		= Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.ПодчинениеРегистратору)
		Или Метаданные.Последовательности.Содержит(Мета) Тогда
		Строка = Измерения.Добавить();
		Строка.Имя         = "Регистратор";
		Строка.ТипЗначения = Документы.ТипВсеСсылки();
		Строка.Заголовок   = "Регистратор";
	КонецЕсли;
	
	// Период
	Если ЭтоРегистрСведений И Мета.ОсновнойОтборПоПериоду Тогда
		Строка = Измерения.Добавить();
		Строка.Имя         = "Период";
		Строка.ТипЗначения = Новый ОписаниеТипов("Дата");
		Строка.Заголовок   = "Период";
	КонецЕсли;
	
	// Измерения
	Если ЭтоРегистрСведений Тогда
		Для Каждого МетаИзм Из Мета.Измерения Цикл
			Строка = Измерения.Добавить();
			Строка.Имя         = МетаИзм.Имя;
			Строка.ТипЗначения = МетаИзм.Тип;
			Строка.Заголовок   = МетаИзм.Представление();
		КонецЦикла;
	КонецЕсли;
	
	// Перерасчет
	Если Метаданные.РегистрыРасчета.Содержит(Мета.Родитель()) Тогда
		Строка = Измерения.Добавить();
		Строка.Имя         = "ОбъектПерерасчета";
		Строка.ТипЗначения = Документы.ТипВсеСсылки();
		Строка.Заголовок   = "Объект перерасчета";
	КонецЕсли;

	Возврат Измерения;
КонецФункции

&НаСервереБезКонтекста
Процедура ДобавитьКолонкиВТаблицуФормы(ТаблицаФормы, СохранятьИмена, Добавлять, ГруппаКолонок = Неопределено)

	Форма = ФормаЭлементаФормы(ТаблицаФормы);
	ЭлементыФормы = Форма.Элементы;
	ИмяРеквизитаТаблицы = ТаблицаФормы.ПутьКДанным;

	Сохраняемые = Новый Структура(СохранятьИмена);
	СохраняемыеПутиДанных = Новый Соответствие;
	Для Каждого Элемент Из Сохраняемые Цикл
		СохраняемыеПутиДанных.Вставить(ИмяРеквизитаТаблицы + "." + Элемент.Ключ, Истина);
	КонецЦикла;

	ЭтоДинамическийСписок = Ложь;
	Для Каждого Реквизит Из Форма.ПолучитьРеквизиты() Цикл
		Если Реквизит.Имя = ИмяРеквизитаТаблицы И Реквизит.ТипЗначения.СодержитТип(Тип("ДинамическийСписок")) Тогда
			ЭтоДинамическийСписок = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	// Динамический пересоздает реквизиты сам
	Если Не ЭтоДинамическийСписок Тогда
		УдаляемыеИмена = Новый Массив;
		
		// Удаляем все реквизиты, которые не перечислены в СохранятьИмена
		Для Каждого Реквизит Из Форма.ПолучитьРеквизиты(ИмяРеквизитаТаблицы) Цикл
			ТекИмя = Реквизит.Имя;
			Если Не Сохраняемые.Свойство(ТекИмя) Тогда
				УдаляемыеИмена.Добавить(Реквизит.Путь + "." + ТекИмя);
			КонецЕсли;
		КонецЦикла;

		Добавляемые = Новый Массив;
		Для Каждого Колонка Из Добавлять Цикл
			ТекИмя = Колонка.Имя;
			Если Не Сохраняемые.Свойство(ТекИмя) Тогда
				Добавляемые.Добавить( Новый РеквизитФормы(ТекИмя, Колонка.ТипЗначения, ИмяРеквизитаТаблицы,
					Колонка.Заголовок));
			КонецЕсли;
		КонецЦикла;

		Форма.ИзменитьРеквизиты(Добавляемые, УдаляемыеИмена);
	КонецЕсли;
	
	// Удаляем элементы
	Родитель = ?(ГруппаКолонок = Неопределено, ТаблицаФормы, ГруппаКолонок);

	Удалять = Новый Массив;
	Для Каждого Элемент Из Родитель.ПодчиненныеЭлементы Цикл
		Удалять.Добавить(Элемент);
	КонецЦикла;
	Для Каждого Элемент Из Удалять Цикл
		Если ТипЗнч(Элемент) <> Тип("ГруппаФормы") И СохраняемыеПутиДанных[Элемент.ПутьКДанным] = Неопределено Тогда
			ЭлементыФормы.Удалить(Элемент);
		КонецЕсли;
	КонецЦикла;
	
	// Создаем элементы
	Префикс = ТаблицаФормы.Имя;
	Для Каждого Колонка Из Добавлять Цикл
		ТекИмя = Колонка.Имя;
		ЭлФормы = ЭлементыФормы.Вставить(Префикс + ТекИмя, Тип("ПолеФормы"), Родитель);
		ЭлФормы.Вид = ВидПоляФормы.ПолеВвода;
		ЭлФормы.ПутьКДанным = ИмяРеквизитаТаблицы + "." + ТекИмя;
		ЭлФормы.Заголовок = Колонка.Заголовок;
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ФормаЭлементаФормы(ЭлементФормы)
	Результат = ЭлементФормы;
	//@skip-warning
	ТипыФормы = Новый ОписаниеТипов("УправляемаяФорма");
	Пока Не ТипыФормы.СодержитТип(ТипЗнч(Результат)) Цикл
		Результат = Результат.Родитель;
	КонецЦикла;
	Возврат Результат;
КонецФункции

&НаСервереБезКонтекста
Процедура ПроставитьПометкиВниз(ДанныеСтроки)
	Значение = ДанныеСтроки.Пометка;
	Для Каждого Потомок Из ДанныеСтроки.ПолучитьЭлементы() Цикл
		Потомок.Пометка = Значение;
		ПроставитьПометкиВниз(Потомок);
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПроставитьПометкиВверх(ДанныеСтроки)
	РодительСтроки = ДанныеСтроки.ПолучитьРодителя();
	Если РодительСтроки <> Неопределено Тогда
		ВсеИстина = Истина;
		НеВсеЛожь = Ложь;
		Для Каждого Потомок Из РодительСтроки.ПолучитьЭлементы() Цикл
			ВсеИстина = ВсеИстина И (Потомок.Пометка = 1);
			НеВсеЛожь = НеВсеЛожь Или Булево(Потомок.Пометка);
		КонецЦикла;
		Если ВсеИстина Тогда
			РодительСтроки.Пометка = 1;
		ИначеЕсли НеВсеЛожь Тогда
			РодительСтроки.Пометка = 2;
		Иначе
			РодительСтроки.Пометка = 0;
		КонецЕсли;
		ПроставитьПометкиВверх(РодительСтроки);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
