
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если (ТипЗнч(Параметры.СообщенияПользователю) <> Тип("Массив") И
		ТипЗнч(Параметры.СообщенияПользователю) <> Тип("ФиксированныйМассив")) Или
		Параметры.СообщенияПользователю.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Отсутствуют данные для отображения сообщений!'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		Возврат;
	КонецЕсли;
	
	Для индекс = 0 По Параметры.СообщенияПользователю.ВГраница() Цикл
		Сообщения.Добавить(Параметры.СообщенияПользователю[индекс].Текст);
	КонецЦикла;
	
	Если Не ПустаяСтрока(Параметры.Заголовок) Тогда
		Заголовок = СтрШаблон(НСтр("ru = 'Сообщения: %1'"), Параметры.Заголовок);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
