
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьПривилегированныйРежим(Истина);
	
	Если Параметры.Свойство("Пользователь") Тогда
		Пользователь = Параметры.Пользователь;
	Иначе
		Пользователь = Пользователи.АвторизованныйПользователь();
	КонецЕсли;
	
	Если Параметры.Свойство("ВыборПользователяДоступен") И 
		ТипЗнч(Параметры.ВыборПользователяДоступен) = Тип("Булево") Тогда
		Элементы.Пользователь.Видимость = Параметры.ВыборПользователяДоступен;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Пользователь) Тогда
		ЗаполнитьДанныеПользователяИБ();
	Иначе
		Элементы.Пользователь.АктивизироватьПоУмолчанию = Истина;
		Элементы.Пользователь.Видимость = Истина;
	КонецЕсли;

	Если Параметры.Свойство("Пароль") Тогда
		Пароль = Параметры.Пароль;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ВладелецФормы = Неопределено Тогда
		РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	ОповеститьОВыборе(СформироватьСтруктуруПользователя());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	ЗаполнитьДанныеПользователяИБ();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Отмена(Команда)
	Пользователь = Неопределено;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Необходимо выбрать пользователя'"));
		Возврат;
	КонецЕсли;
	
	ТекстОшибки = ПроверитьПарольПользователя();
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ПоказатьПредупреждение(, ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ОписаниеОповещенияОЗакрытии) = Тип("ОписаниеОповещения") Тогда
		
		Попытка
			//ВыполнитьОбработкуОповещения(ОписаниеОповещенияОЗакрытии, СформироватьСтруктуруПользователя());
		Исключение
			ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке()) + Символы.ПС
				+ НСтр("ru = 'Возможно пароль введен неверно, повторите ввод пароля.'");
		КонецПопытки;
		
	КонецЕсли;
	
	Закрыть();
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ПоказатьПредупреждение(, ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СформироватьСтруктуруПользователя()
	
	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураПользователя = Новый Структура("Имя");
	
	УстановитьПривилегированныйРежим(Истина);
	Пользователи.СкопироватьСвойстваПользователяИБ(СтруктураПользователя, 
		Пользователи.СвойстваПользователяИБ(ИдентификаторПользователяИБ));

	СтруктураПользователя.Вставить("Пароль", Пароль);
	СтруктураПользователя.Вставить("Пользователь", Пользователь);
	
	Возврат СтруктураПользователя;
	
КонецФункции

&НаСервере
Функция ПроверитьПарольПользователя()
	
	УстановитьПривилегированныйРежим(Истина);
	Если Не ПользователиСлужебный.СтарыйПарольСовпадаетССохраненным(Пароль, ИдентификаторПользователяИБ) Тогда
		Возврат НСтр("ru = 'Пароль введен не верно'");
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДанныеПользователяИБ()
	УстановитьПривилегированныйРежим(Истина);
	ИдентификаторПользователяИБ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователь, "ИдентификаторПользователяИБ");
КонецПроцедуры

#КонецОбласти
