
//@skip-check export-procedure-missing-comment
#Область ПрограммныйИнтерфейс

Функция ПолучитьДополнительныеНастройки(ТаблицаИнтеграции, ТолькоИспользуемые = Истина) Экспорт
	
	ДополнительныеНастройки = РегистрыСведений.SUI_ДополнительныеНастройкиТаблицИнтеграции.ПолучитьНастройки(ТаблицаИнтеграции, ТолькоИспользуемые);
	
	Если ДополнительныеНастройки.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат ДополнительныеНастройки[0].ДополнительныеНастройки;
	КонецЕсли;
	
КонецФункции

Процедура СохранитьДополнительныеНастройки(ТаблицаИнтеграции, ДополнительныеНастройки) Экспорт
	
	ДополнительныеНастройкиСоответствие = Новый Соответствие();
	ДополнительныеНастройкиСоответствие.Вставить(ТаблицаИнтеграции, ДополнительныеНастройки);
	
	РегистрыСведений.SUI_ДополнительныеНастройкиТаблицИнтеграции.СохранитьНастройки(ДополнительныеНастройкиСоответствие);
	
КонецПроцедуры

Функция ВерсияНастроек() Экспорт
	Возврат "1.0";
КонецФункции

Функция ПолучитьНастройкиДляВыгрузкиВФайл(АдресРезультата = Неопределено) Экспорт
	
	Настройки = Новый Структура();
	Настройки.Вставить("Вид", 		"НастройкиМетаданных");
	Настройки.Вставить("Версия", 	ВерсияНастроек());
	
	// Пользовательский запрос
	ПользовательскийЗапрос = Новый Структура();
	ПользовательскийЗапрос.Вставить("Использование", 		ПолучитьФункциональнуюОпцию("SUI_ИспользоватьПользовательскийЗапрос"));
	ПользовательскийЗапрос.Вставить("ДанныеКонструктора", 	ПолучитьПользовательскийЗапрос());
	Настройки.Вставить("ПользовательскийЗапрос", ПользовательскийЗапрос);
	
	// Запрос получения остатков и цен
	ЗапросПолученияОстатковИЦен = Новый Структура();
	ЗапросПолученияОстатковИЦен.Вставить("ДанныеКонструктора", ПолучитьЗапросПолученияОстатковИЦен());
	Настройки.Вставить("ЗапросПолученияОстатковИЦен", ЗапросПолученияОстатковИЦен);
	
	// Настройки таблиц интеграции
	ПараметрыПолученияНастроек = РегистрыСведений.SUI_НастройкиТаблицИнтеграции.ПараметрыПолученияНастроек();
	ПараметрыПолученияНастроек.Используется = Неопределено;
	ПараметрыПолученияНастроек.Настраиваемая = Неопределено;
	Настройки.Вставить("ТаблицыИнтеграции", 
		РегистрыСведений.SUI_НастройкиТаблицИнтеграции.ПолучитьНастройки(ПараметрыПолученияНастроек));
	
	// Настройки таблиц интеграции. Удалить колонку ИмяТаблицы
	КолонкаИмяТаблицы = Настройки.ТаблицыИнтеграции.Колонки.Найти("ИмяТаблицы");
	Если КолонкаИмяТаблицы <> Неопределено Тогда
		Настройки.ТаблицыИнтеграции.Колонки.Удалить(КолонкаИмяТаблицы);
	КонецЕсли;
	
	// Дополнительные настройки
	Настройки.Вставить("ДополнительныеНастройки", РегистрыСведений.SUI_ДополнительныеНастройкиТаблицИнтеграции.ПолучитьДополнительныеНастройки());
	
	Настройки = ОбщегоНазначения.ЗначениеВСтрокуXML(Настройки);
	
	Если ЭтоАдресВременногоХранилища(АдресРезультата) Тогда
		Возврат ПоместитьВоВременноеХранилище(Настройки, АдресРезультата);
	Иначе
		Возврат Настройки;
	КонецЕсли;
	
КонецФункции

Процедура ЗагрузитьНастройкиИзФайла(Настройки, АдресРезультата) Экспорт
	
	Если ТипЗнч(Настройки) = Тип("Строка") Тогда
		
		Если ЭтоАдресВременногоХранилища(Настройки) Тогда
			Настройки = ПолучитьИзВременногоХранилища(Настройки);
		Иначе
			Настройки = ОбщегоНазначения.ЗначениеИзСтрокиXML(Настройки);
		КонецЕсли;
	
	КонецЕсли;
	
	Если ТипЗнч(Настройки) = Тип("ДвоичныеДанные") Тогда
		Настройки = ОбщегоНазначения.ЗначениеИзСтрокиXML(ПолучитьСтрокуИзДвоичныхДанных(Настройки));
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.Проверить(
		(SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Настройки, "Вид") = "НастройкиМетаданных"),
		НСтр("ru = 'Загружаемые данные не являются настройками метаданных.'"));
	
	ВерсияЗагружаемыхНастроек = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Настройки, "Версия", "", Тип("Строка"));
	
	ШаблонОшибкиВерсии = НСтр("ru = 'Версия загружаемых настроек ""%1"" не соответствуют версии настроек текущей конфигурации ""%2"".'");
	ОбщегоНазначенияКлиентСервер.Проверить(
		(ВерсияЗагружаемыхНастроек = ВерсияНастроек()),
		СтрШаблон(ШаблонОшибкиВерсии, ВерсияЗагружаемыхНастроек, ВерсияНастроек()));
	
	НачатьТранзакцию();
	
	Попытка
		
		ТипыСтруктура = SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.МассивЗначений(Тип("Структура"), Тип("ФиксированнаяСтруктура"));
		ТипыСоответствие = SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.МассивЗначений(Тип("Соответствие"), Тип("ФиксированноеСоответствие"));
		
		// Пользовательский запрос
		СохранитьПользовательскийЗапрос(SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Настройки, 
			"ПользовательскийЗапрос.ДанныеКонструктора", Новый Структура(), Новый ОписаниеТипов(ТипыСтруктура)));
		
		// Пользовательский запрос. Использование
		УстановитьПривилегированныйРежим(Истина);
		Константы.SUI_ИспользоватьПользовательскийЗапрос.Установить(
			SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Настройки, "ПользовательскийЗапрос.Использование", Ложь, Тип("Булево")));
		УстановитьПривилегированныйРежим(Ложь);
		
		// Запрос получения остатков и цен
		СохранитьЗапросПолученияОстатковИЦен(SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Настройки, 
			"ЗапросПолученияОстатковИЦен.ДанныеКонструктора", Новый Структура(), Новый ОписаниеТипов(ТипыСтруктура)));
	
		// Настройки таблиц интеграции
		НастройкиТаблицИнтеграции = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Настройки, "ТаблицыИнтеграции", 
			Новый ТаблицаЗначений(), Тип("ТаблицаЗначений"));
		ТаблицыИнтеграции = РегистрыСведений.SUI_НастройкиТаблицИнтеграции.ЗагрузитьНастройки(НастройкиТаблицИнтеграции, Истина);
		
		// Дополнительные настройки
		ДополнительныеНастройки = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			Настройки, "ДополнительныеНастройки", Новый Соответствие(), Новый ОписаниеТипов(ТипыСоответствие));
		РегистрыСведений.SUI_ДополнительныеНастройкиТаблицИнтеграции.СохранитьДополнительныеНастройки(ДополнительныеНастройки, Истина);
	
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Если ЭтоАдресВременногоХранилища(АдресРезультата) Тогда
		ПоместитьВоВременноеХранилище(ТаблицыИнтеграции, АдресРезультата);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьПредопределеннуюНастройку(Параметры, АдресРезультата = Неопределено) Экспорт
	
	Если Не Параметры.Свойство("ПредопределеннаяНастройка") Или
		ТипЗнч(Параметры.ПредопределеннаяНастройка) <> Тип("ПеречислениеСсылка.SUI_ПредопределенныеНастройкиПодсистемы") Или
		Не ЗначениеЗаполнено(Параметры.ПредопределеннаяНастройка) Тогда
		ВызватьИсключение НСтр("ru = 'Не удалось определеить предопределенную настройку.'");
	КонецЕсли;
	
	Если Параметры.ПредопределеннаяНастройка = Перечисления.SUI_ПредопределенныеНастройкиПодсистемы.УправлениеТорговлей11 Тогда
		НастройкиИзМакета = ПолучитьСтрокуИзДвоичныхДанных(ПолучитьОбщийМакет("SUI_ПредопределенныеУправлениеТорговлей11"));  
	ИначеЕсли Параметры.ПредопределеннаяНастройка = Перечисления.SUI_ПредопределенныеНастройкиПодсистемы.УправлениеНашейФирмой Тогда
		НастройкиИзМакета = ПолучитьСтрокуИзДвоичныхДанных(ПолучитьОбщийМакет("SUI_ПредопределенныеУправлениеНашейФирмой"));
	ИначеЕсли Параметры.ПредопределеннаяНастройка = Перечисления.SUI_ПредопределенныеНастройкиПодсистемы.Розница30 Тогда
		НастройкиИзМакета = ПолучитьСтрокуИзДвоичныхДанных(ПолучитьОбщийМакет("SUI_ПредопределенныеРозница30"));
	ИначеЕсли Параметры.ПредопределеннаяНастройка = Перечисления.SUI_ПредопределенныеНастройкиПодсистемы.Розница23 Тогда
		НастройкиИзМакета = ПолучитьСтрокуИзДвоичныхДанных(ПолучитьОбщийМакет("SUI_ПредопределенныеРозница23"));	
	КонецЕсли;   
	
	ЗагрузитьНастройкиИзФайла(НастройкиИзМакета, АдресРезультата);	
	
КонецПроцедуры

Функция СформироватьПредопределенныеДополнительныеНастройки(ТаблицаИнтеграции, КонфигурацияНастройки, ДополнительныеНастройки) Экспорт
	
	ДополнительныеНастройки = Новый Структура();
	
	Если ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыУпаковок Тогда
		СформироватьПредопределенныеДополнительныеНастройки_ШтрихкодыУпаковокТоваров(КонфигурацияНастройки, ДополнительныеНастройки);
	ИначеЕсли ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.СерииНоменклатуры Тогда
		СформироватьПредопределенныеДополнительныеНастройки_СерииНоменклатуры(КонфигурацияНастройки, ДополнительныеНастройки);
	ИначеЕсли ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыНоменклатуры Тогда
		СформироватьПредопределенныеДополнительныеНастройки_ШтрихкодыНоменклатуры(КонфигурацияНастройки, ДополнительныеНастройки);
	КонецЕсли;
	
	Возврат ДополнительныеНастройки;
	
КонецФункции

Процедура УстановитьПризнакИспользованияТаблицы(ТаблицаИнтеграции, Используется, ОчиститьТаблицу = Истина) Экспорт
	
	СоответсвиеКонстант = SUI_НастройкиМетаданныхПовтИсп.СоответсвиеКонстантТаблицИнтеграции();
	Константа = СоответсвиеКонстант.Получить(ТаблицаИнтеграции);
	Если Константа <> Неопределено Тогда
		УстановитьПривилегированныйРежим(Истина);
		МенеджерЗначения = Константа.СоздатьМенеджерЗначения();
		МенеджерЗначения.Значение = Используется;
		Если Не ОчиститьТаблицу Тогда
			МенеджерЗначения.ДополнительныеСвойства.Вставить("SUI_НеОчищатьТаблицу");
		КонецЕсли;
		МенеджерЗначения.Записать();
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;

КонецПроцедуры

Функция ТаблицаИспользуется(ТаблицаИнтеграции) Экспорт

	ИмяФО = SUI_НастройкиМетаданныхПовтИсп.СоответсвиеФункциональныхОпцийТаблицИнтеграции().Получить(ТаблицаИнтеграции);
	
	Если ИмяФО = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	Возврат ПолучитьФункциональнуюОпцию(ИмяФО);
	
КонецФункции

Функция ПолучитьИмяТаблицыВКонфигурации(ТаблицаИнтеграции) Экспорт

	СоответствиеТаблицИнтеграции = SUI_НастройкиМетаданныхПовтИсп.СоответствиеТаблицИнтеграцииВКонфигурации();
	Возврат СоответствиеТаблицИнтеграции.Получить(ТаблицаИнтеграции);

КонецФункции

Функция ПолучитьТаблицуИнтеграцииПоИмениТаблицыКонфигурации(ИмяТаблицыКонфигурации) Экспорт
	
	НайденноеЗначение = Неопределено;
	
	СоответствиеТаблицИнтеграции = SUI_НастройкиМетаданныхПовтИсп.СоответствиеТаблицИнтеграцииВКонфигурации();
	
	Для Каждого СоответствиеТаблицыИнтеграции Из СоответствиеТаблицИнтеграции Цикл
		Если СоответствиеТаблицыИнтеграции.Значение = ИмяТаблицыКонфигурации Тогда
			НайденноеЗначение = СоответствиеТаблицыИнтеграции.Ключ;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат НайденноеЗначение;
	
КонецФункции

Функция ПолучитьТаблицуИнтеграцииПоКонстанте(Константа) Экспорт
	
	НайденноеЗначение = Неопределено;
	
	СоответствиеТаблицИнтеграции = SUI_НастройкиМетаданныхПовтИсп.СоответсвиеКонстантТаблицИнтеграции();
	
	Для Каждого СоответствиеТаблицыИнтеграции Из СоответствиеТаблицИнтеграции Цикл
		Если СоответствиеТаблицыИнтеграции.Значение = Константа Тогда
			НайденноеЗначение = СоответствиеТаблицыИнтеграции.Ключ;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат НайденноеЗначение;
	
КонецФункции

Функция ПолучитьИмяТаблицыМобильногоУстройства(ТаблицаИнтеграции) Экспорт

	Если ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.Контрагенты Тогда
		Возврат "RS_countragents";
	
	ИначеЕсли ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.Склады Тогда
		Возврат "RS_warehouses";
		
	ИначеЕсли ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.Ячейки Тогда
		Возврат "RS_cells";

	ИначеЕсли ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.Номенклатура Тогда
		Возврат "RS_goods";

	ИначеЕсли ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.ХарактеристикиНоменклатуры Тогда
		Возврат "RS_properties";

	ИначеЕсли ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.УпаковкиНоменклатуры Тогда
		Возврат "RS_units";

	ИначеЕсли ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.ЕдиницыИзмерения Тогда
		Возврат "RS_classifier_units";

	ИначеЕсли ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.ВидыНоменклатуры Тогда
		Возврат "RS_types_goods";

	ИначеЕсли ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыНоменклатуры Тогда
		Возврат "RS_barcodes";

	ИначеЕсли ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.Документы Тогда
		Возврат "RS_docs";

	ИначеЕсли ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.НастройкиДокументов Тогда
		Возврат "RS_doc_types";

	ИначеЕсли ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.ПользователиТСД Тогда
		Возврат "RS_employees";
	
	ИначеЕсли ТаблицаИнтеграции = SUI_ПакетыДанныхКлиентСервер.КлючТаблицы_ДокументыЗавершенные() Тогда
		Возврат "RS_docs_completed";
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ЭтоТаблицаИнтеграции(ПолноеИмяТаблицыКонфигурации) Экспорт
	
	ТаблицыИнтеграции = SUI_НастройкиМетаданныхПовтИсп.ТаблицыИнтеграцииВКонфигурации();
	Возврат (ТаблицыИнтеграции.Найти(ПолноеИмяТаблицыКонфигурации) <> Неопределено);
	
КонецФункции

Функция ИмяТаблицыИнтеграции(ТаблицаИнтеграции) Экспорт
	
	ИндексТаблицы = Перечисления.SUI_ТаблицыИнтеграции.Индекс(ТаблицаИнтеграции);
	Возврат Метаданные.Перечисления.SUI_ТаблицыИнтеграции.ЗначенияПеречисления[ИндексТаблицы].Имя;
	
КонецФункции

// Параметры записи настройки.
// 
// Возвращаемое значение:
//  Структура - Структура параметров записи настройки:
Функция ПараметрыЗаписиНастройки() Экспорт
	
	ПараметрыЗаписи = Новый Структура();
	
	ПараметрыЗаписи.Вставить("ТаблицаИнтеграции");
	ПараметрыЗаписи.Вставить("ПолноеИмяОбъекта");
	ПараметрыЗаписи.Вставить("ТаблицаОбъекта");
	ПараметрыЗаписи.Вставить("НастройкиКомпоновкиДанных", Новый НастройкиКомпоновкиДанных());
	ПараметрыЗаписи.Вставить("ДополнительныеНастройки", Новый Структура());
	ПараметрыЗаписи.Вставить("Используется");
	
	//@skip-check constructor-function-return-section
	Возврат ПараметрыЗаписи;
	
КонецФункции

// Записать настройку.
// 
// Параметры:
//  ПараметрыЗаписи - Структура - см. SUI_НастройкиМетаданныхСервер.ПараметрыЗаписиНастройки.
//@skip-check doc-comment-complex-type-with-link
Процедура ЗаписатьНастройку(ПараметрыЗаписи) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.Удалить_SUI_НастройкиТаблицИнтеграции.СоздатьМенеджерЗаписи();
	
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ПараметрыЗаписи, "ТаблицаИнтеграции, ПолноеИмяОбъекта, ТаблицаОбъекта");
	
	МенеджерЗаписи.НастройкиКомпоновкиДанных = Новый ХранилищеЗначения(ПараметрыЗаписи.НастройкиКомпоновкиДанных, Новый СжатиеДанных(9));
	МенеджерЗаписи.ДополнительныеНастройки = Новый ХранилищеЗначения(ПараметрыЗаписи.ДополнительныеНастройки, Новый СжатиеДанных(9));
	
	МенеджерЗаписи.Записать(Истина);
	
	Если ТипЗнч(ПараметрыЗаписи.Используется) = Тип("Булево") Тогда
		ОчиститьТаблицу = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗаписи, "ОчиститьТаблицу", Истина, Тип("Булево"));
		УстановитьПризнакИспользованияТаблицы(ПараметрыЗаписи.ТаблицаИнтеграции, ПараметрыЗаписи.Используется, ОчиститьТаблицу);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьРеквизитыВыбораИзНастройки(ТаблицаИнтеграции, ТаблицаИспользуется = Истина, ПоОсновномуОбъекту = Истина) Экспорт
	
	ПараметрыПолученияНастроек =  РегистрыСведений.SUI_НастройкиТаблицИнтеграции.ПараметрыПолученияНастроек(ТаблицаИнтеграции);
	ПараметрыПолученияНастроек.Используется = ТаблицаИспользуется;
	ПараметрыПолученияНастроек.ОсновнойОбъект = ПоОсновномуОбъекту;
	
	НастройкиТаблицы = РегистрыСведений.SUI_НастройкиТаблицИнтеграции.ПолучитьНастройки(ПараметрыПолученияНастроек);
	Если НастройкиТаблицы.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НастройкиТаблицы = НастройкиТаблицы[0];
	
	РеквизитыВыбора = Новый Структура();
	
	РеквизитыВыбора.Вставить("ПолноеИмяОбъекта", НастройкиТаблицы[0].ИмяОбъекта);
	РеквизитыВыбора.Вставить("ТаблицаОбъекта", НастройкиТаблицы[0].ИмяТаблицы);
	РеквизитыВыбора.Вставить("Элементы", Новый Структура());
	
	ВыбранныеРеквизиты = РегистрыСведений.SUI_НастройкиТаблицИнтеграции.ПолучитьВыбранныеРеквизитыИзНастройки(НастройкиТаблицы[0]);
	
	РазрешенныеСимволыЗаголовка = SUI_СтроковыеФункцииКлиентСервер.АлфавитБуквыЛатинские()
		+ SUI_СтроковыеФункцииКлиентСервер.АлфавитБуквыРусские()
		+ SUI_СтроковыеФункцииКлиентСервер.АлфавитЦифры() + "_";
	
	Для Каждого ВыбранныйРеквизит Из ВыбранныеРеквизиты Цикл
		
		ЗаголовокПоля = SUI_СтроковыеФункцииКлиентСервер.ПривестиСтрокуКРазрешеннымСимволам(
			ВыбранныйРеквизит.Ключ, РазрешенныеСимволыЗаголовка);
		
		Если ЗначениеЗаполнено(ЗаголовокПоля) Тогда
			РеквизитыВыбора.Элементы.Вставить(ЗаголовокПоля, ВыбранныйРеквизит.Значение.Имя);
		КонецЕсли;
		
	КонецЦикла;
	
	Если РеквизитыВыбора.Элементы.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат РеквизитыВыбора;

КонецФункции

Функция ПолучитьПользовательскийЗапрос() Экспорт
	
	сткДанныеКонструктора = SUI_КонструкторЗапросаКлиентСервер.ДанныеКонструктора();

	УстановитьПривилегированныйРежим(Истина);
	ДанныеКонструктора = Константы.SUI_ПользовательскийЗапрос.Получить().Получить();
	УстановитьПривилегированныйРежим(Ложь);
	
	сткДанныеКонструктора.ТекстЗапроса = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеКонструктора, 
		"ТекстЗапроса", "", Тип("Строка"));
	сткДанныеКонструктора.ВыполнятьВПакетномРежиме = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеКонструктора, 
		"ВыполнятьВПакетномРежиме", Ложь, Тип("Булево"));
	сткДанныеКонструктора.ПакетыРезультата = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеКонструктора, 
		"ПакетыРезультата", Новый Массив(), Тип("Массив"));
	
	Если Не ЗначениеЗаполнено(сткДанныеКонструктора.ТекстЗапроса) Тогда
		сткДанныеКонструктора.ВыполнятьВПакетномРежиме = Ложь;
	КонецЕсли;
	
	Если Не сткДанныеКонструктора.ВыполнятьВПакетномРежиме Тогда
		сткДанныеКонструктора.ПакетыРезультата = Новый Массив();
	КонецЕсли;
	
	сткДанныеКонструктора.ПакетыРезультата = ОбщегоНазначенияКлиентСервер.СвернутьМассив(сткДанныеКонструктора.ПакетыРезультата);
	
	Возврат Новый ФиксированнаяСтруктура(сткДанныеКонструктора);
	
КонецФункции

Процедура СохранитьПользовательскийЗапрос(ДанныеКонструктора) Экспорт
	
	сткДанныеКонструктора = SUI_КонструкторЗапросаКлиентСервер.ДанныеКонструктора();

	сткДанныеКонструктора.ТекстЗапроса = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеКонструктора, 
		"ТекстЗапроса", "", Тип("Строка"));
	сткДанныеКонструктора.ВыполнятьВПакетномРежиме = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеКонструктора, 
		"ВыполнятьВПакетномРежиме", Ложь, Тип("Булево"));
	сткДанныеКонструктора.ПакетыРезультата = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеКонструктора, 
		"ПакетыРезультата", Новый Массив(), Тип("Массив"));

	Если Не ЗначениеЗаполнено(сткДанныеКонструктора.ТекстЗапроса) Тогда
		сткДанныеКонструктора.ВыполнятьВПакетномРежиме = Ложь;
	КонецЕсли;
	
	Если Не сткДанныеКонструктора.ВыполнятьВПакетномРежиме Тогда
		сткДанныеКонструктора.ПакетыРезультата = Новый Массив();
	КонецЕсли;
	
	сткДанныеКонструктора.ПакетыРезультата = ОбщегоНазначенияКлиентСервер.СвернутьМассив(сткДанныеКонструктора.ПакетыРезультата);
	
	Константы.SUI_ПользовательскийЗапрос.Установить(
		Новый ХранилищеЗначения(Новый ФиксированнаяСтруктура(сткДанныеКонструктора), Новый СжатиеДанных(9)));
	
КонецПроцедуры

Функция ПолучитьЗапросПолученияОстатковИЦен() Экспорт
	
	сткДанныеКонструктора = SUI_КонструкторЗапросаКлиентСервер.ДанныеКонструктора();

	УстановитьПривилегированныйРежим(Истина);
	ДанныеКонструктора = Константы.SUI_ЗапросПолученияОстатковИЦен.Получить().Получить();
	УстановитьПривилегированныйРежим(Ложь);
	
	сткДанныеКонструктора.ТекстЗапроса = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеКонструктора, 
		"ТекстЗапроса", "", Тип("Строка"));
	сткДанныеКонструктора.ВыполнятьВПакетномРежиме = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеКонструктора, 
		"ВыполнятьВПакетномРежиме", Ложь, Тип("Булево"));
	сткДанныеКонструктора.ПакетыРезультата = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеКонструктора, 
		"ПакетыРезультата", Новый Массив(), Тип("Массив"));
	
	Если Не ЗначениеЗаполнено(сткДанныеКонструктора.ТекстЗапроса) Тогда
		сткДанныеКонструктора.ВыполнятьВПакетномРежиме = Ложь;
	КонецЕсли;
	
	Если Не сткДанныеКонструктора.ВыполнятьВПакетномРежиме Тогда
		сткДанныеКонструктора.ПакетыРезультата = Новый Массив();
	КонецЕсли;
	
	сткДанныеКонструктора.ПакетыРезультата = ОбщегоНазначенияКлиентСервер.СвернутьМассив(сткДанныеКонструктора.ПакетыРезультата);
	
	Возврат Новый ФиксированнаяСтруктура(сткДанныеКонструктора);
	
КонецФункции

Процедура СохранитьЗапросПолученияОстатковИЦен(ДанныеКонструктора) Экспорт
	
	сткДанныеКонструктора = SUI_КонструкторЗапросаКлиентСервер.ДанныеКонструктора();

	сткДанныеКонструктора.ТекстЗапроса = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеКонструктора, 
		"ТекстЗапроса", "", Тип("Строка"));
	сткДанныеКонструктора.ВыполнятьВПакетномРежиме = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеКонструктора, 
		"ВыполнятьВПакетномРежиме", Ложь, Тип("Булево"));
	сткДанныеКонструктора.ПакетыРезультата = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеКонструктора, 
		"ПакетыРезультата", Новый Массив(), Тип("Массив"));

	Если Не ЗначениеЗаполнено(сткДанныеКонструктора.ТекстЗапроса) Тогда
		сткДанныеКонструктора.ВыполнятьВПакетномРежиме = Ложь;
	КонецЕсли;
	
	Если Не сткДанныеКонструктора.ВыполнятьВПакетномРежиме Тогда
		сткДанныеКонструктора.ПакетыРезультата = Новый Массив();
	КонецЕсли;
	
	сткДанныеКонструктора.ПакетыРезультата = ОбщегоНазначенияКлиентСервер.СвернутьМассив(сткДанныеКонструктора.ПакетыРезультата);
	
	УстановитьПривилегированныйРежим(Истина);
	Константы.SUI_ЗапросПолученияОстатковИЦен.Установить(
		Новый ХранилищеЗначения(Новый ФиксированнаяСтруктура(сткДанныеКонструктора), Новый СжатиеДанных(9)));
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия 				= "24.9.10.1";
	Обработчик.Процедура 			= "SUI_НастройкиМетаданныхСервер.ОтключениеТаблиц_24_9_10_1";
	Обработчик.РежимВыполнения 		= "Оперативно";
	Обработчик.Комментарий 			= НСтр("ru = 'Отключение неиспользуемых таблиц интеграций'");
	
КонецПроцедуры

Процедура ОтключениеТаблиц_24_9_10_1() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	НастройкиТаблицИнтеграции.ТаблицаИнтеграции,
		|	НастройкиТаблицИнтеграции.ИмяОбъектаКонфигурации
		|ИЗ
		|	РегистрСведений.SUI_НастройкиТаблицИнтеграции КАК НастройкиТаблицИнтеграции
		|ГДЕ
		|	НастройкиТаблицИнтеграции.ТаблицаИнтеграции В (&ОтключаемыеТаблицы)
		|ДЛЯ ИЗМЕНЕНИЯ
		|	РегистрСведений.SUI_НастройкиТаблицИнтеграции";
	
	Запрос.УстановитьПараметр("ОтключаемыеТаблицы", SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.МассивЗначений(
		Перечисления.SUI_ТаблицыИнтеграции.СерииНоменклатуры,
		Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыУпаковок));
	
	НачатьТранзакцию();
	
	Попытка
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			НаборЗаписей = РегистрыСведений.SUI_НастройкиТаблицИнтеграции.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ТаблицаИнтеграции.Установить(Выборка.ТаблицаИнтеграции);
			НаборЗаписей.Отбор.ИмяОбъектаКонфигурации.Установить(Выборка.ИмяОбъектаКонфигурации);
			НаборЗаписей.Записать(Истина);
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПредопределенныеДополнительныеНастройки

Функция СформироватьПредопределенныеДополнительныеНастройки_СерииНоменклатуры(КонфигурацияНастройки, ДополнительныеНастройки)
	
	ДополнительныеНастройки.Вставить("АлгоритмСозданияСерииНоменклатуры", Новый Структура("Тип, Алгоритм", 
		Перечисления.SUI_ТипыАлгоритмов.Произвольный,
		SUI_СерииНоменклатурыКлиентСервер.ПредопределенныйАлгоритмСозданияСерииНоменклатуры(КонфигурацияНастройки)));
	
	Возврат ДополнительныеНастройки;
	
КонецФункции

Функция СформироватьПредопределенныеДополнительныеНастройки_ШтрихкодыУпаковокТоваров(КонфигурацияНастройки, ДополнительныеНастройки)
	
	ДополнительныеНастройки.Вставить("АлгоритмНормализацииЗначенияШтрихкода", Новый Структура("Тип, Алгоритм", 
		Перечисления.SUI_ТипыАлгоритмов.Произвольный,
		SUI_ШтрихкодыУпаковокКлиентСервер.ПредопределенныйАлгоритмНормализацииЗначенияШтрихкода(КонфигурацияНастройки)));
		
	ДополнительныеНастройки.Вставить("АлгоритмСозданияШтрихкодаУпаковки", Новый Структура("Тип, Алгоритм", 
		Перечисления.SUI_ТипыАлгоритмов.Произвольный, 
		SUI_ШтрихкодыУпаковокКлиентСервер.ПредопределенныйАлгоритмСозданияШтрихкодаУпаковки(КонфигурацияНастройки)));
	
	Возврат ДополнительныеНастройки;
	
КонецФункции

Функция СформироватьПредопределенныеДополнительныеНастройки_ШтрихкодыНоменклатуры(КонфигурацияНастройки, ДополнительныеНастройки)
	
	ДополнительныеНастройки.Вставить("АлгоритмСозданияШтрихкодаНоменклатуры", Новый Структура("Тип, Алгоритм", 
		Перечисления.SUI_ТипыАлгоритмов.Произвольный, 
		SUI_ШтрихкодыНоменклатурыКлиентСервер.ПредопределенныйАлгоритмСозданияШтрихкодаНоменклатуры(КонфигурацияНастройки)));
	
	Возврат ДополнительныеНастройки;
	
КонецФункции

#КонецОбласти

#КонецОбласти
