
//@skip-check export-procedure-missing-comment
#Область ПрограммныйИнтерфейс

Функция ПолучитьДополнительныеНастройки(ТаблицаИнтеграции, ТолькоИспользуемые = Истина) Экспорт
	
	Перем ДополнительныеНастройки;
	
	Если Не ТолькоИспользуемые Или (ТолькоИспользуемые И ТаблицаИспользуется(ТаблицаИнтеграции)) Тогда
		ДополнительныеНастройки = РегистрыСведений.SUI_ДополнительныеНастройкиТаблицИнтеграции.ПолучитьДополнительныеНастройки(
			ТаблицаИнтеграции);
	КонецЕсли;
	
	Возврат ДополнительныеНастройки.Получить(ТаблицаИнтеграции);
	
КонецФункции

Процедура СохранитьДополнительныеНастройки(ТаблицаИнтеграции, ДополнительныеНастройки) Экспорт
	
	ДополнительныеНастройкиСоответствие = Новый Соответствие();
	ДополнительныеНастройкиСоответствие.Вставить(ТаблицаИнтеграции, ДополнительныеНастройки);
	
	РегистрыСведений.SUI_ДополнительныеНастройкиТаблицИнтеграции.СохранитьДополнительныеНастройки(ДополнительныеНастройкиСоответствие);
	
КонецПроцедуры

Функция ВерсияНастроек() Экспорт
	Возврат "1.0";
КонецФункции

Функция ПолучитьНастройкиДляВыгрузкиВФайл(АдресРезультата = Неопределено) Экспорт
	
	Настройки = Новый Структура();
	Настройки.Вставить("Вид", 		"НастройкиМетаданных");
	Настройки.Вставить("Версия", 	ВерсияНастроек());
	
	// Пользовательский запрос
	ПользовательскийЗапрос = Новый Структура();
	ПользовательскийЗапрос.Вставить("Использование", 		ПолучитьФункциональнуюОпцию("SUI_ИспользоватьПользовательскийЗапрос"));
	ПользовательскийЗапрос.Вставить("ДанныеКонструктора", 	ПолучитьПользовательскийЗапрос());
	Настройки.Вставить("ПользовательскийЗапрос", ПользовательскийЗапрос);
	
	// Запрос получения остатков и цен
	ЗапросПолученияОстатковИЦен = Новый Структура();
	ЗапросПолученияОстатковИЦен.Вставить("ДанныеКонструктора", ПолучитьЗапросПолученияОстатковИЦен());
	Настройки.Вставить("ЗапросПолученияОстатковИЦен", ЗапросПолученияОстатковИЦен);
	
	// Настройки таблиц интеграции
	ПараметрыПолученияНастроек = РегистрыСведений.SUI_НастройкиТаблицИнтеграции.ПараметрыПолученияНастроек();
	ПараметрыПолученияНастроек.Используется = Неопределено;
	ПараметрыПолученияНастроек.Настраиваемая = Неопределено;
	Настройки.Вставить("ТаблицыИнтеграции", 
		РегистрыСведений.SUI_НастройкиТаблицИнтеграции.ПолучитьНастройки(ПараметрыПолученияНастроек));
	
	// Настройки таблиц интеграции. Удалить колонку ИмяТаблицы
	КолонкаИмяТаблицы = Настройки.ТаблицыИнтеграции.Колонки.Найти("ИмяТаблицы");
	Если КолонкаИмяТаблицы <> Неопределено Тогда
		Настройки.ТаблицыИнтеграции.Колонки.Удалить(КолонкаИмяТаблицы);
	КонецЕсли;
	
	// Дополнительные настройки
	Настройки.Вставить("ДополнительныеНастройки", РегистрыСведений.SUI_ДополнительныеНастройкиТаблицИнтеграции.ПолучитьДополнительныеНастройки());
	
	Настройки = ОбщегоНазначения.ЗначениеВСтрокуXML(Настройки);
	
	Если ЭтоАдресВременногоХранилища(АдресРезультата) Тогда
		Возврат ПоместитьВоВременноеХранилище(Настройки, АдресРезультата);
	Иначе
		Возврат Настройки;
	КонецЕсли;
	
КонецФункции

Процедура ЗагрузитьНастройкиИзФайла(Настройки, АдресРезультата) Экспорт
	
	Если ТипЗнч(Настройки) = Тип("Строка") Тогда
		
		Если ЭтоАдресВременногоХранилища(Настройки) Тогда
			Настройки = ПолучитьИзВременногоХранилища(Настройки);
		Иначе
			Настройки = ОбщегоНазначения.ЗначениеИзСтрокиXML(Настройки);
		КонецЕсли;
	
	КонецЕсли;
	
	Если ТипЗнч(Настройки) = Тип("ДвоичныеДанные") Тогда
		Настройки = ОбщегоНазначения.ЗначениеИзСтрокиXML(ПолучитьСтрокуИзДвоичныхДанных(Настройки));
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.Проверить(
		(SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Настройки, "Вид") = "НастройкиМетаданных"),
		НСтр("ru = 'Загружаемые данные не являются настройками метаданных.'"));
	
	ВерсияЗагружаемыхНастроек = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Настройки, "Версия", "", Тип("Строка"));

	Если ПустаяСтрока(ВерсияЗагружаемыхНастроек) Тогда
		КонвертироватьНастройкиМетаданных(Настройки);
		ВерсияЗагружаемыхНастроек = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Настройки, "Версия", "", Тип("Строка"));
	КонецЕсли;
	
	ШаблонОшибкиВерсии = НСтр("ru = 'Версия загружаемых настроек ""%1"" не соответствуют версии настроек текущей конфигурации ""%2"".'");
	ОбщегоНазначенияКлиентСервер.Проверить(
		(ВерсияЗагружаемыхНастроек = ВерсияНастроек()),
		СтрШаблон(ШаблонОшибкиВерсии, ВерсияЗагружаемыхНастроек, ВерсияНастроек()));
	
	НачатьТранзакцию();
	
	Попытка
		
		ТипыСтруктура = SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.МассивЗначений(Тип("Структура"), Тип("ФиксированнаяСтруктура"));
		ТипыСоответствие = SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.МассивЗначений(Тип("Соответствие"), Тип("ФиксированноеСоответствие"));
		
		// Пользовательский запрос
		СохранитьПользовательскийЗапрос(SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Настройки, 
			"ПользовательскийЗапрос.ДанныеКонструктора", Новый Структура(), Новый ОписаниеТипов(ТипыСтруктура)));
		
		// Пользовательский запрос. Использование
		УстановитьПривилегированныйРежим(Истина);
		Константы.SUI_ИспользоватьПользовательскийЗапрос.Установить(
			SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Настройки, "ПользовательскийЗапрос.Использование", Ложь, Тип("Булево")));
		УстановитьПривилегированныйРежим(Ложь);
		
		// Запрос получения остатков и цен
		СохранитьЗапросПолученияОстатковИЦен(SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Настройки, 
			"ЗапросПолученияОстатковИЦен.ДанныеКонструктора", Новый Структура(), Новый ОписаниеТипов(ТипыСтруктура)));
	
		// Настройки таблиц интеграции
		НастройкиТаблицИнтеграции = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Настройки, "ТаблицыИнтеграции", 
			Новый ТаблицаЗначений(), Тип("ТаблицаЗначений"));
		ТаблицыИнтеграции = РегистрыСведений.SUI_НастройкиТаблицИнтеграции.ЗагрузитьНастройки(НастройкиТаблицИнтеграции, Истина);
		
		// Дополнительные настройки
		ДополнительныеНастройки = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			Настройки, "ДополнительныеНастройки", Новый Соответствие(), Новый ОписаниеТипов(ТипыСоответствие));
		РегистрыСведений.SUI_ДополнительныеНастройкиТаблицИнтеграции.СохранитьДополнительныеНастройки(ДополнительныеНастройки, Истина);
	
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Если ЭтоАдресВременногоХранилища(АдресРезультата) Тогда
		ПоместитьВоВременноеХранилище(ТаблицыИнтеграции, АдресРезультата);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьПредопределеннуюНастройку(Параметры, АдресРезультата = Неопределено) Экспорт
	
	Если Не Параметры.Свойство("ПредопределеннаяНастройка") Или
		ТипЗнч(Параметры.ПредопределеннаяНастройка) <> Тип("ПеречислениеСсылка.SUI_ПредопределенныеНастройкиПодсистемы") Или
		Не ЗначениеЗаполнено(Параметры.ПредопределеннаяНастройка) Тогда
		ВызватьИсключение НСтр("ru = 'Не удалось определеить предопределенную настройку.'");
	КонецЕсли;
	
	Если Параметры.ПредопределеннаяНастройка = Перечисления.SUI_ПредопределенныеНастройкиПодсистемы.УправлениеТорговлей11 Тогда
		НастройкиИзМакета = ПолучитьСтрокуИзДвоичныхДанных(ПолучитьОбщийМакет("SUI_ПредопределенныеУправлениеТорговлей11"));  
	ИначеЕсли Параметры.ПредопределеннаяНастройка = Перечисления.SUI_ПредопределенныеНастройкиПодсистемы.УправлениеНашейФирмой Тогда
		НастройкиИзМакета = ПолучитьСтрокуИзДвоичныхДанных(ПолучитьОбщийМакет("SUI_ПредопределенныеУправлениеНашейФирмой"));
	ИначеЕсли Параметры.ПредопределеннаяНастройка = Перечисления.SUI_ПредопределенныеНастройкиПодсистемы.Розница30 Тогда
		НастройкиИзМакета = ПолучитьСтрокуИзДвоичныхДанных(ПолучитьОбщийМакет("SUI_ПредопределенныеРозница30"));
	ИначеЕсли Параметры.ПредопределеннаяНастройка = Перечисления.SUI_ПредопределенныеНастройкиПодсистемы.Розница23 Тогда
		НастройкиИзМакета = ПолучитьСтрокуИзДвоичныхДанных(ПолучитьОбщийМакет("SUI_ПредопределенныеРозница23"));
	ИначеЕсли Параметры.ПредопределеннаяНастройка = Перечисления.SUI_ПредопределенныеНастройкиПодсистемы.ЕРП Тогда
		НастройкиИзМакета = ПолучитьСтрокуИзДвоичныхДанных(ПолучитьОбщийМакет("SUI_ПредопределенныеЕРП"));
	ИначеЕсли Параметры.ПредопределеннаяНастройка = Перечисления.SUI_ПредопределенныеНастройкиПодсистемы.КомплекснаяАвтоматизация Тогда
		НастройкиИзМакета = ПолучитьСтрокуИзДвоичныхДанных(ПолучитьОбщийМакет("SUI_ПредопределенныеУправлениеТорговлей11"));
	ИначеЕсли Параметры.ПредопределеннаяНастройка = Перечисления.SUI_ПредопределенныеНастройкиПодсистемы.Бухгалтерия Тогда
		НастройкиИзМакета = ПолучитьСтрокуИзДвоичныхДанных(ПолучитьОбщийМакет("SUI_ПредопределенныеБухгалтерия"));
	КонецЕсли;   
	
	ЗагрузитьНастройкиИзФайла(НастройкиИзМакета, АдресРезультата);	
	
КонецПроцедуры

Функция СформироватьПредопределенныеДополнительныеНастройки(ТаблицаИнтеграции, КонфигурацияНастройки, ДополнительныеНастройки) Экспорт
	
	ДополнительныеНастройки = Новый Структура();
	
	Если ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыУпаковок Тогда
		СформироватьПредопределенныеДополнительныеНастройки_ШтрихкодыУпаковокТоваров(КонфигурацияНастройки, ДополнительныеНастройки);
	ИначеЕсли ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.СерииНоменклатуры Тогда
		СформироватьПредопределенныеДополнительныеНастройки_СерииНоменклатуры(КонфигурацияНастройки, ДополнительныеНастройки);
	ИначеЕсли ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыНоменклатуры Тогда
		СформироватьПредопределенныеДополнительныеНастройки_ШтрихкодыНоменклатуры(КонфигурацияНастройки, ДополнительныеНастройки);
	КонецЕсли;
	
	Возврат ДополнительныеНастройки;
	
КонецФункции

Процедура УстановитьПризнакИспользованияТаблицы(ТаблицаИнтеграции, Используется, ОчиститьТаблицу = Истина) Экспорт
	
	СоответсвиеКонстант = SUI_НастройкиМетаданныхПовтИсп.СоответсвиеКонстантТаблицИнтеграции();
	Константа = СоответсвиеКонстант.Получить(ТаблицаИнтеграции);
	Если Константа <> Неопределено Тогда
		УстановитьПривилегированныйРежим(Истина);
		МенеджерЗначения = Константа.СоздатьМенеджерЗначения();
		МенеджерЗначения.Значение = Используется;
		Если Не ОчиститьТаблицу Тогда
			МенеджерЗначения.ДополнительныеСвойства.Вставить("SUI_НеОчищатьТаблицу");
		КонецЕсли;
		МенеджерЗначения.Записать();
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;

КонецПроцедуры

Функция ТаблицаИспользуется(ТаблицаИнтеграции) Экспорт

	ИмяФО = SUI_НастройкиМетаданныхПовтИсп.СоответсвиеФункциональныхОпцийТаблицИнтеграции().Получить(ТаблицаИнтеграции);
	
	Если ИмяФО = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	Возврат ПолучитьФункциональнуюОпцию(ИмяФО);
	
КонецФункции

Функция ПолучитьИмяТаблицыВКонфигурации(ТаблицаИнтеграции) Экспорт

	СоответствиеТаблицИнтеграции = SUI_НастройкиМетаданныхПовтИсп.СоответствиеТаблицИнтеграцииВКонфигурации();
	Возврат СоответствиеТаблицИнтеграции.Получить(ТаблицаИнтеграции);

КонецФункции

Функция ПолучитьТаблицуИнтеграцииПоИмениТаблицыКонфигурации(ИмяТаблицыКонфигурации) Экспорт
	
	НайденноеЗначение = Неопределено;
	
	СоответствиеТаблицИнтеграции = SUI_НастройкиМетаданныхПовтИсп.СоответствиеТаблицИнтеграцииВКонфигурации();
	
	Для Каждого СоответствиеТаблицыИнтеграции Из СоответствиеТаблицИнтеграции Цикл
		Если СоответствиеТаблицыИнтеграции.Значение = ИмяТаблицыКонфигурации Тогда
			НайденноеЗначение = СоответствиеТаблицыИнтеграции.Ключ;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат НайденноеЗначение;
	
КонецФункции

Функция ПолучитьТаблицуИнтеграцииПоКонстанте(Константа) Экспорт
	
	НайденноеЗначение = Неопределено;
	
	СоответствиеТаблицИнтеграции = SUI_НастройкиМетаданныхПовтИсп.СоответсвиеКонстантТаблицИнтеграции();
	
	Для Каждого СоответствиеТаблицыИнтеграции Из СоответствиеТаблицИнтеграции Цикл
		Если СоответствиеТаблицыИнтеграции.Значение = Константа Тогда
			НайденноеЗначение = СоответствиеТаблицыИнтеграции.Ключ;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат НайденноеЗначение;
	
КонецФункции

Функция ПолучитьИмяТаблицыМобильногоУстройства(ТаблицаИнтеграции) Экспорт

	Если ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.Контрагенты Тогда
		Возврат "RS_countragents";
	
	ИначеЕсли ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.Склады Тогда
		Возврат "RS_warehouses";
		
	ИначеЕсли ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.Ячейки Тогда
		Возврат "RS_cells";

	ИначеЕсли ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.Номенклатура Тогда
		Возврат "RS_goods";

	ИначеЕсли ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.ХарактеристикиНоменклатуры Тогда
		Возврат "RS_properties";

	ИначеЕсли ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.СерииНоменклатуры Тогда
		Возврат "RS_series";

	ИначеЕсли ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.УпаковкиНоменклатуры Тогда
		Возврат "RS_units";

	ИначеЕсли ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.ЕдиницыИзмерения Тогда
		Возврат "RS_classifier_units";
	
	ИначеЕсли ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.ВидыЦен Тогда
		Возврат "RS_price_types";

	ИначеЕсли ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.ЦеныНоменклатуры Тогда
		Возврат "RS_prices";

	ИначеЕсли ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыНоменклатуры Тогда
		Возврат "RS_barcodes";

	ИначеЕсли ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыУпаковок Тогда
		Возврат "RS_marking_codes";

	ИначеЕсли ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.Документы Тогда
		Возврат "RS_docs";

	ИначеЕсли ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.ТоварыДокументов Тогда
		Возврат "RS_docs_table";

	ИначеЕсли ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыУпаковокДокументов Тогда
		Возврат "RS_docs_barcodes";

	ИначеЕсли ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.СерииДокументов Тогда
		Возврат "RS_docs_series";

	ИначеЕсли ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.ДокументыАдресногоХранения Тогда
		Возврат "RS_adr_docs";

	ИначеЕсли ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.ТоварыДокументовАдресногоХранения Тогда
		Возврат "RS_adr_docs_table";

	ИначеЕсли ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.НастройкиДокументов Тогда
		Возврат "RS_doc_types";

	ИначеЕсли ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.ПользователиТСД Тогда
		Возврат "RS_employees";
	
	ИначеЕсли ТаблицаИнтеграции = SUI_ПакетыДанныхКлиентСервер.КлючТаблицы_ДокументыЗавершенные() Тогда
		Возврат "RS_docs_completed";
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ЭтоТаблицаИнтеграции(ПолноеИмяТаблицыКонфигурации) Экспорт
	
	ТаблицыИнтеграции = SUI_НастройкиМетаданныхПовтИсп.ТаблицыИнтеграцииВКонфигурации();
	Возврат (ТаблицыИнтеграции.Найти(ПолноеИмяТаблицыКонфигурации) <> Неопределено);
	
КонецФункции

Функция ИмяТаблицыИнтеграции(ТаблицаИнтеграции) Экспорт
	
	ИндексТаблицы = Перечисления.SUI_ТаблицыИнтеграции.Индекс(ТаблицаИнтеграции);
	Возврат Метаданные.Перечисления.SUI_ТаблицыИнтеграции.ЗначенияПеречисления[ИндексТаблицы].Имя;
	
КонецФункции

// Параметры записи настройки.
// 
// Возвращаемое значение:
//  Структура - Структура параметров записи настройки:
Функция ПараметрыЗаписиНастройки() Экспорт
	
	ПараметрыЗаписи = Новый Структура();
	
	ПараметрыЗаписи.Вставить("ТаблицаИнтеграции");
	ПараметрыЗаписи.Вставить("ПолноеИмяОбъекта");
	ПараметрыЗаписи.Вставить("ТаблицаОбъекта");
	ПараметрыЗаписи.Вставить("НастройкиКомпоновкиДанных", Новый НастройкиКомпоновкиДанных());
	ПараметрыЗаписи.Вставить("ДополнительныеНастройки", Новый Структура());
	ПараметрыЗаписи.Вставить("Используется");
	
	//@skip-check constructor-function-return-section
	Возврат ПараметрыЗаписи;
	
КонецФункции

// Записать настройку.
// 
// Параметры:
//  ПараметрыЗаписи - Структура - см. SUI_НастройкиМетаданныхСервер.ПараметрыЗаписиНастройки.
//@skip-check doc-comment-complex-type-with-link
Процедура ЗаписатьНастройку(ПараметрыЗаписи) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.Удалить_SUI_НастройкиТаблицИнтеграции.СоздатьМенеджерЗаписи();
	
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ПараметрыЗаписи, "ТаблицаИнтеграции, ПолноеИмяОбъекта, ТаблицаОбъекта");
	
	МенеджерЗаписи.НастройкиКомпоновкиДанных = Новый ХранилищеЗначения(ПараметрыЗаписи.НастройкиКомпоновкиДанных, Новый СжатиеДанных(9));
	МенеджерЗаписи.ДополнительныеНастройки = Новый ХранилищеЗначения(ПараметрыЗаписи.ДополнительныеНастройки, Новый СжатиеДанных(9));
	
	МенеджерЗаписи.Записать(Истина);
	
	Если ТипЗнч(ПараметрыЗаписи.Используется) = Тип("Булево") Тогда
		ОчиститьТаблицу = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗаписи, "ОчиститьТаблицу", Истина, Тип("Булево"));
		УстановитьПризнакИспользованияТаблицы(ПараметрыЗаписи.ТаблицаИнтеграции, ПараметрыЗаписи.Используется, ОчиститьТаблицу);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьРеквизитыВыбораИзНастройки(ТаблицаИнтеграции, ТаблицаИспользуется = Истина, ПоОсновномуОбъекту = Истина) Экспорт
	
	ПараметрыПолученияНастроек =  РегистрыСведений.SUI_НастройкиТаблицИнтеграции.ПараметрыПолученияНастроек(ТаблицаИнтеграции);
	ПараметрыПолученияНастроек.Используется = ТаблицаИспользуется;
	ПараметрыПолученияНастроек.ОсновнойОбъект = ПоОсновномуОбъекту;
	
	НастройкиТаблицы = РегистрыСведений.SUI_НастройкиТаблицИнтеграции.ПолучитьНастройки(ПараметрыПолученияНастроек);
	Если НастройкиТаблицы.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НастройкиТаблицы = НастройкиТаблицы[0];
	
	РеквизитыВыбора = Новый Структура();
	
	РеквизитыВыбора.Вставить("ПолноеИмяОбъекта", НастройкиТаблицы[0].ИмяОбъекта);
	РеквизитыВыбора.Вставить("ТаблицаОбъекта", НастройкиТаблицы[0].ИмяТаблицы);
	РеквизитыВыбора.Вставить("Элементы", Новый Структура());
	
	ВыбранныеРеквизиты = РегистрыСведений.SUI_НастройкиТаблицИнтеграции.ПолучитьВыбранныеРеквизитыИзНастройки(НастройкиТаблицы[0]);
	
	РазрешенныеСимволыЗаголовка = SUI_СтроковыеФункцииКлиентСервер.АлфавитБуквыЛатинские()
		+ SUI_СтроковыеФункцииКлиентСервер.АлфавитБуквыРусские()
		+ SUI_СтроковыеФункцииКлиентСервер.АлфавитЦифры() + "_";
	
	Для Каждого ВыбранныйРеквизит Из ВыбранныеРеквизиты Цикл
		
		ЗаголовокПоля = SUI_СтроковыеФункцииКлиентСервер.ПривестиСтрокуКРазрешеннымСимволам(
			ВыбранныйРеквизит.Ключ, РазрешенныеСимволыЗаголовка);
		
		Если ЗначениеЗаполнено(ЗаголовокПоля) Тогда
			РеквизитыВыбора.Элементы.Вставить(ЗаголовокПоля, ВыбранныйРеквизит.Значение.Имя);
		КонецЕсли;
		
	КонецЦикла;
	
	Если РеквизитыВыбора.Элементы.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат РеквизитыВыбора;

КонецФункции

Функция ПолучитьПользовательскийЗапрос() Экспорт
	
	сткДанныеКонструктора = SUI_КонструкторЗапросаКлиентСервер.ДанныеКонструктора();

	УстановитьПривилегированныйРежим(Истина);
	ДанныеКонструктора = Константы.SUI_ПользовательскийЗапрос.Получить().Получить();
	УстановитьПривилегированныйРежим(Ложь);
	
	сткДанныеКонструктора.ТекстЗапроса = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеКонструктора, 
		"ТекстЗапроса", "", Тип("Строка"));
	сткДанныеКонструктора.ВыполнятьВПакетномРежиме = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеКонструктора, 
		"ВыполнятьВПакетномРежиме", Ложь, Тип("Булево"));
	сткДанныеКонструктора.ПакетыРезультата = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеКонструктора, 
		"ПакетыРезультата", Новый Массив(), Тип("Массив"));
	
	Если Не ЗначениеЗаполнено(сткДанныеКонструктора.ТекстЗапроса) Тогда
		сткДанныеКонструктора.ВыполнятьВПакетномРежиме = Ложь;
	КонецЕсли;
	
	Если Не сткДанныеКонструктора.ВыполнятьВПакетномРежиме Тогда
		сткДанныеКонструктора.ПакетыРезультата = Новый Массив();
	КонецЕсли;
	
	сткДанныеКонструктора.ПакетыРезультата = ОбщегоНазначенияКлиентСервер.СвернутьМассив(сткДанныеКонструктора.ПакетыРезультата);
	
	Возврат Новый ФиксированнаяСтруктура(сткДанныеКонструктора);
	
КонецФункции

Процедура СохранитьПользовательскийЗапрос(ДанныеКонструктора) Экспорт
	
	сткДанныеКонструктора = SUI_КонструкторЗапросаКлиентСервер.ДанныеКонструктора();

	сткДанныеКонструктора.ТекстЗапроса = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеКонструктора, 
		"ТекстЗапроса", "", Тип("Строка"));
	сткДанныеКонструктора.ВыполнятьВПакетномРежиме = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеКонструктора, 
		"ВыполнятьВПакетномРежиме", Ложь, Тип("Булево"));
	сткДанныеКонструктора.ПакетыРезультата = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеКонструктора, 
		"ПакетыРезультата", Новый Массив(), Тип("Массив"));

	Если Не ЗначениеЗаполнено(сткДанныеКонструктора.ТекстЗапроса) Тогда
		сткДанныеКонструктора.ВыполнятьВПакетномРежиме = Ложь;
	КонецЕсли;
	
	Если Не сткДанныеКонструктора.ВыполнятьВПакетномРежиме Тогда
		сткДанныеКонструктора.ПакетыРезультата = Новый Массив();
	КонецЕсли;
	
	сткДанныеКонструктора.ПакетыРезультата = ОбщегоНазначенияКлиентСервер.СвернутьМассив(сткДанныеКонструктора.ПакетыРезультата);
	
	Константы.SUI_ПользовательскийЗапрос.Установить(
		Новый ХранилищеЗначения(Новый ФиксированнаяСтруктура(сткДанныеКонструктора), Новый СжатиеДанных(9)));
	
КонецПроцедуры

Функция ПолучитьЗапросПолученияОстатковИЦен() Экспорт
	
	сткДанныеКонструктора = SUI_КонструкторЗапросаКлиентСервер.ДанныеКонструктора();

	УстановитьПривилегированныйРежим(Истина);
	ДанныеКонструктора = Константы.SUI_ЗапросПолученияОстатковИЦен.Получить().Получить();
	УстановитьПривилегированныйРежим(Ложь);
	
	сткДанныеКонструктора.ТекстЗапроса = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеКонструктора, 
		"ТекстЗапроса", "", Тип("Строка"));
	сткДанныеКонструктора.ВыполнятьВПакетномРежиме = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеКонструктора, 
		"ВыполнятьВПакетномРежиме", Ложь, Тип("Булево"));
	сткДанныеКонструктора.ПакетыРезультата = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеКонструктора, 
		"ПакетыРезультата", Новый Массив(), Тип("Массив"));
	
	Если Не ЗначениеЗаполнено(сткДанныеКонструктора.ТекстЗапроса) Тогда
		сткДанныеКонструктора.ВыполнятьВПакетномРежиме = Ложь;
	КонецЕсли;
	
	Если Не сткДанныеКонструктора.ВыполнятьВПакетномРежиме Тогда
		сткДанныеКонструктора.ПакетыРезультата = Новый Массив();
	КонецЕсли;
	
	сткДанныеКонструктора.ПакетыРезультата = ОбщегоНазначенияКлиентСервер.СвернутьМассив(сткДанныеКонструктора.ПакетыРезультата);
	
	Возврат Новый ФиксированнаяСтруктура(сткДанныеКонструктора);
	
КонецФункции

Процедура СохранитьЗапросПолученияОстатковИЦен(ДанныеКонструктора) Экспорт
	
	сткДанныеКонструктора = SUI_КонструкторЗапросаКлиентСервер.ДанныеКонструктора();

	сткДанныеКонструктора.ТекстЗапроса = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеКонструктора, 
		"ТекстЗапроса", "", Тип("Строка"));
	сткДанныеКонструктора.ВыполнятьВПакетномРежиме = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеКонструктора, 
		"ВыполнятьВПакетномРежиме", Ложь, Тип("Булево"));
	сткДанныеКонструктора.ПакетыРезультата = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеКонструктора, 
		"ПакетыРезультата", Новый Массив(), Тип("Массив"));

	Если Не ЗначениеЗаполнено(сткДанныеКонструктора.ТекстЗапроса) Тогда
		сткДанныеКонструктора.ВыполнятьВПакетномРежиме = Ложь;
	КонецЕсли;
	
	Если Не сткДанныеКонструктора.ВыполнятьВПакетномРежиме Тогда
		сткДанныеКонструктора.ПакетыРезультата = Новый Массив();
	КонецЕсли;
	
	сткДанныеКонструктора.ПакетыРезультата = ОбщегоНазначенияКлиентСервер.СвернутьМассив(сткДанныеКонструктора.ПакетыРезультата);
	
	УстановитьПривилегированныйРежим(Истина);
	Константы.SUI_ЗапросПолученияОстатковИЦен.Установить(
		Новый ХранилищеЗначения(Новый ФиксированнаяСтруктура(сткДанныеКонструктора), Новый СжатиеДанных(9)));
		
КонецПроцедуры

#Область УстаревшиеПроцедурыИФункции

// Устарела. см. РегистрСведений.SUI_НастройкиТаблицИнтеграции.ПолучитьНастройки 
// и см. РегистрСведений.SUI_ДополнительныеНастройкиТаблицИнтеграции.ПолучитьДополнительныеНастройки
//
//@skip-check doc-comment-export-function-return-section
Функция ПолучитьНастройки(ТаблицаИнтеграции = Неопределено, ПолноеИмяОбъекта = Неопределено, ТолькоИспользуемые = Истина) Экспорт
	
	Настройки = Новый Соответствие();
	
//	Запрос = Новый Запрос;
//	Запрос.Текст =
//		"ВЫБРАТЬ
//		|	SUI_НастройкиТаблицИнтеграции.ТаблицаИнтеграции,
//		|	SUI_НастройкиТаблицИнтеграции.ПолноеИмяОбъекта,
//		|	SUI_НастройкиТаблицИнтеграции.ТаблицаОбъекта,
//		|	SUI_НастройкиТаблицИнтеграции.НастройкиКомпоновкиДанных,
//		|	SUI_НастройкиТаблицИнтеграции.ДополнительныеНастройки
//		|ИЗ
//		|	РегистрСведений.Удалить_SUI_НастройкиТаблицИнтеграции КАК SUI_НастройкиТаблицИнтеграции
//		|ГДЕ
//		|	ВЫБОР
//		|		КОГДА &ПолноеИмяОбъекта <> НЕОПРЕДЕЛЕНО
//		|			ТОГДА SUI_НастройкиТаблицИнтеграции.ПолноеИмяОбъекта = &ПолноеИмяОбъекта
//		|		ИНАЧЕ ИСТИНА
//		|	КОНЕЦ";
//	
//	Запрос.УстановитьПараметр("ПолноеИмяОбъекта", ПолноеИмяОбъекта);
//	
//	Если ТипЗнч(ТаблицаИнтеграции) = Тип("ПеречислениеСсылка.SUI_ТаблицыИнтеграции") Тогда
//		Запрос.Текст = Запрос.Текст + "
//		|	И SUI_НастройкиТаблицИнтеграции.ТаблицаИнтеграции = &ТаблицаИнтеграции";
//		Запрос.УстановитьПараметр("ТаблицаИнтеграции", ТаблицаИнтеграции);
//	ИначеЕсли ТипЗнч(ТаблицаИнтеграции) = Тип("СписокЗначений") Или ТипЗнч(ТаблицаИнтеграции) = Тип("Массив") Тогда
//		Запрос.Текст = Запрос.Текст + "
//		|	И SUI_НастройкиТаблицИнтеграции.ТаблицаИнтеграции В (&ТаблицаИнтеграции)";	
//		Запрос.УстановитьПараметр("ТаблицаИнтеграции", ТаблицаИнтеграции);
//	КонецЕсли;
//
//	УстановитьПривилегированныйРежим(Истина);
//	РезультатЗапроса = Запрос.Выполнить();
//	УстановитьПривилегированныйРежим(Ложь);
//	
//	Если Не РезультатЗапроса.Пустой() Тогда
//	
//		ИменаКолонок = Новый Массив();
//		Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
//			ИменаКолонок.Добавить(Колонка.Имя);
//		КонецЦикла;
//		ИменаКолонок = СтрСоединить(ИменаКолонок, ", ");
//		
//		Выборка = РезультатЗапроса.Выбрать();
//		
//		Пока Выборка.Следующий() Цикл
//			
//			Если ТолькоИспользуемые И Не ТаблицаИспользуется(Выборка.ТаблицаИнтеграции) Тогда
//				Продолжить;
//			КонецЕсли;
//			
//			Если Метаданные.НайтиПоПолномуИмени(Выборка.ПолноеИмяОбъекта) = Неопределено Тогда
//				Продолжить;
//			КонецЕсли;
//			
//			ДанныеНастройки = Новый Структура(ИменаКолонок);
//			ЗаполнитьЗначенияСвойств(ДанныеНастройки, Выборка);
//			
//			ДанныеНастройки.НастройкиКомпоновкиДанных = ДанныеНастройки.НастройкиКомпоновкиДанных.Получить();
//			Если ТипЗнч(ДанныеНастройки.НастройкиКомпоновкиДанных) <> Тип("НастройкиКомпоновкиДанных") Тогда
//				ДанныеНастройки.НастройкиКомпоновкиДанных = Новый НастройкиКомпоновкиДанных();
//			КонецЕсли;
//			
//			ДанныеНастройки.ДополнительныеНастройки = ДанныеНастройки.ДополнительныеНастройки.Получить();
//			Если ТипЗнч(ДанныеНастройки.ДополнительныеНастройки) <> Тип("Структура") Тогда
//				ДанныеНастройки.ДополнительныеНастройки = Новый Структура();
//			КонецЕсли;
//			
//			ДанныеНастройки.Вставить("Используется", ?(ТолькоИспользуемые, Истина, ТаблицаИспользуется(Выборка.ТаблицаИнтеграции)));
//	
//			Настройки.Вставить(Выборка.ТаблицаИнтеграции, ДанныеНастройки);
//	
//		КонецЦикла;
//		
//	КонецЕсли;
	
	Если ТипЗнч(ТаблицаИнтеграции) = Тип("ПеречислениеСсылка.SUI_ТаблицыИнтеграции") И ЗначениеЗаполнено(ТаблицаИнтеграции) Тогда
		Возврат Настройки.Получить(ТаблицаИнтеграции);
	Иначе
		Возврат Настройки;
	КонецЕсли;

КонецФункции

// Устарела. см. РегистрСведений.SUI_НастройкиТаблицИнтеграции.ПолучитьВыбранныеРеквизитыИзНастройки
//
Функция ПолучитьСопоставлениеРеквизитовИзНастройки(ТаблицаИнтеграции, ТаблицаИспользуется = Истина, ПоОсновномуОбъекту = Истина) Экспорт
	
	Возврат РегистрыСведений.SUI_НастройкиТаблицИнтеграции.ПолучитьВыбранныеРеквизиты(
		ТаблицаИнтеграции, ТаблицаИспользуется, ПоОсновномуОбъекту);
	
КонецФункции

// Устарела.
//
Функция ПолучитьЗапросИзНастройки(Настройка, ПараметрыЗапроса = Неопределено, ИмяВременнойТаблицы = "", ВыборПервых = 0) Экспорт
	
	Если Настройка.НастройкиКомпоновкиДанных.Выбор.Элементы.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыЗапроса) <> Тип("Структура") Тогда
		ПараметрыЗапроса = Новый Структура();
	КонецЕсли;
	
	МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(Настройка.ПолноеИмяОбъекта);
	
	Если МетаданныеОбъекта = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Настройка.ТаблицаОбъекта) Тогда
		
		Если Метаданные.Документы.Содержит(МетаданныеОбъекта) Или Метаданные.Справочники.Содержит(МетаданныеОбъекта) Тогда
			
			Если МетаданныеОбъекта.ТабличныеЧасти.Найти(Настройка.ТаблицаОбъекта) = Неопределено Тогда
				Возврат Неопределено;
			КонецЕсли;
			
		ИначеЕсли Метаданные.РегистрыСведений.Содержит(МетаданныеОбъекта) Тогда 
			
			Если ВРег(Настройка.ТаблицаОбъекта) <> "СРЕЗПЕРВЫХ" И ВРег(Настройка.ТаблицаОбъекта) <> "СРЕЗПОСЛЕДНИХ" Тогда
				Возврат Неопределено;
			КонецЕсли;
			
			Если МетаданныеОбъекта.ПериодичностьРегистраСведений = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический Тогда
				Возврат Неопределено;
			КонецЕсли;
			
		Иначе
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	SUI_КомпоновкаДанныхКлиентСервер.ДобавитьГруппировку(Настройка.НастройкиКомпоновкиДанных);
	
	Схема = SUI_КомпоновкаДанныхСервер.ПустаяСхема();
		
	НаборДанных = SUI_КомпоновкаДанныхСервер.ДобавитьПустойНаборДанных(Схема, , МетаданныеОбъекта.Имя + Настройка.ТаблицаОбъекта);
	НаборДанных.Запрос = "ВЫБРАТЬ * ИЗ " + МетаданныеОбъекта.ПолноеИмя() + ?(ЗначениеЗаполнено(Настройка.ТаблицаОбъекта), "." + Настройка.ТаблицаОбъекта, "");

	Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных();
	SUI_КомпоновкаДанныхСервер.ИнициализироватьКомпоновщикНастроек(Компоновщик, Схема, Настройка.НастройкиКомпоновкиДанных);
	
	Если Компоновщик.Настройки.Выбор.Элементы.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;

	ПараметрыПользовательскихПолейВыбор = Новый Структура();
	ВыраженияПользовательскихПолейВыбор = Новый Соответствие();
	
	РазрешенныеСимволы = SUI_СтроковыеФункцииКлиентСервер.АлфавитБуквыЛатинские()
		+ SUI_СтроковыеФункцииКлиентСервер.АлфавитБуквыРусские()
		+ SUI_СтроковыеФункцииКлиентСервер.АлфавитЦифры() + "_";
		
	Для Каждого ПользовательскоеПоле Из Настройка.НастройкиКомпоновкиДанных.ПользовательскиеПоля.Элементы Цикл
		
		Если ТипЗнч(ПользовательскоеПоле) <> Тип("ПользовательскоеПолеВыборКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли;
		
		Выражение = ПолучитьВыражениеПользовательскогоПоляВыбор(Схема, НаборДанных.Имя, ПользовательскоеПоле, 
			Строка(Компоновщик.Настройки.Выбор.ДоступныеПоляВыбора.Элементы[0].Поле), ПараметрыПользовательскихПолейВыбор);
		
		Если Выражение = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ПутьКДанным = SUI_СтроковыеФункцииКлиентСервер.ПривестиСтрокуКРазрешеннымСимволам(ПользовательскоеПоле.ПутьКДанным, РазрешенныеСимволы);
		
		Если Не ПустаяСтрока(ПутьКДанным) Тогда
			ВыраженияПользовательскихПолейВыбор.Вставить(ПутьКДанным, Выражение);
		КонецЕсли;
		
	КонецЦикла;

	Если ПараметрыЗапроса.Количество() > 0 Тогда
		
		мсвУсловия = Новый Массив();
		
		Для Каждого КлючЗначение Из ПараметрыЗапроса Цикл
			
			ТипЗначенияПараметра = ТипЗнч(КлючЗначение.Значение);
			
			Если ТипЗначенияПараметра = Тип("Массив") Или ТипЗначенияПараметра = Тип("СписокЗначений") Тогда
				мсвУсловия.добавить(КлючЗначение.Ключ + " В (&ПараметрЗапроса" + КлючЗначение.Ключ + ")");
			Иначе
				мсвУсловия.добавить(КлючЗначение.Ключ + " = &ПараметрЗапроса" + КлючЗначение.Ключ);
			КонецЕсли;
			
			SUI_КомпоновкаДанныхСервер.ДобавитьПараметр(Схема, "ПараметрЗапроса" + КлючЗначение.Ключ, , КлючЗначение.Значение);
			
		КонецЦикла;
		
		Если мсвУсловия.Количество() > 0 тогда
			
			НаборДанных.Запрос = НаборДанных.Запрос + "
			|ГДЕ
			| " + СтрСоединить(мсвУсловия, Символы.ПС + символы.Таб + "И ");
			
		Конецесли;	
		
	КонецЕсли;
		
	МакетКомпоновки = SUI_КомпоновкаДанныхСервер.ПолучитьМакетКомпоновки(Схема, Настройка.НастройкиКомпоновкиДанных);
	
	СоответствияЗаголовков = Новый Соответствие();
	Выражения = Новый Соответствие();
	
	Для Каждого Макет Из МакетКомпоновки.Макеты Цикл
		
		Если ТипЗнч(Макет.Макет) = Тип("МакетЗаголовкаКоллекцииЗначенийОбластиКомпоновкиДанных") Тогда
			
			Для Каждого Ячейка Из Макет.Макет.Ячейки Цикл
				ЗаголовокЯчейки = СтрСоединить(СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Ячейка.Заголовок, " "));
				СоответствияЗаголовков.Вставить(Ячейка.Имя, ЗаголовокЯчейки);
			КонецЦикла;
			
		ИначеЕсли ТипЗнч(Макет.Макет) = Тип("МакетКоллекцииЗначенийОбластиКомпоновкиДанных") Тогда
			
			Для Каждого Ячейка Из Макет.Макет.Ячейки Цикл

				Параметр = Макет.Параметры.Найти(Ячейка.Значение);
				
				Если Параметр <> Неопределено Тогда
					Выражения.Вставить(Ячейка.Колонка, Параметр.Выражение);
				КонецЕсли;
	
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	МассивВыраженийВыбора = Новый Массив();
	
	Для Каждого СоответствиеЗаголовка Из СоответствияЗаголовков Цикл
		
		КлючЗначениеВыражения = ВыраженияПользовательскихПолейВыбор.Получить(СоответствиеЗаголовка.Ключ);
		
		Если КлючЗначениеВыражения = Неопределено Тогда
			КлючЗначениеВыражения = Выражения.Получить(СоответствиеЗаголовка.Ключ);
		КонецЕсли;

		Если КлючЗначениеВыражения <> Неопределено Тогда
			МассивВыраженийВыбора.Добавить(Символы.Таб + КлючЗначениеВыражения + " КАК " + СоответствиеЗаголовка.Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = SUI_КомпоновкаДанныхСервер.ПолучитьЗапросИзМакетаКомпоновки(МакетКомпоновки, НаборДанных.Имя);
	
	Для Каждого ПараметрПользовательскогоПоляВыбор Из ПараметрыПользовательскихПолейВыбор Цикл
		Запрос.Параметры.Вставить(ПараметрПользовательскогоПоляВыбор.Ключ, ПараметрПользовательскогоПоляВыбор.Значение);
	КонецЦикла;
	
	_ВыборПервых = ОбщегоНазначения.ОписаниеТипаЧисло(4, 0, ДопустимыйЗнак.Неотрицательный).ПривестиЗначение(ВыборПервых);
	_ВыборПервых = ?(_ВыборПервых = 0, "", "ПЕРВЫЕ " + Формат(_ВыборПервых, "ЧЦ=4; ЧДЦ=0; ЧГ=0;"));
	
	Если СтрНайти(Запрос.Текст, "ГДЕ") > 0 Тогда
		Запрос.Текст = "ВЫБРАТЬ " + _ВыборПервых + "
		|" + СтрСоединить(МассивВыраженийВыбора, "," + Символы.ПС) + "
		|" + ?(ЗначениеЗаполнено(ИмяВременнойТаблицы), "ПОМЕСТИТЬ " + ИмяВременнойТаблицы, "") + "
		|ИЗ
		|	" + Настройка.ПолноеИмяОбъекта + ?(ЗначениеЗаполнено(Настройка.ТаблицаОбъекта), "." + Настройка.ТаблицаОбъекта, "") + " КАК " + НаборДанных.Имя + "
		|" + Сред(Запрос.Текст, СтрНайти(Запрос.Текст, "ГДЕ"));
	Иначе
		Запрос.Текст = "ВЫБРАТЬ " + _ВыборПервых + "
		|" + СтрСоединить(МассивВыраженийВыбора, "," + Символы.ПС) + "
		|" + ?(ЗначениеЗаполнено(ИмяВременнойТаблицы), "ПОМЕСТИТЬ " + ИмяВременнойТаблицы, "") + "
		|ИЗ
		|	" + Настройка.ПолноеИмяОбъекта + ?(ЗначениеЗаполнено(Настройка.ТаблицаОбъекта), "." + Настройка.ТаблицаОбъекта, "") + " КАК " + НаборДанных.Имя;
	КонецЕсли;
	
	Возврат Запрос;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия 				= "1.0.0.9";
	Обработчик.Процедура 			= "SUI_НастройкиМетаданныхСервер.КонвертироватьНастройкиМетаданныхПриОбновлении_1_0_0_9";
	Обработчик.РежимВыполнения 		= "Оперативно";
	Обработчик.Комментарий 			= НСтр("ru = 'Конвертация настроек метаданных'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия 				= "1.0.4.4";
	Обработчик.Процедура 			= 
		"SUI_НастройкиМетаданныхСервер.ОтключитьВидНоменклатурыВНастройкеНоменклатурыПриОбновлении_1_0_4_4";
	Обработчик.РежимВыполнения 		= "Оперативно";
	Обработчик.Комментарий 			= НСтр("ru = 'Отключение реквизита Вид номенклатуры в настройке Номенклатура'");
	
КонецПроцедуры

Процедура КонвертироватьНастройкиМетаданныхПриОбновлении_1_0_0_9() Экспорт
	
	Если Метаданные.РегистрыСведений.Найти("Удалить_SUI_НастройкиТаблицИнтеграции") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Удалить_SUI_НастройкиТаблицИнтеграции.ТаблицаИнтеграции,
		|	Удалить_SUI_НастройкиТаблицИнтеграции.ПолноеИмяОбъекта,
		|	Удалить_SUI_НастройкиТаблицИнтеграции.ТаблицаОбъекта,
		|	Удалить_SUI_НастройкиТаблицИнтеграции.НастройкиКомпоновкиДанных,
		|	Удалить_SUI_НастройкиТаблицИнтеграции.ДополнительныеНастройки,
		|	ЛОЖЬ КАК Используется
		|ИЗ
		|	РегистрСведений.Удалить_SUI_НастройкиТаблицИнтеграции КАК Удалить_SUI_НастройкиТаблицИнтеграции";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		Настройки = ОбщегоНазначения.ЗначениеИзСтрокиXML(ПолучитьНастройкиДляВыгрузкиВФайл());
		
		Настройки.Вставить("Данные", Новый Соответствие());
		
		Если Настройки.Свойство("ТаблицыИнтеграции") Тогда
			Настройки.Удалить("ТаблицыИнтеграции");
		КонецЕсли;
		
		Если Настройки.Свойство("ДополнительныеНастройки") Тогда
			Настройки.Удалить("ДополнительныеНастройки");
		КонецЕсли;
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ДанныеНастройки = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Выборка);
			ДанныеНастройки.Используется = ТаблицаИспользуется(ДанныеНастройки.ТаблицаИнтеграции);
			ДанныеНастройки.НастройкиКомпоновкиДанных = ДанныеНастройки.НастройкиКомпоновкиДанных.Получить();
			ДанныеНастройки.ДополнительныеНастройки = ДанныеНастройки.ДополнительныеНастройки.Получить();
			Настройки.Данные.Вставить(Выборка.ТаблицаИнтеграции, ДанныеНастройки);
		КонецЦикла;
		
		КонвертироватьНастройкиМетаданных(Настройки);
		
		ЗагрузитьНастройкиИзФайла(ОбщегоНазначения.ЗначениеВСтрокуXML(Настройки), Неопределено);
		
		НаборЗаписей = РегистрыСведений.Удалить_SUI_НастройкиТаблицИнтеграции.СоздатьНаборЗаписей();
		НаборЗаписей.Записать(Истина);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура ОтключитьВидНоменклатурыВНастройкеНоменклатурыПриОбновлении_1_0_4_4() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	SUI_НастройкиТаблицИнтеграции.ТаблицаИнтеграции,
		|	SUI_НастройкиТаблицИнтеграции.ИмяОбъектаКонфигурации,
		|	SUI_НастройкиТаблицИнтеграции.НастройкиКомпоновкиДанных,
		|	SUI_НастройкиТаблицИнтеграции.ОсновнойОбъект,
		|	SUI_НастройкиТаблицИнтеграции.СхемаКомпоновкиДанных
		|ИЗ
		|	РегистрСведений.SUI_НастройкиТаблицИнтеграции КАК SUI_НастройкиТаблицИнтеграции
		|ГДЕ
		|	SUI_НастройкиТаблицИнтеграции.ТаблицаИнтеграции = ЗНАЧЕНИЕ(Перечисление.SUI_ТаблицыИнтеграции.Номенклатура)
		|ДЛЯ ИЗМЕНЕНИЯ
		|	РегистрСведений.SUI_НастройкиТаблицИнтеграции";
	
	НачатьТранзакцию();
	
	Попытка
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			
			НастройкиБылиМодифицированны = Ложь;
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				Схема = Выборка.СхемаКомпоновкиДанных.Получить();
				
				Если ТипЗнч(Схема) <> Тип("СхемаКомпоновкиДанных") Тогда
					Продолжить;
				КонецЕсли;
				
				НастройкаКД = Выборка.НастройкиКомпоновкиДанных.Получить();
				
				Если ТипЗнч(НастройкаКД) <> Тип("НастройкиКомпоновкиДанных") Тогда
					Продолжить;
				КонецЕсли;
				
				Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных();
				SUI_КомпоновкаДанныхСервер.ИнициализироватьКомпоновщикНастроек(Компоновщик, Схема, НастройкаКД);
				
				ПолеВыбораУдалено = Ложь;
				
				Для Каждого ЭлементВыбора Из Компоновщик.Настройки.Выбор.Элементы Цикл
					
					Если ЭлементВыбора.Заголовок = "type_good" Тогда
						
						ДоступноеПолеВыбора = Компоновщик.Настройки.Выбор.ДоступныеПоляВыбора.НайтиПоле(ЭлементВыбора.Поле);
						
						Если ДоступноеПолеВыбора <> Неопределено И
							SUI_ОбщегоНазначенияПереопределяемый.ЭтоСсылка(ДоступноеПолеВыбора.ТипЗначения) Тогда
							Компоновщик.Настройки.Выбор.Элементы.Удалить(ЭлементВыбора);
							ПолеВыбораУдалено = Истина;
						КонецЕсли;
						
						Прервать;
						
					КонецЕсли;
					
				КонецЦикла;
				
				Если ПолеВыбораУдалено Тогда
					
					МенеджерЗаписи = РегистрыСведений.SUI_НастройкиТаблицИнтеграции.СоздатьМенеджерЗаписи();
					ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка, , "НастройкиКомпоновкиДанных");
					МенеджерЗаписи.НастройкиКомпоновкиДанных = 
						Новый ХранилищеЗначения(Компоновщик.ПолучитьНастройки(), Новый СжатиеДанных(9));
					МенеджерЗаписи.Записать(Истина);
					
					НастройкиБылиМодифицированны = Истина;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если НастройкиБылиМодифицированны Тогда
				УстановитьПризнакИспользованияТаблицы(Перечисления.SUI_ТаблицыИнтеграции.Номенклатура, Ложь, Ложь);
				ОбщегоНазначения.СообщитьПользователю(
					НСтр("ru = 'Необходимо перенастроить таблицу ""Номенклатура"" в Центре настроек.'"));
			КонецЕсли;
			
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	SUI_tbl_goods.id,
			|	SUI_tbl_goods.art,
			|	SUI_tbl_goods.code,
			|	SUI_tbl_goods.description,
			|	SUI_tbl_goods.name,
			|	SUI_tbl_goods.type_good,
			|	SUI_tbl_goods.unit,
			|	SUI_tbl_goods.use_mark
			|ИЗ
			|	РегистрСведений.SUI_tbl_goods КАК SUI_tbl_goods
			|ГДЕ
			|	SUI_tbl_goods.type_good ПОДОБНО &ШаблонИдентификатораSimple
			|ДЛЯ ИЗМЕНЕНИЯ
			|	РегистрСведений.SUI_tbl_goods";
		
		Запрос.УстановитьПараметр("ШаблонИдентификатораSimple", 
			SUI_ИнтеграцияВКонфигурациюКлиентСервер.ШаблонИдентификатораSimple());
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				НаборЗаписей = РегистрыСведений.SUI_tbl_goods.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.id.Установить(Выборка.id);
				
				ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
				
				НаборЗаписей[0].type_good = SUI_ИнтеграцияВКонфигурацию.СсылкаПоИдентификаторуSimple(
					НаборЗаписей[0].type_good, Истина);
				
				НаборЗаписей.ОбменДанными.Загрузка = Истина;
				НаборЗаписей.Записать(Истина);
				
			КонецЦикла;
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьВыражениеПользовательскогоПоляВыбор(Схема, ИмяНабораДанных, Поле, ДоступноеПоле, ПараметрыЗапроса)

	НастройкиКомпоновки = Новый НастройкиКомпоновкиДанных();

	SUI_КомпоновкаДанныхКлиентСервер.ДобавитьВыбранноеПоле(НастройкиКомпоновки, ДоступноеПоле);

	SUI_КомпоновкаДанныхКлиентСервер.ДобавитьГруппировку(НастройкиКомпоновки);
	
	Выражения = Новый Массив();
	ВыражениеИначе = "";
	
	Для Каждого ВариантПоля Из Поле.Варианты.Элементы Цикл
		
		Если Не ВариантПоля.Использование Тогда
			Продолжить;
		КонецЕсли;
		
		Если ВариантПоля.Отбор.Элементы.Количество() = 0 Тогда
			
			Если ТипЗнч(ВариантПоля.Значение) = Тип("ПолеКомпоновкиДанных") Тогда
				ВыражениеИначе = ВариантПоля.Значение;
			Иначе
				ВыражениеИначе = "&ПользовательскийПараметр" + Строка(ПараметрыЗапроса.Количество());
				ПараметрыЗапроса.Вставить("ПользовательскийПараметр" + Строка(ПараметрыЗапроса.Количество()), ВариантПоля.Значение);
			КонецЕсли;
			
			Продолжить;
			
		КонецЕсли;

		SUI_КомпоновкаДанныхКлиентСервер.УдалитьОтбор(НастройкиКомпоновки.Отбор);
		
		Для Каждого ЭлементОтбора Из ВариантПоля.Отбор.Элементы Цикл
			
			Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
				
				ГруппаЭлементовОтбора = SUI_КомпоновкаДанныхКлиентСервер.ДобавитьГруппуОтбора(
					НастройкиКомпоновки.Отбор.Элементы, ЭлементОтбора.ТипГруппы);
					 
				Для Каждого ЭлементОтбораВгруппе Из ЭлементОтбора.Элементы Цикл
					
					ЭлементОтбораНовый = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					ЭлементОтбораНовый.ЛевоеЗначение = ЭлементОтбораВгруппе.ЛевоеЗначение;
					ЭлементОтбораНовый.ПравоеЗначение = ЭлементОтбораВгруппе.ПравоеЗначение;
					ЭлементОтбораНовый.ВидСравнения = ЭлементОтбораВгруппе.ВидСравнения;
					
				КонецЦикла;
				
			Иначе
				SUI_КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(НастройкиКомпоновки, ЭлементОтбора.ЛевоеЗначение, 
					ЭлементОтбора.ПравоеЗначение, ЭлементОтбора.ВидСравнения, ЭлементОтбора.Использование);
			КонецЕсли;
			
		КонецЦикла;
		
		МакетКомпоновки = SUI_КомпоновкаДанныхСервер.ПолучитьМакетКомпоновки(Схема, НастройкиКомпоновки);
		
		ТекстЗапроса = МакетКомпоновки.НаборыДанных[ИмяНабораДанных].Запрос;
		
		Если СтрНайти(ТекстЗапроса, "ГДЕ") = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Выражение = Сред(ТекстЗапроса, СтрНайти(ТекстЗапроса, "ГДЕ") + 3, СтрДлина(ТекстЗапроса) - СтрНайти(ТекстЗапроса, "ГДЕ"));
		
		Если Не ЗначениеЗаполнено(Выражение) Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого ЗначениеПараметра Из МакетКомпоновки.ЗначенияПараметров Цикл
			Выражение = СтрЗаменить(Выражение, "&" + ЗначениеПараметра.Имя, "&ПользовательскийПараметр" + Строка(ПараметрыЗапроса.Количество()));
			ПараметрыЗапроса.Вставить("ПользовательскийПараметр" + Строка(ПараметрыЗапроса.Количество()), ЗначениеПараметра.Значение);
		КонецЦикла;
		
		Если ТипЗнч(ВариантПоля.Значение) = Тип("ПолеКомпоновкиДанных") Тогда
			Выражения.Добавить("КОГДА " + Выражение + " ТОГДА " + ВариантПоля.Значение);
		Иначе
			Выражения.Добавить("КОГДА " + Выражение + " ТОГДА &ПользовательскийПараметр" + Строка(ПараметрыЗапроса.Количество()));
			ПараметрыЗапроса.Вставить("ПользовательскийПараметр" + Строка(ПараметрыЗапроса.Количество()), ВариантПоля.Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	Если Выражения.Количество() = 0 Тогда
	
		Если ЗначениеЗаполнено(ВыражениеИначе) Тогда
			Возврат ВыражениеИначе;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
		
	Иначе
		
		Если ЗначениеЗаполнено(ВыражениеИначе) Тогда
			Выражения.Добавить("ИНАЧЕ " + ВыражениеИначе);
		КонецЕсли;
		
		Возврат "ВЫБОР
		|	" + СтрСоединить(Выражения, Символы.ПС + Символы.Таб) + "
		|КОНЕЦ";
		
	КонецЕсли;
	
КонецФункции

Процедура КонвертироватьНастройкиМетаданных(Настройки)
	
	ДанныеНастроек = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Настройки, "Данные", Новый Соответствие(), Тип("Соответствие"));
	
	Если ДанныеНастроек.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПолученияНастроек = РегистрыСведений.SUI_НастройкиТаблицИнтеграции.ПараметрыПолученияНастроек();
	ТаблицаНастроек = РегистрыСведений.SUI_НастройкиТаблицИнтеграции.ПолучитьНастройки(ПараметрыПолученияНастроек);
	ТаблицаНастроек.Очистить();
	
	КолонкаИмяТаблицы = ТаблицаНастроек.Колонки.Найти("ИмяТаблицы");
	Если КолонкаИмяТаблицы <> Неопределено Тогда
		ТаблицаНастроек.Колонки.Удалить(КолонкаИмяТаблицы);
	КонецЕсли;
	
	ДополнительныеНастройки = Новый Соответствие();
	
	ТаблицыДополнительныхНастроек = РегистрыСведений.SUI_ДополнительныеНастройкиТаблицИнтеграции.ТаблицыИнтеграцииДополнительныхНастроек();
	
	Для Каждого ДанныеНастройки Из ДанныеНастроек Цикл
		
		ЗначениеНастройки = ДанныеНастройки.Значение;
		
		НоваяСтрока = ТаблицаНастроек.Добавить();
		НоваяСтрока.ТаблицаИнтеграции = ДанныеНастройки.Ключ;
		НоваяСтрока.ОсновнойОбъект = Истина;
		НоваяСтрока.ИмяОбъекта = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЗначениеНастройки, 
			"ПолноеИмяОбъекта", "", Тип("Строка"));
		НоваяСтрока.Используется = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЗначениеНастройки, 
			"Используется", Ложь, Тип("Булево"));
		
		Если ПустаяСтрока(НоваяСтрока.ИмяОбъекта) Тогда
			МетаданныеОбъекта = Неопределено;
		Иначе
			МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(НоваяСтрока.ИмяОбъекта);
		КонецЕсли;
		
		ВидОбъекта = ВРег(РегистрыСведений.SUI_НастройкиТаблицИнтеграции.ВидОбъектаКонфигурации(НоваяСтрока.ИмяОбъекта));
		
		Если Не ЗначениеЗаполнено(НоваяСтрока.ТаблицаИнтеграции) Или МетаданныеОбъекта = Неопределено Или
			РегистрыСведений.SUI_НастройкиТаблицИнтеграции.ДоступныеВидыОбъектовКНастройке().Найти(ВРег(ВидОбъекта)) = Неопределено Тогда
			ТаблицаНастроек.Удалить(НоваяСтрока);
			Продолжить;
		КонецЕсли;
		
		ИмяОбъекта = МетаданныеОбъекта.Имя;
		
		ТаблицаОбъекта = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЗначениеНастройки, "ТаблицаОбъекта", "", Тип("Строка"));
		
		Если Не ПустаяСтрока(ТаблицаОбъекта) Тогда
			ИмяОбъекта = ИмяОбъекта + ТаблицаОбъекта;
		КонецЕсли;
		
		МассивУсловий = Новый Массив();
		Для Каждого ПараметрСКД Из РегистрыСведений.SUI_НастройкиТаблицИнтеграции.ПараметрыСКДПоОбъектуКонфигурации(НоваяСтрока.ИмяОбъекта) Цикл
			МассивУсловий.Добавить(ИмяОбъекта + "." + ПараметрСКД + " = &" + ПараметрСКД);
		КонецЦикла;
	
		КонструкторЗапроса = Новый КонструкторЗапроса("ВЫБРАТЬ РАЗРЕШЕННЫЕ 
		|	*
		|ИЗ " + НоваяСтрока.ИмяОбъекта + ?(ЗначениеЗаполнено(ТаблицаОбъекта), "." + ТаблицаОбъекта, "") + " КАК " + ИмяОбъекта);
		
		КонструкторЗапроса.РежимКомпоновкиДанных = Истина;
		
		ТекстЗапроса = КонструкторЗапроса.Текст;
		
		Если МассивУсловий.Количество() > 0 Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|{ГДЕ
			|	" + СтрСоединить(МассивУсловий, "," + Символы.ПС + Символы.Таб) + "}";
		КонецЕсли;
		
		НоваяСтрока.СхемаКомпоновкиДанных = SUI_КомпоновкаДанныхСервер.ПустаяСхема();
		НаборДанных = SUI_КомпоновкаДанныхСервер.ДобавитьПустойНаборДанных(НоваяСтрока.СхемаКомпоновкиДанных);
		НаборДанных.Запрос = ТекстЗапроса;
			
		НоваяСтрока.НастройкиКомпоновкиДанных = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЗначениеНастройки, 
			"НастройкиКомпоновкиДанных", Новый НастройкиКомпоновкиДанных(), Тип("НастройкиКомпоновкиДанных"));
		
		КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных();
		
		SUI_КомпоновкаДанныхСервер.ИнициализироватьКомпоновщикНастроек(КомпоновщикНастроек, 
			НоваяСтрока.СхемаКомпоновкиДанных, НоваяСтрока.НастройкиКомпоновкиДанных, 
			СпособВосстановленияНастроекКомпоновкиДанных.Полное);
		SUI_КомпоновкаДанныхКлиентСервер.ДобавитьГруппировку(КомпоновщикНастроек);
		
		НоваяСтрока.НастройкиКомпоновкиДанных = КомпоновщикНастроек.ПолучитьНастройки();
		
		Если ТаблицыДополнительныхНастроек.Найти(НоваяСтрока.ТаблицаИнтеграции) <> Неопределено Тогда
			ДопНастройка = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЗначениеНастройки, "ДополнительныеНастройки", 
				Новый Структура(), Тип("Структура"));
			ДополнительныеНастройки.Вставить(НоваяСтрока.ТаблицаИнтеграции, ДопНастройка);
		КонецЕсли;
		
	КонецЦикла;
	
	Настройки.Вставить("ТаблицыИнтеграции", ТаблицаНастроек);
	Настройки.Вставить("ДополнительныеНастройки", ДополнительныеНастройки);
	Настройки.Вставить("Версия", ВерсияНастроек());
	Настройки.Удалить("Данные");
	
КонецПроцедуры

#Область Настройки

Функция СформироватьПредопределенныеДополнительныеНастройки_СерииНоменклатуры(КонфигурацияНастройки, ДополнительныеНастройки)
	
	ДополнительныеНастройки.Вставить("АлгоритмСозданияСерииНоменклатуры", Новый Структура("Тип, Алгоритм", 
		Перечисления.SUI_ТипыАлгоритмов.Произвольный,
		SUI_СерииНоменклатурыКлиентСервер.ПредопределенныйАлгоритмСозданияСерииНоменклатуры(КонфигурацияНастройки)));
	
	Возврат ДополнительныеНастройки;
	
КонецФункции

Функция СформироватьПредопределенныеДополнительныеНастройки_ШтрихкодыУпаковокТоваров(КонфигурацияНастройки, ДополнительныеНастройки)
	
	ДополнительныеНастройки.Вставить("АлгоритмНормализацииЗначенияШтрихкода", Новый Структура("Тип, Алгоритм", 
		Перечисления.SUI_ТипыАлгоритмов.Произвольный,
		SUI_ШтрихкодыУпаковокКлиентСервер.ПредопределенныйАлгоритмНормализацииЗначенияШтрихкода(КонфигурацияНастройки)));
		
	ДополнительныеНастройки.Вставить("АлгоритмСозданияШтрихкодаУпаковки", Новый Структура("Тип, Алгоритм", 
		Перечисления.SUI_ТипыАлгоритмов.Произвольный, 
		SUI_ШтрихкодыУпаковокКлиентСервер.ПредопределенныйАлгоритмСозданияШтрихкодаУпаковки(КонфигурацияНастройки)));
	
	Возврат ДополнительныеНастройки;
	
КонецФункции

Функция СформироватьПредопределенныеДополнительныеНастройки_ШтрихкодыНоменклатуры(КонфигурацияНастройки, ДополнительныеНастройки)
	
	ДополнительныеНастройки.Вставить("АлгоритмСозданияШтрихкодаНоменклатуры", Новый Структура("Тип, Алгоритм", 
		Перечисления.SUI_ТипыАлгоритмов.Произвольный, 
		SUI_ШтрихкодыНоменклатурыКлиентСервер.ПредопределенныйАлгоритмСозданияШтрихкодаНоменклатуры(КонфигурацияНастройки)));
	
	Возврат ДополнительныеНастройки;
	
КонецФункции

#КонецОбласти

#КонецОбласти
