
#Область ПрограммныйИнтерфейс

// Возвращает числовой вес версии для сравнения версий между собой.
//
// Параметры:
//  Версия - Строка - версия в строковом формате.
//
// Возвращаемое значение:
//  Число - вес версии
//
Функция ВесВерсии(Знач Версия) Экспорт
	
	Если Версия = "" Тогда
		Возврат 0;
	КонецЕсли;
	
	Если СтрНачинаетсяС(Версия, "ОтладкаОбработчика") Тогда
		Возврат 99000000000;
	КонецЕсли;
	
	РазрядыВерсииСтроками = СтрРазделить(Версия, ".");
	Если РазрядыВерсииСтроками.Количество() = 3 Тогда
		РазрядыВерсииСтроками.Добавить("0");
	КонецЕсли;
	
	Возврат ВесВерсииИзМассиваСтрок(РазрядыВерсииСтроками);
	
КонецФункции

Функция ПолучитьСписокОбновленийИзРепозитория(ПредварительныеВерсии = Ложь, Таймаут = 15) Экспорт
	
	#Если ВебКлиент Тогда
		Возврат SUI_ОбновлениеSimpleВызовСервера.ПолучитьСписокОбновленийИзРепозитория(Таймаут);
	#Иначе
		
		Результат = Новый Структура();
		Результат.Вставить("Ошибка", "");
		Результат.Вставить("СписокВерсий", Новый Массив());
		
		Попытка
			
			РезультатЗапроса = ВыполнитьЗапросКРепозиторию("/releases", Таймаут);
			СписокВерсий = ДанныеJSON(РезультатЗапроса.ПолучитьТелоКакСтроку());
			Если СписокВерсий.Количество() > 0 Тогда
				Результат.СписокВерсий = ПолучитьДоступныеВерсииКОбновлению(СписокВерсий, ПредварительныеВерсии);
			КонецЕсли;
			
		Исключение
			Ошибка = ИнформацияОбОшибке();
			ЗаписатьОшибкуОбращенияКРепозиторию(Ошибка);
			Результат.Ошибка = НСтр("ru = 'Возникла ошибка получения списка обновлений.
			|Обратитесь к поставщику обновлений.'");
		КонецПопытки;
		
		Возврат Результат;
		
	#КонецЕсли
	
КонецФункции

Функция ЗагрузитьФайлОбновленияИзРепозитория(ОписаниеОбновления, АдресХранения, Таймаут = 15) Экспорт
	
	#Если ВебКлиент Тогда
		Результат = SUI_ОбновлениеSimpleВызовСервера.ЗагрузитьФайлОбновленияИзРепозитория(ОписаниеОбновления, Таймаут);
	#Иначе
		
		Результат = Новый Структура();
		Результат.Вставить("Ошибка", "");
		Результат.Вставить("АдресХранения", "");
		
		Попытка
			
			ПутьКФайлуЗагрузки = "";
			
			Если ПустаяСтрока(ОписаниеОбновления.file_url) Тогда
				
				ПутьКВложению = "/releases/assets/" + Формат(ОписаниеОбновления.file_id, "ЧГ=0;");
				РезультатЗапроса = ВыполнитьЗапросКРепозиторию(ПутьКВложению, Таймаут);
				
				Вложение = ДанныеJSON(РезультатЗапроса.ПолучитьТелоКакСтроку());
				ПутьКФайлуЗагрузки = SUI_ОбщегоНазначенияКлиентСервер.ЗначениеСоответствия(
					Вложение, "browser_download_url", "", Тип("Строка"));
				
				ОбщегоНазначенияКлиентСервер.Проверить(Не ПустаяСтрока(ПутьКФайлуЗагрузки),
					СтрШаблон(НСтр("ru = 'Не удалось определить ссылку для скачивания файла обновления по идентификатору %1.'"), 
					Формат(ОписаниеОбновления.file_id, "ЧГ=0;")),
					"SUI_ОбновлениеSimpleКлиентСервер.ЗагрузитьФайлОбновленияИзРепозитория");
				
			Иначе
				
				ПутьКФайлуЗагрузки = ОписаниеОбновления.file_url;
				
				ОбщегоНазначенияКлиентСервер.Проверить(Не ПустаяСтрока(ПутьКФайлуЗагрузки),
					НСтр("ru = 'Пустая ссылка для скачивания файла обновления'"),
					"SUI_ОбновлениеSimpleКлиентСервер.ЗагрузитьФайлОбновленияИзРепозитория");
				
			КонецЕсли;
			
			РезультатЗапроса = ВыполнитьЗапросКРепозиторию(ПутьКФайлуЗагрузки, Таймаут);
			ФайлОбновления = РезультатЗапроса.ПолучитьТелоКакДвоичныеДанные();
			Результат.АдресХранения = ПоместитьВоВременноеХранилище(ФайлОбновления, АдресХранения);
			
		Исключение
			Ошибка = ИнформацияОбОшибке();
			ЗаписатьОшибкуОбращенияКРепозиторию(Ошибка);
			Результат.Ошибка = НСтр("ru = 'Возникла ошибка получения файла обновления.
			|Обратитесь к поставщику обновлений.'");
		КонецПопытки;
		
	#КонецЕсли
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ИмяСобытия(ВложенноеСобытие = "") Экспорт 
	Возврат НСтр("ru = 'Обновление'") + ?(ПустаяСтрока(ВложенноеСобытие), "", ". " + ВложенноеСобытие);	
КонецФункции

Функция ДанныеJSON(Строка, ПрочитатьВСоответствие = Истина) Экспорт
	
	#Если ВебКлиент Тогда
		РезультатЧтения = SUI_ОбновлениеSimpleВызовСервера.ДанныеJSON(Строка);
	#Иначе
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Строка);
		РезультатЧтения = ПрочитатьJSON(ЧтениеJSON, ПрочитатьВСоответствие);	
	#КонецЕсли

	Возврат РезультатЧтения;
	
КонецФункции

Функция СтрокаJSON(Данные) Экспорт
	
	#Если ВебКлиент Тогда
		ДанныеСтрокойJSON = SUI_ОбновлениеSimpleВызовСервера.СтрокаJSON(Данные);
	#Иначе
		ЗаписьJSON = Новый ЗаписьJSON();
		ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(, Символы.Таб));
		ЗаписатьJSON(ЗаписьJSON, Данные);
		ДанныеСтрокойJSON = ЗаписьJSON.Закрыть();
	#КонецЕсли
	
	Возврат ДанныеСтрокойJSON;
	
КонецФункции

Функция КлючСообщенияПрогрессаВыполненияОбработчикаОбновления() Экспорт
	Возврат "ПрогрессВыполнения=";
КонецФункции

Функция ТекущаяВерсия() Экспорт
	
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		Возврат SUI_ОбновлениеSimple.ТекущаяВерсияКонфигурации(Ложь);
	#Иначе
		ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка");
		Возврат ОписаниеТипаСтрока.ПривестиЗначение(SUI_ПараметрыПриложения.Получить("ВерсияРасширения"));
	#КонецЕсли
	
КонецФункции

#Область ПараметрыЗапускаПриложения

Функция ПараметрЗапускаОбновления() Экспорт
	Возврат "/RunUpdateSimple";
КонецФункции

Функция ПараметрПропускаОбновления() Экспорт
	Возврат "/SkipUpdateSimple";
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВладелецРепозитория()
	
	Возврат "artemyakovlev94";
	
КонецФункции

Функция ИмяРепозитория()
	
	Возврат "simple";
	
КонецФункции

Функция АдресРепозитория()
	
	Возврат "https://api.github.com/repos/" + ВладелецРепозитория() + "/" + ИмяРепозитория();
	
КонецФункции

Функция ВесВерсииИзМассиваСтрок(РазрядыВерсииСтроками)
	
	Возврат 0
		+ Число(РазрядыВерсииСтроками[0]) * 1000000000
		+ Число(РазрядыВерсииСтроками[1]) * 1000000
		+ Число(РазрядыВерсииСтроками[2]) * 1000
		+ Число(РазрядыВерсииСтроками[3]);

КонецФункции

Функция ВыполнитьЗапросКРепозиторию(ПутьВРепозитории, Таймаут = 15, ПопыткаПеренаправления = 0)
	
	КоличествоПопытокПеренаправлений = 1;
	
	Попытка
		
		СтруктураАдреса = ОбщегоНазначенияКлиентСервер.СтруктураURI(ПутьВРепозитории);
		
		Если ПустаяСтрока(СтруктураАдреса.Схема) Или ПустаяСтрока(СтруктураАдреса.Хост) Тогда
			
			ОбщегоНазначенияКлиентСервер.Проверить(ПопыткаПеренаправления < КоличествоПопытокПеренаправлений,
				СтрШаблон(НСтр("ru = 'Не правильно указан адрес перенаправления %1'"), ПутьВРепозитории));
			
			СтруктураАдреса = ОбщегоНазначенияКлиентСервер.СтруктураURI(АдресРепозитория() + ПутьВРепозитории);
			
		КонецЕсли;
		
		ЗащищенноеСоединение = ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение();
		Соединение = Новый HTTPСоединение(СтруктураАдреса.Хост, СтруктураАдреса.Порт, , , , Таймаут, ЗащищенноеСоединение);
		HTTPЗапрос = Новый HTTPЗапрос(СтруктураАдреса.ПутьНаСервере);
		РезультатЗапроса = Соединение.Получить(HTTPЗапрос);
		
		Если РезультатЗапроса.КодСостояния >= 300 И РезультатЗапроса.КодСостояния < 400 Тогда
			
			АдресПеренаправления = РезультатЗапроса.Заголовки.Получить("Location");
			
			ОбщегоНазначенияКлиентСервер.Проверить(Не ПустаяСтрока(АдресПеренаправления),
				СтрШаблон(НСтр("ru = 'Код состояния: %1
				|Не задан адрес перенаправления.'"), 
				РезультатЗапроса.КодСостояния));
			
			ОбщегоНазначенияКлиентСервер.Проверить(ПопыткаПеренаправления <= КоличествоПопытокПеренаправлений,
				СтрШаблон(НСтр("ru = 'Код состояния: %1
				|Адрес перенаправления: %2
				|Превышено количество попыток перенаправлений (%3).'"), 
				РезультатЗапроса.КодСостояния, АдресПеренаправления, КоличествоПопытокПеренаправлений));
			
			ПопыткаПеренаправления = ПопыткаПеренаправления + 1;
			
			РезультатЗапроса = ВыполнитьЗапросКРепозиторию(АдресПеренаправления, Таймаут, ПопыткаПеренаправления);
			
		Иначе
			ОбщегоНазначенияКлиентСервер.Проверить(РезультатЗапроса.КодСостояния = 200,
				СтрШаблон(НСтр("ru = 'Код состояния: %1
				|Содержимое: %2'"), РезультатЗапроса.КодСостояния, РезультатЗапроса.ПолучитьТелоКакСтроку()),
				"SUI_ОбновлениеSimpleКлиентСервер.ВыполнитьЗапросКРепозиторию");
		КонецЕсли;
		
	Исключение
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Хост: %1
			|Порт: %2
			|Путь: %3
			|%4'"), 
			СтруктураАдреса.Хост, СтруктураАдреса.Порт, СтруктураАдреса.ПутьНаСервере,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Возврат РезультатЗапроса;
	
КонецФункции

Функция ПолучитьДоступныеВерсииКОбновлению(Версии, ПредварительныеВерсии)
	
	ПорядокВерсий = Новый СписокЗначений();
	ВерсииДляОбновления = Новый Соответствие();
	
	ТекущаяВерсия = ТекущаяВерсия();
	
	Для ИндексВерсии = 0 По Версии.ВГраница() Цикл
		
		ОписаниеВерсии = Новый Структура();
		ОписаниеВерсии.Вставить("id", Версии[ИндексВерсии].Получить("id"));
		ОписаниеВерсии.Вставить("tag_name", Версии[ИндексВерсии].Получить("tag_name"));
		ОписаниеВерсии.Вставить("prerelease", Версии[ИндексВерсии].Получить("prerelease"));
		
		Если Не ЗначениеЗаполнено(ОписаниеВерсии.id) Или 
			ПустаяСтрока(ОписаниеВерсии.tag_name) Или
			(Не ПредварительныеВерсии И ОписаниеВерсии.prerelease) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии(ТекущаяВерсия, ОписаниеВерсии.tag_name) >= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ОписаниеВерсии.Вставить("body", Версии[ИндексВерсии].Получить("body"));
		ОписаниеВерсии.Вставить("tag_init", ПолучитьНачальнуюВерсиюИзОписанияВерсии(ОписаниеВерсии.body));
		
		Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии(ОписаниеВерсии.tag_init, ТекущаяВерсия) > 0 Тогда
			ОписаниеВерсии.Вставить("manual_update", Истина);
		Иначе
			ОписаниеВерсии.Вставить("manual_update", Ложь);
		КонецЕсли;
		
		ОписаниеФайла = ПолучитьОписаниеФайлаОбновленияИзОписанияВерсии(Версии[ИндексВерсии]);
		Если ОписаниеФайла = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ОписаниеВерсии.Вставить("file_id", ОписаниеФайла.id);
		ОписаниеВерсии.Вставить("file_url", ОписаниеФайла.url);
		ОписаниеВерсии.Вставить("url", Версии[ИндексВерсии].Получить("html_url"));
		ОписаниеВерсии.Вставить("created_at", Версии[ИндексВерсии].Получить("created_at"));
		ОписаниеВерсии.Вставить("published_at", Версии[ИндексВерсии].Получить("published_at"));
		ОписаниеВерсии.Вставить("created_at", 
			SUI_ОбщегоНазначенияКлиентСервер.ПолучитьДатуИзСтрокиISO8601(ОписаниеВерсии.created_at));
		ОписаниеВерсии.Вставить("published_at", 
			SUI_ОбщегоНазначенияКлиентСервер.ПолучитьДатуИзСтрокиISO8601(ОписаниеВерсии.published_at));
		
		ВесВерсииОбновления = ВесВерсии(ОписаниеВерсии.tag_name);
		
		Если ВесВерсииОбновления = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Пока ПорядокВерсий.НайтиПоЗначению(ВесВерсииОбновления) <> Неопределено Цикл
			ВесВерсииОбновления = ВесВерсииОбновления + 1;
		КонецЦикла;
		
		ВерсииДляОбновления.Вставить(ВесВерсииОбновления, ОписаниеВерсии);
		ПорядокВерсий.Добавить(ВесВерсииОбновления);
		
	КонецЦикла;
	
	СписокВерсий = Новый Массив();
	
	ПорядокВерсий.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
	Для Каждого ЭлементПорядка Из ПорядокВерсий Цикл
		СписокВерсий.Добавить(ВерсииДляОбновления.Получить(ЭлементПорядка.Значение));
	КонецЦикла;
	
	Возврат СписокВерсий;
	
КонецФункции

Функция ПолучитьОписаниеФайлаОбновленияИзОписанияВерсии(ОписаниеВерсии)
	
	ОписаниеФайла = Неопределено;
	
	Вложения = ОписаниеВерсии.Получить("assets");
	
	Для индекс = 0 По Вложения.ВГраница() Цикл
		
		Если Вложения[индекс].Получить("name") = "Update.zip" И
			Вложения[индекс].Получить("content_type") = "application/x-zip-compressed" И
			Вложения[индекс].Получить("state") = "uploaded" Тогда
			
			ОписаниеФайла = Новый Структура();
			ОписаниеФайла.Вставить("id", Вложения[индекс].Получить("id"));
			ОписаниеФайла.Вставить("url", Вложения[индекс].Получить("browser_download_url"));
			ОписаниеФайла.Вставить("created_at", Вложения[индекс].Получить("created_at"));
			ОписаниеФайла.Вставить("updated_at", Вложения[индекс].Получить("updated_at"));
			
			Если Не ЗначениеЗаполнено(ОписаниеФайла.id) И Не ЗначениеЗаполнено(ОписаниеФайла.url) Тогда
				ОписаниеФайла = Неопределено;
			КонецЕсли;
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ОписаниеФайла;
	
КонецФункции

Функция ПолучитьНачальнуюВерсиюИзОписанияВерсии(Описание)
	
	НачальнаяВерсия = "0.0.0.0";
	
	Версия = "";
	
	ПозицияНачало = СтрНайти(Описание, "***init: ^");
	
	Если ПозицияНачало > 0 Тогда
		
		СтрокаОписания = Сред(Описание, 11);
		
		ПозицияКонец = СтрНайти(СтрокаОписания, "***");
		Если ПозицияКонец > 0 Тогда
			Версия = Лев(СтрокаОписания, ПозицияКонец - 1);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ПустаяСтрока(Версия) Тогда
		Описание = СтрЗаменить(Описание, СтрШаблон("***init: ^%1***", Версия), "");
		НачальнаяВерсия = СокрЛП(Версия);
	КонецЕсли;
	
	Возврат НачальнаяВерсия;
	
КонецФункции

Процедура ЗаписатьОшибкуОбращенияКРепозиторию(Ошибка)
	
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(), , 
		Метаданные.ОбщиеМодули.SUI_ОбновлениеSimpleКлиентСервер, , Ошибка);
	#Иначе
	Событие = SUI_ЖурналРегистрацииКлиентСервер.ИмяСобытия(ИмяСобытия());
	Комментарий = ОбработкаОшибок.ПодробноеПредставлениеОшибки(Ошибка);
	ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации(Событие, "Ошибка", Комментарий, , Истина);
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти
