
#Область ПрограммныйИнтерфейс

Функция ПараметрыОткрытия(ИсходныйТекст = "", ПредопределенныйТекст = "") Экспорт
	
	ПараметрыОткрытия = Новый Структура();
	
	ПараметрыОткрытия.Вставить("ИсходныйТекст", 			ИсходныйТекст);
	ПараметрыОткрытия.Вставить("ПредопределенныйТекст", 	ПредопределенныйТекст);
	ПараметрыОткрытия.Вставить("Заголовок", 				"");
	ПараметрыОткрытия.Вставить("Описание", 					"");
	ПараметрыОткрытия.Вставить("ЗапретРедактированияПриОткрытии", Ложь);
	ПараметрыОткрытия.Вставить("ЗакрытьСРезультатом", 		Истина);
	ПараметрыОткрытия.Вставить("НеВыгружатьВФайл", 			Ложь);
	ПараметрыОткрытия.Вставить("НеЗагружатьИзФайла", 		Ложь);
	ПараметрыОткрытия.Вставить("НеРедактировать", 			Ложь);
	ПараметрыОткрытия.Вставить("ПользовательскиеОбъекты", 	Новый Структура());
	
	Возврат ПараметрыОткрытия;
	
КонецФункции

Процедура ОткрытьРедактор(Знач ПараметрыОткрытия, ОповещениеОЗавершении = Неопределено, ФормаВладелец = Неопределено, 
	Окно = Неопределено, РежимОткрытия = Неопределено) Экспорт
	
	ПредопределенныйТекст = Новый СписокЗначений();
	
	Если ЗначениеЗаполнено(ПараметрыОткрытия.ПредопределенныйТекст) Тогда
		
		ТипЗначенияПредопределенныйТекст = ТипЗнч(ПараметрыОткрытия.ПредопределенныйТекст);
		
		Если ТипЗначенияПредопределенныйТекст = Тип("Строка") Тогда
			ПредопределенныйТекст.Добавить(ПараметрыОткрытия.ПредопределенныйТекст, НСтр("ru = 'Предопределенный код'"));
		ИначеЕсли ТипЗначенияПредопределенныйТекст = Тип("СписокЗначений") Тогда
			ПредопределенныйТекст = ПараметрыОткрытия.ПредопределенныйТекст;
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыОткрытия.ПредопределенныйТекст = ПредопределенныйТекст;
	
	ОткрытьФорму("Обработка.SUI_РедакторКода.Форма", ПараметрыОткрытия, ФормаВладелец, 
		?(ФормаВладелец = Неопределено, Неопределено, ФормаВладелец.УникальныйИдентификатор), Окно, , ОповещениеОЗавершении, РежимОткрытия);
	
КонецПроцедуры

Функция ДобавитьПользовательскийОбъект(КоллекцияОбъектов, Имя, Описание = "", ФактическийТип = Неопределено, 
	СсылочныйТип = Неопределено, ИсключитьИзРедактораBSL = Ложь) Экспорт
	
	Возврат SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(КоллекцияОбъектов, Имя, Описание, 
		ФактическийТип, СсылочныйТип, ИсключитьИзРедактораBSL);
	
КонецФункции

Функция ДобавитьСвойствоПользовательскогоОбъекта(ПользовательскийОбъект, Имя, Представление = "", Описание = "", 
	ФактическийТип = Неопределено, СсылочныйТип = Неопределено, ИсключитьИзРедактораBSL = Ложь) Экспорт
	
	Возврат SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(ПользовательскийОбъект, Имя, 
		Представление, Описание, ФактическийТип, СсылочныйТип, ИсключитьИзРедактораBSL);
	
КонецФункции

#КонецОбласти
