
#Область ПрограммныйИнтерфейс

Функция ПараметрыОткрытия(ИсходныйТекст = "", ПредопределенныйТекст = "") Экспорт
	
	ПараметрыОткрытия = Новый Структура();
	
	ПараметрыОткрытия.Вставить("ИсходныйТекст", 			ИсходныйТекст);
	ПараметрыОткрытия.Вставить("ПредопределенныйТекст", 	ПредопределенныйТекст);
	ПараметрыОткрытия.Вставить("Заголовок", 				"");
	ПараметрыОткрытия.Вставить("Описание", 					"");
	ПараметрыОткрытия.Вставить("ЗапретРедактированияПриОткрытии", Ложь);
	ПараметрыОткрытия.Вставить("ЗакрытьСРезультатом", 		Истина);
	ПараметрыОткрытия.Вставить("НеВыгружатьВФайл", 			Ложь);
	ПараметрыОткрытия.Вставить("НеЗагружатьИзФайла", 		Ложь);
	ПараметрыОткрытия.Вставить("НеРедактировать", 			Ложь);
	ПараметрыОткрытия.Вставить("ПользовательскиеОбъекты", 	Новый Структура());
	
	Возврат ПараметрыОткрытия;
	
КонецФункции

Процедура ОткрытьРедактор(ПараметрыОткрытия, ОповещениеОЗавершении = Неопределено, ФормаВладелец = Неопределено, 
	Окно = Неопределено, РежимОткрытия = Неопределено) Экспорт
	
	ОткрытьФорму("Обработка.SUI_РедакторКода.Форма", ПараметрыОткрытия, ФормаВладелец, 
		?(ФормаВладелец = Неопределено, Неопределено, ФормаВладелец.УникальныйИдентификатор), Окно, , ОповещениеОЗавершении, РежимОткрытия);
	
КонецПроцедуры

Функция ДобавитьПользовательскийОбъект(КоллекцияОбъектов, Имя, Описание = "", ФактическийТип = Неопределено, 
	СсылочныйТип = Неопределено, ИсключитьИзРедактораBSL = Ложь) Экспорт
	
	Возврат SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(КоллекцияОбъектов, Имя, Описание, 
		ФактическийТип, СсылочныйТип, ИсключитьИзРедактораBSL);
	
КонецФункции

Функция ДобавитьСвойствоПользовательскогоОбъекта(ПользовательскийОбъект, Имя, Представление = "", Описание = "", 
	ФактическийТип = Неопределено, СсылочныйТип = Неопределено, ИсключитьИзРедактораBSL = Ложь) Экспорт
	
	Возврат SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(ПользовательскийОбъект, Имя, 
		Представление, Описание, ФактическийТип, СсылочныйТип, ИсключитьИзРедактораBSL);
	
КонецФункции

#КонецОбласти
