
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "SUI_ПринятЗапросАвторизации" Тогда
		
		Если ТипЗнч(Параметр) = Тип("ПланОбменаСсылка.SUI_МобильныеУстройства") И ЗначениеЗаполнено(Параметр) Тогда
			ПоказатьЗначение(, Параметр);
		КонецЕсли;
		
		Элементы.Список.Обновить();
		
	ИначеЕсли ИмяСобытия = "SUI_ОтклоненЗапросАвторизации" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Запрос авторизации был отклонен'"));
		Элементы.Список.Обновить();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПринятьЗапрос(Команда)
	
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	SUI_МобильныеУстройстваКлиент.ПринятьЗапросАвторизации(Элементы.Список.ТекущиеДанные.ИдентификаторУстройства);

КонецПроцедуры 

&НаКлиенте
Процедура ОтклонитьЗапрос(Команда)
	
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	SUI_МобильныеУстройстваКлиент.ОтклонитьЗапросАвторизации(Элементы.Список.ТекущиеДанные.ИдентификаторУстройства);
	
КонецПроцедуры   

&НаКлиенте
Процедура СформироватьQRДляПодключения(Команда)
	ОткрытьФорму("ОбщаяФорма.SUI_QRКодДляПодключенияМобильногоПриложения", , 
		ЭтотОбъект, УникальныйИдентификатор);
КонецПроцедуры

#КонецОбласти
