
#Область ОписаниеПеременных

&НаКлиенте
Перем ПараметрыТекущейСтрокиТаблицыПередВызовом;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	SUI_РегламентныеЗадания.ВыполнитьПроверкуПрав(Отказ, Ложь);
	
	ПризнакОтображенияНеУстановленныхЗаданий = SUI_РегламентныеЗадания.ПолучитьПризнакОтображенияНеУстановленныхЗаданий();
	
	Если ПризнакОтображенияНеУстановленныхЗаданий = Неопределено Тогда
		Элементы.ТаблицаРегламентныеЗаданияОтображатьНеУстановленные.Пометка = Истина;
	Иначе
		Элементы.ТаблицаРегламентныеЗаданияОтображатьНеУстановленные.Пометка = ПризнакОтображенияНеУстановленныхЗаданий;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОтображатьНеУстановленныеНаКлиенте();
	
	ПодключитьОбработчикОжидания("ВыполнитьОбновлениеСпискаРегламентныхЗаданий", 0.1, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаРегламентныеЗадания

&НаКлиенте
Процедура ТаблицаРегламентныеЗаданияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элемент.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	ИначеЕсли Не ТекДанные.Установлено Тогда
		УстановитьРегламентноеЗаданиеНаКлиенте();
	Иначе
		
		Если Поле.Имя = "ТаблицаРегламентныеЗаданияРасписание" И
			ЗначениеЗаполнено(ТекДанные.Расписание) Тогда
			НастроитьРасписаниеНаКлиенте();
		ИначеЕсли Поле.Имя = "ТаблицаРегламентныеЗаданияПредставлениеОшибки" И
			Не ПустаяСтрока(ТекДанные.ПредставлениеОшибки) Тогда
			ОткрытьПросмотрОшибкиНаКлиенте();
		ИначеЕсли Поле.Имя = "ТаблицаРегламентныеЗаданияПредставлениеСообщений" И 
			Не ПустаяСтрока(ТекДанные.ПредставлениеСообщений) Тогда
			ОткрытьПросмотрСообщенийНаКлиенте();
		ИначеЕсли Не ТекДанные.Использование Тогда
			ВключитьРегламентноеЗаданиеНаКлиенте();
		Иначе
			ЗапуститьРегламентноеЗаданиеНаКлиенте();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьСписокРегламентныхЗаданий(Команда)
	
	ОбновитьСписокРегламентныхЗаданийНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРегламентноеЗадание(Команда)
	
	УстановитьРегламентноеЗаданиеНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьРегламентноеЗадание(Команда)
	
	УдалитьРегламентноеЗаданиеНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьРегламентноеЗадание(Команда)
	
	ВключитьРегламентноеЗаданиеНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыключитьРегламентноеЗадание(Команда)
	
	ВыключитьРегламентноеЗаданиеНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРасписание(Команда)
	
	НастроитьРасписаниеНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьАварийныйПерезапуск(Команда)
	
	НастроитьАварийныйПерезапускНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьРегламентноеЗадание(Команда)
	
	ЗапуститьРегламентноеЗаданиеНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ОстановитьРегламентноеЗадание(Команда)
	
	ОстановитьРегламентноеЗаданиеНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьНеУстановленные(Команда)
	
	ОтображатьНеУстановленныеНаКлиенте(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЖурналРегистрации(Команда)
	
	ТекущиеДанные = Элементы.ТаблицаРегламентныеЗадания.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Выберите регламентное задание.'"));
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ПоследнийЗапускНачало) И Не ЗначениеЗаполнено(ТекущиеДанные.ПоследнийЗапускКонец) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Нет событий для просмотра, так как регламентное задание не выполнялось.'"));
		Возврат;
	КонецЕсли;
	
	ОтборСобытий = Новый Структура;
	ОтборСобытий.Вставить("ДатаНачала", ТекущиеДанные.ПоследнийЗапускНачало);
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ПоследнийЗапускКонец) Тогда
		ОтборСобытий.Вставить("ДатаОкончания", ТекущиеДанные.ПоследнийЗапускКонец);
	КонецЕсли;
	
	ОтборСобытий.Вставить("Данные", ТекущиеДанные.Ключ);
	
	ЖурналРегистрацииКлиент.ОткрытьЖурналРегистрации(ОтборСобытий, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОтобразитьДлительнуюОперацию(Описание)
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаДлительнойОперации;
	Элементы.ОписаниеДлительнойОперации.Заголовок = Описание;
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьДлительнуюОперацию()
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаТаблицаРегламентныхЗаданий;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрыТекущейСтрокиПередВызовом(ТекущиеДанные) Экспорт
	
	Если ТекущиеДанные = Неопределено Тогда
		ПараметрыТекущейСтрокиТаблицыПередВызовом = Неопределено;
	Иначе
		
		ПараметрыТекущейСтрокиТаблицыПередВызовом = Новый Структура();
		ПараметрыТекущейСтрокиТаблицыПередВызовом.Вставить("Ключ", ТекущиеДанные.Ключ);
		ПараметрыТекущейСтрокиТаблицыПередВызовом.Вставить("УникальныйИдентификатор", ТекущиеДанные.УникальныйИдентификатор);
		ПараметрыТекущейСтрокиТаблицыПередВызовом.Вставить("Наименование", ТекущиеДанные.Наименование);
		
		ПараметрыТекущейСтрокиТаблицыПередВызовом = Новый ФиксированнаяСтруктура(ПараметрыТекущейСтрокиТаблицыПередВызовом);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПараметрыТекущейСтрокиПослеВызова(КонтекстВызова = "", ВызыватьИсключение = Истина, Сбрасывать = Истина)
	
	Результат = Неопределено;
	
	ТипПараметровТекущейСтроки = ТипЗнч(ПараметрыТекущейСтрокиТаблицыПередВызовом);
	
	Если ТипПараметровТекущейСтроки = Тип("ФиксированнаяСтруктура") Тогда
		Результат = ОбщегоНазначенияКлиент.СкопироватьРекурсивно(ПараметрыТекущейСтрокиТаблицыПередВызовом);
	Иначе
		ОбщегоНазначенияКлиентСервер.Проверить(Не ВызыватьИсключение,
			НСтр("ru = 'Не установлены параметры текущей строки'"), КонтекстВызова);
	КонецЕсли;
	
	Если Сбрасывать Тогда
		УстановитьПараметрыТекущейСтрокиПередВызовом(Неопределено);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#Область ОбновитьСписокРегламентныхЗаданий

&НаКлиенте
Процедура ВыполнитьОбновлениеСпискаРегламентныхЗаданий() Экспорт
	
	ОбновитьСписокРегламентныхЗаданийНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокРегламентныхЗаданийНаКлиенте(Контекст = Неопределено)
	
	УстановитьПараметрыТекущейСтрокиПередВызовом(Элементы.ТаблицаРегламентныеЗадания.ТекущиеДанные);
	
	ДлительнаяОперация = ОбновитьСписокРегламентныхЗаданийНаСервере();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Заголовок = НСтр("ru = 'Получение списка регламентных заданий'");
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбновитьСписокРегламентныхЗаданийЗавершениеНаКлиенте", 
		ЭтотОбъект, Контекст);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ОбновитьСписокРегламентныхЗаданийНаСервере()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	Возврат ДлительныеОперации.ВыполнитьВФоне("SUI_РегламентныеЗадания.ПолучитьРегламентныеЗадания", 
		Неопределено, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ОбновитьСписокРегламентныхЗаданийЗавершениеНаКлиенте(Результат, Контекст) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Сообщения <> Неопределено Тогда
		
		Для индекс = 0 По Результат.Сообщения.ВГраница() Цикл
			Результат.Сообщения[индекс].Сообщить();
		КонецЦикла;
		
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		
		ПоказатьПредупреждение(, Результат.КраткоеПредставлениеОшибки);
		
	ИначеЕсли Результат.Статус = "Выполнено" Тогда
		
		ОбновитьСписокРегламентныхЗаданийЗавершениеНаСервере(Результат.АдресРезультата);
		
		Для Каждого ЭлементТаблицыРегламентныеЗадания Из ТаблицаРегламентныеЗадания Цикл
			
			ОбновитьДополнительныеДанныеВСтрокеТаблицы(ЭлементТаблицыРегламентныеЗадания);
			
		КонецЦикла;
		
		ДанныеСтрокиПриВызове = ПолучитьПараметрыТекущейСтрокиПослеВызова("ОбновитьСписокРегламентныхЗаданийЗавершениеНаКлиенте", Ложь);
		
		Если ДанныеСтрокиПриВызове <> Неопределено Тогда
			
			ТекущийОтбор = Новый Структура("Ключ, УникальныйИдентификатор");
			ЗаполнитьЗначенияСвойств(ТекущийОтбор, ДанныеСтрокиПриВызове);
			
			НайденныеСтроки = ТаблицаРегламентныеЗадания.НайтиСтроки(ТекущийОтбор);
			
			Если НайденныеСтроки.Количество() = 0 Тогда
				ТекущийОтбор.Удалить("УникальныйИдентификатор");
				НайденныеСтроки = ТаблицаРегламентныеЗадания.НайтиСтроки(ТекущийОтбор);
			КонецЕсли;
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				Элементы.ТаблицаРегламентныеЗадания.ТекущаяСтрока = НайденныеСтроки[0].ПолучитьИдентификатор();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗнч(Контекст) = Тип("Структура") Тогда
		
		Если Контекст.Свойство("ОповещениеОЗавершении") Тогда
			ВыполнитьОбработкуОповещения(Контекст.ОповещениеОЗавершении, (Результат.Статус = "Выполнено"));
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокРегламентныхЗаданийЗавершениеНаСервере(АдресТаблицы)
	
	РегламентныеЗаданияТаблица = ПолучитьИзВременногоХранилища(АдресТаблицы);
	
	РегламентныеЗаданияТаблица.Колонки.Добавить("ПредставлениеОшибки", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	РегламентныеЗаданияТаблица.Колонки.Добавить("ПредставлениеСообщений", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	РегламентныеЗаданияТаблица.Колонки.Добавить("КартинкаРасписание", 
		ОбщегоНазначения.ОписаниеТипаЧисло(1, , ДопустимыйЗнак.Неотрицательный));
	РегламентныеЗаданияТаблица.Колонки.Добавить("КартинкаОшибка", 
		ОбщегоНазначения.ОписаниеТипаЧисло(1, , ДопустимыйЗнак.Неотрицательный));
	РегламентныеЗаданияТаблица.Колонки.Добавить("КартинкаСообщения", 
		ОбщегоНазначения.ОписаниеТипаЧисло(1, , ДопустимыйЗнак.Неотрицательный));
	
	ЗначениеВРеквизитФормы(РегламентныеЗаданияТаблица, "ТаблицаРегламентныеЗадания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДополнительныеДанныеВСтрокеТаблицы(ТекущиеДанные)
	
	Если Не ПустаяСтрока(ТекущиеДанные.КраткоеПредставлениеОшибки) Тогда
		ТекущиеДанные.ПредставлениеОшибки = ТекущиеДанные.КраткоеПредставлениеОшибки;
	ИначеЕсли Не ПустаяСтрока(ТекущиеДанные.ПодробноеПредставлениеОшибки) Тогда
		ТекущиеДанные.ПредставлениеОшибки = ТекущиеДанные.ПодробноеПредставлениеОшибки;
	КонецЕсли;
	
	Если СтрДлина(ТекущиеДанные.ПредставлениеОшибки) > 23 Тогда
		ТекущиеДанные.ПредставлениеОшибки = Лев(ТекущиеДанные.ПредставлениеОшибки, 20) + "...";
	КонецЕсли;
	
	Если ПустаяСтрока(ТекущиеДанные.ПредставлениеОшибки) Тогда
		ТекущиеДанные.КартинкаОшибка = 1;
	КонецЕсли;
	
	Если ТекущиеДанные.СообщенияПользователю.Количество() > 0 Тогда
		ПредставлениеСообщений = СтрШаблон(НСтр("ru = 'Сообщений: %1'"), ТекущиеДанные.СообщенияПользователю.Количество());
	Иначе
		ПредставлениеСообщений = "";
		ТекущиеДанные.КартинкаСообщения = 1;
	КонецЕсли;
	
	ТекущиеДанные.ПредставлениеСообщений = ПредставлениеСообщений;
	
	Если Не ТекущиеДанные.Установлено Тогда
		ТекущиеДанные.ТекущееСостояниеПредставление = "<не установлено>";
	ИначеЕсли Не ТекущиеДанные.Использование Тогда
		ТекущиеДанные.ТекущееСостояниеПредставление = "<выключено>";
	ИначеЕсли ПустаяСтрока(ТекущиеДанные.ТекущееСостояниеПредставление) Тогда
		ТекущиеДанные.ТекущееСостояниеПредставление = "<не определено>";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.Расписание) Тогда
		
		Если ТекущиеДанные.Установлено Тогда
			ТекущиеДанные.Расписание = НСтр("ru = '<не настроено>'");
		КонецЕсли;
		
		ТекущиеДанные.КартинкаРасписание = 1;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область УстановитьРегламентноеЗадание

&НаКлиенте
Процедура УстановитьРегламентноеЗаданиеНаКлиенте()
	
	ТекДанные = Элементы.ТаблицаРегламентныеЗадания.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Выберите регламентное задание!'"));
	ИначеЕсли ТекДанные.Установлено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Регламентное задание уже установлено!'"));
	Иначе
		
		Оповещение = Новый ОписаниеОповещения("УстановитьРегламентноеЗаданиеПодтверждение", ЭтотОбъект, ТекДанные);
		
		ЗаголовокВопроса = НСтр("ru = 'Установка регламентного задания'");
		
		ТекстВопроса = НСтр("ru = 'Вы действительно хотите установить регламентное задание ""%1""?'");
		ТекстВопроса = СтрШаблон(ТекстВопроса, ТекДанные.Наименование);
		
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , , ЗаголовокВопроса);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРегламентноеЗаданиеПодтверждение(Ответ, ТекДанные) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Результат = УстановитьРегламентноеЗаданиеНаСервере(ТекДанные.Ключ);
	
	Если Результат.Выполнено Тогда
		
		ПараметрыСозданногоЗадания = Новый Структура();
		ПараметрыСозданногоЗадания.Вставить("Ключ", ТекДанные.Ключ);
		ПараметрыСозданногоЗадания.Вставить("УникальныйИдентификатор", Результат.УникальныйИдентификатор);
		ПараметрыСозданногоЗадания.Вставить("Установлено", Истина);
		
		Оповещение = Новый ОписаниеОповещения("УстановитьРегламентноеЗаданиеЗавершениеПослеОбновленияСписка", 
			ЭтотОбъект, ПараметрыСозданногоЗадания);
		
		Контекст = Новый Структура();
		Контекст.Вставить("ОповещениеОЗавершении", Оповещение);
		
		ОбновитьСписокРегламентныхЗаданийНаКлиенте(Контекст);
		
	ИначеЕсли Не ПустаяСтрока(Результат.Ошибка) Тогда
		ПоказатьПредупреждение(, Результат.Ошибка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРегламентноеЗаданиеЗавершениеПослеОбновленияСписка(Результат, ПараметрыСозданногоЗадания) Экспорт
	
	Если Не Результат Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСозданногоЗадания.Вставить("Использование", Ложь);
	
	НайденныеСтроки = ТаблицаРегламентныеЗадания.НайтиСтроки(ПараметрыСозданногоЗадания);
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ВключитьРегламентноеЗаданиеПодтверждение", ЭтотОбъект, НайденныеСтроки[0]);
	
	ЗаголовокВопроса = НСтр("ru = 'Включение регламентного задания'");
	
	ТекстВопроса = НСтр("ru = 'Включить регламентное задание ""%1""?'");
	ТекстВопроса = СтрШаблон(ТекстВопроса, НайденныеСтроки[0].Наименование);
	
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , , ЗаголовокВопроса);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция УстановитьРегламентноеЗаданиеНаСервере(Ключ)
	
	Результат = Новый Структура();
	Результат.Вставить("Выполнено", Ложь);
	Результат.Вставить("Ошибка", "");
	
	Попытка
		Результат.Вставить("УникальныйИдентификатор", SUI_РегламентныеЗадания.УстановитьРегламентноеЗаданиеПодсистемы(Ключ));
	Исключение
		Результат.Ошибка = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	Если ЗначениеЗаполнено(Результат.УникальныйИдентификатор) Тогда
		Результат.Выполнено = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область УдалитьРегламентноеЗадание

&НаКлиенте
Процедура УдалитьРегламентноеЗаданиеНаКлиенте()
	
	ТекДанные = Элементы.ТаблицаРегламентныеЗадания.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Выберите регламентное задание!'"));
	ИначеЕсли Не ТекДанные.Установлено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Регламентное задание не установлено!'"));
	Иначе
		
		Оповещение = Новый ОписаниеОповещения("УдалитьРегламентноеЗаданиеПодтверждение", ЭтотОбъект, ТекДанные);
		
		ЗаголовокВопроса = НСтр("ru = 'Удаление регламентного задания'");
		
		ТекстВопроса = НСтр("ru = 'Вы действительно хотите удалить регламентное задание ""%1""?'");
		ТекстВопроса = СтрШаблон(ТекстВопроса, ТекДанные.Наименование);
		
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , , ЗаголовокВопроса);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьРегламентноеЗаданиеПодтверждение(Ответ, ТекДанные) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Результат = УдалитьРегламентноеЗаданиеНаСервере(ТекДанные.Ключ, ТекДанные.УникальныйИдентификатор);
	
	Если Результат.Выполнено Тогда
		ОбновитьСписокРегламентныхЗаданийНаКлиенте();
	ИначеЕсли Не ПустаяСтрока(Результат.Ошибка) Тогда
		ПоказатьПредупреждение(, Результат.Ошибка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция УдалитьРегламентноеЗаданиеНаСервере(Ключ, УникальныйИдентификатор)
	
	Результат = Новый Структура();
	Результат.Вставить("Выполнено", Ложь);
	Результат.Вставить("Ошибка", "");
	
	Попытка
		Результат.Выполнено = SUI_РегламентныеЗадания.УдалитьРегламентноеЗаданиеПодсистемы(Ключ, УникальныйИдентификатор);
	Исключение
		Результат.Ошибка = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ВключитьРегламентноеЗадание

&НаКлиенте
Процедура ВключитьРегламентноеЗаданиеНаКлиенте()
	
	ТекДанные = Элементы.ТаблицаРегламентныеЗадания.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Выберите регламентное задание!'"));
	ИначеЕсли Не ТекДанные.Установлено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Регламентное задание не установлено!'"));
	ИначеЕсли ТекДанные.Использование Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Регламентное задание уже включено!'"));
	Иначе
		
		Оповещение = Новый ОписаниеОповещения("ВключитьРегламентноеЗаданиеПодтверждение", ЭтотОбъект, ТекДанные);
		
		ЗаголовокВопроса = НСтр("ru = 'Включение регламентного задания'");
		
		ТекстВопроса = НСтр("ru = 'Вы действительно хотите включить регламентное задание ""%1""?'");
		ТекстВопроса = СтрШаблон(ТекстВопроса, ТекДанные.Наименование);
		
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , , ЗаголовокВопроса);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьРегламентноеЗаданиеПодтверждение(Ответ, ТекДанные) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Результат = ВключитьРегламентноеЗаданиеНаСервере(ТекДанные.Ключ, ТекДанные.УникальныйИдентификатор);
	
	Если Результат.Выполнено Тогда
		ПодключитьОбработчикОжидания("ВыполнитьОбновлениеСпискаРегламентныхЗаданий", 0.5, Истина);
	ИначеЕсли Не ПустаяСтрока(Результат.Ошибка) Тогда
		ПоказатьПредупреждение(, Результат.Ошибка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВключитьРегламентноеЗаданиеНаСервере(Ключ, УникальныйИдентификатор)
	
	Результат = Новый Структура();
	Результат.Вставить("Выполнено", Ложь);
	Результат.Вставить("Ошибка", "");
	
	Попытка
		
		Данные = Новый Структура();
		Данные.Вставить("Использование", Истина);
		
		Результат.Выполнено = SUI_РегламентныеЗадания.ОбновитьРегламентноеЗаданиеПодсистемы(
			Ключ, УникальныйИдентификатор, Данные);
		
	Исключение
		Результат.Ошибка = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ВыключитьРегламентноеЗадание

&НаКлиенте
Процедура ВыключитьРегламентноеЗаданиеНаКлиенте()
	
	ТекДанные = Элементы.ТаблицаРегламентныеЗадания.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Выберите регламентное задание!'"));
	ИначеЕсли Не ТекДанные.Установлено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Регламентное задание не установлено!'"));
	ИначеЕсли Не ТекДанные.Использование Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Регламентное задание не включено!'"));
	Иначе
		
		Оповещение = Новый ОписаниеОповещения("ВыключитьРегламентноеЗаданиеПодтверждение", ЭтотОбъект, ТекДанные);
		
		ЗаголовокВопроса = НСтр("ru = 'Выключение регламентного задания'");
		
		ТекстВопроса = НСтр("ru = 'Вы действительно хотите выключить регламентное задание ""%1""?'");
		ТекстВопроса = СтрШаблон(ТекстВопроса, ТекДанные.Наименование);
		
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , , ЗаголовокВопроса);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыключитьРегламентноеЗаданиеПодтверждение(Ответ, ТекДанные) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Результат = ВыключитьРегламентноеЗаданиеНаСервере(ТекДанные.Ключ, ТекДанные.УникальныйИдентификатор);
	
	Если Результат.Выполнено Тогда
		ПодключитьОбработчикОжидания("ВыполнитьОбновлениеСпискаРегламентныхЗаданий", 0.5, Истина);
	ИначеЕсли Не ПустаяСтрока(Результат.Ошибка) Тогда
		ПоказатьПредупреждение(, Результат.Ошибка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВыключитьРегламентноеЗаданиеНаСервере(Ключ, УникальныйИдентификатор)
	
	Результат = Новый Структура();
	Результат.Вставить("Выполнено", Ложь);
	Результат.Вставить("Ошибка", "");
	
	Попытка
		
		Данные = Новый Структура();
		Данные.Вставить("Использование", Ложь);
		
		Результат.Выполнено = SUI_РегламентныеЗадания.ОбновитьРегламентноеЗаданиеПодсистемы(
			Ключ, УникальныйИдентификатор, Данные);
		
	Исключение
		Результат.Ошибка = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область НастроитьРасписание

&НаКлиенте
Процедура НастроитьРасписаниеНаКлиенте()
	
	ТекДанные = Элементы.ТаблицаРегламентныеЗадания.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Выберите регламентное задание!'"));
	ИначеЕсли Не ТекДанные.Установлено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Регламентное задание не установлено!'"));
	Иначе
		
		Расписание = ПолучитьРасписаниеРегламентногоЗадания(ТекДанные.Ключ, ТекДанные.УникальныйИдентификатор);
		
		Если Расписание = Неопределено Тогда
			Расписание = Новый РасписаниеРегламентногоЗадания();
		КонецЕсли;
		
		Диалог = Новый ДиалогРасписанияРегламентногоЗадания(Расписание);
		
		Оповещение = Новый ОписаниеОповещения("НастроитьРасписаниеЗавершение", ЭтотОбъект, ТекДанные);
		Диалог.Показать(Оповещение);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРасписаниеРегламентногоЗадания(Ключ, УникальныйИдентификатор)
	
	Возврат SUI_РегламентныеЗадания.ПолучитьРасписаниеРегламентногоЗадания(Ключ, УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура НастроитьРасписаниеЗавершение(НовоеРасписание, ТекДанные) Экспорт
	
	Если НовоеРасписание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Результат = НастроитьРасписаниеЗавершениеНаСервере(ТекДанные.Ключ, ТекДанные.УникальныйИдентификатор, НовоеРасписание);
	
	Если Результат.Выполнено Тогда
		ОбновитьСписокРегламентныхЗаданийНаКлиенте();
	ИначеЕсли Не ПустаяСтрока(Результат.Ошибка) Тогда
		ПоказатьПредупреждение(, Результат.Ошибка);
	КонецЕсли;
			
КонецПроцедуры

&НаСервереБезКонтекста
Функция НастроитьРасписаниеЗавершениеНаСервере(Ключ, УникальныйИдентификатор, Расписание)
	
	Результат = Новый Структура();
	Результат.Вставить("Выполнено", Ложь);
	Результат.Вставить("Ошибка", "");
	
	Попытка
		
		Данные = Новый Структура();
		Данные.Вставить("Расписание", Расписание);
		
		Результат.Выполнено = SUI_РегламентныеЗадания.ОбновитьРегламентноеЗаданиеПодсистемы(
			Ключ, УникальныйИдентификатор, Данные);
		
	Исключение
		Результат.Ошибка = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область НастроитьАварийныйПерезапуск

&НаКлиенте
Процедура НастроитьАварийныйПерезапускНаКлиенте()
	
	ТекДанные = Элементы.ТаблицаРегламентныеЗадания.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Выберите регламентное задание!'"));
	ИначеЕсли Не ТекДанные.Установлено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Регламентное задание не установлено!'"));
	Иначе
		
		ПараметрыНастройкиАварийногоПерезапуска = Новый Структура();
		ПараметрыНастройкиАварийногоПерезапуска.Вставить("КоличествоПовторовПриАварийномЗавершении",
			ТекДанные.КоличествоПовторовПриАварийномЗавершении);
		ПараметрыНастройкиАварийногоПерезапуска.Вставить("ИнтервалПовторовПриАварийномЗавершении", 
			ТекДанные.ИнтервалПовторовПриАварийномЗавершении);
		ПараметрыНастройкиАварийногоПерезапуска.Вставить("ПредставлениеРегламентногоЗадания", ТекДанные.Наименование);
		
		Контекст = Новый Структура();
		Контекст.Вставить("Ключ", ТекДанные.Ключ);
		Контекст.Вставить("УникальныйИдентификатор", ТекДанные.УникальныйИдентификатор);
		
		Оповещение = Новый ОписаниеОповещения("НастроитьАварийныйПерезапускЗавершение", ЭтотОбъект, Контекст);
		
		ОткрытьФорму("Обработка.SUI_РегламентныеЗадания.Форма.НастройкаАварийногоПерезапуска", 
			ПараметрыНастройкиАварийногоПерезапуска, ЭтотОбъект, УникальныйИдентификатор, , , Оповещение);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьАварийныйПерезапускЗавершение(НовыеПараметрыАварийногоПерезапуска, Контекст) Экспорт
	
	Если НовыеПараметрыАварийногоПерезапуска = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Результат = НастроитьАварийныйПерезапускЗавершениеНаСервере(Контекст.Ключ, Контекст.УникальныйИдентификатор, 
		НовыеПараметрыАварийногоПерезапуска);
	
	Если Результат.Выполнено Тогда
		ОбновитьСписокРегламентныхЗаданийНаКлиенте();
	ИначеЕсли Не ПустаяСтрока(Результат.Ошибка) Тогда
		ПоказатьПредупреждение(, Результат.Ошибка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НастроитьАварийныйПерезапускЗавершениеНаСервере(Ключ, УникальныйИдентификатор, ПараметрыАварийногоПерезапуска)
	
	Результат = Новый Структура();
	Результат.Вставить("Выполнено", Ложь);
	Результат.Вставить("Ошибка", "");
	
	Попытка
		Результат.Выполнено = SUI_РегламентныеЗадания.ОбновитьРегламентноеЗаданиеПодсистемы(
			Ключ, УникальныйИдентификатор, ПараметрыАварийногоПерезапуска);
	Исключение
		Результат.Ошибка = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ЗапуститьРегламентноеЗадание

&НаКлиенте
Процедура ЗапуститьРегламентноеЗаданиеНаКлиенте()
	
	ТекДанные = Элементы.ТаблицаРегламентныеЗадания.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Выберите регламентное задание!'"));
	ИначеЕсли Не ТекДанные.Установлено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Регламентное задание не установлено!'"));
	Иначе
		
		Оповещение = Новый ОписаниеОповещения("ЗапуститьРегламентноеЗаданиеПодтверждение", ЭтотОбъект, ТекДанные);
		
		ЗаголовокВопроса = НСтр("ru = 'Запуск регламентного задания'");
		
		ТекстВопроса = НСтр("ru = 'Вы действительно хотите запустить регламентное задание ""%1""?'");
		ТекстВопроса = СтрШаблон(ТекстВопроса, ТекДанные.Наименование);
		
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , , ЗаголовокВопроса);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьРегламентноеЗаданиеПодтверждение(Ответ, ТекДанные) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗапуска = SUI_РегламентныеЗаданияКлиентСервер.ПараметрыОкнаЗапускаРегламентногоЗадания(
		ТекДанные.Ключ, ТекДанные.УникальныйИдентификатор);
	ПараметрыЗапуска.ОжидатьЗавершения = Ложь;
	ПараметрыЗапуска.ТолькоИспользуемые = Ложь;
	ПараметрыЗапуска.ЗакрытьПриОшибке = Ложь;
	ПараметрыЗапуска.ЗакрытьПриУспешномЗавершении = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ЗапуститьРегламентноеЗаданиеЗавершение", ЭтотОбъект, ТекДанные);
	
	SUI_РегламентныеЗаданияКлиент.ЗапуститьРегламентноеЗаданиеВручную(ПараметрыЗапуска, ЭтотОбъект, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьРегламентноеЗаданиеЗавершение(РезультатЗапуска, ТекущиеДанныеПриЗапуске) Экспорт
	
	ПодключитьОбработчикОжидания("ВыполнитьОбновлениеСпискаРегламентныхЗаданий", 1, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОстановитьРегламентноеЗадание

&НаКлиенте
Процедура ОстановитьРегламентноеЗаданиеНаКлиенте()
	
	ТекДанные = Элементы.ТаблицаРегламентныеЗадания.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Выберите регламентное задание!'"));
	ИначеЕсли Не ТекДанные.Установлено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Регламентное задание не установлено!'"));
	Иначе
		
		Оповещение = Новый ОписаниеОповещения("ОстановитьРегламентноеЗаданиеПодтверждение", ЭтотОбъект, ТекДанные);
		
		ЗаголовокВопроса = НСтр("ru = 'Остановка регламентного задания'");
		
		ТекстВопроса = НСтр("ru = 'Вы действительно хотите остановить выполение регламентного задания ""%1""?'");
		ТекстВопроса = СтрШаблон(ТекстВопроса, ТекДанные.Наименование);
		
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , , ЗаголовокВопроса);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОстановитьРегламентноеЗаданиеПодтверждение(Ответ, ТекДанные) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПараметрыТекущейСтрокиПередВызовом(ТекДанные);
	
	ТекстОписанияДлительнойОперации = НСтр("ru = 'Остановка выполнения регламентного задания ""%1""'");
	ТекстОписанияДлительнойОперации = СтрШаблон(ТекстОписанияДлительнойОперации, ТекДанные.Наименование);
	ОтобразитьДлительнуюОперацию(ТекстОписанияДлительнойОперации);
	
	ПодключитьОбработчикОжидания("ОстановитьРегламентноеЗаданиеПродолжить", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОстановитьРегламентноеЗаданиеПродолжить() Экспорт
	
	ДанныеСтрокиПриВызове = ПолучитьПараметрыТекущейСтрокиПослеВызова("ОстановитьРегламентноеЗаданиеПродолжить");
	
	Результат = ОстановитьРегламентноеЗаданиеНаСервере(ДанныеСтрокиПриВызове.Ключ, 
		ДанныеСтрокиПриВызове.УникальныйИдентификатор);
	
	Если Результат.Выполнено Тогда
		ПодключитьОбработчикОжидания("ОстановитьРегламентноеЗаданиеЗавершение", 2, Истина);
	ИначеЕсли Не ПустаяСтрока(Результат.Ошибка) Тогда
		ПоказатьПредупреждение(, Результат.Ошибка);
		СкрытьДлительнуюОперацию();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОстановитьРегламентноеЗаданиеЗавершение() Экспорт
	
	Оповещение = Новый ОписаниеОповещения("ОстановитьРегламентноеЗаданиеЗавершениеПослеОбновленияСписка", ЭтотОбъект);
	
	Контекст = Новый Структура();
	Контекст.Вставить("ОповещениеОЗавершении", Оповещение);
	
	ОбновитьСписокРегламентныхЗаданийНаКлиенте(Контекст);
	
КонецПроцедуры

&НаКлиенте
Процедура ОстановитьРегламентноеЗаданиеЗавершениеПослеОбновленияСписка(Результат, Контекст) Экспорт
	
	СкрытьДлительнуюОперацию();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОстановитьРегламентноеЗаданиеНаСервере(Ключ, УникальныйИдентификатор)
	
	Результат = Новый Структура();
	Результат.Вставить("Выполнено", Ложь);
	Результат.Вставить("Ошибка", "");
	
	Попытка
		
		ПараметрыОстановки = Новый Структура();
		ПараметрыОстановки.Вставить("Ключ", Ключ);
		ПараметрыОстановки.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
		
		SUI_РегламентныеЗадания.ОтменитьВыполнениеРегламентногоЗадания(ПараметрыОстановки);
		
		Результат.Выполнено = Истина;
		
	Исключение
		Результат.Ошибка = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПросмотрОшибкиРегламентногозадания

&НаКлиенте
Процедура ОткрытьПросмотрОшибкиНаКлиенте()
	
	ТекДанные = Элементы.ТаблицаРегламентныеЗадания.ТекущиеДанные;
	
	ТекДанные = Элементы.ТаблицаРегламентныеЗадания.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Выберите регламентное задание!'"));
	ИначеЕсли Не ТекДанные.Установлено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Регламентное задание не установлено!'"));
	ИначеЕсли Не ЗначениеЗаполнено(ТекДанные.КраткоеПредставлениеОшибки) И 
		Не ЗначениеЗаполнено(ТекДанные.ПодробноеПредставлениеОшибки) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Отсутствуют данные об ошибке для просмотра!'"));
	Иначе
		
		ПараметрыПросмотраОшибки = Новый Структура();
		ПараметрыПросмотраОшибки.Вставить("КраткоеПредставлениеОшибки", ТекДанные.КраткоеПредставлениеОшибки);
		ПараметрыПросмотраОшибки.Вставить("ПодробноеПредставлениеОшибки", ТекДанные.ПодробноеПредставлениеОшибки);
		ПараметрыПросмотраОшибки.Вставить("ПредставлениеРегламентногоЗадания", ТекДанные.Наименование);
		
		ОткрытьФорму("Обработка.SUI_РегламентныеЗадания.Форма.ПросмотрОшибки", 
			ПараметрыПросмотраОшибки, ЭтотОбъект, УникальныйИдентификатор);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПросмотрСообщенийРегламентногозадания

&НаКлиенте
Процедура ОткрытьПросмотрСообщенийНаКлиенте()
	
	ТекДанные = Элементы.ТаблицаРегламентныеЗадания.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Выберите регламентное задание!'"));
	ИначеЕсли Не ТекДанные.Установлено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Регламентное задание не установлено!'"));
	ИначеЕсли Не ЗначениеЗаполнено(ТекДанные.СообщенияПользователю) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Отсутствуют сообщения для просмотра!'"));
	Иначе
		
		ПараметрыПросмотраСообщений = Новый Структура();
		ПараметрыПросмотраСообщений.Вставить("СообщенияПользователю", ТекДанные.СообщенияПользователю);
		ПараметрыПросмотраСообщений.Вставить("ПредставлениеРегламентногоЗадания", ТекДанные.Наименование);
		
		ОткрытьФорму("Обработка.SUI_РегламентныеЗадания.Форма.ПросмотрСообщений", 
			ПараметрыПросмотраСообщений, ЭтотОбъект, УникальныйИдентификатор);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОтображатьНеУстановленные

&НаКлиенте
Процедура ОтображатьНеУстановленныеНаКлиенте(ПервыйЗапуск = Истина)
	
	Если Не ПервыйЗапуск Тогда
		Элементы.ТаблицаРегламентныеЗаданияОтображатьНеУстановленные.Пометка = 
			Не Элементы.ТаблицаРегламентныеЗаданияОтображатьНеУстановленные.Пометка;
		СохранитьПризнакОтображенияНеУстановленыхЗаданий(
			Элементы.ТаблицаРегламентныеЗаданияОтображатьНеУстановленные.Пометка);
	КонецЕсли;
	
	Элементы.ТаблицаРегламентныеЗаданияКонтекстноеМенюОтображатьНеУстановленные.Пометка =
		Элементы.ТаблицаРегламентныеЗаданияОтображатьНеУстановленные.Пометка;
	
	Если Не Элементы.ТаблицаРегламентныеЗаданияОтображатьНеУстановленные.Пометка Тогда
		
		Отбор = Новый Структура();
		Отбор.Вставить("Установлено", Истина);
		Отбор = Новый ФиксированнаяСтруктура(Отбор);
		
	Иначе
		Отбор = Неопределено;
	КонецЕсли;
	
	Элементы.ТаблицаРегламентныеЗадания.ОтборСтрок = Отбор;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьПризнакОтображенияНеУстановленыхЗаданий(Значение)
	
	SUI_РегламентныеЗадания.СохранитьПризнакОтображенияНеУстановленныхЗаданий(Значение);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
