
#Область ПрограммныйИнтерфейс

Процедура ВыполнитьПолнуюВыгрузку(МобильноеУстройство) Экспорт
	SUI_МобильныеУстройстваСервер.ВыполнитьПолнуюВыгрузку(МобильноеУстройство);
КонецПроцедуры

Функция ЗапросАвторизацииУстройстваСуществует(ИдентификаторУстройства) Экспорт
	Возврат SUI_МобильныеУстройстваСервер.ЗапросАвторизацииУстройстваСуществует(ИдентификаторУстройства);
КонецФункции

Функция МобильноеУстройствоСуществует(ИдентификаторУстройства) Экспорт
	Возврат SUI_МобильныеУстройстваСервер.МобильноеУстройствоСуществует(ИдентификаторУстройства);
КонецФункции

Функция ПринятьЗапросАвторизацииУстройства(ИдентификаторУстройства) Экспорт
	Возврат SUI_МобильныеУстройстваСервер.ПринятьЗапросАвторизацииУстройства(ИдентификаторУстройства);
КонецФункции

Процедура УдалитьЗапросАвторизацииУстройства(ИдентификаторУстройства) Экспорт
	SUI_МобильныеУстройстваСервер.УдалитьЗапросАвторизации(ИдентификаторУстройства);
КонецПроцедуры

Функция ПолучитьЗапросАвторизации(ИдентификаторУстройства) Экспорт
	Возврат SUI_МобильныеУстройстваСервер.ПолучитьЗапросАвторизации(ИдентификаторУстройства);
КонецФункции

Функция УдалитьВсеЗапросыМобильныхУстройств() Экспорт

	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	SUI_ЗапросыАвторизацииМобильныхУстройств.ИдентификаторУстройства КАК ИдентификаторУстройства
	|ИЗ
	|	РегистрСведений.SUI_ЗапросыАвторизацииМобильныхУстройств КАК SUI_ЗапросыАвторизацииМобильныхУстройств";
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		SUI_МобильныеУстройстваСервер.УдалитьЗапросАвторизации(Выборка.ИдентификаторУстройства);
	КонецЦикла;

КонецФункции 

#КонецОбласти
