
#Область ПрограммныйИнтерфейс

#Область МетодыСобытияПриложения

Процедура ПриНачалеРаботыСистемы() Экспорт
	
	ПараметрыСтартаСеанса = SUI_SimpleВызовСервера.ПараметрыСтартаСеанса();

	SUI_ПараметрыПриложения.Вставить("ПраваРасширенияПриСтарте", ПараметрыСтартаСеанса.ДобавленыПраваНаРасширение);
	SUI_ПараметрыПриложения.Вставить("НомерСеанса", ПараметрыСтартаСеанса.НомерСеанса);
	
	SUI_ПараметрыПриложения.Вставить("ВерсияРасширения", ПараметрыСтартаСеанса.ВерсияРасширения);
	SUI_ПараметрыПриложения.Вставить("ВерсияДанных", ПараметрыСтартаСеанса.ВерсияДанных);
	
	SUI_ПараметрыПриложения.Вставить("ПроверкаОбновленийПриСтарте", ПараметрыСтартаСеанса.ПроверкаОбновленийПриСтарте);
	SUI_ПараметрыПриложения.Вставить("УстановкаПредварительныхВерсий", 
		ПараметрыСтартаСеанса.УстановкаПредварительныхВерсий);
	
	ПодключитьОбработчикОжидания("SUI_ПриНачалеРаботыСистемыПереопределяемый", 0.1, Истина);
	
КонецПроцедуры

Процедура ПриЗавершенииРаботыСистемы() Экспорт
	
	КаталогВспомогательныхБиблиотекИнструментов = SUI_ОбщегоНазначенияКлиент.КаталогВспомогательныхБиблиотекИнструментов();
	Если Не ПустаяСтрока(КаталогВспомогательныхБиблиотекИнструментов) Тогда
		Попытка
			ОписаниеОповещения = Новый ОписаниеОповещения("ПриЗавершенииРаботыСистемыЗавершениеУдаленияФайлов", ЭтотОбъект);
			НачатьУдалениеФайлов(ОписаниеОповещения, КаталогВспомогательныхБиблиотекИнструментов);
		Исключение
			//
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

Процедура ВыполнитьПроверкуСвязиПубликацииИБ(Форма) Экспорт
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ВыполнитьПроверкуСвязиПубликацииИБПослеВводаПароля", ЭтотОбъект);
	
  	ОткрытьФорму("ОбщаяФорма.SUI_АутентификацияВСервисе", , Форма, Форма.УникальныйИдентификатор, , , ОповещениеОЗавершении);
  	
КонецПроцедуры

Функция ПрефиксВПараметрахПриложения(ИмяПараметра) Экспорт
	Возврат SUI_SimpleКлиентСервер.ИмяРасширения() + "." + ИмяПараметра;
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
	
Процедура ОткрытьФормуОбновленияSimple(ДополнительныеПараметры) Экспорт
	
	ОткрытьФорму("Обработка.SUI_ОбновлениеSimple.Форма");
	
КонецПроцедуры

Процедура ВыполнитьПроверкуСвязиПубликацииИБПослеВводаПароля(ДанныеАутентификации, ДополнительныеПараметры) Экспорт
	
	Если ДанныеАутентификации = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РезультатПроверки = SUI_SimpleКлиентСервер.ВыполнитьПроверкуСвязиПубликацииИБ(ДанныеАутентификации);
	
	Если РезультатПроверки.Результат Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатПроверки.ТекстСообщения);
	Иначе
		ПоказатьПредупреждение(, РезультатПроверки.ТекстСообщения, , НСтр("ru = 'Проверка связи'"));
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриНачалеРаботыСистемыПереопределяемыйПродолжить(КонтекстПродолжения, Контекст) Экспорт

	Если SUI_SimpleВызовСервера.ЗапускатьМастерНастроекПриНачалеРаботыСистемы() Тогда
		ОткрытьФормуМастераНастроек();
	КонецЕсли;
	
	SUI_ОбновлениеSimpleКлиент.ВыполнитьПроверкуОбновленийВРепозитории();
	
КонецПроцедуры

Процедура ОткрытьФормуМастераНастроек() Экспорт
	
	ИмяПараметра = ПрефиксВПараметрахПриложения("SUI_МастерНастроек.Форма");
	Форма = ПараметрыПриложения.Получить(ИмяПараметра);
	
	Если Форма = Неопределено Или Не Форма.Открыта() Тогда
		Форма = ОткрытьФорму("Обработка.SUI_МастерНастроек.Форма", , , , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		ПараметрыПриложения.Вставить(ИмяПараметра, Форма);
	Иначе
		Форма.Активизировать();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗавершенииРаботыСистемыЗавершениеУдаленияФайлов(ДополнительныеПараметры) Экспорт
	//
КонецПроцедуры

#КонецОбласти
