
#Область ПрограммныйИнтерфейс

// Проверить наличие прав для работы с регламентными заданиями.
// 
// Параметры:
//  Отказ - Булево - Отказ
//  ВызыватьИсключение - Булево - Вызывать исключение при проверке, иначе сообщение пользователю
Процедура ВыполнитьПроверкуПрав(Отказ, ВызыватьИсключение = Истина) Экспорт
	
	Если Не Пользователи.ЭтоПолноправныйПользователь(, Истина) Тогда
		
		Отказ = Истина;
		
		ТекстОшибки = НСтр("ru = 'Недостаточно прав.'");
		
		Если ВызыватьИсключение Тогда
			ВызватьИсключение ТекстОшибки;
		Иначе
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Получить регламентные задания.
// 
// Параметры:
// 	Параметры - Структура - Параметры для получения регламентных заданий:
// 		* Ключ - Строка - (необяз.) Ключ регламентного задания подсистемы Simple
// 		* Используемые - Булево - (необяз.) Отбор только используемых
// 		* УникальныйИдентификатор - УникальныйИдентификатор - (необяз.) Уникальный идентификатор регламентного задания
// 		* Установленные - Булево - (необяз.) Отбор только установленых
//  АдресРезультата - Строка, Неопределено - Адрес временного хранилища для помещения таблицы значений
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Получить регламентные задания см. ТаблицаРегламентныхЗаданий:
// * Установлено - Булево - Признак установленного регламентного задания.
// * Использование - Булево - Признак использования регламентного задания.
// * Наименование - Строка - Наименование регламентного задания.
// * Ключ - Строка - Ключ регламентного задания.
// * УникальныйИдентификатор - УникальныйИдентификатор - Идентификатор регламентного задания.
// * ИмяМетода - Строка - Имя метода регламентного задания.
// * Расписание - Строка - Представление расписания регламентного задания.
// * КоличествоПовторовПриАварийномЗавершении - Число - Количество повторов регламентного задания при аварийном завершении.
// * ИнтервалПовторовПриАварийномЗавершении - Число - Интервал повторов регламентного задания при аварийном завершении.
// * ИдентификаторФоновогоЗадания - УникальныйИдентификатор - Уникальный идентификатор последнего фонового задания.
// * НаименованиеФоновогоЗадания - Строка - Наименование последнего фонового задания.
// * ИмяМетодаФоновогоЗадания - Строка - Имя метода последнего фонового задания.
// * ПоследнийЗапускНачало - Дата - Дата запуска последнего фонового задания.
// * ПоследнийЗапускКонец - Дата - Дата завершения выполнения последнего фонового задания.
// * ТекущееСостояние - СостояниеФоновогоЗадания - Текущее состояние последнего фонового задания.
// * ТекущееСостояниеПредставление - Строка - Представление текущего состояния последнего фонового задания.
// * КраткоеПредставлениеОшибки - Строка - Краткое представление ошибки выполнения последнего фонового задания.
// * ПодробноеПредставлениеОшибки - Строка - Подробное представление ошибки выполнения последнего фонового задания.
// * СообщенияПользователю - Массив из СообщениеПользователю - Сообщения пользователю из последнего фонового задания.
Функция ПолучитьРегламентныеЗадания(Знач Параметры, АдресРезультата = Неопределено) Экспорт
	
	ТаблицаРегламентныхЗаданий = ТаблицаРегламентныхЗаданий();
	
	Отказ = Ложь;
	ВыполнитьПроверкуПрав(Отказ, Ложь);
	
	Если ТипЗнч(Параметры) <> Тип("Структура") Тогда
		Параметры = Новый Структура();
	КонецЕсли;
	
	Если Не Отказ Тогда
		
		РегламентныеЗаданияПодсистемы = ПолучитьРегламентныеЗаданияПодсистемы();
		
		ОтборРегламентныхЗаданий = Новый Структура();
		
		Если Параметры.Свойство("Ключ") Тогда
			ОтборРегламентныхЗаданий.Вставить("Ключ", Параметры.Ключ);
		КонецЕсли;
		
		Если Параметры.Свойство("Используемые") Тогда
			
			ОписаниеТипаБулево = Новый ОписаниеТипов("Булево");
			ОтборРегламентныхЗаданий.Вставить("Использование", ОписаниеТипаБулево.ПривестиЗначение(Параметры.Используемые));
			
		КонецЕсли;
		
		Если Параметры.Свойство("УникальныйИдентификатор") Тогда
			ОтборРегламентныхЗаданий.Вставить("УникальныйИдентификатор", Параметры.УникальныйИдентификатор);
		КонецЕсли;
		
		Если ОтборРегламентныхЗаданий.Количество() = 0 Тогда
			ОтборРегламентныхЗаданий = Неопределено;
		КонецЕсли;
		
		РегламентныеЗаданияВСистеме = ПолучитьРегламентныеЗаданияСистемы(ОтборРегламентныхЗаданий);
		
		Для индекс = 0 По РегламентныеЗаданияВСистеме.ВГраница() Цикл
			
			ПараметрыОтбора = Новый Структура();
			ПараметрыОтбора.Вставить("Ключ", РегламентныеЗаданияВСистеме[индекс].Ключ);
			
			НайденноеРегламентноеЗаданиеПодсистемы = РегламентныеЗаданияПодсистемы.НайтиСтроки(ПараметрыОтбора);
			
			Если НайденноеРегламентноеЗаданиеПодсистемы.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаТаблицы 							= ТаблицаРегламентныхЗаданий.Добавить();
			СтрокаТаблицы.Установлено 				= Истина;
			СтрокаТаблицы.Ключ 						= РегламентныеЗаданияВСистеме[индекс].Ключ;
			СтрокаТаблицы.УникальныйИдентификатор 	= РегламентныеЗаданияВСистеме[индекс].УникальныйИдентификатор;
			СтрокаТаблицы.Наименование 				= РегламентныеЗаданияВСистеме[индекс].Наименование;
			СтрокаТаблицы.Использование 			= РегламентныеЗаданияВСистеме[индекс].Использование;
			СтрокаТаблицы.Расписание 				= РегламентныеЗаданияВСистеме[индекс].Расписание;
			
			СтрокаТаблицы.КоличествоПовторовПриАварийномЗавершении = 
				РегламентныеЗаданияВСистеме[индекс].КоличествоПовторовПриАварийномЗавершении;
			СтрокаТаблицы.ИнтервалПовторовПриАварийномЗавершении = 
				РегламентныеЗаданияВСистеме[индекс].ИнтервалПовтораПриАварийномЗавершении;
			
			ПоследнееФоновоеЗадание = ПолучитьПоследнееФоновоеЗадание(РегламентныеЗаданияВСистеме[индекс]);
			
			Если ПоследнееФоновоеЗадание <> Неопределено Тогда
				
				СтрокаТаблицы.ИдентификаторФоновогоЗадания 	= ПоследнееФоновоеЗадание.УникальныйИдентификатор;
				СтрокаТаблицы.НаименованиеФоновогоЗадания 	= ПоследнееФоновоеЗадание.Наименование;
				СтрокаТаблицы.ИмяМетодаФоновогоЗадания 		= ПоследнееФоновоеЗадание.ИмяМетода;
				СтрокаТаблицы.ПоследнийЗапускНачало 		= ПоследнееФоновоеЗадание.Начало;
				СтрокаТаблицы.ПоследнийЗапускКонец 			= ПоследнееФоновоеЗадание.Конец;
				СтрокаТаблицы.ТекущееСостояние 				= ПоследнееФоновоеЗадание.Состояние;
				СтрокаТаблицы.СообщенияПользователю 		= ПоследнееФоновоеЗадание.ПолучитьСообщенияПользователю(Ложь);
				
				Если ПоследнееФоновоеЗадание.ИнформацияОбОшибке <> Неопределено Тогда
					
					СтрокаТаблицы.КраткоеПредставлениеОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(
						ПоследнееФоновоеЗадание.ИнформацияОбОшибке);
					СтрокаТаблицы.ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(
						ПоследнееФоновоеЗадание.ИнформацияОбОшибке);
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.ТекущееСостояние) Тогда
				СтрокаТаблицы.ТекущееСостояниеПредставление = Строка(СтрокаТаблицы.ТекущееСостояние);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.ПоследнийЗапускНачало) И
				ЗначениеЗаполнено(СтрокаТаблицы.ПоследнийЗапускКонец) Тогда
				
				СтрокаТаблицы.ЗатраченноеВремя = SUI_ОбщегоНазначенияКлиентСервер.ПолучитьПредставлениеРазницыВремени(
					СтрокаТаблицы.ПоследнийЗапускКонец - СтрокаТаблицы.ПоследнийЗапускНачало);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если (Не Параметры.Свойство("Установленные") Или Не Параметры.Установленные) И
			(ОтборРегламентныхЗаданий = Неопределено Или 
			Не ОтборРегламентныхЗаданий.Свойство("Использование") Или
			Не ОтборРегламентныхЗаданий.Использование) Тогда
			
			Для Каждого РегламентноеЗаданиеПодсистемы Из РегламентныеЗаданияПодсистемы Цикл
				
				Если ОтборРегламентныхЗаданий <> Неопределено И 
					ОтборРегламентныхЗаданий.Свойство("Ключ") И 
					ОтборРегламентныхЗаданий.Ключ <> РегламентноеЗаданиеПодсистемы.Ключ Тогда
					Продолжить;
				КонецЕсли;
				
				Если ТаблицаРегламентныхЗаданий.Найти(РегламентноеЗаданиеПодсистемы.Ключ, "Ключ") = Неопределено Тогда
					
					СтрокаТаблицы = ТаблицаРегламентныхЗаданий.Добавить();
					СтрокаТаблицы.Ключ = РегламентноеЗаданиеПодсистемы.Ключ;
					СтрокаТаблицы.Наименование = РегламентноеЗаданиеПодсистемы.Наименование;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если Параметры.Свойство("Установленные") Тогда
			
			ТекущийОтбор = Новый Структура();
			ТекущийОтбор.Вставить("Установлено", Параметры.Установленные);
			ТаблицаРегламентныхЗаданий = ТаблицаРегламентныхЗаданий.Скопировать(ТекущийОтбор);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если АдресРезультата <> Неопределено Тогда
		ПоместитьВоВременноеХранилище(ТаблицаРегламентныхЗаданий, АдресРезультата);
	КонецЕсли;
	
	Возврат ТаблицаРегламентныхЗаданий;
	
КонецФункции

// Возвращает расписание регламентного задания.
// Перед вызовом требуется иметь право администрирования или УстановитьПривилегированныйРежим.
//
// В модели сервиса работает с регламентными заданиями платформы, а не с заданиями очереди,
// одинаково как в разделенном, так и в неразделенном режимах.
//
// Параметры:
// 	РегламентноеЗаданиеПодсистемыИлиКлюч - СтрокаТаблицыЗначений, Строка - Строка таблицы значений см. ПолучитьРегламентныеЗаданияПодсистемы 
//  																		или ключ регламентного задания.
//  УникальныйИдентификатор - УникальныйИдентификатор - идентификатор регламентного задания.
//
//  ВСтруктуре    - Булево - если Истина, тогда расписание будет преобразовано
//                  в структуру, которую можно передать на клиент.
// 
// Возвращаемое значение:
//  РасписаниеРегламентногоЗадания, Структура, Неопределено - структура содержит те же свойства, что и расписание.
// 
Функция ПолучитьРасписаниеРегламентногоЗадания(Знач РегламентноеЗаданиеПодсистемыИлиКлюч, 
	УникальныйИдентификатор, Знач ВСтруктуре = Ложь) Экспорт
	
	Отказ = Ложь;
	ВыполнитьПроверкуПрав(Отказ, Ложь);
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РегламентноеЗаданиеПодсистемы = РегламентноеЗаданиеПодсистемыПоПараметру(РегламентноеЗаданиеПодсистемыИлиКлюч, 
		"ПолучитьРасписаниеРегламентногоЗадания");
	
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("Ключ", РегламентноеЗаданиеПодсистемы.Ключ);
	ПараметрыОтбора.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
	
	НайденныеРегламентныеЗадания = ПолучитьРегламентныеЗаданияСистемы(ПараметрыОтбора);
	
	ОбщегоНазначенияКлиентСервер.Проверить(НайденныеРегламентныеЗадания.Количество() > 0,
		НСтр("ru = 'Не найдено установленное регламентное задание'"),
		"ПолучитьРасписаниеРегламентногоЗадания");
	
	Если ВСтруктуре Тогда
		//@skip-check constructor-function-return-section
		Возврат ОбщегоНазначенияКлиентСервер.РасписаниеВСтруктуру(НайденныеРегламентныеЗадания[0].Расписание);
	КонецЕсли;
	
	Возврат НайденныеРегламентныеЗадания[0].Расписание;
	
КонецФункции

// Установить регламентное задание подсистемы.
// 
// Параметры:
//  РегламентноеЗаданиеПодсистемыИлиКлюч - СтрокаТаблицыЗначений, Строка - Строка таблицы значений см. ПолучитьРегламентныеЗаданияПодсистемы 
//  																		или ключ регламентного задания.
// 
// Возвращаемое значение:
//  Булево - Установить регламентное задание подсистемы
Функция УстановитьРегламентноеЗаданиеПодсистемы(Знач РегламентноеЗаданиеПодсистемыИлиКлюч) Экспорт
	
	Отказ = Ложь;
	ВыполнитьПроверкуПрав(Отказ, Ложь);
	
	Если Отказ Тогда
		Возврат ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор();
	КонецЕсли;
	
	РегламентноеЗаданиеПодсистемы = РегламентноеЗаданиеПодсистемыПоПараметру(РегламентноеЗаданиеПодсистемыИлиКлюч, 
		"УстановитьРегламентноеЗаданиеПодсистемы");
	
	ОбщегоНазначенияКлиентСервер.Проверить(Не ПустаяСтрока(РегламентноеЗаданиеПодсистемы.Наименование),
		НСтр("ru = 'Не заполнено наименование регламентного задания подсистемы'"),
		"УстановитьРегламентноеЗаданиеПодсистемы");
	
	ОбщегоНазначенияКлиентСервер.Проверить(Не ПустаяСтрока(РегламентноеЗаданиеПодсистемы.ИмяМетода),
		НСтр("ru = 'Не заполнено имя метода регламентного задания подсистемы'"),
		"УстановитьРегламентноеЗаданиеПодсистемы");
	
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("Ключ", РегламентноеЗаданиеПодсистемы.Ключ);
	
	ОбщегоНазначенияКлиентСервер.Проверить(ПолучитьРегламентныеЗаданияСистемы(ПараметрыОтбора).Количество() = 0,
		НСтр("ru = 'Регламентное задание подсистемы уже установлено'"),
		"УстановитьРегламентноеЗаданиеПодсистемы");
	
	НовоеРегламентноеЗадание = СоздатьРегламентноеЗадание(РегламентноеЗаданиеПодсистемы.Ключ,
		РегламентноеЗаданиеПодсистемы.Наименование,
		РегламентноеЗаданиеПодсистемы.Использование,
		РегламентноеЗаданиеПодсистемы.Расписание,
		РегламентноеЗаданиеПодсистемы.КоличествоПовторовПриАварийномЗавершении,
		РегламентноеЗаданиеПодсистемы.ИнтервалПовтораПриАварийномЗавершении);
	
	Возврат НовоеРегламентноеЗадание.УникальныйИдентификатор;
	
КонецФункции

// Обновить регламентное задание подсистемы.
// 
// Параметры:
//  РегламентноеЗаданиеПодсистемыИлиКлюч - СтрокаТаблицыЗначений, Строка - Строка таблицы значений см. ПолучитьРегламентныеЗаданияПодсистемы 
//  																		или ключ регламентного задания.
//  УникальныйИдентификатор - УникальныйИдентификатор - Уникальный идентификатор регламентного задания
//  ОбновляемыеДанные - Структура - Обновляемые данные:
//  	* Использование - Булево - Признак использования регламентного задания.
//  	* Наименование - Строка - Наименование регламентного задания.
//  	* Расписание - РасписаниеРегламентногоЗадания - Расписание регламентного задания.
//  	* КоличествоПовторовПриАварийномЗавершении - Число - Количество повторов регламентного задания при аварийном завершении.
//  	* ИнтервалПовтораПриАварийномЗавершении - Число - Интервал повторов регламентного задания при аварийном завершении.
// 
// Возвращаемое значение:
//  Булево - Обновить регламентное задание подсистемы
Функция ОбновитьРегламентноеЗаданиеПодсистемы(Знач РегламентноеЗаданиеПодсистемыИлиКлюч, УникальныйИдентификатор, ОбновляемыеДанные) Экспорт
	
	Отказ = Ложь;
	ВыполнитьПроверкуПрав(Отказ, Ложь);
	
	Если Отказ Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РегламентноеЗаданиеПодсистемы = РегламентноеЗаданиеПодсистемыПоПараметру(РегламентноеЗаданиеПодсистемыИлиКлюч, 
		"ОбновитьРегламентноеЗаданиеПодсистемы");
	
	ОбщегоНазначенияКлиентСервер.Проверить(Не ПустаяСтрока(РегламентноеЗаданиеПодсистемы.Наименование),
		НСтр("ru = 'Не заполнено наименование регламентного задания подсистемы'"),
		"ОбновитьРегламентноеЗаданиеПодсистемы");
	
	ОбщегоНазначенияКлиентСервер.Проверить(Не ПустаяСтрока(РегламентноеЗаданиеПодсистемы.ИмяМетода),
		НСтр("ru = 'Не заполнено имя метода регламентного задания подсистемы'"),
		"ОбновитьРегламентноеЗаданиеПодсистемы");
	
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("Ключ", РегламентноеЗаданиеПодсистемы.Ключ);
	ПараметрыОтбора.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
	
	НайденныеРегламентныеЗадания = ПолучитьРегламентныеЗаданияСистемы(ПараметрыОтбора);
	
	ОбщегоНазначенияКлиентСервер.Проверить(НайденныеРегламентныеЗадания.Количество() > 0,
		НСтр("ru = 'Не найдено установленное регламентное задание'"),
		"ОбновитьРегламентноеЗаданиеПодсистемы");
	
	РазрешенныеРеквизитыКОбновлению = Новый Массив();
	РазрешенныеРеквизитыКОбновлению.Добавить("Использование");
	РазрешенныеРеквизитыКОбновлению.Добавить("Наименование");
	РазрешенныеРеквизитыКОбновлению.Добавить("Расписание");
	РазрешенныеРеквизитыКОбновлению.Добавить("КоличествоПовторовПриАварийномЗавершении");
	РазрешенныеРеквизитыКОбновлению.Добавить("ИнтервалПовтораПриАварийномЗавершении");
	
	ОбновляемыеДанныеЭталон = Новый Структура();
	
	Для Каждого ЭлементОбновляемыхДанных Из ОбновляемыеДанные Цикл
		
		Если РазрешенныеРеквизитыКОбновлению.Найти(ЭлементОбновляемыхДанных.Ключ) <> Неопределено Тогда
			ОбновляемыеДанныеЭталон.Вставить(ЭлементОбновляемыхДанных.Ключ, ЭлементОбновляемыхДанных.Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	Если ОбновляемыеДанныеЭталон.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЗаданияКОтменеВыполнения = Новый Массив();
	
	Попытка
		
		УстановитьПривилегированныйРежим(Истина);
		
		Для индекс = 0 По НайденныеРегламентныеЗадания.ВГраница() Цикл
			
			Если ОбновляемыеДанныеЭталон.Свойство("Использование") И
				Не ОбновляемыеДанныеЭталон.Использование И
				НайденныеРегламентныеЗадания[индекс].Использование Тогда
				
				ПараметрыОтмены = Новый Структура();
				ПараметрыОтмены.Вставить("Ключ", РегламентноеЗаданиеПодсистемы.Ключ);
				ПараметрыОтмены.Вставить("УникальныйИдентификатор", НайденныеРегламентныеЗадания[индекс].УникальныйИдентификатор);
				ЗаданияКОтменеВыполнения.Добавить(ПараметрыОтмены);
				
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(НайденныеРегламентныеЗадания[индекс], ОбновляемыеДанныеЭталон);
			НайденныеРегламентныеЗадания[индекс].Записать();
			
		КонецЦикла;
		
	Исключение
		Ошибка = ИнформацияОбОшибке();
		ТекстОшибки = НСтр("ru = 'Ошибка обновлении данных регламентного задания подсистемы!'");
		ЗаписатьОшибку(РегламентноеЗаданиеПодсистемы.Ключ, СтрШаблон("%1
		|%2", ТекстОшибки, ОбработкаОшибок.ПодробноеПредставлениеОшибки(Ошибка)));
		ВызватьИсключение(ТекстОшибки, , , , Ошибка);
	КонецПопытки;
	
	Для индекс = 0 По ЗаданияКОтменеВыполнения.ВГраница() Цикл
		ОтменитьВыполнениеРегламентногоЗадания(ЗаданияКОтменеВыполнения[индекс]);
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

// Удалить регламентное задание подсистемы.
// 
// Параметры:
//  РегламентноеЗаданиеПодсистемыИлиКлюч - СтрокаТаблицыЗначений, Строка - Строка таблицы значений см. ПолучитьРегламентныеЗаданияПодсистемы 
//  																		или ключ регламентного задания.
//  УникальныйИдентификатор - УникальныйИдентификатор - Уникальный идентификатор регламентного задания.
// 
// Возвращаемое значение:
//  Булево - Удалить регламентное задание подсистемы
Функция УдалитьРегламентноеЗаданиеПодсистемы(Знач РегламентноеЗаданиеПодсистемыИлиКлюч, УникальныйИдентификатор) Экспорт
	
	Отказ = Ложь;
	ВыполнитьПроверкуПрав(Отказ, Ложь);
	
	Если Отказ Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РегламентноеЗаданиеПодсистемы = РегламентноеЗаданиеПодсистемыПоПараметру(РегламентноеЗаданиеПодсистемыИлиКлюч, 
		"УдалитьРегламентноеЗаданиеПодсистемы");
	
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("Ключ", РегламентноеЗаданиеПодсистемы.Ключ);
	ПараметрыОтбора.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
	
	НайденныеРегламентныеЗадания = ПолучитьРегламентныеЗаданияСистемы(ПараметрыОтбора);
	
	ОбщегоНазначенияКлиентСервер.Проверить(НайденныеРегламентныеЗадания.Количество() > 0,
		НСтр("ru = 'Не найдено установленное регламентное задание'"),
		"УдалитьРегламентноеЗаданиеПодсистемы");
	
	Попытка
		
		УстановитьПривилегированныйРежим(Истина);
		
		Для индекс = 0 По НайденныеРегламентныеЗадания.ВГраница() Цикл
			НайденныеРегламентныеЗадания[индекс].Удалить();
		КонецЦикла;
		
	Исключение
		Ошибка = ИнформацияОбОшибке();
		ТекстОшибки = НСтр("ru = 'Ошибка удаления регламентного задания подсистемы!'");
		ЗаписатьОшибку(РегламентноеЗаданиеПодсистемы.Ключ, СтрШаблон("%1
		|%2", ТекстОшибки, ОбработкаОшибок.ПодробноеПредставлениеОшибки(Ошибка)));
		ВызватьИсключение(ТекстОшибки, , , , Ошибка);
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

// Выполнить регламентное задание вручную.
// 
// Параметры:
//  Ключ - Строка - Ключ регламентного задания подсистемы
//  УникальныйИдентификатор - УникальныйИдентификатор - Уникальный идентификатор регламентного задания
//  ТолькоИспользуемые - Булево - Только используемые
// 
// Возвращаемое значение:
//  Структура - Структура сведений запуска регламентного задания см.СтруктураСведенийЗапускаРегламентногоЗадания:
// * ЗапускВыполнен - Булево - Признак выполнения запуска
// * УжеВыполняется - Булево - Признак уже выполняющегося
// * Выполняется - Булево - Признак выполнения
// * Состояние - Строка - Состояние выполнения
// * Ошибка - Строка - Краткое описание ошибки
// * ИдентификаторЗадания - УникальныйИдентификатор, Неопределено - Идентификатор регламентного задания
// * НаименованиеЗадания - Строка - Наименование регламентного задания
// * НаименованиеФоновогоЗадания - Строка - Наименование фонового задания
// * ИдентификаторФоновогоЗадания - УникальныйИдентификатор, Неопределено - Идентификатор фонового задания
// * ДатаЗапуска - Дата - Дата запуска фонового задания
// * ДатаЗавершения - Дата - Дата завершения фонового задания
// * ЗатрченноеВремя - Число - Затраченное время на выполнение фонового задания
// * ЗатрченноеВремяПредставление - Строка - Пердставление затраченного времени на выполнение фонового задания 
Функция ВыполнитьРегламентноеЗаданиеВручную(Ключ, УникальныйИдентификатор, ТолькоИспользуемые) Экспорт
	
	РезультатЗапуска = СтруктураСведенийЗапускаРегламентногоЗадания();
	
	Попытка
		Отказ = Ложь;
		ВыполнитьПроверкуПрав(Отказ);
	Исключение
		РезультатЗапуска.Ошибка = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат РезультатЗапуска;
	КонецПопытки;
	
	#Если ВнешнееСоединение Тогда
		ОбщегоНазначенияКлиентСервер.Проверить(Не ОбщегоНазначения.ИнформационнаяБазаФайловая(),
		НСтр("ru = 'Во внешнем соединении файловой информационной базы данных невозможно запустить регламентное задание вручную!'"));
	#КонецЕсли
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ПолучитьРегламентныеЗаданияПодсистемы(Ключ).Количество() <> 1 Тогда
		РезультатЗапуска.Ошибка = НСтр("ru = 'По ключу не найдено регламентное задание подсистемы!'");
		Возврат РезультатЗапуска;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("Ключ", Ключ);
	
	Если ТипЗнч(УникальныйИдентификатор) = Тип("УникальныйИдентификатор") И 
		ЗначениеЗаполнено(УникальныйИдентификатор) Тогда
		ПараметрыОтбора.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
	КонецЕсли;
	
	Задания = ПолучитьРегламентныеЗаданияСистемы(ПараметрыОтбора);
	
	Если Задания.Количество() = 0 Тогда
		РезультатЗапуска.Ошибка = НСтр("ru = 'Не удалось найти регламентное задание!'");
		Возврат РезультатЗапуска;
	КонецЕсли;
	
	Задание = Задания[0];
	РезультатЗапуска.НаименованиеЗадания = Задание.Наименование;
	РезультатЗапуска.ИдентификаторЗадания = Задание.УникальныйИдентификатор;
	
	Если ТолькоИспользуемые И Не Задание.Использование Тогда
		
		Для индекс = 1 По Задания.ВГраница() Цикл
			
			Задание = Задания[индекс];
			РезультатЗапуска.НаименованиеЗадания = Задание.Наименование;
			РезультатЗапуска.ИдентификаторЗадания = Задание.УникальныйИдентификатор;
			
			Если Задание.Использование Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если Не Задание.Использование Тогда
			РезультатЗапуска.Ошибка = НСтр("ru = 'Регламентное задание не используется!'");
			Возврат РезультатЗапуска;
		КонецЕсли;
		
	КонецЕсли;
	
	ФоновоеЗадание = ПолучитьПоследнееФоновоеЗадание(Задание);
	
	Если ФоновоеЗадание = Неопределено Или ФоновоеЗадание.Состояние <> СостояниеФоновогоЗадания.Активно Тогда
		
		Попытка
			
			ФоновоеЗадание = РасширенияКонфигурации.ВыполнитьФоновоеЗаданиеСРасширениямиБазыДанных(
				Задание.Метаданные.ИмяМетода, 
				Задание.Параметры, 
				Строка(Задание.УникальныйИдентификатор), 
				СтрШаблон(НСтр("ru = 'Запуск вручную: %1'"), Задание.Наименование));
			
			РезультатЗапуска.ЗапускВыполнен = Истина;
			
		Исключение
			Ошибка = ИнформацияОбОшибке();
			ШаблонОшибки = НСтр("ru = 'Не удалось запустить регламентное задание ""%1"".
			|%2'");
			ЗаписатьОшибку(Задание.Ключ, СтрШаблон(ШаблонОшибки, Задание.Наименование,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(Ошибка)));
			РезультатЗапуска.Ошибка = СтрШаблон(ШаблонОшибки, Задание.Наименование,
				ОбработкаОшибок.КраткоеПредставлениеОшибки(Ошибка));
			Возврат РезультатЗапуска;
		КонецПопытки;
		
	КонецЕсли;
	
	СведенияОЗапуске = ПолучитьСведенияОЗапускеЗадания(ФоновоеЗадание);
	
	РезультатЗапуска.Выполняется = СведенияОЗапуске.Выполняется;
	РезультатЗапуска.УжеВыполняется = СведенияОЗапуске.УжеВыполняется;
	РезультатЗапуска.ИдентификаторФоновогоЗадания = СведенияОЗапуске.ИдентификаторФоновогоЗадания;
	РезультатЗапуска.НаименованиеФоновогоЗадания = СведенияОЗапуске.НаименованиеФоновогоЗадания;
	РезультатЗапуска.Состояние = СведенияОЗапуске.Состояние;
	РезультатЗапуска.ДатаЗапуска = СведенияОЗапуске.ДатаЗапуска;
	РезультатЗапуска.ДатаЗавершения = СведенияОЗапуске.ДатаЗавершения;
	РезультатЗапуска.ЗатрченноеВремя = СведенияОЗапуске.ЗатрченноеВремя;
	РезультатЗапуска.ЗатрченноеВремяПредставление = СведенияОЗапуске.ЗатрченноеВремяПредставление;
	
	Возврат РезультатЗапуска;
	
КонецФункции

// Отменить выполнение регламентного задания.
// 
// Параметры:
//  Параметры - Структура - Параметры для отмены:
//		* Ключ - Строка - Ключ регламентного задания подсистемы
//		* ИдентификаторФоновогоЗадания - УникальныйИдентификатор - Идентификатор фонового задания
//		* УникальныйИдентификатор - УникальныйИдентификатор - Идентификатор регламентного задания
Процедура ОтменитьВыполнениеРегламентногоЗадания(Параметры) Экспорт
	
	Отказ = Ложь;
	ВыполнитьПроверкуПрав(Отказ);
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОбщегоНазначенияКлиентСервер.Проверить(
		ПолучитьРегламентныеЗаданияПодсистемы(Параметры.Ключ).Количество() = 1,
		НСтр("ru = 'По ключу не найдено регламентное задание подсистемы!'"));
	
	Если Параметры.Свойство("ИдентификаторФоновогоЗадания") Тогда
		
		ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(Параметры.ИдентификаторФоновогоЗадания);
		
		Если ФоновоеЗадание = Неопределено Или
			ФоновоеЗадание.Состояние <> СостояниеФоновогоЗадания.Активно Тогда
			Возврат;
		КонецЕсли;
		
		Если СтрНачинаетсяС(ФоновоеЗадание.Наименование, "Запуск вручную: ") И
			СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ФоновоеЗадание.Ключ) Тогда
			
			УстановитьПривилегированныйРежим(Истина);
			Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(
				Новый УникальныйИдентификатор(ФоновоеЗадание.Ключ));
			УстановитьПривилегированныйРежим(Ложь);
			
			Если Не ЭтоРегламентноеЗаданиеSimple(Задание) Тогда
				Возврат;
			КонецЕсли;
			
		КонецЕсли;
		
		ДлительныеОперации.ОтменитьВыполнениеЗадания(ФоновоеЗадание.УникальныйИдентификатор);
		
	ИначеЕсли Параметры.Свойство("УникальныйИдентификатор") Тогда
		
		ПараметрыОтбора = Новый Структура();
		ПараметрыОтбора.Вставить("Ключ", Параметры.Ключ);
		ПараметрыОтбора.Вставить("УникальныйИдентификатор", Параметры.УникальныйИдентификатор);
		
		Задания = ПолучитьРегламентныеЗаданияСистемы(ПараметрыОтбора);
		
		Если Задания.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		Для Счетчик = 1 По 2 Цикл
			
			ТекущийОтбор = Новый Структура();
			ТекущийОтбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
			ДобавитьОтборФоновыхЗаданийПоРегламентномуЗаданию(ТекущийОтбор, Задания[0], ?(Счетчик = 1, Истина, Ложь));
			
			АктивныеФоновыеЗадания = ФоновыеЗадания.ПолучитьФоновыеЗадания(ТекущийОтбор);
			
			Для индекс = 0 По АктивныеФоновыеЗадания.ВГраница() Цикл
				ДлительныеОперации.ОтменитьВыполнениеЗадания(АктивныеФоновыеЗадания[индекс].УникальныйИдентификатор);
			КонецЦикла;
			
		КонецЦикла;
		
	Иначе
		ВызватьИсключение НСтр("ru = 'Не переданны параметры для остановки выполнения регламентного задания.'");
	КонецЕсли;
	
КонецПроцедуры

// Получить информацию о фоновом задании.
// 
// Параметры:
//  ИдентификаторИлиФоновоеЗадание - УникальныйИдентификатор, ФоновоеЗадание - Идентификатор фонового задания или фоновое задание
// 
// Возвращаемое значение:
//  Структура - Структура сведений запуска регламентного задания см.СтруктураСведенийЗапускаРегламентногоЗадания:
// * ЗапускВыполнен - Булево - Признак выполнения запуска
// * УжеВыполняется - Булево - Признак уже выполняющегося
// * Выполняется - Булево - Признак выполнения
// * Состояние - Строка - Состояние выполнения
// * Ошибка - Строка - Краткое описание ошибки
// * ИдентификаторЗадания - УникальныйИдентификатор, Неопределено - Идентификатор регламентного задания
// * НаименованиеЗадания - Строка - Наименование регламентного задания
// * НаименованиеФоновогоЗадания - Строка - Наименование фонового задания
// * ИдентификаторФоновогоЗадания - УникальныйИдентификатор, Неопределено - Идентификатор фонового задания
// * ДатаЗапуска - Дата - Дата запуска фонового задания
// * ДатаЗавершения - Дата - Дата завершения фонового задания
// * ЗатрченноеВремя - Число - Затраченное время на выполнение фонового задания
// * ЗатрченноеВремяПредставление - Строка - Пердставление затраченного времени на выполнение фонового задания 
Функция ПолучитьИнформациюОФоновомЗадании(ИдентификаторИлиФоновоеЗадание) Экспорт
	
	Отказ = Ложь;
	ВыполнитьПроверкуПрав(Отказ);
	
	Возврат ПолучитьСведенияОЗапускеЗадания(ИдентификаторИлиФоновоеЗадание);
	
КонецФункции

// Получить признак отображения не установленных заданий.
// 
// Возвращаемое значение:
//  Неопределено, Булево - Получить признак отображения не установленных заданий или Неопределено если настройка отсутствует
Функция ПолучитьПризнакОтображенияНеУстановленныхЗаданий() Экспорт
	
	ПризнакОтображения = SUI_ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		КлючОбщейНастройкиПризнакОтображенияНеУстановленныхЗаданий());
	
	Если ПризнакОтображения <> Неопределено Тогда
		ОписаниеТипаБулево = Новый ОписаниеТипов("Булево");
		ПризнакОтображения = ОписаниеТипаБулево.ПривестиЗначение(ПризнакОтображения);
	КонецЕсли;
	
	Возврат ПризнакОтображения;
	
КонецФункции

// Сохранить признак отображения не установленных заданий.
// 
// Параметры:
//  ПризнакОтображения - Булево - Признак отображения не установленных заданий
Процедура СохранитьПризнакОтображенияНеУстановленныхЗаданий(ПризнакОтображения) Экспорт
	
	ОписаниеТипаБулево = Новый ОписаниеТипов("Булево");
	SUI_ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
		КлючОбщейНастройкиПризнакОтображенияНеУстановленныхЗаданий(), 
		ОписаниеТипаБулево.ПривестиЗначение(ПризнакОтображения));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ВыполнитьРегламентноеЗадание() Экспорт
	
	ТекущееФоновоеЗадание = ПолучитьТекущийСеансИнформационнойБазы().ПолучитьФоновоеЗадание();
	
	Если ТекущееФоновоеЗадание <> Неопределено И ТекущееФоновоеЗадание.РегламентноеЗадание <> Неопределено Тогда
		Задание = ТекущееФоновоеЗадание.РегламентноеЗадание;
	ИначеЕсли ТекущееФоновоеЗадание <> Неопределено И
		СтрНачинаетсяС(ТекущееФоновоеЗадание.Наименование, "Запуск вручную: ") И
		СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ТекущееФоновоеЗадание.Ключ) Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(
			Новый УникальныйИдентификатор(ТекущееФоновоеЗадание.Ключ));
		УстановитьПривилегированныйРежим(Ложь);
		
	Иначе
		Задание = Неопределено;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.Проверить(ЭтоРегламентноеЗаданиеSimple(Задание),
		НСтр("ru = 'Метод предназначен только для выполнения из фонового задания регламентного задания'"),
		"SUI_РегламентныеЗадания.ВыполнитьРегламентноеЗадание");
	
	РегламентныеЗаданияПодсистемы = ПолучитьРегламентныеЗаданияПодсистемы(Задание.Ключ);
	
	Если РегламентныеЗаданияПодсистемы.Количество() = 0 Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Simple: Не найдено регламентное задание подсистемы ""%1"" по ключу ""%2"".
		|Необходимо отключить данное регламентное задание!'"),
		ТекущееФоновоеЗадание.РегламентноеЗадание.Наименование, ТекущееФоновоеЗадание.РегламентноеЗадание.Ключ);
		ЗаписатьПредупреждение(ТекущееФоновоеЗадание.РегламентноеЗадание.Ключ, ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Попытка
		ОбщегоНазначения.ВыполнитьМетодКонфигурации(РегламентныеЗаданияПодсистемы[0].ИмяМетода);
	Исключение
		Ошибка = ИнформацияОбОшибке();
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Simple: Ошибка выполнения регламентного задания ""%1""!'"),
			Задание.Наименование);
		ЗаписатьОшибку(Задание.Ключ, СтрШаблон("%1
		|%2", ТекстОшибки, ОбработкаОшибок.ПодробноеПредставлениеОшибки(Ошибка)));
		ВызватьИсключение(ТекстОшибки, , , , Ошибка);
	КонецПопытки;
	
КонецПроцедуры

// Выводит команды запуска регламентных заданий в форме.
// Для вызова из обработчика формы ПриСозданииНаСервере.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма
//  ОбщийМодуль - ОбщийМодуль - Общий модуль или модуль менеджера
Процедура ПриСозданииНаСервере(Форма, ОбщийМодуль) Экспорт
	
	Отказ = Ложь;
	Попытка
		ВыполнитьПроверкуПрав(Отказ);
	Исключение
		Возврат;
	КонецПопытки;
	
	ТаблицаЗаданий = ТаблицаРегламентныеЗаданияПодсистемы();
	
	Попытка
		ОбщийМодуль.ПриДобавленииРегламентныхЗаданийПодсистемы(ТаблицаЗаданий);
	Исключение
		Ошибка = ИнформацияОбОшибке();
		ВызватьИсключение(НСтр("ru = 'Ошибка инциализации регламентных заданий по общему модулю!'"),,,, Ошибка);
	КонецПопытки;
	
	КомандыКСозданию = Новый Массив();
	
	Для Каждого СтрокаТаблицыЗаданий Из ТаблицаЗаданий Цикл
		
		Отбор = Новый Структура();
		Отбор.Вставить("Ключ", СтрокаТаблицыЗаданий.Ключ);
		Отбор.Вставить("Использование", Истина);
		
		УстановитьПривилегированныйРежим(Истина);
		Если ПолучитьРегламентныеЗаданияСистемы(Отбор).Количество() > 0 Тогда
			КомандыКСозданию.Добавить(СтрокаТаблицыЗаданий);
		КонецЕсли;
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЦикла;
	
	Если КомандыКСозданию.Количество() > 0 Тогда
		
		ИмяПроцедурыКомандыНаФорме = "Подключаемый_ЗапуститьРегламентноеЗадание";
		
		ГруппаКомандЗапуск = Форма.Элементы.Найти("РегламентныеЗаданияЗапуск");
		
		Если ГруппаКомандЗапуск = Неопределено Тогда
			
			ГруппаКомандЗапуск = Форма.Элементы.Добавить("РегламентныеЗаданияЗапуск", Тип("ГруппаФормы"), Форма.КоманднаяПанель);
			ГруппаКомандЗапуск.Вид = ВидГруппыФормы.Подменю;
			ГруппаКомандЗапуск.Картинка = БиблиотекаКартинок.РегламентноеЗадание;
			ГруппаКомандЗапуск.Отображение = ОтображениеКнопки.КартинкаИТекст;
			ГруппаКомандЗапуск.Заголовок = НСтр("ru = 'Регламентные задания'");
			
		ИначеЕсли ТипЗнч(ГруппаКомандЗапуск) <> Тип("ГруппаФормы") Тогда
			Возврат;
		КонецЕсли;
		
		Для индекс = 0 По КомандыКСозданию.ВГраница() Цикл
			
			ИмяКоманды = "РЗ_" + КомандыКСозданию[индекс].Ключ;
			НаименованиеКнопки = КомандыКСозданию[индекс].Наименование;
			Если СтрНачинаетсяС(НаименованиеКнопки, "Simple: ") Тогда
				НаименованиеКнопки = СтрЗаменить(НаименованиеКнопки, "Simple: ", "");
			КонецЕсли;
			
			КомандаЗапуск = Форма.Команды.Найти(ИмяКоманды);
			КомандаДобавлена = Ложь;
			
			Если КомандаЗапуск = Неопределено Тогда
				
				КомандаЗапуск = Форма.Команды.Добавить(ИмяКоманды);
				КомандаЗапуск.Заголовок = НаименованиеКнопки;
				КомандаЗапуск.Действие = ИмяПроцедурыКомандыНаФорме;
				КомандаЗапуск.Картинка = БиблиотекаКартинок.СтартБизнесПроцесса;
				
				КомандаДобавлена = Истина;
				
			ИначеЕсли КомандаЗапуск.Действие <> ИмяПроцедурыКомандыНаФорме Тогда 
				Продолжить;
			КонецЕсли;
			
			Если Форма.Элементы.Найти(КомандаЗапуск.Имя) = Неопределено Тогда
				
				КнопкаЗапуск = Форма.Элементы.Добавить(КомандаЗапуск.Имя, Тип("КнопкаФормы"), ГруппаКомандЗапуск);
				КнопкаЗапуск.Заголовок = КомандаЗапуск.Заголовок;
				КнопкаЗапуск.ИмяКоманды = КомандаЗапуск.Имя;
				
			ИначеЕсли ТипЗнч(КнопкаЗапуск) <> Тип("КнопкаФормы") Или
				КнопкаЗапуск.ИмяКоманды <> КомандаЗапуск.Имя И
				КомандаДобавлена Тогда
				
				Форма.Команды.Удалить(КомандаЗапуск);
				
			КонецЕсли;
			
		КонецЦикла;
	
	КонецЕсли;
	
КонецПроцедуры

// При добавлении регламентных заданий подсистемы.
// 
// Параметры:
//  РегламентныеЗаданияПодсистемы - ТаблицаЗначений - Таблица регламентных заданий подсистемы см. ПолучитьРегламентныеЗаданияПодсистемы:
// 		* Ключ - Строка - Ключ регламентного задания.
// 		* Наименование - Строка - Наименование регламентного задания.
// 		* ИмяМетода - Строка - Имя метода регламентного задания
// 		* Использование - Булево - Признак использования регламентного задания.
// 		* Расписание - РасписаниеРегламентногоЗадания - Расписание регламентного задания.
// 		* КоличествоПовторовПриАварийномЗавершении - Число - Количество повторов регламентного задания при аварийном завершении.
// 		* ИнтервалПовтораПриАварийномЗавершении - Число - Интервал повторов регламентного задания при аварийном завершении.
Процедура ПриДобавленииРегламентныхЗаданийПодсистемы(РегламентныеЗаданияПодсистемы) Экспорт
	
	// Очередь заданий
	SUI_ОчередьЗаданий.ПриДобавленииРегламентныхЗаданийПодсистемы(РегламентныеЗаданияПодсистемы);
	
	// Логирование HTTP запросов
	SUI_ЛогированиеHTTPЗапросов.ПриДобавленииРегламентныхЗаданийПодсистемы(РегламентныеЗаданияПодсистемы);
	
	// Документы обмена
	SUI_ДокументыОбмена.ПриДобавленииРегламентныхЗаданийПодсистемы(РегламентныеЗаданияПодсистемы);
	
	// Сообщения мобильных устройств
	SUI_СообщенияМобильныхУстройств.ПриДобавленииРегламентныхЗаданийПодсистемы(РегламентныеЗаданияПодсистемы);
	
	// Сообщения обмена данными
	SUI_СообщенияОбменаДанными.ПриДобавленииРегламентныхЗаданийПодсистемы(РегламентныеЗаданияПодсистемы);
	
	//
	
	ПроверитьУникальностьПриДобавленииРегламентныхЗаданийПодсистемы(РегламентныеЗаданияПодсистемы);
	
КонецПроцедуры

Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.5.11";
	Обработчик.Процедура = "SUI_РегламентныеЗадания.УдалитьПредопределенныеРегламентныеЗаданияПредыдущихВерсий_1_0_5_11";
	Обработчик.РежимВыполнения = "Оперативно";
	Обработчик.Комментарий = НСтр("ru = 'Удаление предопределенных регламентных заданий прошлых версий'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.5.11";
	Обработчик.Процедура = "SUI_РегламентныеЗадания.ИнициализироватьПредопределенныеРегламентныеЗадания_1_0_5_11";
	Обработчик.РежимВыполнения = "Оперативно";
	Обработчик.Комментарий = НСтр("ru = 'Инициализация регламентных заданий'");
	
КонецПроцедуры

Процедура УдалитьПредопределенныеРегламентныеЗаданияПредыдущихВерсий_1_0_5_11() Экспорт
	
	Отбор = Новый Структура();
	Отбор.Вставить("Метаданные", "ЗапускДополнительныхОбработок");
	
	Для Каждого Задание Из РегламентныеЗадания.ПолучитьРегламентныеЗадания(Отбор) Цикл
		
		Если Задание.Параметры.Количество() = 2 И
			(ТипЗнч(Задание.Параметры[0]) = Тип("ПеречислениеСсылка.Удалить_SUI_КлючиРегламентыхЗаданий") Или
			(Задание.Параметры[0] = Неопределено И 
			ТипЗнч(Задание.Параметры[1]) = Тип("Строка") И
			СтрНачинаетсяС(Задание.Параметры[1], "SUI_"))) Тогда
			
			Попытка
				
				ТекстИнформации = НСтр("ru = 'Задание предыдущей версии ""%1"" удалено.'");
				ТекстИнформации = СтрШаблон(ТекстИнформации, Задание.Наименование);
				
				Задание.Удалить();
				
				SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(), УровеньЖурналаРегистрации.Информация, 
					Метаданные.ОбщиеМодули.SUI_РегламентныеЗадания, , ТекстИнформации);
				
			Исключение
				Ошибка = ИнформацияОбОшибке();
				SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(), , 
					Метаданные.ОбщиеМодули.SUI_РегламентныеЗадания, , Ошибка);
				ВызватьИсключение(НСтр("ru = 'Ошибка удаления регламентного задания предыдущих версий!'"),,,, Ошибка);
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ИнициализироватьПредопределенныеРегламентныеЗадания_1_0_5_11() Экспорт
	
	ПараметрыПолучения = Новый Структура();
	ПараметрыПолучения.Вставить("Установленные", Ложь);
	
	НеУстановленныеЗадания = ПолучитьРегламентныеЗадания(ПараметрыПолучения);
	
	Если НеУстановленныеЗадания.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	РегламентныеЗаданияПодсистемы = ПолучитьРегламентныеЗаданияПодсистемы();
	
	Для Каждого НеУстановленноеЗадание Из НеУстановленныеЗадания Цикл
		
		ЗаданиеПодсистемы = РегламентныеЗаданияПодсистемы.Найти(НеУстановленноеЗадание.Ключ, "Ключ");
		
		Если ЗаданиеПодсистемы = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			
			СозданноеЗадание = СоздатьРегламентноеЗадание(ЗаданиеПодсистемы.Ключ, 
				ЗаданиеПодсистемы.Наименование,
				Истина, 
				ЗаданиеПодсистемы.Расписание,
				ЗаданиеПодсистемы.КоличествоПовторовПриАварийномЗавершении,
				ЗаданиеПодсистемы.ИнтервалПовтораПриАварийномЗавершении);
			
			ТекстИнформации = НСтр("ru = 'Регламентное задание ""%1"" инициализировано.'");
			ТекстИнформации = СтрШаблон(ТекстИнформации, СозданноеЗадание.Наименование);
			
			SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(), УровеньЖурналаРегистрации.Информация, 
				Метаданные.ОбщиеМодули.SUI_РегламентныеЗадания, СозданноеЗадание.Ключ, ТекстИнформации);
			
		Исключение
			Ошибка = ИнформацияОбОшибке();
			SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(), , 
				Метаданные.ОбщиеМодули.SUI_РегламентныеЗадания, ЗаданиеПодсистемы.Ключ, Ошибка);
			ТекстОшибки = НСтр("ru = 'Ошибка инициализации регламентного задания ""%1""!'");
			ТекстОшибки = СтрШаблон(, НеУстановленноеЗадание.Наименование);
			ВызватьИсключение(ТекстОшибки, , , , Ошибка);
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//@skip-check module-unused-method
#Область ЗаписьВЖурналРегистрации

Функция ИмяСобытия(ВложенноеСобытие = "")
	Возврат НСтр("ru = 'Регламентные задания'") + ?(ЗначениеЗаполнено(ВложенноеСобытие), ". " + ВложенноеСобытие, "");
КонецФункции

Процедура ЗаписатьВЖурнал(Уровень, КлючРегламентногоЗадания, Текст)
	SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(), Уровень, 
		Метаданные.ОбщиеМодули.SUI_РегламентныеЗадания, КлючРегламентногоЗадания, Текст);
КонецПроцедуры

Процедура ЗаписатьОшибку(КлючРегламентногоЗадания, ТекстСообщения)
	ЗаписатьВЖурнал(УровеньЖурналаРегистрации.Ошибка, КлючРегламентногоЗадания, ТекстСообщения);
КонецПроцедуры

Процедура ЗаписатьПредупреждение(КлючРегламентногоЗадания, ТекстСообщения)
	ЗаписатьВЖурнал(УровеньЖурналаРегистрации.Предупреждение, КлючРегламентногоЗадания, ТекстСообщения);
КонецПроцедуры

Процедура ЗаписатьИнформацию(КлючРегламентногоЗадания, ТекстСообщения)
	ЗаписатьВЖурнал(УровеньЖурналаРегистрации.Информация, КлючРегламентногоЗадания, ТекстСообщения);
КонецПроцедуры

Процедура ЗаписатьПримечание(КлючРегламентногоЗадания, ТекстСообщения)
	ЗаписатьВЖурнал(УровеньЖурналаРегистрации.Примечание, КлючРегламентногоЗадания, ТекстСообщения);
КонецПроцедуры

#КонецОбласти

// Таблица регламентных заданий.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица регламентных заданий:
// * Установлено - Булево - Признак установленного регламентного задания.
// * Использование - Булево - Признак использования регламентного задания.
// * Наименование - Строка - Наименование регламентного задания.
// * Ключ - Строка - Ключ регламентного задания.
// * УникальныйИдентификатор - УникальныйИдентификатор - Идентификатор регламентного задания.
// * ИмяМетода - Строка - Имя метода регламентного задания.
// * Расписание - Строка - Представление расписания регламентного задания.
// * КоличествоПовторовПриАварийномЗавершении - Число - Количество повторов регламентного задания при аварийном завершении.
// * ИнтервалПовторовПриАварийномЗавершении - Число - Интервал повторов регламентного задания при аварийном завершении.
// * ИдентификаторФоновогоЗадания - УникальныйИдентификатор - Уникальный идентификатор последнего фонового задания.
// * НаименованиеФоновогоЗадания - Строка - Наименование последнего фонового задания.
// * ИмяМетодаФоновогоЗадания - Строка - Имя метода последнего фонового задания.
// * ПоследнийЗапускНачало - Дата - Дата запуска последнего фонового задания.
// * ПоследнийЗапускКонец - Дата - Дата завершения выполнения последнего фонового задания.
// * ТекущееСостояние - СостояниеФоновогоЗадания - Текущее состояние последнего фонового задания.
// * ТекущееСостояниеПредставление - Строка - Представление текущего состояния последнего фонового задания.
// * КраткоеПредставлениеОшибки - Строка - Краткое представление ошибки выполнения последнего фонового задания.
// * ПодробноеПредставлениеОшибки - Строка - Подробное представление ошибки выполнения последнего фонового задания.
// * СообщенияПользователю - Массив из СообщениеПользователю - Сообщения пользователю из последнего фонового задания.
Функция ТаблицаРегламентныхЗаданий()
	
	Таблица = Новый ТаблицаЗначений();
	
	Таблица.Колонки.Добавить("Установлено", Новый ОписаниеТипов("Булево"));
	Таблица.Колонки.Добавить("Использование", Новый ОписаниеТипов("Булево"));
	Таблица.Колонки.Добавить("Наименование", SUI_ОбщегоНазначения.ОписаниеТипаСтрока(200));
	Таблица.Колонки.Добавить("Ключ", SUI_ОбщегоНазначения.ОписаниеТипаСтрока(75));
	Таблица.Колонки.Добавить("УникальныйИдентификатор", Новый ОписаниеТипов("УникальныйИдентификатор"));
	Таблица.Колонки.Добавить("Расписание", SUI_ОбщегоНазначения.ОписаниеТипаСтрока(100));
	Таблица.Колонки.Добавить("КоличествоПовторовПриАварийномЗавершении", 
		SUI_ОбщегоНазначения.ОписаниеТипаЧисло(1, , ДопустимыйЗнак.Неотрицательный));
	Таблица.Колонки.Добавить("ИнтервалПовторовПриАварийномЗавершении", 
		SUI_ОбщегоНазначения.ОписаниеТипаЧисло(4, , ДопустимыйЗнак.Неотрицательный));
	Таблица.Колонки.Добавить("ИдентификаторФоновогоЗадания", Новый ОписаниеТипов("УникальныйИдентификатор"));
	Таблица.Колонки.Добавить("НаименованиеФоновогоЗадания", SUI_ОбщегоНазначения.ОписаниеТипаСтрока(200));
	Таблица.Колонки.Добавить("ИмяМетодаФоновогоЗадания", SUI_ОбщегоНазначения.ОписаниеТипаСтрока(200));
	Таблица.Колонки.Добавить("ПоследнийЗапускНачало", SUI_ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	Таблица.Колонки.Добавить("ПоследнийЗапускКонец", SUI_ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	Таблица.Колонки.Добавить("ТекущееСостояние", Новый ОписаниеТипов("СостояниеФоновогоЗадания"));
	Таблица.Колонки.Добавить("ТекущееСостояниеПредставление", SUI_ОбщегоНазначения.ОписаниеТипаСтрока(50));
	Таблица.Колонки.Добавить("КраткоеПредставлениеОшибки", SUI_ОбщегоНазначения.ОписаниеТипаСтрока(0));
	Таблица.Колонки.Добавить("ПодробноеПредставлениеОшибки", SUI_ОбщегоНазначения.ОписаниеТипаСтрока(0));
	Таблица.Колонки.Добавить("СообщенияПользователю", Новый ОписаниеТипов("ФиксированныйМассив"));
	Таблица.Колонки.Добавить("ЗатраченноеВремя", SUI_ОбщегоНазначения.ОписаниеТипаСтрока(0));
	
	Возврат Таблица;
	
КонецФункции

// Получить регламентные задания системы.
// 
// Параметры:
//  ПараметрыОтбора - Структура, Неопределено - Дополнительные параметры отбора:
//  	* УникальныйИдентификатор - УникальныйИдентификатор - Уникальный идентификатор регламентного задания
//  	* Ключ - Строка - Ключ регламентного задания
//  	* Использование - Булево - Признак использования регламентного задания
//  	* Наименование - Строка - Наименование регламентного задания
// 
// Возвращаемое значение:
//  Массив из РегламентноеЗадание - Список регламентных заданий
Функция ПолучитьРегламентныеЗаданияСистемы(ПараметрыОтбора = Неопределено)
	
	Отбор = Новый Структура();
	Отбор.Вставить("Метаданные", "ЗапускДополнительныхОбработок");
	
	Если ПараметрыОтбора <> Неопределено Тогда
		
		Если ПараметрыОтбора.Свойство("УникальныйИдентификатор") Тогда
			Отбор.Вставить("УникальныйИдентификатор", ПараметрыОтбора.УникальныйИдентификатор);
		КонецЕсли;
		
		Если ПараметрыОтбора.Свойство("Ключ") Тогда
			Отбор.Вставить("Ключ", ПараметрыОтбора.Ключ);
		КонецЕсли;
		
		Если ПараметрыОтбора.Свойство("Использование") Тогда
			Отбор.Вставить("Использование", ПараметрыОтбора.Использование);
		КонецЕсли;
		
		Если ПараметрыОтбора.Свойство("Наименование") Тогда
			Отбор.Вставить("Наименование", ПараметрыОтбора.Наименование);
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	РегламентныеЗаданияСистемы = Новый Массив();
	
	Для Каждого РегламентноеЗаданиеСистемы Из РегламентныеЗадания.ПолучитьРегламентныеЗадания(Отбор) Цикл
		
		Если РегламентноеЗаданиеСистемы.Параметры.Количество() = 2 И
			РегламентноеЗаданиеСистемы.Параметры[0] = SUI_РегламентныеЗаданияКлиентСервер.КлючРегламентныхЗаданийSimple() Тогда
			РегламентныеЗаданияСистемы.Добавить(РегламентноеЗаданиеСистемы);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат РегламентныеЗаданияСистемы;
	
КонецФункции

Функция ТаблицаРегламентныеЗаданияПодсистемы()
	
	РегламентныеЗаданияПодсистемы = Новый ТаблицаЗначений();
	РегламентныеЗаданияПодсистемы.Колонки.Добавить("Ключ", 			SUI_ОбщегоНазначения.ОписаниеТипаСтрока(100));
	РегламентныеЗаданияПодсистемы.Колонки.Добавить("Наименование", 	SUI_ОбщегоНазначения.ОписаниеТипаСтрока(200));
	РегламентныеЗаданияПодсистемы.Колонки.Добавить("ИмяМетода", 	SUI_ОбщегоНазначения.ОписаниеТипаСтрока(200));
	РегламентныеЗаданияПодсистемы.Колонки.Добавить("Использование", Новый ОписаниеТипов("Булево"));
	РегламентныеЗаданияПодсистемы.Колонки.Добавить("Расписание", 	Новый ОписаниеТипов("РасписаниеРегламентногоЗадания"));
	РегламентныеЗаданияПодсистемы.Колонки.Добавить("КоличествоПовторовПриАварийномЗавершении", 
		SUI_ОбщегоНазначения.ОписаниеТипаЧисло(1, , ДопустимыйЗнак.Неотрицательный));
	РегламентныеЗаданияПодсистемы.Колонки.Добавить("ИнтервалПовтораПриАварийномЗавершении", 
		SUI_ОбщегоНазначения.ОписаниеТипаЧисло(3, , ДопустимыйЗнак.Неотрицательный));
	
	Возврат РегламентныеЗаданияПодсистемы;
	
КонецФункции

// Получить регламентные задания подсистемы.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Получить регламентные задания подсистемы:
// * Ключ - Строка - Ключ регламентного задания.
// * Наименование - Строка - Наименование регламентного задания.
// * ИмяМетода - Строка - Имя метода регламентного задания
// * Использование - Булево - Признак использования регламентного задания.
// * Расписание - РасписаниеРегламентногоЗадания - Расписание регламентного задания.
// * КоличествоПовторовПриАварийномЗавершении - Число - Количество повторов регламентного задания при аварийном завершении.
// * ИнтервалПовтораПриАварийномЗавершении - Число - Интервал повторов регламентного задания при аварийном завершении.
Функция ПолучитьРегламентныеЗаданияПодсистемы(Ключ = Неопределено)
	
	РегламентныеЗаданияПодсистемы = ТаблицаРегламентныеЗаданияПодсистемы();
	
	ПриДобавленииРегламентныхЗаданийПодсистемы(РегламентныеЗаданияПодсистемы);
	
	Если Ключ <> Неопределено Тогда
		
		Отбор = Новый Структура();
		Отбор.Вставить("Ключ", Ключ);
		
		РегламентныеЗаданияПодсистемы = РегламентныеЗаданияПодсистемы.Скопировать(Отбор);
		
	КонецЕсли;
	
	Возврат РегламентныеЗаданияПодсистемы;
	
КонецФункции

Функция ЭтоРегламентноеЗаданиеSimple(Задание)
	
	Если ТипЗнч(Задание) = Тип("РегламентноеЗадание") И
		Задание.Параметры.Количество() = 2 И
		Задание.Параметры[0] = SUI_РегламентныеЗаданияКлиентСервер.КлючРегламентныхЗаданийSimple() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Регламентное задание подсистемы по параметру.
// 
// Параметры:
//  РегламентноеЗаданиеПодсистемыИлиКлюч - СтрокаТаблицыЗначений, Строка - см. ПолучитьРегламентныеЗаданияПодсистемы или ключ регламентного задания
//  КонтекстПроверки - Строка - Контекст проверки
// 
// Возвращаемое значение:
//  СтрокаТаблицыЗначений - Регламентное задание подсистемы по параметру см. ПолучитьРегламентныеЗаданияПодсистемы
Функция РегламентноеЗаданиеПодсистемыПоПараметру(РегламентноеЗаданиеПодсистемыИлиКлюч, КонтекстПроверки)
	
	Если ТипЗнч(РегламентноеЗаданиеПодсистемыИлиКлюч) = Тип("Строка") Тогда
		
		РегламентныеЗаданияПодсистемы = ПолучитьРегламентныеЗаданияПодсистемы();
		РегламентноеЗаданиеПодсистемы = РегламентныеЗаданияПодсистемы.Найти(РегламентноеЗаданиеПодсистемыИлиКлюч, "Ключ");
		
		ОбщегоНазначенияКлиентСервер.Проверить(РегламентноеЗаданиеПодсистемы <> Неопределено,
			СтрШаблон(НСтр("ru = 'Не найдено предопределенное регламентное задание подсистемы по ключу ""%1""'"), 
			РегламентноеЗаданиеПодсистемыИлиКлюч),
			КонтекстПроверки);
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.Проверить(
		ТипЗнч(РегламентноеЗаданиеПодсистемы) = Тип("СтрокаТаблицыЗначений"),
		НСтр("ru = 'Неверный параметр 1'"),
		КонтекстПроверки);
	
	ОбщегоНазначенияКлиентСервер.Проверить(Не ПустаяСтрока(РегламентноеЗаданиеПодсистемы.Ключ),
		НСтр("ru = 'Не заполнен ключ регламентного задания подсистемы'"),
		КонтекстПроверки);
	
	Возврат РегламентноеЗаданиеПодсистемы;
	
КонецФункции

// Получить последнее фоновое задание.
// 
// Параметры:
//  РегламентноеЗадание - РегламентноеЗадание - Регламентное задание
// 
// Возвращаемое значение:
//  Неопределено, ФоновоеЗадание - Получить последнее фоновое задание
Функция ПолучитьПоследнееФоновоеЗадание(РегламентноеЗадание)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПоследнееФоновоеЗадание = РегламентноеЗадание.ПоследнееЗадание;
	
	Если ПоследнееФоновоеЗадание = Неопределено Тогда
		
		ТекущийОтбор = Новый Структура();
		ДобавитьОтборФоновыхЗаданийПоРегламентномуЗаданию(ТекущийОтбор, РегламентноеЗадание, Ложь);
		АвтоматическиеФоновыеЗадания = ФоновыеЗадания.ПолучитьФоновыеЗадания(ТекущийОтбор);
		
		ПоследнееФоновоеЗадание = ВыбратьПоследнееФоновоеЗаданиеИзМассива(АвтоматическиеФоновыеЗадания,
			ПоследнееФоновоеЗадание);
		
	КонецЕсли;
	
	ТекущийОтбор = Новый Структура();
	ДобавитьОтборФоновыхЗаданийПоРегламентномуЗаданию(ТекущийОтбор, РегламентноеЗадание, Истина);
	ФоновыеЗаданияЗапущенныеВручную = ФоновыеЗадания.ПолучитьФоновыеЗадания(ТекущийОтбор);
	
	ПоследнееФоновоеЗадание = ВыбратьПоследнееФоновоеЗаданиеИзМассива(
		ФоновыеЗаданияЗапущенныеВручную, ПоследнееФоновоеЗадание);
	
	Возврат ПоследнееФоновоеЗадание;
	
КонецФункции

// Выбрать последнее фоновое задание из массива.
// 
// Параметры:
//  МассивФоновыхЗаданий - Массив из ФоновоеЗадание - Массив фоновых заданий
//  ПоследнееФоновоеЗадание - ФоновоеЗадание, Неопределено - Последнее фоновое задание
// 
// Возвращаемое значение:
//  Неопределено, ФоновоеЗадание - Выбрать последнее фоновое задание из массива
Функция ВыбратьПоследнееФоновоеЗаданиеИзМассива(МассивФоновыхЗаданий, ПоследнееФоновоеЗадание)
	
	Результат = ПоследнееФоновоеЗадание;
	
	Если МассивФоновыхЗаданий.Количество() > 0 Тогда
		
		Если ПоследнееФоновоеЗадание = Неопределено Тогда
			Результат = МассивФоновыхЗаданий[0];
		Иначе
			
			Если ЗначениеЗаполнено(ПоследнееФоновоеЗадание.Конец) Тогда
				
				Если Не ЗначениеЗаполнено(МассивФоновыхЗаданий[0].Конец) Или
					ПоследнееФоновоеЗадание.Конец < МассивФоновыхЗаданий[0].Конец Тогда
					Результат = МассивФоновыхЗаданий[0];
				КонецЕсли;
				
			Иначе
				
				Если Не ЗначениеЗаполнено(МассивФоновыхЗаданий[0].Конец) И 
					ПоследнееФоновоеЗадание.Начало < МассивФоновыхЗаданий[0].Начало Тогда
					Результат = МассивФоновыхЗаданий[0];
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьОтборФоновыхЗаданийПоРегламентномуЗаданию(Отбор, РегламентноеЗадание, ЗапущенныеВручную = Ложь)
	
	Если ЗапущенныеВручную Тогда
		Отбор.Вставить("Ключ", Строка(РегламентноеЗадание.УникальныйИдентификатор));
	Иначе
		Отбор.Вставить("РегламентноеЗадание", РегламентноеЗадание);
	КонецЕсли;
	
КонецПроцедуры

// Проверить уникальность при добавлении регламентных заданий подсистемы.
// 
// Параметры:
//  РегламентныеЗаданияПодсистемы - ТаблицаЗначений - Таблица регламентных заданий подсистемы см. ПолучитьРегламентныеЗаданияПодсистемы:
// 		* Ключ - Строка - Ключ регламентного задания.
// 		* Наименование - Строка - Наименование регламентного задания.
// 		* ИмяМетода - Строка - Имя метода регламентного задания
// 		* Использование - Булево - Признак использования регламентного задания.
// 		* Расписание - РасписаниеРегламентногоЗадания - Расписание регламентного задания.
// 		* КоличествоПовторовПриАварийномЗавершении - Число - Количество повторов регламентного задания при аварийном завершении.
// 		* ИнтервалПовтораПриАварийномЗавершении - Число - Интервал повторов регламентного задания при аварийном завершении.
Процедура ПроверитьУникальностьПриДобавленииРегламентныхЗаданийПодсистемы(РегламентныеЗаданияПодсистемы)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РегламентныеЗаданияПодсистемы.Ключ,
		|	РегламентныеЗаданияПодсистемы.ИмяМетода,
		|	1 КАК КлючУникальности
		|ПОМЕСТИТЬ втРегламентныеЗаданияПодсистемы
		|ИЗ
		|	&РегламентныеЗаданияПодсистемы КАК РегламентныеЗаданияПодсистемы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втРегламентныеЗаданияПодсистемы.Ключ
		|ИЗ
		|	втРегламентныеЗаданияПодсистемы КАК втРегламентныеЗаданияПодсистемы
		|СГРУППИРОВАТЬ ПО
		|	втРегламентныеЗаданияПодсистемы.Ключ
		|ИМЕЮЩИЕ
		|	СУММА(втРегламентныеЗаданияПодсистемы.КлючУникальности) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втРегламентныеЗаданияПодсистемы.ИмяМетода
		|ИЗ
		|	втРегламентныеЗаданияПодсистемы КАК втРегламентныеЗаданияПодсистемы
		|СГРУППИРОВАТЬ ПО
		|	втРегламентныеЗаданияПодсистемы.ИмяМетода
		|ИМЕЮЩИЕ
		|	СУММА(втРегламентныеЗаданияПодсистемы.КлючУникальности) > 1";
	
	Запрос.УстановитьПараметр("РегламентныеЗаданияПодсистемы", РегламентныеЗаданияПодсистемы);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ОшибкиУникальности = Новый Массив();
	
	Для индекс = 1 По РезультатыЗапроса.ВГраница() Цикл
		
		Если РезультатыЗапроса[индекс].Пустой() Тогда
			Продолжить;
		КонецЕсли;
		
		Выборка = РезультатыЗапроса[индекс].Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если индекс = 1 Тогда
				ТекстОшибкиУникальности = НСтр("ru = 'Ключ регламентных заданий ""%1"" не уникален!'");
				ТекстОшибкиУникальности = СтрШаблон(ТекстОшибкиУникальности, Выборка.Ключ);
			ИначеЕсли индекс = 2 Тогда
				ТекстОшибкиУникальности = НСтр("ru = 'Имя метода регламентных заданий ""%1"" не уникально!'");
				ТекстОшибкиУникальности = СтрШаблон(ТекстОшибкиУникальности, Выборка.ИмяМетода);
			Иначе
				Продолжить;
			КонецЕсли;
			
			ОшибкиУникальности.Добавить(ТекстОшибкиУникальности);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если ОшибкиУникальности.Количество() > 0 Тогда
		
		ТекстОшибки = НСтр("ru = 'Обнаружены ошибки регламентных заданий подсистемы:
		|%1'");
		ВызватьИсключение СтрШаблон(ТекстОшибки, СтрСоединить(ОшибкиУникальности));
		
	КонецЕсли;
	
КонецПроцедуры

// Структура сведений запуска регламентного задания.
// 
// Возвращаемое значение:
//  Структура - Структура сведений запуска регламентного задания:
// * ЗапускВыполнен - Булево - Признак выполнения запуска
// * УжеВыполняется - Булево - Признак уже выполняющегося
// * Выполняется - Булево - Признак выполнения
// * Состояние - Строка - Состояние выполнения
// * Ошибка - Строка - Краткое описание ошибки
// * ИдентификаторЗадания - УникальныйИдентификатор, Неопределено - Идентификатор регламентного задания
// * НаименованиеЗадания - Строка - Наименование регламентного задания
// * НаименованиеФоновогоЗадания - Строка - Наименование фонового задания
// * ИдентификаторФоновогоЗадания - УникальныйИдентификатор, Неопределено - Идентификатор фонового задания
// * ДатаЗапуска - Дата - Дата запуска фонового задания
// * ДатаЗавершения - Дата - Дата завершения фонового задания
// * ЗатрченноеВремя - Число - Затраченное время на выполнение фонового задания
// * ЗатрченноеВремяПредставление - Строка - Пердставление затраченного времени на выполнение фонового задания
Функция СтруктураСведенийЗапускаРегламентногоЗадания()
	
	СтруктураСведений = Новый Структура();
	СтруктураСведений.Вставить("ЗапускВыполнен", Ложь);
	СтруктураСведений.Вставить("УжеВыполняется", Ложь);
	СтруктураСведений.Вставить("Выполняется", Ложь);
	СтруктураСведений.Вставить("Состояние", "");
	СтруктураСведений.Вставить("Ошибка", "");
	СтруктураСведений.Вставить("ИдентификаторЗадания");
	СтруктураСведений.Вставить("НаименованиеЗадания", "");
	СтруктураСведений.Вставить("НаименованиеФоновогоЗадания", "");
	СтруктураСведений.Вставить("ИдентификаторФоновогоЗадания");
	СтруктураСведений.Вставить("ДатаЗапуска", Дата(1, 1, 1));
	СтруктураСведений.Вставить("ДатаЗавершения", Дата(1, 1, 1));
	СтруктураСведений.Вставить("ЗатрченноеВремя", 0);
	СтруктураСведений.Вставить("ЗатрченноеВремяПредставление",
		SUI_ОбщегоНазначенияКлиентСервер.ПолучитьПредставлениеРазницыВремени(СтруктураСведений.ЗатрченноеВремя));
	
	//@skip-check constructor-function-return-section
	Возврат СтруктураСведений;
	
КонецФункции

Функция ПолучитьСведенияОЗапускеЗадания(ИдентификаторИлиФоновоеЗадание)
	
	УстановитьПривилегированныйРежим(Истина);
	
	СведенияЗапуска = СтруктураСведенийЗапускаРегламентногоЗадания();
	
	Если ТипЗнч(ИдентификаторИлиФоновоеЗадание) = Тип("ФоновоеЗадание") Тогда
		ФоновоеЗадание = ИдентификаторИлиФоновоеЗадание;
	ИначеЕсли ТипЗнч(ИдентификаторИлиФоновоеЗадание) = Тип("УникальныйИдентификатор") Тогда
		ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторИлиФоновоеЗадание);
	Иначе
		ВызватьИсключение НСтр("ru = 'Неверный параметр 1'");
	КонецЕсли;
	
	Если ФоновоеЗадание <> Неопределено Тогда
		
		СведенияЗапуска.Выполняется = (ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Активно);
		СведенияЗапуска.УжеВыполняется = Истина;
		СведенияЗапуска.ИдентификаторФоновогоЗадания = ФоновоеЗадание.УникальныйИдентификатор;
		СведенияЗапуска.НаименованиеФоновогоЗадания = ФоновоеЗадание.Наименование;
		СведенияЗапуска.Состояние = Строка(ФоновоеЗадание.Состояние);
		СведенияЗапуска.ДатаЗапуска = ФоновоеЗадание.Начало;
		СведенияЗапуска.ДатаЗавершения = ФоновоеЗадание.Конец;
		
		Если ЗначениеЗаполнено(СведенияЗапуска.ДатаЗапуска) И ЗначениеЗаполнено(СведенияЗапуска.ДатаЗавершения) Тогда
			
			СведенияЗапуска.ЗатрченноеВремя = СведенияЗапуска.ДатаЗавершения - СведенияЗапуска.ДатаЗапуска;
			
			Если СведенияЗапуска.ЗатрченноеВремя < 0 Тогда
				СведенияЗапуска.ЗатрченноеВремя = 0;
			КонецЕсли;
			
			СведенияЗапуска.ЗатрченноеВремяПредставление = 
				SUI_ОбщегоНазначенияКлиентСервер.ПолучитьПредставлениеРазницыВремени(СведенияЗапуска.ЗатрченноеВремя);
			
		КонецЕсли;
		
		Если ФоновоеЗадание.ИнформацияОбОшибке <> Неопределено Тогда
			СведенияЗапуска.Ошибка = ОбработкаОшибок.КраткоеПредставлениеОшибки(ФоновоеЗадание.ИнформацияОбОшибке);
		КонецЕсли;
		
		Если ФоновоеЗадание.РегламентноеЗадание <> Неопределено Тогда
			Задание = ФоновоеЗадание.РегламентноеЗадание;
		ИначеЕсли СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ФоновоеЗадание.Ключ) Тогда
			Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Новый УникальныйИдентификатор(ФоновоеЗадание.Ключ));
		Иначе
			Задание = Неопределено;
		КонецЕсли;
		
		Если Задание <> Неопределено Тогда
			СведенияЗапуска.НаименованиеЗадания = Задание.Наименование;
			СведенияЗапуска.ИдентификаторЗадания = Задание.УникальныйИдентификатор;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СведенияЗапуска;
	
КонецФункции

Функция СоздатьРегламентноеЗадание(Ключ, Наименование, Использование, Расписание, КоличествоПовторовПриОшибке, ИнтервалПовторовПриОшибке)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыРегламентногоЗадания = Новый Массив();
	ПараметрыРегламентногоЗадания.Добавить(SUI_РегламентныеЗаданияКлиентСервер.КлючРегламентныхЗаданийSimple());
	ПараметрыРегламентногоЗадания.Добавить(Ключ);
	
	Попытка
		
		УстановитьПривилегированныйРежим(Истина);
	
		НовоеРегламентноеЗадание 				= РегламентныеЗадания.СоздатьРегламентноеЗадание("ЗапускДополнительныхОбработок");
		НовоеРегламентноеЗадание.Ключ 			= Ключ;
		НовоеРегламентноеЗадание.Наименование 	= Наименование;
		НовоеРегламентноеЗадание.Использование 	= Использование;
		НовоеРегламентноеЗадание.Расписание 	= Расписание;
		НовоеРегламентноеЗадание.Параметры		= ПараметрыРегламентногоЗадания;
		НовоеРегламентноеЗадание.КоличествоПовторовПриАварийномЗавершении = КоличествоПовторовПриОшибке;
		НовоеРегламентноеЗадание.ИнтервалПовтораПриАварийномЗавершении = ИнтервалПовторовПриОшибке;
		
		НовоеРегламентноеЗадание.Записать();
		
	Исключение
		Ошибка = ИнформацияОбОшибке();
		ТекстОшибки = НСтр("ru = 'Ошибка создания регламентного задания подсистемы!'");
		ЗаписатьОшибку(Ключ, СтрШаблон("%1
		|%2", ТекстОшибки, ОбработкаОшибок.ПодробноеПредставлениеОшибки(Ошибка)));
		ВызватьИсключение(ТекстОшибки, , , , Ошибка);
	КонецПопытки;
	
	Возврат НовоеРегламентноеЗадание;
	
КонецФункции

Функция КлючОбщейНастройкиПризнакОтображенияНеУстановленныхЗаданий()
	
	Возврат "ПризнакОтображенияНеУстановленныхЗаданий";
	
КонецФункции

#КонецОбласти
