
#Область ПрограммныйИнтерфейс

#Область ПодпискиНаСобытия

Процедура SUI_ИдентификаторыРегламентныхЗаданийПередЗаписью(Источник, Отказ) Экспорт

	Если Отказ Или Источник.ДополнительныеСвойства.Свойство("ЗаменаИдентификаторов") Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.Проверить(Пользователи.ЭтоПолноправныйПользователь(),
		НСтр("ru = 'Недостаточно прав'"),
		"ИдентификаторыРегламентныхЗаданийПередЗаписью");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Таблица.Значение
		|ИЗ
		|	" + Источник.Метаданные().ПолноеИмя() + " КАК Таблица";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);

	Выборка.Следующий();
	
	Если Выборка.Значение <> Источник.Значение Тогда

		ИсторияРЗ = Новый Структура();
		ИсторияРЗ.Вставить("Предыдущее", РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Выборка.Значение));
		ИсторияРЗ.Вставить("Текущее", РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Источник.Значение));
		
		Источник.ДополнительныеСвойства.Вставить("РегламентныеЗадания", ИсторияРЗ);
		
	КонецЕсли;

КонецПроцедуры

Процедура SUI_ИдентификаторыРегламентныхЗаданийПриЗаписи(Источник, Отказ) Экспорт
	
	Если Отказ Или Источник.ДополнительныеСвойства.Свойство("ЗаменаИдентификаторов") Тогда
		Возврат;
	КонецЕсли;

	ПредыдущееЗадание = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Источник.ДополнительныеСвойства, 
		"РегламентныеЗадания.Предыдущее", Неопределено, Тип("РегламентноеЗадание"));
	ТекущееЗадание = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Источник.ДополнительныеСвойства, 
		"РегламентныеЗадания.Текущее", Неопределено, Тип("РегламентноеЗадание"));

	Если РегламентноеЗаданиеЗаполнено(ПредыдущееЗадание) Тогда
		УдалитьРегламентноеЗадание(ПредыдущееЗадание);
	КонецЕсли;
	
	Если Источник.Значение <> ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор() Тогда
		
		ОбщегоНазначенияКлиентСервер.Проверить(РегламентноеЗаданиеЗаполнено(ТекущееЗадание),
			СтрШаблон(НСтр("ru = 'По идентификатору %1 не найдено регламентное задание.'"), Источник.Значение), 
			"ИдентификаторыРегламентныхЗаданийПриЗаписи");
		
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Регламентное задание ""%1"" не является регламентным заданием %2'"), 
			ТекущееЗадание.Наименование, SUI_SimpleКлиентСервер.Представление());
		
		ОбщегоНазначенияКлиентСервер.Проверить(ЭтоРегламентноеЗаданиеSimple(ТекущееЗадание), 
			ТекстОшибки, "ИдентификаторыРегламентныхЗаданийПриЗаписи");

		ИдентификаторыЗаданий = ПолучитьИдентификаторыРегламентныхЗаданий(Истина);
		ЗаданияПоИдентификатору = ИдентификаторыЗаданий.НайтиСтроки(Новый Структура("Идентификатор", Источник.Значение));
		
		Для индекс = 0 По ЗаданияПоИдентификатору.ВГраница() Цикл
			
			МенеджерКонстанты = МенеджерКонстантыРегламентногоЗадания(ЗаданияПоИдентификатору[индекс].Ключ);
			Если МенеджерКонстанты <> Неопределено Тогда

				МенеджерЗначения = МенеджерКонстанты.СоздатьМенеджерЗначения();
				
				Если Источник.Метаданные() = МенеджерЗначения.Метаданные() Тогда
					Продолжить;
				КонецЕсли;
				
				МенеджерЗначения.Значение = ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор();
				МенеджерЗначения.ДополнительныеСвойства.Вставить("ЗаменаИдентификаторов");
				МенеджерЗначения.Записать();
				
			КонецЕсли;

		КонецЦикла;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

Процедура ЗапуститьРегламентноеЗаданиеВручную(Параметры, АдресРезультата) Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("Запущено", Ложь);
	Результат.Вставить("Состояние", "Выполняется");
	Результат.Вставить("ОписаниеИнформацииОбОшибке", "");
	Результат.Вставить("ИдентификаторФоновогоЗадания");
	
	КлючРегламентногоЗадания = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "КлючРегламентногоЗадания");
	ИгнорироватьОшибкиВыполнения = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИгнорироватьОшибкиВыполнения", Ложь, Тип("Булево"));
	ИгнорироватьИспользование = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИгнорироватьИспользование", Ложь, Тип("Булево"));
	
	ОбщегоНазначенияКлиентСервер.Проверить(Не КлючРегламентногоЗаданияПоПараметру(КлючРегламентногоЗадания).Пустая(),
		НСтр("ru = 'Не передан ключ для запуска регламентного задания.'"),
		"SUI_РегламентныеЗадания.ЗапуститьРегламентноеЗаданиеВручную");
	
	Если ТипЗнч(АдресРезультата) <> Тип("Строка") Или Не ЭтоАдресВременногоХранилища(АдресРезультата) Тогда
		АдресРезультата = Неопределено;
	КонецЕсли;
	
	#Если ВнешнееСоединение Тогда
		Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
			ОбщегоНазначенияКлиентСервер.Проверить(ИгнорироватьОшибкиВыполнения,
				НСтр("ru = 'Во внешнем соединении файловой информационной базы данных невозможно запустить регламентное задание вручную'"),
				"SUI_РегламентныеЗадания.ЗапуститьРегламентноеЗаданиеВручную");
			Если АдресРезультата <> Неопределено Тогда
				ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
			КонецЕсли;
			Возврат;
		КонецЕсли;
	#КонецЕсли
	
	УстановитьПривилегированныйРежим(Истина);
	
	Задание = РегламентноеЗаданиеПоКлючу(КлючРегламентногоЗадания);
	
	Если Задание = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.Проверить(ИгнорироватьОшибкиВыполнения,
			СтрШаблон(НСтр("ru = 'По ключу ""%1"" не найдено регламентное задание подсистемы %2.'"), КлючРегламентногоЗадания, SUI_SimpleКлиентСервер.Представление()));
		Если АдресРезультата <> Неопределено Тогда
			ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если Не Задание.Использование И Не ИгнорироватьИспользование Тогда
		ОбщегоНазначенияКлиентСервер.Проверить(ИгнорироватьОшибкиВыполнения,
			СтрШаблон(НСтр("ru = 'Регламентное задание %1 не используется.'"), КлючРегламентногоЗадания));
		Если АдресРезультата <> Неопределено Тогда
			ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	РезультатЗапуска = РегламентныеЗаданияСлужебный.ВыполнитьРегламентноеЗаданиеВручную(Задание);
	Если РезультатЗапуска.ЗапускВыполнен И ЗначениеЗаполнено(РезультатЗапуска.ИдентификаторФоновогоЗадания) Тогда
		СвойстваПоследнего = СвойстваПоследнегоФоновогоЗаданияПоОтбору(Новый Структура("Идентификатор", РезультатЗапуска.ИдентификаторФоновогоЗадания));
	Иначе
		СвойстваПоследнего = СвойстваПоследнегоФоновогоЗаданияВыполненияРегламентногоЗадания(Задание);
	КонецЕсли;
	
	Если СвойстваПоследнего <> Неопределено Тогда
		
		Результат.Запущено = Истина;
		Результат.ИдентификаторФоновогоЗадания = Новый УникальныйИдентификатор(СвойстваПоследнего.Идентификатор);
		
		Если СвойстваПоследнего.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
			Результат.Состояние = "Выполнено";
		ИначеЕсли СвойстваПоследнего.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
			Результат.Состояние = "Ошибка";
		ИначеЕсли СвойстваПоследнего.Состояние = СостояниеФоновогоЗадания.Отменено Тогда
			Результат.Состояние = "Отменено";
		КонецЕсли;
		
		Результат.ОписаниеИнформацииОбОшибке = СвойстваПоследнего.ОписаниеИнформацииОбОшибке;
		
	КонецЕсли;
	
	Если АдресРезультата <> Неопределено Тогда
		ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолучитьРезультатВыполненияФоновогоЗаданияРегламентногоЗадания(Параметры, АдресРезультата) Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("Состояние");
	Результат.Вставить("ОписаниеИнформацииОбОшибке", "");
	Результат.Вставить("ИдентификаторФоновогоЗадания");
	
	КлючРегламентногоЗадания = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "КлючРегламентногоЗадания");
	ИгнорироватьОшибкиВыполнения = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИгнорироватьОшибкиВыполнения", Ложь, Тип("Булево"));
	ИдентификаторФоновогоЗадания = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИдентификаторФоновогоЗадания");
	
	Если ТипЗнч(ИдентификаторФоновогоЗадания) <> Тип("УникальныйИдентификатор") Тогда
		
		ИдентификаторФоновогоЗадания = ОбщегоНазначения.ОписаниеТипаСтрока(36).ПривестиЗначение(ИдентификаторФоновогоЗадания);
		Если СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ИдентификаторФоновогоЗадания) Тогда
			ИдентификаторФоновогоЗадания = Новый УникальныйИдентификатор(ИдентификаторФоновогоЗадания);
		Иначе
			ИдентификаторФоновогоЗадания = ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор();
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗнч(АдресРезультата) <> Тип("Строка") Или Не ЭтоАдресВременногоХранилища(АдресРезультата) Тогда
		АдресРезультата = Неопределено;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Параметры.Свойство("Таймаут") Тогда
		Таймаут = ОбщегоНазначения.ОписаниеТипаЧисло(2, , ДопустимыйЗнак.Неотрицательный).ПривестиЗначение(Параметры.Таймаут);
		Таймаут = ?(Таймаут > 30, 30, Таймаут);
	Иначе
		Таймаут = ?(ПолучитьСкоростьКлиентскогоСоединения() = СкоростьКлиентскогоСоединения.Низкая, 4, 2);
	КонецЕсли;
	
	SUI_ОбщегоНазначения.Пауза(Таймаут);
	
	Если ЗначениеЗаполнено(ИдентификаторФоновогоЗадания) Тогда
		СвойстваПоследнего = СвойстваПоследнегоФоновогоЗаданияПоОтбору(Новый Структура("Идентификатор", Строка(ИдентификаторФоновогоЗадания)));
	Иначе
		
		Задание = РегламентноеЗаданиеПоКлючу(КлючРегламентногоЗадания);
		
		Если Задание = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.Проверить(ИгнорироватьОшибкиВыполнения,
				СтрШаблон(НСтр("ru = 'По ключу ""%1"" не найдено регламентное задание подсистемы %2.'"), КлючРегламентногоЗадания, SUI_SimpleКлиентСервер.Представление()));
			Если АдресРезультата <> Неопределено Тогда
				ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
			КонецЕсли;
			Возврат;
		КонецЕсли;
		
		СвойстваПоследнего = СвойстваПоследнегоФоновогоЗаданияВыполненияРегламентногоЗадания(Задание);
		
	КонецЕсли;
	
	Если СвойстваПоследнего <> Неопределено Тогда
		
		Результат.ИдентификаторФоновогоЗадания = Новый УникальныйИдентификатор(СвойстваПоследнего.Идентификатор);
		
		Если СвойстваПоследнего.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
			Результат.Состояние = "Выполнено";
		ИначеЕсли СвойстваПоследнего.Состояние = СостояниеФоновогоЗадания.Активно Тогда
			Результат.Состояние = "Выполняется";
		ИначеЕсли СвойстваПоследнего.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
			Результат.Состояние = "Ошибка";
		ИначеЕсли СвойстваПоследнего.Состояние = СостояниеФоновогоЗадания.Отменено Тогда
			Результат.Состояние = "Отменено";
		КонецЕсли;
		
		Результат.ОписаниеИнформацииОбОшибке = СвойстваПоследнего.ОписаниеИнформацииОбОшибке;
		
	КонецЕсли;
	
	Если АдресРезультата <> Неопределено Тогда
		ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОстановитьРегламентноеЗадание(Параметры, АдресРезультата) Экспорт
	
	КлючРегламентногоЗадания = КлючРегламентногоЗаданияПоПараметру(SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "КлючРегламентногоЗадания"));
	ИгнорироватьОшибкиВыполнения = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИгнорироватьОшибкиВыполнения", Ложь, Тип("Булево"));
	ИдентификаторФоновогоЗадания = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ИдентификаторФоновогоЗадания");
	
	Если ТипЗнч(ИдентификаторФоновогоЗадания) <> Тип("УникальныйИдентификатор") Тогда
		
		ИдентификаторФоновогоЗадания = ОбщегоНазначения.ОписаниеТипаСтрока(36).ПривестиЗначение(ИдентификаторФоновогоЗадания);
		Если СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ИдентификаторФоновогоЗадания) Тогда
			ИдентификаторФоновогоЗадания = Новый УникальныйИдентификатор(ИдентификаторФоновогоЗадания);
		Иначе
			ИдентификаторФоновогоЗадания = ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор();
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗнч(АдресРезультата) <> Тип("Строка") Или Не ЭтоАдресВременногоХранилища(АдресРезультата) Тогда
		АдресРезультата = Неопределено;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЗначениеЗаполнено(ИдентификаторФоновогоЗадания) Тогда
		
		Если КлючРегламентногоЗадания.Пустая() Тогда
			ОбщегоНазначенияКлиентСервер.Проверить(ИгнорироватьОшибкиВыполнения,
				НСтр("ru = 'Ошибка остановки регламентного задания.
				|Не передан ключ для остановки регламентного задания.'"));
		Иначе
			
			Задание = РегламентноеЗаданиеПоКлючу(КлючРегламентногоЗадания);
		
			Если Задание = Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.Проверить(ИгнорироватьОшибкиВыполнения,
					СтрШаблон(НСтр("ru = 'Ошибка остановки регламентного задания.
					|По ключу ""%1"" не найдено регламентное задание подсистемы %2.'"), 
					КлючРегламентногоЗадания, SUI_SimpleКлиентСервер.Представление()));
			Иначе
				СвойстваПоследнего = СвойстваПоследнегоФоновогоЗаданияВыполненияРегламентногоЗадания(Задание);
				Если СвойстваПоследнего <> Неопределено Тогда
					ИдентификаторФоновогоЗадания = СвойстваПоследнего.Идентификатор;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторФоновогоЗадания) Тогда
		ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторФоновогоЗадания);
	КонецЕсли;
	
	Если АдресРезультата <> Неопределено Тогда
		ПоместитьВоВременноеХранилище(Истина, АдресРезультата);
	КонецЕсли;
	
КонецПроцедуры

Процедура ИспользованиеРегламентногоЗадания(КлючРегламентногоЗадания, Значение) Экспорт
	
	Если Не Пользователи.ЭтоПолноправныйПользователь() Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	РегламентноеЗадание = РегламентноеЗаданиеПоКлючу(КлючРегламентногоЗадания);
	
	Если РегламентноеЗадание <> Неопределено Тогда

			РегламентноеЗадание.Использование = Значение;
			РегламентноеЗадание.Записать();
			
			СообщениеЖурнала = СтрШаблон(НСтр("ru = 'Регламентное задание ""%1"": %2'"), 
				КлючРегламентногоЗадания, Формат(РегламентноеЗадание.Использование, "БЛ=Выключено; БИ=Включено;"));
			ЗаписатьПримечание(КлючРегламентногоЗадания, СообщениеЖурнала);
		
	Иначе
		
		ТекстСообщения = СтрШаблон(НСтр("ru = 'По ключу ""%1"" не найдено регламентное задание подсистемы %2.'"), 
			КлючРегламентногоЗадания, SUI_SimpleКлиентСервер.Представление());
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);

	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьИнформациюОРегламентныхЗаданиях(КлючРегламентногоЗадания = Неопределено, АдресРезультата = Неопределено) Экспорт
	
	ОбщегоНазначенияКлиентСервер.Проверить(Пользователи.ЭтоПолноправныйПользователь(),
		НСтр("ru = 'Недостаточно прав для получения информации о регламентных заданиях'"));
	
	УстановитьПривилегированныйРежим(Истина);
	
	Таблица = ПолучитьИдентификаторыРегламентныхЗаданий();
	
	Таблица.Колонки.Добавить("Использование", Новый ОписаниеТипов("Булево"));
	Таблица.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("Начало", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	Таблица.Колонки.Добавить("Конец", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	Таблица.Колонки.Добавить("Состояние", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("Расписание", Новый ОписаниеТипов("РасписаниеРегламентногоЗадания"));
	Таблица.Колонки.Добавить("Пользователь", Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	Таблица.Колонки.Добавить("ОписаниеИнформацииОбОшибке", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("Существует", Новый ОписаниеТипов("Булево"));

	Если Не КлючРегламентногоЗаданияПоПараметру(КлючРегламентногоЗадания).Пустая() Тогда
		
		Построитель = Новый ПостроительЗапроса();
		Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(Таблица);
		
		Отбор = Построитель.Отбор.Добавить("Ключ");
		Отбор.ВидСравнения = ВидСравнения.Равно;
		Отбор.Значение = КлючРегламентногоЗадания;
		Отбор.Использование = Истина;
		
		Построитель.Выполнить();
		Таблица = Построитель.Результат.Выгрузить();
		
	КонецЕсли;

	Для Каждого СтрокаТаблицы Из Таблица Цикл
		
		РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(СтрокаТаблицы.Идентификатор);
		
		Если Не РегламентноеЗаданиеЗаполнено(РегламентноеЗадание) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТаблицы.Использование = РегламентноеЗадание.Использование;
		СтрокаТаблицы.Наименование = РегламентноеЗадание.Наименование;
		СтрокаТаблицы.Расписание = РегламентноеЗадание.Расписание;
		СтрокаТаблицы.Пользователь = Пользователи.НайтиПоИмени(РегламентноеЗадание.ИмяПользователя);
		СтрокаТаблицы.Существует = Истина;
		
		СвойстваПоследнего = СвойстваПоследнегоФоновогоЗаданияВыполненияРегламентногоЗадания(РегламентноеЗадание);
		Если СвойстваПоследнего <> Неопределено Тогда
			
			СтрокаТаблицы.Начало = СвойстваПоследнего.Начало;
			СтрокаТаблицы.Конец = СвойстваПоследнего.Конец;
			СтрокаТаблицы.ОписаниеИнформацииОбОшибке = СвойстваПоследнего.ОписаниеИнформацииОбОшибке;
			
			Если СвойстваПоследнего.Состояние = СостояниеФоновогоЗадания.Активно Тогда
				СтрокаТаблицы.Состояние = НСтр("ru = 'Выполняется'");
			ИначеЕсли СвойстваПоследнего.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
				СтрокаТаблицы.Состояние = НСтр("ru = 'Выполнено'");
			ИначеЕсли СвойстваПоследнего.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
				СтрокаТаблицы.Состояние = НСтр("ru = 'Ошибка выполнения'");
			ИначеЕсли СвойстваПоследнего.Состояние = СостояниеФоновогоЗадания.Отменено Тогда
				СтрокаТаблицы.Состояние = НСтр("ru = 'Отменено'");
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;

	Если АдресРезультата <> Неопределено И ЭтоАдресВременногоХранилища(АдресРезультата) Тогда
		ПоместитьВоВременноеХранилище(Таблица, АдресРезультата);
	КонецЕсли;
	
	Возврат Таблица;
	
КонецФункции

// Создать регламентное задание по ключу.
// 
// Параметры:
//  КлючРегламентногоЗадания - ПеречислениеСсылка.SUI_КлючиРегламентыхЗаданий - Ключ регламентного задания
//  Использование - Булево - Признак использования регламентного задания
// 
// Возвращаемое значение:
//  УникальныйИдентификатор - Уникальный идентификатор регламентного задания
Функция СоздатьРегламентноеЗаданиеПоКлючу(КлючРегламентногоЗадания, Использование = Истина) Экспорт
	
	ИдентификаторЗадания = ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор();
	
	Если КлючРегламентногоЗадания = Перечисления.SUI_КлючиРегламентыхЗаданий.ОбработкаОчередиЗаданий Тогда
		ИдентификаторЗадания = СоздатьРегламентноеЗадание_ОбработкаОчередиЗаданий(Использование);
	ИначеЕсли КлючРегламентногоЗадания = Перечисления.SUI_КлючиРегламентыхЗаданий.ОчисткаОчередиЗаданий Тогда
		ИдентификаторЗадания = СоздатьРегламентноеЗадание_ОчисткаОчередиЗаданий(Использование);
	ИначеЕсли КлючРегламентногоЗадания = Перечисления.SUI_КлючиРегламентыхЗаданий.ОчисткаЛогированияHTTPЗапросов Тогда
		ИдентификаторЗадания = СоздатьРегламентноеЗадание_ОчисткаЛогированияHTTPЗапросов(Использование);
	ИначеЕсли КлючРегламентногоЗадания = Перечисления.SUI_КлючиРегламентыхЗаданий.ОчисткаОбработанныхДокументов Тогда
		ИдентификаторЗадания = СоздатьРегламентноеЗадание_ОчисткаОбработанныхДокументов(Использование);
	ИначеЕсли КлючРегламентногоЗадания = Перечисления.SUI_КлючиРегламентыхЗаданий.ОчисткаСообщенийМобильныхУстройств Тогда
		ИдентификаторЗадания = СоздатьРегламентноеЗадание_ОчисткаСообщенийМобильныхУстройств(Использование);
	ИначеЕсли КлючРегламентногоЗадания = Перечисления.SUI_КлючиРегламентыхЗаданий.ОбработкаСообщенийОбменаДанными Тогда
		ИдентификаторЗадания = СоздатьРегламентноеЗадание_ОбработкаСообщенийОбменаДанными(Использование);
	ИначеЕсли КлючРегламентногоЗадания = Перечисления.SUI_КлючиРегламентыхЗаданий.СверткаСообщенийОбменаДанными Тогда
		ИдентификаторЗадания = СоздатьРегламентноеЗадание_СверткаСообщенийОбменаДанными(Использование);
	КонецЕсли;
	
	Если ИдентификаторЗадания <> ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор() Тогда
		СообщениеЖурнала = СтрШаблон(НСтр("ru = 'Регламентное задание ""%1"": Создано'"), КлючРегламентногоЗадания);
		ЗаписатьИнформацию(КлючРегламентногоЗадания, СообщениеЖурнала);
	КонецЕсли;
	
	Возврат ИдентификаторЗадания;
	
КонецФункции

// Обновить регламентное задание по ключу.
// 
// Параметры:
//  КлючРегламентногоЗадания - ПеречислениеСсылка.SUI_КлючиРегламентыхЗаданий - Ключ регламентного задания
//  ИзмененныеДанные - Структура:
//  	* Использование 	- Булево - Признак использования регламентного задания
//  	* Наименование 		- Строка - Наименование регламентного задания
//  	* Расписание 		- РасписаниеРегламентногоЗадания - Расписание регламентного задания
//  	* ИмяПользователя 	- Строка - Имя пользователя БД под которым следует выполнять РЗ
//  	* Пользователь 		- СправочникСсылка.Пользователи - Пользователь под которым следует выполнять РЗ
// 
// Возвращаемое значение:
//  УникальныйИдентификатор - Уникальный идентификатор регламентного задания
Функция ОбновитьРегламентноеЗаданиеПоКлючу(КлючРегламентногоЗадания, ИзмененныеДанные) Экспорт
	
	ОбщегоНазначенияКлиентСервер.Проверить(Пользователи.ЭтоПолноправныйПользователь(), 
		НСтр("ru = 'Операция обновления не выполнена по причине:
		|Недостаточно прав'"), 
		"SUI_РегламентныеЗадания.ОбновитьРегламентноеЗаданиеПоКлючу");
		
	ОбщегоНазначенияКлиентСервер.Проверить(Не КлючРегламентногоЗаданияПоПараметру(КлючРегламентногоЗадания).Пустая(), 
		НСтр("ru = 'Операция обновления не выполнена по причине:
		|Не удалось определить ключ регламентного задания'"), 
		"SUI_РегламентныеЗадания.ОбновитьРегламентноеЗаданиеПоКлючу");

	РегламентноеЗадание = РегламентноеЗаданиеПоКлючу(КлючРегламентногоЗадания);
	
	ОбщегоНазначенияКлиентСервер.Проверить(РегламентноеЗаданиеЗаполнено(РегламентноеЗадание), 
		СтрШаблон(НСтр("ru = 'Операция обновления не выполнена по причине:
		|Не найдено регламентное задание подсистемы %1.'"), SUI_SimpleКлиентСервер.Представление()), 
		"SUI_РегламентныеЗадания.ОбновитьРегламентноеЗаданиеПоКлючу");
	
	ДанныеИзменены = Ложь;
	
	Если ИзмененныеДанные.Свойство("Использование") Тогда
		РегламентноеЗадание.Использование = ИзмененныеДанные.Использование;
		ДанныеИзменены = Истина;
	КонецЕсли;
	
	Если ИзмененныеДанные.Свойство("Наименование") Тогда
		РегламентноеЗадание.Наименование = ИзмененныеДанные.Наименование;
		ДанныеИзменены = Истина;
	КонецЕсли;
	
	Если ИзмененныеДанные.Свойство("Расписание") Тогда
		РегламентноеЗадание.Расписание = ИзмененныеДанные.Расписание;
		ДанныеИзменены = Истина;
	КонецЕсли;
	
	Если ИзмененныеДанные.Свойство("ИмяПользователя") Тогда
		РегламентноеЗадание.ИмяПользователя = ИзмененныеДанные.ИмяПользователя;
		ДанныеИзменены = Истина;
	КонецЕсли;
	
	Если ИзмененныеДанные.Свойство("Пользователь") Тогда
		
		ПользовательИБ = SUI_ПользователиПереопределяемый.НайтиПоСсылке(ИзмененныеДанные.Пользователь);
		Если ПользовательИБ <> Неопределено Тогда
			РегламентноеЗадание.ИмяПользователя = ПользовательИБ.Имя;
			ДанныеИзменены = Истина;
		КонецЕсли;

	КонецЕсли;
	
	Если ДанныеИзменены Тогда
		РегламентноеЗадание.Записать();
	КонецЕсли;
	
	Возврат РегламентноеЗадание.УникальныйИдентификатор;
	
КонецФункции

// Удалить регламентное задание.
// 
// Параметры:
//  РегламентноеЗадание - РегламентноеЗадание, ПеречислениеСсылка.SUI_КлючиРегламентыхЗаданий - Регламентное задание или ПеречислениеСсылка Ключ регламентного задания
Процедура УдалитьРегламентноеЗадание(Знач РегламентноеЗадание) Экспорт
	
	ОбщегоНазначенияКлиентСервер.Проверить(Пользователи.ЭтоПолноправныйПользователь(), 
		НСтр("ru = 'Недостаточно прав'"), 
		"SUI_РегламентныеЗадания.УдалитьРегламентноеЗадание");

	НаименованиеДляЖурнала = "";

	Если ТипЗнч(РегламентноеЗадание) = Тип("РегламентноеЗадание") Тогда
		
		Если ЭтоРегламентноеЗаданиеSimple(РегламентноеЗадание) Тогда
			НаименованиеДляЖурнала = РегламентноеЗадание.Наименование;
		Иначе
			РегламентноеЗадание = Неопределено;
		КонецЕсли;
		
	Иначе
		
		РегламентноеЗадание = КлючРегламентногоЗаданияПоПараметру(РегламентноеЗадание);
		
		Если РегламентноеЗадание.Пустая() Тогда
			РегламентноеЗадание = Неопределено;
		Иначе
			НаименованиеДляЖурнала = Строка(РегламентноеЗадание);
			РегламентноеЗадание = РегламентноеЗаданиеПоКлючу(РегламентноеЗадание);
		КонецЕсли;
		
	
	КонецЕсли;
	
	Если РегламентноеЗаданиеЗаполнено(РегламентноеЗадание) Тогда
		
		РегламентноеЗадание.Удалить();
		
		Если Не ПустаяСтрока(НаименованиеДляЖурнала) Тогда
			СообщениеЖурнала = СтрШаблон(НСтр("ru = 'Регламентное задание ""%1"": Удалено'"), НаименованиеДляЖурнала);
			ЗаписатьИнформацию(Неопределено, СообщениеЖурнала);
		КонецЕсли;
		
	Иначе
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Операция удаления не выполнена по причине:
		|Не найдено регламентное задание подсистемы %1.'"), SUI_SimpleКлиентСервер.Представление());
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Выполнить регламентное задание.
// 
// Параметры:
//  КлючРегламентногоЗадания - ПеречислениеСсылка.SUI_КлючиРегламентыхЗаданий - Ключ регламентного задания
//  ИмяМетода - Строка - Имя метода
Процедура ВыполнитьРегламентноеЗадание(КлючРегламентногоЗадания, ИмяМетода) Экспорт
	
	Если КлючРегламентногоЗаданияПоПараметру(КлючРегламентногоЗадания).Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекущееФоновоеЗадание = ПолучитьТекущийСеансИнформационнойБазы().ПолучитьФоновоеЗадание();
	
	ОбщегоНазначенияКлиентСервер.Проверить(
		ТекущееФоновоеЗадание <> Неопределено,
		НСтр("ru = 'Метод предназначен только для выполнения из фонового задания'"),
		"SUI_РегламентныеЗадания.ВыполнитьРегламентноеЗадание");
	
	Если ТекущееФоновоеЗадание.РегламентноеЗадание = Неопределено Тогда
		
		ТекущееЗадание = РегламентноеЗаданиеПоКлючу(КлючРегламентногоЗадания);
		
		ОбщегоНазначенияКлиентСервер.Проверить(
			ТекущееЗадание <> Неопределено И Строка(ТекущееЗадание.УникальныйИдентификатор) = ТекущееФоновоеЗадание.Ключ,
			НСтр("ru = 'Метод предназначен только для выполнения из фонового задания регламентного задания'"),
			"SUI_РегламентныеЗадания.ВыполнитьРегламентноеЗадание");
	
	Иначе
		
		Отбор = Новый Структура();
		Отбор.Вставить("Ключ", Строка(ТекущееФоновоеЗадание.РегламентноеЗадание.УникальныйИдентификатор));
		Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
		Если СвойстваФоновыхЗаданий(Отбор).Количество() > 0 Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	ЗаписатьИнформацию(КлючРегламентногоЗадания, СтрШаблон(НСтр("ru = 'Регламентное задание %1: Запуск'"), КлючРегламентногоЗадания));
	
	ОбщегоНазначения.ВыполнитьМетодКонфигурации(ИмяМетода);

	ЗаписатьИнформацию(КлючРегламентногоЗадания, СтрШаблон(НСтр("ru = 'Регламентное задание %1: Завершение'"), КлючРегламентногоЗадания));
	
КонецПроцедуры

Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия 				= "1.0.0.3";
	Обработчик.Процедура 			= "SUI_РегламентныеЗадания.ИнициализироватьПредопределенныеРегламентныеЗадания_Переход_1_0_0_3";
	Обработчик.РежимВыполнения 		= "Оперативно";
	Обработчик.Комментарий 			= НСтр("ru = 'Инициализация регламентных заданий'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия 				= "1.0.0.3";
	Обработчик.Процедура 			= "SUI_РегламентныеЗадания.ИнициализироватьПредопределенныеРегламентныеЗадания_1_0_0_3";
	Обработчик.РежимВыполнения 		= "Оперативно";
	Обработчик.Комментарий 			= НСтр("ru = 'Инициализация регламентных заданий'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия 				= "1.0.1.4";
	Обработчик.Процедура 			= "SUI_РегламентныеЗадания.ИнициализироватьПредопределенныеРегламентныеЗадания_1_0_1_4";
	Обработчик.РежимВыполнения 		= "Оперативно";
	Обработчик.Комментарий 			= НСтр("ru = 'Инициализация регламентных заданий'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия 				= "1.0.2.1";
	Обработчик.Процедура 			= "SUI_РегламентныеЗадания.ИнициализироватьПредопределенныеРегламентныеЗадания_1_0_2_1";
	Обработчик.РежимВыполнения 		= "Оперативно";
	Обработчик.Комментарий 			= НСтр("ru = 'Инициализация регламентных заданий'");
	
КонецПроцедуры

Процедура ИнициализироватьПредопределенныеРегламентныеЗадания_Переход_1_0_0_3() Экспорт
	
	Если Не Пользователи.ЭтоПолноправныйПользователь() Тогда
		Возврат;
	КонецЕсли;
	
	МетаданныеОбъекта = Метаданные.Справочники.Найти("SUI_РегламентныеЗадания");
	Если МетаданныеОбъекта = Неопределено Тогда
		МетаданныеОбъекта = Метаданные.Справочники.Найти("Удалить_SUI_РегламентныеЗадания");
	КонецЕсли;
	
	Если МетаданныеОбъекта = Неопределено Тогда
		Возврат;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаСправочника.Ссылка,
		|	ТаблицаСправочника.ИдентификаторРегламентногоЗадания,
		|	ТаблицаСправочника.Вид
		|ИЗ
		|	" + МетаданныеОбъекта.ПолноеИмя() + " КАК ТаблицаСправочника";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ВсегоЗаписей = Выборка.Количество();
	СчетчикПрогресса = 0;
	ТекущийСчетчик = 1;
	
	ТекущийКлюч = Перечисления.SUI_КлючиРегламентыхЗаданий.ПустаяСсылка();
	
	НачатьТранзакцию();
		
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить(МетаданныеОбъекта.ПолноеИмя());
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Ссылка", "Ссылка");
		Блокировка.Заблокировать();
			
		Пока Выборка.Следующий() Цикл

			ТекущийКлюч = Выборка.Вид;
			
			Если Выборка.ИдентификаторРегламентногоЗадания <> ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор() Тогда
				
				РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Выборка.ИдентификаторРегламентногоЗадания);
				Если РегламентноеЗаданиеЗаполнено(РегламентноеЗадание) И ЭтоРегламентноеЗаданиеSimple(РегламентноеЗадание) Тогда
					РегламентноеЗадание.Удалить();
				КонецЕсли;
				
			КонецЕсли;
			
			Если ОбщегоНазначения.СсылкаСуществует(Выборка.Ссылка) Тогда
				
				ОбъектСправочникаРЗ = Выборка.Ссылка.ПолучитьОбъект();
				ОбъектСправочникаРЗ.Удалить();
				
			КонецЕсли;

			SUI_ОбновлениеSimple.СообщениеПрогессаВыполненияОбработчика(ВсегоЗаписей, СчетчикПрогресса, ТекущийСчетчик);
			ТекущийСчетчик = ТекущийСчетчик+1;
			
		КонецЦикла;
	
		ЗафиксироватьТранзакцию();
			
	Исключение
		ОтменитьТранзакцию();
		ЗаписатьОшибку(ТекущийКлюч, ИнформацияОбОшибке());
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура ИнициализироватьПредопределенныеРегламентныеЗадания_1_0_0_3() Экспорт
	
	Если Не Пользователи.ЭтоПолноправныйПользователь() Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийКлюч = Перечисления.SUI_КлючиРегламентыхЗаданий.ПустаяСсылка();
	
	Попытка
		
		УстановитьПривилегированныйРежим(Истина);
		
		ИдентификаторыРегламентныхЗаданий = ПолучитьИдентификаторыРегламентныхЗаданий();
		ЗаполнитьРегламентныеЗаданияВТаблицеИдентификаторов(ИдентификаторыРегламентныхЗаданий);
		
		ВсегоЗаписей = ИдентификаторыРегламентныхЗаданий.Количество();
		СчетчикПрогресса = 0;
		ТекущийСчетчик = 1;
		
		Для Каждого СтрокаТаблицы Из ИдентификаторыРегламентныхЗаданий Цикл
			
			ТекущийКлюч = СтрокаТаблицы.Ключ;
			
			Если РегламентноеЗаданиеЗаполнено(СтрокаТаблицы.РегламентноеЗадание) И
				ЭтоРегламентноеЗаданиеSimple(СтрокаТаблицы.РегламентноеЗадание) Тогда
				Продолжить;
			КонецЕсли;

			Если ТекущийКлюч = Перечисления.SUI_КлючиРегламентыхЗаданий.ОчисткаЛогированияHTTPЗапросов Тогда
				Использование = ПолучитьФункциональнуюОпцию("SUI_ЛогированиеHTTPЗапросов");
			Иначе
				Использование = Истина;
			КонецЕсли;
			
			СоздатьРегламентноеЗаданиеПоКлючу(ТекущийКлюч, Использование);
			
			SUI_ОбновлениеSimple.СообщениеПрогессаВыполненияОбработчика(ВсегоЗаписей, СчетчикПрогресса, ТекущийСчетчик);
			ТекущийСчетчик = ТекущийСчетчик+1;
			
		КонецЦикла;
		
	Исключение
		ЗаписатьОшибку(ТекущийКлюч, ИнформацияОбОшибке());
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура ИнициализироватьПредопределенныеРегламентныеЗадания_1_0_1_4() Экспорт
	
	Если Не Пользователи.ЭтоПолноправныйПользователь() Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийКлюч = Перечисления.SUI_КлючиРегламентыхЗаданий.ОчисткаОбработанныхДокументов;
	
	Попытка
		
		УстановитьПривилегированныйРежим(Истина);
		
		ИдентификаторыРегламентныхЗаданий = ПолучитьИдентификаторыРегламентныхЗаданий();
		ЗаполнитьРегламентныеЗаданияВТаблицеИдентификаторов(ИдентификаторыРегламентныхЗаданий);
		
		СтрокаТаблицы = ИдентификаторыРегламентныхЗаданий.Найти(ТекущийКлюч, "Ключ");
		
		Если СтрокаТаблицы = Неопределено Или
			Не РегламентноеЗаданиеЗаполнено(СтрокаТаблицы.РегламентноеЗадание) Или
			Не ЭтоРегламентноеЗаданиеSimple(СтрокаТаблицы.РегламентноеЗадание) Тогда
			СоздатьРегламентноеЗаданиеПоКлючу(ТекущийКлюч, Истина);
		КонецЕсли;

	Исключение
		ЗаписатьОшибку(ТекущийКлюч, ИнформацияОбОшибке());
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура ИнициализироватьПредопределенныеРегламентныеЗадания_1_0_2_1() Экспорт
	
	Если Не Пользователи.ЭтоПолноправныйПользователь() Тогда
		Возврат;
	КонецЕсли;
	
	НовыеРегламентныеЗадания = SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.МассивЗначений(
		Перечисления.SUI_КлючиРегламентыхЗаданий.ОбработкаСообщенийОбменаДанными,
		Перечисления.SUI_КлючиРегламентыхЗаданий.СверткаСообщенийОбменаДанными);
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИдентификаторыРегламентныхЗаданий = ПолучитьИдентификаторыРегламентныхЗаданий();
	ЗаполнитьРегламентныеЗаданияВТаблицеИдентификаторов(ИдентификаторыРегламентныхЗаданий);
	
	Для индекс = 0 По НовыеРегламентныеЗадания.ВГраница() Цикл
		
		Попытка
			
			СтрокаТаблицы = ИдентификаторыРегламентныхЗаданий.Найти(НовыеРегламентныеЗадания[индекс], "Ключ");
			
			Если СтрокаТаблицы = Неопределено Или
				Не РегламентноеЗаданиеЗаполнено(СтрокаТаблицы.РегламентноеЗадание) Или
				Не ЭтоРегламентноеЗаданиеSimple(СтрокаТаблицы.РегламентноеЗадание) Тогда
				СоздатьРегламентноеЗаданиеПоКлючу(НовыеРегламентныеЗадания[индекс], Истина);
			КонецЕсли;
			
		Исключение
			ЗаписатьОшибку(НовыеРегламентныеЗадания[индекс], ИнформацияОбОшибке());
			ВызватьИсключение;
		КонецПопытки;
		
	КонецЦикла;
	
	// Удалить РЗ ФормированиеСлужебныхДанных
	Если Метаданные.Константы.Найти("Удалить_SUI_РЗ_ФормированиеСлужебныхПакетов") <> Неопределено Тогда
		
		ИдентификаторРЗ = Константы.Удалить_SUI_РЗ_ФормированиеСлужебныхПакетов.Получить();
		Если ЗначениеЗаполнено(ИдентификаторРЗ) Тогда
			УдалитьРегламентноеЗадание(РегламентныеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторРЗ));
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗаписьВЖурналРегистрации

Функция ИмяСобытия(ВложенноеСобытие = "")
	Возврат НСтр("ru = 'Регламентные задания'") + ?(ЗначениеЗаполнено(ВложенноеСобытие), ". " + ВложенноеСобытие, "");
КонецФункции

Процедура ЗаписатьВЖурнал(Уровень, КлючРегламентногоЗадания, Текст)
	SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(), Уровень, 
		Метаданные.ОбщиеМодули.SUI_РегламентныеЗадания, КлючРегламентногоЗадания, Текст);
КонецПроцедуры

Процедура ЗаписатьОшибку(КлючРегламентногоЗадания, ТекстСообщения)
	ЗаписатьВЖурнал(УровеньЖурналаРегистрации.Ошибка, КлючРегламентногоЗадания, ТекстСообщения);
КонецПроцедуры

Процедура ЗаписатьПредупреждение(КлючРегламентногоЗадания, ТекстСообщения)
	ЗаписатьВЖурнал(УровеньЖурналаРегистрации.Предупреждение, КлючРегламентногоЗадания, ТекстСообщения);
КонецПроцедуры

Процедура ЗаписатьИнформацию(КлючРегламентногоЗадания, ТекстСообщения)
	ЗаписатьВЖурнал(УровеньЖурналаРегистрации.Информация, КлючРегламентногоЗадания, ТекстСообщения);
КонецПроцедуры

Процедура ЗаписатьПримечание(КлючРегламентногоЗадания, ТекстСообщения)
	ЗаписатьВЖурнал(УровеньЖурналаРегистрации.Примечание, КлючРегламентногоЗадания, ТекстСообщения);
КонецПроцедуры

#КонецОбласти

#Область СозданиеРегламентныхЗаданий

// Параметры создания регламентного задания.
// 
// Параметры:
//  КлючРегламентногоЗадания - ПеречислениеСсылка.SUI_КлючиРегламентыхЗаданий - Ключ регламентного задания
//  Параметры - Неопределено, Массив - Параметры регламентного задания
//  Расписание - Неопределено, РасписаниеРегламентногоЗадания - Расписание регламетного задания
// 
// Возвращаемое значение:
//  Структура - Параметры создания регламентного задания:
// * Метаданные - ОбъектМетаданныхРегламентноеЗадание - Метаданные регламетного задания
// * Наименование - Строка - Наименование регламентного задания
// * Параметры - Массив - Параметры регламентного задания
// * Использование - Булево - Признак использования регламентного задания
// * Расписание - РасписаниеРегламентногоЗадания - Расписание регламетного задания
// * ИмяПользователя - Строка - Имя пользователя от которого будет выполнятся запуск регламетного задания
// * КоличествоПовторовПриАварийномЗавершении - Число -
// * ИнтервалПовтораПриАварийномЗавершении - Число -
Функция ПараметрыСозданияРегламентногоЗадания(КлючРегламентногоЗадания, Параметры = Неопределено, Расписание = Неопределено)
	
	ПараметрыСоздания = Новый Структура();
	
	ОписаниеТипаМассив = Новый ОписаниеТипов("Массив");
	ОписаниеТипаРасписание = Новый ОписаниеТипов("РасписаниеРегламентногоЗадания");
	
	ПараметрыСоздания.Вставить("Метаданные", 		Метаданные.РегламентныеЗадания.ЗапускДополнительныхОбработок);
	ПараметрыСоздания.Вставить("Ключ", 				НРег(ОбщегоНазначения.КонтрольнаяСуммаСтрокой(КлючРегламентногоЗадания, ХешФункция.SHA1)));
	ПараметрыСоздания.Вставить("Наименование", 		СтрШаблон(НСтр("ru = '%1: %2'"), SUI_SimpleКлиентСервер.Представление(), КлючРегламентногоЗадания));
	ПараметрыСоздания.Вставить("Параметры", 		ОписаниеТипаМассив.ПривестиЗначение(Параметры));
	ПараметрыСоздания.Вставить("Использование", 	Истина);
	ПараметрыСоздания.Вставить("Расписание", 		ОписаниеТипаРасписание.ПривестиЗначение(Расписание));
	ПараметрыСоздания.Вставить("ИмяПользователя", 	"");
	ПараметрыСоздания.Вставить("КоличествоПовторовПриАварийномЗавершении", 	1);
	ПараметрыСоздания.Вставить("ИнтервалПовтораПриАварийномЗавершении", 	30);
	
	Возврат ПараметрыСоздания;
	
КонецФункции

// Создать регламентное задание.
// 
// Параметры:
//  ПараметрыСоздания - Структура - см. SUI_РегламентныеЗадания.ПараметрыСозданияРегламентногоЗадания
// 
// Возвращаемое значение:
//  УникальныйИдентификатор - Уникальный идентификатор регламентного задания
Функция СоздатьРегламентноеЗадание(ПараметрыСоздания)
	
	РегламентноеЗадание = РегламентныеЗадания.СоздатьРегламентноеЗадание(ПараметрыСоздания.Метаданные);
	ЗаполнитьЗначенияСвойств(РегламентноеЗадание, ПараметрыСоздания);
	РегламентноеЗадание.Записать();
	
	Возврат РегламентноеЗадание.УникальныйИдентификатор;
	
КонецФункции

Функция СоздатьРегламентноеЗадание_ОбработкаОчередиЗаданий(Использование = Истина)
	
	Ключ = Перечисления.SUI_КлючиРегламентыхЗаданий.ОбработкаОчередиЗаданий;

	МенеджерКонстанты = МенеджерКонстантыРегламентногоЗадания(Ключ);
	
	Если МенеджерКонстанты <> Неопределено Тогда
		
		НачатьТранзакцию();
		
		Попытка
			
			ПараметрыЗадания = Новый Массив();
			ПараметрыЗадания.Добавить(Ключ);
			ПараметрыЗадания.Добавить("SUI_ОчередьЗаданий.ОбработатьОчередь");
			
			Расписание = Новый РасписаниеРегламентногоЗадания();
			Расписание.ПериодПовтораДней = 1;
			Расписание.ПериодПовтораВТечениеДня	= 60;
			
			ПараметрыСоздания = ПараметрыСозданияРегламентногоЗадания(Ключ, ПараметрыЗадания, Расписание);
			ПараметрыСоздания.Использование = Использование;
			
			ИдентификаторЗадания = СоздатьРегламентноеЗадание(ПараметрыСоздания);
		
			МенеджерКонстанты.Установить(ИдентификаторЗадания);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;

	КонецЕсли;

	Возврат ИдентификаторЗадания;
	
КонецФункции

Функция СоздатьРегламентноеЗадание_ОчисткаОчередиЗаданий(Использование = Истина)
	
	Ключ = Перечисления.SUI_КлючиРегламентыхЗаданий.ОчисткаОчередиЗаданий;
	
	МенеджерКонстанты = МенеджерКонстантыРегламентногоЗадания(Ключ);
	
	Если МенеджерКонстанты <> Неопределено Тогда
		
		НачатьТранзакцию();
		
		Попытка
			
			ПараметрыЗадания = Новый Массив();
			ПараметрыЗадания.Добавить(Ключ);
			ПараметрыЗадания.Добавить("SUI_ОчередьЗаданий.ОчиститьОчередь");
			
			Расписание = Новый РасписаниеРегламентногоЗадания();
			Расписание.ПериодПовтораДней = 1;
			
			ПараметрыСоздания = ПараметрыСозданияРегламентногоЗадания(Ключ, ПараметрыЗадания, Расписание);
			ПараметрыСоздания.Использование = Использование;
			
			ИдентификаторЗадания = СоздатьРегламентноеЗадание(ПараметрыСоздания);
		
			МенеджерКонстанты.Установить(ИдентификаторЗадания);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;

	КонецЕсли;

	Возврат ИдентификаторЗадания;
	
КонецФункции

Функция СоздатьРегламентноеЗадание_ОчисткаЛогированияHTTPЗапросов(Использование = Истина)
	
	Ключ = Перечисления.SUI_КлючиРегламентыхЗаданий.ОчисткаЛогированияHTTPЗапросов;
	
	МенеджерКонстанты = МенеджерКонстантыРегламентногоЗадания(Ключ);
	
	Если МенеджерКонстанты <> Неопределено Тогда
		
		НачатьТранзакцию();
		
		Попытка
			
			ПараметрыЗадания = Новый Массив();
			ПараметрыЗадания.Добавить(Ключ);
			ПараметрыЗадания.Добавить("SUI_ЛогированиеHTTPЗапросов.ВыполнитьОчисткуЛогов");
			
			Расписание = Новый РасписаниеРегламентногоЗадания();
			Расписание.ПериодПовтораДней = 1;
			
			ПараметрыСоздания = ПараметрыСозданияРегламентногоЗадания(Ключ, ПараметрыЗадания, Расписание);
			ПараметрыСоздания.Использование = Использование;
			
			ИдентификаторЗадания = СоздатьРегламентноеЗадание(ПараметрыСоздания);
		
			МенеджерКонстанты.Установить(ИдентификаторЗадания);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;

	КонецЕсли;

	Возврат ИдентификаторЗадания;
	
КонецФункции

Функция СоздатьРегламентноеЗадание_ОчисткаОбработанныхДокументов(Использование = Истина)
	
	Ключ = Перечисления.SUI_КлючиРегламентыхЗаданий.ОчисткаОбработанныхДокументов;
	
	МенеджерКонстанты = МенеджерКонстантыРегламентногоЗадания(Ключ);
	
	Если МенеджерКонстанты <> Неопределено Тогда
		
		НачатьТранзакцию();
		
		Попытка
			
			ПараметрыЗадания = Новый Массив();
			ПараметрыЗадания.Добавить(Ключ);
			ПараметрыЗадания.Добавить("SUI_ДокументыОбмена.ВыполнитьОчисткуОбработанныхДокументов");
			
			Расписание = Новый РасписаниеРегламентногоЗадания();
			Расписание.ПериодПовтораДней = 1;
			
			ПараметрыСоздания = ПараметрыСозданияРегламентногоЗадания(Ключ, ПараметрыЗадания, Расписание);
			ПараметрыСоздания.Использование = Использование;
			
			ИдентификаторЗадания = СоздатьРегламентноеЗадание(ПараметрыСоздания);
		
			МенеджерКонстанты.Установить(ИдентификаторЗадания);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;

	КонецЕсли;

	Возврат ИдентификаторЗадания;
	
КонецФункции

Функция СоздатьРегламентноеЗадание_ОчисткаСообщенийМобильныхУстройств(Использование = Истина)
	
	Ключ = Перечисления.SUI_КлючиРегламентыхЗаданий.ОчисткаСообщенийМобильныхУстройств;
	
	МенеджерКонстанты = МенеджерКонстантыРегламентногоЗадания(Ключ);
	
	Если МенеджерКонстанты <> Неопределено Тогда
		
		НачатьТранзакцию();
		
		Попытка
			
			ПараметрыЗадания = Новый Массив();
			ПараметрыЗадания.Добавить(Ключ);
			ПараметрыЗадания.Добавить("SUI_СообщенияМобильныхУстройств.ВыполнитьОчисткуСообщений");
			
			Расписание = Новый РасписаниеРегламентногоЗадания();
			Расписание.ПериодПовтораДней = 1;
			
			ПараметрыСоздания = ПараметрыСозданияРегламентногоЗадания(Ключ, ПараметрыЗадания, Расписание);
			ПараметрыСоздания.Использование = Использование;
			
			ИдентификаторЗадания = СоздатьРегламентноеЗадание(ПараметрыСоздания);
		
			МенеджерКонстанты.Установить(ИдентификаторЗадания);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;

	КонецЕсли;

	Возврат ИдентификаторЗадания;
	
КонецФункции

Функция СоздатьРегламентноеЗадание_ОбработкаСообщенийОбменаДанными(Использование = Истина)
	
	Ключ = Перечисления.SUI_КлючиРегламентыхЗаданий.ОбработкаСообщенийОбменаДанными;

	МенеджерКонстанты = МенеджерКонстантыРегламентногоЗадания(Ключ);
	
	Если МенеджерКонстанты <> Неопределено Тогда
		
		НачатьТранзакцию();
		
		Попытка
			
			ПараметрыЗадания = Новый Массив();
			ПараметрыЗадания.Добавить(Ключ);
			ПараметрыЗадания.Добавить("SUI_СообщенияОбменаДанными.ВыполнитьОбработкуСообщенийОбменаДанными");
			
			Расписание = Новый РасписаниеРегламентногоЗадания();
			Расписание.ПериодПовтораДней = 1;
			Расписание.ПериодПовтораВТечениеДня	= 60;
			
			ПараметрыСоздания = ПараметрыСозданияРегламентногоЗадания(Ключ, ПараметрыЗадания, Расписание);
			ПараметрыСоздания.Использование = Использование;
			
			ИдентификаторЗадания = СоздатьРегламентноеЗадание(ПараметрыСоздания);
		
			МенеджерКонстанты.Установить(ИдентификаторЗадания);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;

	КонецЕсли;

	Возврат ИдентификаторЗадания;
	
КонецФункции

Функция СоздатьРегламентноеЗадание_СверткаСообщенийОбменаДанными(Использование = Истина)
	
	Ключ = Перечисления.SUI_КлючиРегламентыхЗаданий.СверткаСообщенийОбменаДанными;

	МенеджерКонстанты = МенеджерКонстантыРегламентногоЗадания(Ключ);
	
	Если МенеджерКонстанты <> Неопределено Тогда
		
		НачатьТранзакцию();
		
		Попытка
			
			ПараметрыЗадания = Новый Массив();
			ПараметрыЗадания.Добавить(Ключ);
			ПараметрыЗадания.Добавить("SUI_СообщенияОбменаДанными.ВыполнитьСверткуСообщенийОбменаДанными");
			
			Расписание = Новый РасписаниеРегламентногоЗадания();
			Расписание.ПериодПовтораДней = 1;
			Расписание.ПериодПовтораВТечениеДня	= 60;
			
			ПараметрыСоздания = ПараметрыСозданияРегламентногоЗадания(Ключ, ПараметрыЗадания, Расписание);
			ПараметрыСоздания.Использование = Использование;
			
			ИдентификаторЗадания = СоздатьРегламентноеЗадание(ПараметрыСоздания);
		
			МенеджерКонстанты.Установить(ИдентификаторЗадания);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;

	КонецЕсли;

	Возврат ИдентификаторЗадания;
	
КонецФункции

#КонецОбласти

Функция РегламентноеЗаданиеЗаполнено(РегламентноеЗадание)
	
	ОписаниеТипаРегламентноеЗадание = Новый ОписаниеТипов("РегламентноеЗадание");
	УИД = ОписаниеТипаРегламентноеЗадание.ПривестиЗначение(РегламентноеЗадание).УникальныйИдентификатор;
	Возврат УИД <> ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор();
	
КонецФункции

Функция КлючРегламентногоЗаданияПоПараметру(КлючРегламентногоЗадания)

	ОписаниеТипаКлючРегламентногоЗадания = Новый ОписаниеТипов("ПеречислениеСсылка.SUI_КлючиРегламентыхЗаданий");
	Возврат ОписаниеТипаКлючРегламентногоЗадания.ПривестиЗначение(КлючРегламентногоЗадания);
	
КонецФункции

Функция ЭтоРегламентноеЗаданиеSimple(РегламентноеЗадание)
	
	ЕстьКлючРегламентногоЗаданияSimple = Ложь;
	ОписаниеТипаМассив = Новый ОписаниеТипов("Массив");
	ПараметрыЗадания = ОписаниеТипаМассив.ПривестиЗначение(РегламентноеЗадание.Параметры);
	Для индекс = 0 По ПараметрыЗадания.ВГраница() Цикл
		Если ТипЗнч(ПараметрыЗадания[индекс]) = Тип("ПеречислениеСсылка.SUI_КлючиРегламентыхЗаданий") Тогда
			ЕстьКлючРегламентногоЗаданияSimple = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьКлючРегламентногоЗаданияSimple И 
		РегламентноеЗадание.Метаданные = Метаданные.РегламентныеЗадания.ЗапускДополнительныхОбработок Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции

// Получить идентификаторы регламентных заданий.
// 
// Параметры:
//  ИсключитьПустые - Булево - Исключить пустые идентификаторы
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
//		* Ключ - ПеречислениеСсылка.SUI_КлючиРегламентыхЗаданий - Ключ регламентного задания
//		* Идентификатор - УникальныйИдентификатор - Уникальный идентификатор регламентного задания
Функция ПолучитьИдентификаторыРегламентныхЗаданий(ИсключитьПустые = Ложь)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.SUI_КлючиРегламентыхЗаданий.ОбработкаОчередиЗаданий) КАК Ключ,
		|	ТаблицаКонстанты.Значение КАК Идентификатор
		|ПОМЕСТИТЬ втИдентификаторы
		|ИЗ
		|	Константа.SUI_РЗ_ОбработкаОчередиЗаданий КАК ТаблицаКонстанты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.SUI_КлючиРегламентыхЗаданий.ОчисткаОчередиЗаданий),
		|	ТаблицаКонстанты.Значение
		|ИЗ
		|	Константа.SUI_РЗ_ОчисткаОчередиЗаданий КАК ТаблицаКонстанты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.SUI_КлючиРегламентыхЗаданий.ОчисткаЛогированияHTTPЗапросов),
		|	ТаблицаКонстанты.Значение
		|ИЗ
		|	Константа.SUI_РЗ_ОчисткаЛогированияHTTPЗапросов КАК ТаблицаКонстанты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.SUI_КлючиРегламентыхЗаданий.ОчисткаСообщенийМобильныхУстройств),
		|	ТаблицаКонстанты.Значение
		|ИЗ
		|	Константа.SUI_РЗ_ОчисткаСообщенийМобильныхУстройств КАК ТаблицаКонстанты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.SUI_КлючиРегламентыхЗаданий.ОчисткаОбработанныхДокументов),
		|	ТаблицаКонстанты.Значение
		|ИЗ
		|	Константа.SUI_РЗ_ОчисткаОбработанныхДокументов КАК ТаблицаКонстанты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.SUI_КлючиРегламентыхЗаданий.ОбработкаСообщенийОбменаДанными),
		|	ТаблицаКонстанты.Значение
		|ИЗ
		|	Константа.SUI_РЗ_ОбработкаСообщенийОбменаДанными КАК ТаблицаКонстанты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.SUI_КлючиРегламентыхЗаданий.СверткаСообщенийОбменаДанными),
		|	ТаблицаКонстанты.Значение
		|ИЗ
		|	Константа.SUI_РЗ_СверткаСообщенийОбменаДанными КАК ТаблицаКонстанты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втИдентификаторы.Ключ,
		|	втИдентификаторы.Идентификатор
		|ИЗ
		|	втИдентификаторы КАК втИдентификаторы
		|ГДЕ
		|	ВЫБОР
		|		КОГДА &ИсключитьПустыеИдентификаторы
		|			ТОГДА втИдентификаторы.Идентификатор <> &ПустойИдентификатор
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ втИдентификаторы";
	       
	Запрос.УстановитьПараметр("ИсключитьПустыеИдентификаторы", ИсключитьПустые);
	Запрос.УстановитьПараметр("ПустойИдентификатор", ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор());
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция МенеджерКонстантыРегламентногоЗадания(КлючРегламентногоЗадания)
	
	Если КлючРегламентногоЗадания = Перечисления.SUI_КлючиРегламентыхЗаданий.ОбработкаОчередиЗаданий Тогда
		Возврат Константы.SUI_РЗ_ОбработкаОчередиЗаданий;
		
	ИначеЕсли КлючРегламентногоЗадания = Перечисления.SUI_КлючиРегламентыхЗаданий.ОчисткаОчередиЗаданий Тогда
		Возврат Константы.SUI_РЗ_ОчисткаОчередиЗаданий;
		
	ИначеЕсли КлючРегламентногоЗадания = Перечисления.SUI_КлючиРегламентыхЗаданий.ОчисткаЛогированияHTTPЗапросов Тогда
		Возврат Константы.SUI_РЗ_ОчисткаЛогированияHTTPЗапросов;
		
	ИначеЕсли КлючРегламентногоЗадания = Перечисления.SUI_КлючиРегламентыхЗаданий.ОчисткаСообщенийМобильныхУстройств Тогда
		Возврат Константы.SUI_РЗ_ОчисткаСообщенийМобильныхУстройств;
		
	ИначеЕсли КлючРегламентногоЗадания = Перечисления.SUI_КлючиРегламентыхЗаданий.ОчисткаОбработанныхДокументов Тогда
		Возврат Константы.SUI_РЗ_ОчисткаОбработанныхДокументов;
		
	ИначеЕсли КлючРегламентногоЗадания = Перечисления.SUI_КлючиРегламентыхЗаданий.ОбработкаСообщенийОбменаДанными Тогда
		Возврат Константы.SUI_РЗ_ОбработкаСообщенийОбменаДанными;
		
	ИначеЕсли КлючРегламентногоЗадания = Перечисления.SUI_КлючиРегламентыхЗаданий.СверткаСообщенийОбменаДанными Тогда
		Возврат Константы.SUI_РЗ_СверткаСообщенийОбменаДанными;
	
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура ЗаполнитьРегламентныеЗаданияВТаблицеИдентификаторов(ИдентификаторыРегламентныхЗаданий)
	
	КолонкаРЗ = ИдентификаторыРегламентныхЗаданий.Колонки.Найти("РегламентноеЗадание");
	Если КолонкаРЗ <> Неопределено Тогда
		ИдентификаторыРегламентныхЗаданий.Колонки.Удалить(КолонкаРЗ);
	КонецЕсли;
	
	ИдентификаторыРегламентныхЗаданий.Колонки.Добавить("РегламентноеЗадание", Новый ОписаниеТипов("РегламентноеЗадание"));

	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		
		Для Каждого СтрокаТаблицы Из ИдентификаторыРегламентныхЗаданий Цикл
			
			СтрокаТаблицы.РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(СтрокаТаблицы.Идентификатор);
			
			Если СтрокаТаблицы.РегламентноеЗадание <> Неопределено Тогда
				
				ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаТаблицы.РегламентноеЗадание, , "Ключ");

				Если СтрокаТаблицы.РегламентноеЗадание.ПоследнееЗадание <> Неопределено Тогда
					ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаТаблицы.РегламентноеЗадание.ПоследнееЗадание, , "Ключ");
				КонецЕсли;

			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция РегламентноеЗаданиеПоКлючу(КлючРегламентногоЗадания)
	
	Перем РегламентноеЗадание;
	
	УстановитьПривилегированныйРежим(Истина);
	МенеджерКонстанты = МенеджерКонстантыРегламентногоЗадания(КлючРегламентногоЗадания);
	Если МенеджерКонстанты <> Неопределено Тогда
		
		РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(МенеджерКонстанты.Получить());
		
		Если РегламентноеЗадание <> Неопределено И Не ЭтоРегламентноеЗаданиеSimple(РегламентноеЗадание) Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Найденное регламентное задание ""%1"" по ключу ""%2"" не принадлежит подсистеме %3.'"), 
				РегламентноеЗадание.Наименование, КлючРегламентногоЗадания, SUI_SimpleКлиентСервер.Представление());
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			РегламентноеЗадание = Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат РегламентноеЗадание;
	
КонецФункции

// Возвращает свойства последнего фонового задания выполненного при выполнении регламентного задания, если оно есть.
// Процедура работает, как в файл-серверном, так и в клиент-серверном режимах.
//
// Параметры:
//  РегламентноеЗадание - РегламентноеЗадание
//                      - Строка - строка уникального идентификатора РегламентногоЗадания.
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений:
//     * Идентификатор - Строка
//     * Наименование - Строка
//     * Ключ - Строка
//     * Конец - Дата
//     * ИдентификаторРегламентногоЗадания - Строка
//     * Состояние - СостояниеФоновогоЗадания
//     * ИмяМетода - Строка
//     * Расположение - Строка
//     * ОписаниеИнформацииОбОшибке - Строка
//     * ПопыткаЗапуска - Число
//     * СообщенияПользователю - Массив
//     * НомерСеанса - Число
//     * НачалоСеанса - Дата
//
Функция СвойстваПоследнегоФоновогоЗаданияВыполненияРегламентногоЗадания(РегламентноеЗадание)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИдентификаторРегламентногоЗадания = ?(ТипЗнч(РегламентноеЗадание) = Тип("РегламентноеЗадание"), Строка(РегламентноеЗадание.УникальныйИдентификатор), РегламентноеЗадание);
	Отбор = Новый Структура;
	Отбор.Вставить("ИдентификаторРегламентногоЗадания", ИдентификаторРегламентногоЗадания);
	Отбор.Вставить("ПолучитьПоследнееФоновоеЗаданиеРегламентногоЗадания");
	ТаблицаСвойствФоновыхЗаданий = СвойстваФоновыхЗаданий(Отбор);
	ТаблицаСвойствФоновыхЗаданий.Сортировать("Конец Возр");
	
	Если ТаблицаСвойствФоновыхЗаданий.Количество() = 0 Тогда
		СвойстваФоновогоЗадания = Неопределено;
	ИначеЕсли НЕ ЗначениеЗаполнено(ТаблицаСвойствФоновыхЗаданий[0].Конец) Тогда
		СвойстваФоновогоЗадания = ТаблицаСвойствФоновыхЗаданий[0];
	Иначе
		СвойстваФоновогоЗадания = ТаблицаСвойствФоновыхЗаданий[ТаблицаСвойствФоновыхЗаданий.Количество()-1];
	КонецЕсли;
	
	Возврат СвойстваФоновогоЗадания;
	
КонецФункции

Функция СвойстваПоследнегоФоновогоЗаданияПоОтбору(Отбор)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Отбор.Вставить("ПолучитьПоследнееФоновоеЗаданиеРегламентногоЗадания");
	ТаблицаСвойствФоновыхЗаданий = СвойстваФоновыхЗаданий(Отбор);
	ТаблицаСвойствФоновыхЗаданий.Сортировать("Конец Возр");
	
	Если ТаблицаСвойствФоновыхЗаданий.Количество() = 0 Тогда
		СвойстваФоновогоЗадания = Неопределено;
	ИначеЕсли НЕ ЗначениеЗаполнено(ТаблицаСвойствФоновыхЗаданий[0].Конец) Тогда
		СвойстваФоновогоЗадания = ТаблицаСвойствФоновыхЗаданий[0];
	Иначе
		СвойстваФоновогоЗадания = ТаблицаСвойствФоновыхЗаданий[ТаблицаСвойствФоновыхЗаданий.Количество()-1];
	КонецЕсли;
	
	Возврат СвойстваФоновогоЗадания;
	
КонецФункции

// Возвращает таблицу свойств фоновых заданий.
//  Структуру таблицы смотри в функции ПустаяТаблицаСвойствФоновыхЗаданий().
// 
// Параметры:
//  Отбор        - Структура - допустимые поля:
//                 Идентификатор, Ключ, Состояние, Начало, Конец,
//                 Наименование, ИмяМетода, РегламентноеЗадание. 
//
// Возвращаемое значение:
//   см. НовыеСвойстваФоновыхЗаданий
//
Функция СвойстваФоновыхЗаданий(Отбор = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Таблица = НовыеСвойстваФоновыхЗаданий();
	
	Если ЗначениеЗаполнено(Отбор) И Отбор.Свойство("ПолучитьПоследнееФоновоеЗаданиеРегламентногоЗадания") Тогда
		Отбор.Удалить("ПолучитьПоследнееФоновоеЗаданиеРегламентногоЗадания");
		ПолучитьПоследнее = Истина;
	Иначе
		ПолучитьПоследнее = Ложь;
	КонецЕсли;
	
	РегламентноеЗадание = Неопределено;
	
	// Добавление истории фоновых заданий, полученных с сервера.
	Если ЗначениеЗаполнено(Отбор) И Отбор.Свойство("ИдентификаторРегламентногоЗадания") Тогда
		Если Отбор.ИдентификаторРегламентногоЗадания <> "" Тогда
			РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(
				Новый УникальныйИдентификатор(Отбор.ИдентификаторРегламентногоЗадания));
			ТекущийОтбор = Новый Структура("Ключ", Отбор.ИдентификаторРегламентногоЗадания);
			ФоновыеЗаданияЗапущенныеВручную = ФоновыеЗадания.ПолучитьФоновыеЗадания(ТекущийОтбор);
			Если РегламентноеЗадание <> Неопределено Тогда
				ПоследнееФоновоеЗадание = РегламентноеЗадание.ПоследнееЗадание;
			КонецЕсли;
			Если НЕ ПолучитьПоследнее ИЛИ ПоследнееФоновоеЗадание = Неопределено Тогда
				ТекущийОтбор = Новый Структура("РегламентноеЗадание", РегламентноеЗадание);
				АвтоматическиеФоновыеЗадания = ФоновыеЗадания.ПолучитьФоновыеЗадания(ТекущийОтбор);
			КонецЕсли;
			Если ПолучитьПоследнее Тогда
				Если ПоследнееФоновоеЗадание = Неопределено Тогда
					ПоследнееФоновоеЗадание = ПоследнееФоновоеЗаданиеВМассиве(АвтоматическиеФоновыеЗадания);
				КонецЕсли;
				
				ПоследнееФоновоеЗадание = ПоследнееФоновоеЗаданиеВМассиве(
					ФоновыеЗаданияЗапущенныеВручную, ПоследнееФоновоеЗадание);
				
				Если ПоследнееФоновоеЗадание <> Неопределено Тогда
					МассивФоновыхЗаданий = Новый Массив;
					МассивФоновыхЗаданий.Добавить(ПоследнееФоновоеЗадание);
					ДобавитьСвойстваФоновыхЗаданий(МассивФоновыхЗаданий, Таблица);
				КонецЕсли;
				Возврат Таблица;
			КонецЕсли;
			ДобавитьСвойстваФоновыхЗаданий(ФоновыеЗаданияЗапущенныеВручную, Таблица);
			ДобавитьСвойстваФоновыхЗаданий(АвтоматическиеФоновыеЗадания, Таблица);
		Иначе
			МассивФоновыхЗаданий = Новый Массив;
			ВсеИдентификаторыРегламентныхЗаданий = Новый Соответствие;
			Для каждого ТекущееЗадание Из РегламентныеЗадания.ПолучитьРегламентныеЗадания() Цикл
				ВсеИдентификаторыРегламентныхЗаданий.Вставить(
					Строка(ТекущееЗадание.УникальныйИдентификатор), Истина);
			КонецЦикла;
			ВсеФоновыеЗадания = ФоновыеЗадания.ПолучитьФоновыеЗадания();
			Для каждого ТекущееЗадание Из ВсеФоновыеЗадания Цикл
				Если ТекущееЗадание.РегламентноеЗадание = Неопределено
				   И ВсеИдентификаторыРегламентныхЗаданий[ТекущееЗадание.Ключ] = Неопределено Тогда
				
					МассивФоновыхЗаданий.Добавить(ТекущееЗадание);
				КонецЕсли;
			КонецЦикла;
			ДобавитьСвойстваФоновыхЗаданий(МассивФоновыхЗаданий, Таблица);
		КонецЕсли;
	Иначе
		Если НЕ ЗначениеЗаполнено(Отбор) Тогда
			МассивФоновыхЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания();
		Иначе
			Если Отбор.Свойство("Идентификатор") Тогда
				Отбор.Вставить("УникальныйИдентификатор", Новый УникальныйИдентификатор(Отбор.Идентификатор));
				Отбор.Удалить("Идентификатор");
			КонецЕсли;
			МассивФоновыхЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
			Если Отбор.Свойство("УникальныйИдентификатор") Тогда
				Отбор.Вставить("Идентификатор", Строка(Отбор.УникальныйИдентификатор));
				Отбор.Удалить("УникальныйИдентификатор");
			КонецЕсли;
		КонецЕсли;
		ДобавитьСвойстваФоновыхЗаданий(МассивФоновыхЗаданий, Таблица);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Отбор) И Отбор.Свойство("ИдентификаторРегламентногоЗадания") Тогда
		РегламентныеЗаданияДляОбработки = Новый Массив;
		Если Отбор.ИдентификаторРегламентногоЗадания <> "" Тогда
			Если РегламентноеЗадание = Неопределено Тогда
				РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(
					Новый УникальныйИдентификатор(Отбор.ИдентификаторРегламентногоЗадания));
			КонецЕсли;
			Если РегламентноеЗадание <> Неопределено Тогда
				РегламентныеЗаданияДляОбработки.Добавить(РегламентноеЗадание);
			КонецЕсли;
		КонецЕсли;
	Иначе
		РегламентныеЗаданияДляОбработки = РегламентныеЗадания.ПолучитьРегламентныеЗадания();
	КонецЕсли;
	
	Таблица.Сортировать("Начало Убыв, Конец Убыв");
	
	// Отбор фоновых заданий.
	Если ЗначениеЗаполнено(Отбор) Тогда
		Начало    = Неопределено;
		Конец     = Неопределено;
		Состояние = Неопределено;
		Если Отбор.Свойство("Начало") Тогда
			Начало = ?(ЗначениеЗаполнено(Отбор.Начало), Отбор.Начало, Неопределено);
			Отбор.Удалить("Начало");
		КонецЕсли;
		Если Отбор.Свойство("Конец") Тогда
			Конец = ?(ЗначениеЗаполнено(Отбор.Конец), Отбор.Конец, Неопределено);
			Отбор.Удалить("Конец");
		КонецЕсли;
		Если Отбор.Свойство("Состояние") Тогда
			Если ТипЗнч(Отбор.Состояние) = Тип("Массив") Тогда
				Состояние = Отбор.Состояние;
				Отбор.Удалить("Состояние");
			КонецЕсли;
		КонецЕсли;
		
		Если Отбор.Количество() <> 0 Тогда
			Строки = Таблица.НайтиСтроки(Отбор);
		Иначе
			Строки = Таблица;
		КонецЕсли;
		// Выполнение дополнительного отбора по периоду и состоянию (если отбор определен).
		НомерЭлемента = Строки.Количество() - 1;
		Пока НомерЭлемента >= 0 Цикл
			Если Начало    <> Неопределено И Начало > Строки[НомерЭлемента].Начало
				Или Конец     <> Неопределено И Конец  < ?(ЗначениеЗаполнено(Строки[НомерЭлемента].Конец), Строки[НомерЭлемента].Конец, ТекущаяДатаСеанса())
				Или Состояние <> Неопределено И Состояние.Найти(Строки[НомерЭлемента].Состояние) = Неопределено Тогда
				Строки.Удалить(НомерЭлемента);
			КонецЕсли;
			НомерЭлемента = НомерЭлемента - 1;
		КонецЦикла;
		// Удаление лишних строк из таблицы.
		Если ТипЗнч(Строки) = Тип("Массив") Тогда
			НомерСтроки = Таблица.Количество() - 1;
			Пока НомерСтроки >= 0 Цикл
				Если Строки.Найти(Таблица[НомерСтроки]) = Неопределено Тогда
					Таблица.Удалить(Таблица[НомерСтроки]);
				КонецЕсли;
				НомерСтроки = НомерСтроки - 1;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Таблица;
	
КонецФункции

// Возвращает новую таблицу свойств фоновых заданий.
//
// Возвращаемое значение:
//  ТаблицаЗначений:
//     * Идентификатор - Строка
//     * Наименование - Строка
//     * Ключ - Строка
//     * Конец - Дата
//     * ИдентификаторРегламентногоЗадания - Строка
//     * Состояние - СостояниеФоновогоЗадания
//     * ИмяМетода - Строка
//     * Расположение - Строка
//     * ОписаниеИнформацииОбОшибке - Строка
//     * ПопыткаЗапуска - Число
//     * СообщенияПользователю - Массив
//     * НомерСеанса - Число
//     * НачалоСеанса - Дата
//
Функция НовыеСвойстваФоновыхЗаданий()
	
	НоваяТаблица = Новый ТаблицаЗначений;
	НоваяТаблица.Колонки.Добавить("Идентификатор",                     Новый ОписаниеТипов("Строка"));
	НоваяТаблица.Колонки.Добавить("Наименование",                      Новый ОписаниеТипов("Строка"));
	НоваяТаблица.Колонки.Добавить("Ключ",                              Новый ОписаниеТипов("Строка"));
	НоваяТаблица.Колонки.Добавить("Начало",                            Новый ОписаниеТипов("Дата"));
	НоваяТаблица.Колонки.Добавить("Конец",                             Новый ОписаниеТипов("Дата"));
	НоваяТаблица.Колонки.Добавить("ИдентификаторРегламентногоЗадания", Новый ОписаниеТипов("Строка"));
	НоваяТаблица.Колонки.Добавить("Состояние",                         Новый ОписаниеТипов("СостояниеФоновогоЗадания"));
	НоваяТаблица.Колонки.Добавить("ИмяМетода",                         Новый ОписаниеТипов("Строка"));
	НоваяТаблица.Колонки.Добавить("Расположение",                      Новый ОписаниеТипов("Строка"));
	НоваяТаблица.Колонки.Добавить("ОписаниеИнформацииОбОшибке",        Новый ОписаниеТипов("Строка"));
	НоваяТаблица.Колонки.Добавить("ПопыткаЗапуска",                    Новый ОписаниеТипов("Число"));
	НоваяТаблица.Колонки.Добавить("СообщенияПользователю",             Новый ОписаниеТипов("Массив"));
	НоваяТаблица.Колонки.Добавить("НомерСеанса",                       Новый ОписаниеТипов("Число"));
	НоваяТаблица.Колонки.Добавить("НачалоСеанса",                      Новый ОписаниеТипов("Дата"));
	НоваяТаблица.Индексы.Добавить("Идентификатор, Начало");
	
	Возврат НоваяТаблица;
	
КонецФункции

Процедура ДобавитьСвойстваФоновыхЗаданий(Знач МассивФоновыхЗаданий, Знач ТаблицаСвойствФоновыхЗаданий)
	
	Индекс = МассивФоновыхЗаданий.Количество() - 1;
	Пока Индекс >= 0 Цикл
		ФоновоеЗадание = МассивФоновыхЗаданий[Индекс]; // ФоновоеЗадание
		Строка = ТаблицаСвойствФоновыхЗаданий.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, ФоновоеЗадание);
		Строка.Идентификатор = ФоновоеЗадание.УникальныйИдентификатор;
		РегламентноеЗадание = ФоновоеЗадание.РегламентноеЗадание;
		
		Если РегламентноеЗадание = Неопределено
		   И СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ФоновоеЗадание.Ключ) Тогда
			
			РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Новый УникальныйИдентификатор(ФоновоеЗадание.Ключ));
		КонецЕсли;
		Строка.ИдентификаторРегламентногоЗадания = ?(
			РегламентноеЗадание = Неопределено,
			"",
			РегламентноеЗадание.УникальныйИдентификатор);
		
		Строка.ОписаниеИнформацииОбОшибке = ?(
			ФоновоеЗадание.ИнформацияОбОшибке = Неопределено,
			"",
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ФоновоеЗадание.ИнформацияОбОшибке));
		
		Индекс = Индекс - 1;
	КонецЦикла;
	
КонецПроцедуры

Функция ПоследнееФоновоеЗаданиеВМассиве(МассивФоновыхЗаданий, ПоследнееФоновоеЗадание = Неопределено)
	
	Для каждого ТекущееФоновоеЗадание Из МассивФоновыхЗаданий Цикл
		Если ПоследнееФоновоеЗадание = Неопределено Тогда
			ПоследнееФоновоеЗадание = ТекущееФоновоеЗадание;
			Продолжить;
		КонецЕсли;
		Если ЗначениеЗаполнено(ПоследнееФоновоеЗадание.Конец) Тогда
			Если НЕ ЗначениеЗаполнено(ТекущееФоновоеЗадание.Конец)
			 ИЛИ ПоследнееФоновоеЗадание.Конец < ТекущееФоновоеЗадание.Конец Тогда
				ПоследнееФоновоеЗадание = ТекущееФоновоеЗадание;
			КонецЕсли;
		Иначе
			Если НЕ ЗначениеЗаполнено(ТекущееФоновоеЗадание.Конец)
			   И ПоследнееФоновоеЗадание.Начало < ТекущееФоновоеЗадание.Начало Тогда
				ПоследнееФоновоеЗадание = ТекущееФоновоеЗадание;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПоследнееФоновоеЗадание;
	
КонецФункции

Функция ЕстьФоновыеЗаданияВФайловойИБ()
	
	ЗапущеноЗаданийВФайловойИБ = 0;
	Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
		ЗапущеноЗаданийВФайловойИБ = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор).Количество();
	КонецЕсли;
	Возврат ЗапущеноЗаданийВФайловойИБ > 0;

КонецФункции

#КонецОбласти
