
#Область СлужебныйПрограммныйИнтерфейс

Процедура SUI_ПриНачалеРаботыСистемыПереопределяемый() Экспорт
	
	Если Не SUI_SimpleВызовСервера.Используется() Тогда
		Возврат;
	КонецЕсли;
	
	Результат = SUI_SimpleВызовСервера.ПриНачалеРаботыСистемыПереопределяемый(ПараметрЗапуска);

	Если Результат.Свойство("ЗавершениеРаботы") Тогда
		SUI_ОбщегоНазначенияКлиент.ВыполнитьЗавершениеРаботыСистемы(Результат.ЗавершениеРаботы);
	Иначе
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ПриНачалеРаботыСистемыПереопределяемыйПродолжить", SUI_SimpleКлиент);
		
		Если Результат.Свойство("НачатьОбновлениеИнформационнойБазыSimple") Тогда
			SUI_ОбновлениеSimpleКлиент.НачатьОбновлениеИнформационнойБазы(ОповещениеОЗавершении, 
				Новый Структура("НачальныйНомерВерсии", Результат.НачатьОбновлениеИнформационнойБазыSimple));
		Иначе
			ВыполнитьОбработкуОповещения(ОповещениеОЗавершении, Неопределено);
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
