
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	КлючРегламентногоЗадания = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "КлючРегламентногоЗадания");

	ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(КлючРегламентногоЗадания),
		НСтр("ru = 'Не передан ключ регламентного задания'"));

	ИнформацияОРегламентномЗадании = SUI_РегламентныеЗадания.ПолучитьИнформациюОРегламентныхЗаданиях(КлючРегламентногоЗадания);
	
	ОбщегоНазначенияКлиентСервер.Проверить(ИнформацияОРегламентномЗадании.Количество() > 0,
		СтрШаблон(НСтр("ru = 'Не удлось получить информацию о регламентном задании по ключу %1'"), КлючРегламентногоЗадания));

	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ИнформацияОРегламентномЗадании[0]);

	Если ПустаяСтрока(ОписаниеИнформацииОбОшибке) Тогда
		Элементы.СтраницаОшибка.Видимость = Ложь;
		Элементы.ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	КонецЕсли;

	Заголовок = КлючРегламентногоЗадания;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Отказ Или ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		СохранитьИЗакрыть();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РасписаниеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ОткрытьРасписаниеРегламентногоЗаданияЗавершение", ЭтотОбъект);
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(Расписание);
	Диалог.Показать(Оповещение);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаСохранитьИЗакрыть(Команда)
	СохранитьИЗакрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьРасписаниеРегламентногоЗаданияЗавершение(НовоеРасписание, ДополнительныеПараметры) Экспорт
	
	Если НовоеРасписание <> Неопределено Тогда
		Расписание = НовоеРасписание;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть()
	
	Оповещение = Новый ОписаниеОповещения("СохранитьИЗакрытьПослеПодтверждения", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, НСтр("ru = 'Сохранить изменения?'"), РежимДиалогаВопрос.ДаНетОтмена);
		
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрытьПослеПодтверждения(Ответ, ДополнительныеПараметры) Экспорт
	
	ДанныеБылиСохранены = Ложь;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		СохранитьНаСервере();
		ДанныеБылиСохранены = Истина;
		
	ИначеЕсли Ответ <> КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Ложь;
	
	Закрыть(ДанныеБылиСохранены);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	
	ИзмененныеДанные = Новый Структура();
	ИзмененныеДанные.Вставить("Использование", 	Использование);
	ИзмененныеДанные.Вставить("Наименование", 	Наименование);
	ИзмененныеДанные.Вставить("Расписание", 	Расписание);
	ИзмененныеДанные.Вставить("Пользователь", 	Пользователь);
	
	SUI_РегламентныеЗадания.ОбновитьРегламентноеЗаданиеПоКлючу(КлючРегламентногоЗадания, ИзмененныеДанные);
	
КонецПроцедуры

#КонецОбласти
