
#Область СлужебныйПрограммныйИнтерфейс

Функция КолонкиТаблицыДокументыОбмена() Экспорт
	
	Колонки = Новый Массив();
	
	МетаданныеРегистра = Метаданные.РегистрыСведений.SUI_docs;
	
	Для Каждого Измерение Из МетаданныеРегистра.Измерения Цикл
		
		Если Измерение.Имя = "ИмяОбъектаОписанияМетаданного" Тогда
			Продолжить;
		КонецЕсли;
		
		Колонки.Добавить(Новый ФиксированнаяСтруктура(Новый Структура("Имя, Тип, Заголовок", 
			Измерение.Имя, Измерение.Тип, Измерение.Синоним)));
			
	КонецЦикла;
	
	Для Каждого Ресурс Из МетаданныеРегистра.Ресурсы Цикл
		
		Если Ресурс.Имя = "ИмяОбъектаОписанияМетаданного" Тогда
			Продолжить;
		КонецЕсли;
		
		Колонки.Добавить(Новый ФиксированнаяСтруктура(Новый Структура("Имя, Тип, Заголовок", 
			Ресурс.Имя, Ресурс.Тип, Ресурс.Синоним)));
			
	КонецЦикла;
	
	Для Каждого Реквизит Из МетаданныеРегистра.Реквизиты Цикл
		
		Если Реквизит.Имя = "ИмяОбъектаОписанияМетаданного" Или Реквизит.Имя = "ДатаОбновления" Тогда
			Продолжить;
		КонецЕсли;
		
		Колонки.Добавить(Новый ФиксированнаяСтруктура(Новый Структура("Имя, Тип, Заголовок", 
			Реквизит.Имя, Реквизит.Тип, Реквизит.Синоним)));
		
	КонецЦикла;
	
	Возврат Новый ФиксированныйМассив(Колонки);
	
КонецФункции

Функция КолонкиТаблицыТовары() Экспорт
	
	Колонки = Новый Массив();
	
	МетаданныеРегистра = Метаданные.РегистрыСведений.SUI_docs_tbl_goods;
	
	Для Каждого Измерение Из МетаданныеРегистра.Измерения Цикл
		
		Если Измерение.Имя = "ИмяОбъектаОписанияМетаданного" Тогда
			Продолжить;
		КонецЕсли;
		
		Колонки.Добавить(Новый ФиксированнаяСтруктура(Новый Структура("Имя, Тип, Заголовок", 
			Измерение.Имя, Измерение.Тип, ?(ЗначениеЗаполнено(Измерение.Комментарий), Измерение.Комментарий, Измерение.Синоним))));
			
	КонецЦикла;
	
	Для Каждого Ресурс Из МетаданныеРегистра.Ресурсы Цикл
		
		Если Ресурс.Имя = "ИмяОбъектаОписанияМетаданного" Тогда
			Продолжить;
		КонецЕсли;
		
		Колонки.Добавить(Новый ФиксированнаяСтруктура(Новый Структура("Имя, Тип, Заголовок", 
			Ресурс.Имя, Ресурс.Тип, ?(ЗначениеЗаполнено(Ресурс.Комментарий), Ресурс.Комментарий, Ресурс.Синоним))));
			
	КонецЦикла;
	
	Для Каждого Реквизит Из МетаданныеРегистра.Реквизиты Цикл
		
		Если Реквизит.Имя = "ИмяОбъектаОписанияМетаданного" Или Реквизит.Имя = "ДатаОбновления" Тогда
			Продолжить;
		КонецЕсли;
		
		Колонки.Добавить(Новый ФиксированнаяСтруктура(Новый Структура("Имя, Тип, Заголовок", 
			Реквизит.Имя, Реквизит.Тип, ?(ЗначениеЗаполнено(Реквизит.Комментарий), Реквизит.Комментарий, Реквизит.Синоним))));
		
	КонецЦикла;
	
	Возврат Новый ФиксированныйМассив(Колонки);
	
КонецФункции

Функция КолонкиТаблицыПересчетТоваров() Экспорт
	
	Колонки = Новый Массив();
	
	МетаданныеРегистра = Метаданные.РегистрыСведений.SUI_docs_tbl_goods_delta;
	
	Для Каждого Измерение Из МетаданныеРегистра.Измерения Цикл
		
		Если Измерение.Имя = "ИмяОбъектаОписанияМетаданного" Тогда
			Продолжить;
		КонецЕсли;
		
		Колонки.Добавить(Новый ФиксированнаяСтруктура(Новый Структура("Имя, Тип, Заголовок", 
			Измерение.Имя, Измерение.Тип, ?(ЗначениеЗаполнено(Измерение.Комментарий), Измерение.Комментарий, Измерение.Синоним))));
			
	КонецЦикла;
	
	Для Каждого Ресурс Из МетаданныеРегистра.Ресурсы Цикл
		
		Если Ресурс.Имя = "ИмяОбъектаОписанияМетаданного" Тогда
			Продолжить;
		КонецЕсли;
		
		Колонки.Добавить(Новый ФиксированнаяСтруктура(Новый Структура("Имя, Тип, Заголовок", 
			Ресурс.Имя, Ресурс.Тип, ?(ЗначениеЗаполнено(Ресурс.Комментарий), Ресурс.Комментарий, Ресурс.Синоним))));
			
	КонецЦикла;
	
	Для Каждого Реквизит Из МетаданныеРегистра.Реквизиты Цикл
		
		Если Реквизит.Имя = "ИмяОбъектаОписанияМетаданного" Или Реквизит.Имя = "ДатаОбновления" Тогда
			Продолжить;
		КонецЕсли;
		
		Колонки.Добавить(Новый ФиксированнаяСтруктура(Новый Структура("Имя, Тип, Заголовок", 
			Реквизит.Имя, Реквизит.Тип, ?(ЗначениеЗаполнено(Реквизит.Комментарий), Реквизит.Комментарий, Реквизит.Синоним))));
		
	КонецЦикла;
	
	Возврат Новый ФиксированныйМассив(Колонки);
	
КонецФункции

Функция КолонкиТаблицыСерии() Экспорт
	
	Колонки = Новый Массив();
	
	МетаданныеРегистра = Метаданные.РегистрыСведений.SUI_docs_tbl_series;
	
	Для Каждого Измерение Из МетаданныеРегистра.Измерения Цикл
		
		Если Измерение.Имя = "ИмяОбъектаОписанияМетаданного" Тогда
			Продолжить;
		КонецЕсли;
		
		Колонки.Добавить(Новый ФиксированнаяСтруктура(Новый Структура("Имя, Тип, Заголовок", 
			Измерение.Имя, Измерение.Тип, ?(ЗначениеЗаполнено(Измерение.Комментарий), Измерение.Комментарий, Измерение.Синоним))));
			
	КонецЦикла;
	
	Для Каждого Ресурс Из МетаданныеРегистра.Ресурсы Цикл
		
		Если Ресурс.Имя = "ИмяОбъектаОписанияМетаданного" Тогда
			Продолжить;
		КонецЕсли;
		
		Колонки.Добавить(Новый ФиксированнаяСтруктура(Новый Структура("Имя, Тип, Заголовок", 
			Ресурс.Имя, Ресурс.Тип, ?(ЗначениеЗаполнено(Ресурс.Комментарий), Ресурс.Комментарий, Ресурс.Синоним))));
			
	КонецЦикла;
	
	Для Каждого Реквизит Из МетаданныеРегистра.Реквизиты Цикл
		
		Если Реквизит.Имя = "ИмяОбъектаОписанияМетаданного" Или Реквизит.Имя = "ДатаОбновления" Тогда
			Продолжить;
		КонецЕсли;
		
		Колонки.Добавить(Новый ФиксированнаяСтруктура(Новый Структура("Имя, Тип, Заголовок", 
			Реквизит.Имя, Реквизит.Тип, ?(ЗначениеЗаполнено(Реквизит.Комментарий), Реквизит.Комментарий, Реквизит.Синоним))));
		
	КонецЦикла;
	
	Возврат Новый ФиксированныйМассив(Колонки);
	
КонецФункции

Функция КолонкиТаблицыШтрихкодыУпаковок() Экспорт
	
	Колонки = Новый Массив();
	
	МетаданныеРегистра = Метаданные.РегистрыСведений.Удалить_SUI_docs_tbl_barcodes;
	
	Для Каждого Измерение Из МетаданныеРегистра.Измерения Цикл
		
		Если Измерение.Имя = "ИмяОбъектаОписанияМетаданного" Тогда
			Продолжить;
		КонецЕсли;
		
		Колонки.Добавить(Новый ФиксированнаяСтруктура(Новый Структура("Имя, Тип, Заголовок", 
			Измерение.Имя, Измерение.Тип, ?(ЗначениеЗаполнено(Измерение.Комментарий), Измерение.Комментарий, Измерение.Синоним))));
			
	КонецЦикла;
	
	Для Каждого Ресурс Из МетаданныеРегистра.Ресурсы Цикл
		
		Если Ресурс.Имя = "ИмяОбъектаОписанияМетаданного" Тогда
			Продолжить;
		КонецЕсли;
		
		Колонки.Добавить(Новый ФиксированнаяСтруктура(Новый Структура("Имя, Тип, Заголовок", 
			Ресурс.Имя, Ресурс.Тип, ?(ЗначениеЗаполнено(Ресурс.Комментарий), Ресурс.Комментарий, Ресурс.Синоним))));
			
	КонецЦикла;
	
	Для Каждого Реквизит Из МетаданныеРегистра.Реквизиты Цикл
		
		Если Реквизит.Имя = "ИмяОбъектаОписанияМетаданного" Или Реквизит.Имя = "ДатаОбновления" Тогда
			Продолжить;
		КонецЕсли;
		
		Колонки.Добавить(Новый ФиксированнаяСтруктура(Новый Структура("Имя, Тип, Заголовок", 
			Реквизит.Имя, Реквизит.Тип, ?(ЗначениеЗаполнено(Реквизит.Комментарий), Реквизит.Комментарий, Реквизит.Синоним))));
		
	КонецЦикла;
	
	Возврат Новый ФиксированныйМассив(Колонки);
	
КонецФункции

Функция КолонкиТаблицыПотокШтрихкодов() Экспорт
	
	Колонки = Новый Массив();
	
	МетаданныеРегистра = Метаданные.РегистрыСведений.SUI_docs_tbl_barcode_flow;
	
	Для Каждого Измерение Из МетаданныеРегистра.Измерения Цикл
		
		Если Измерение.Имя = "ИмяОбъектаОписанияМетаданного" Тогда
			Продолжить;
		КонецЕсли;
		
		Колонки.Добавить(Новый ФиксированнаяСтруктура(Новый Структура("Имя, Тип, Заголовок", 
			Измерение.Имя, Измерение.Тип, ?(ЗначениеЗаполнено(Измерение.Комментарий), Измерение.Комментарий, Измерение.Синоним))));
			
	КонецЦикла;
	
	Для Каждого Ресурс Из МетаданныеРегистра.Ресурсы Цикл
		
		Если Ресурс.Имя = "ИмяОбъектаОписанияМетаданного" Тогда
			Продолжить;
		КонецЕсли;
		
		Колонки.Добавить(Новый ФиксированнаяСтруктура(Новый Структура("Имя, Тип, Заголовок", 
			Ресурс.Имя, Ресурс.Тип, ?(ЗначениеЗаполнено(Ресурс.Комментарий), Ресурс.Комментарий, Ресурс.Синоним))));
			
	КонецЦикла;
	
	Для Каждого Реквизит Из МетаданныеРегистра.Реквизиты Цикл
		
		Если Реквизит.Имя = "ИмяОбъектаОписанияМетаданного" Или Реквизит.Имя = "ДатаОбновления" Тогда
			Продолжить;
		КонецЕсли;
		
		Колонки.Добавить(Новый ФиксированнаяСтруктура(Новый Структура("Имя, Тип, Заголовок", 
			Реквизит.Имя, Реквизит.Тип, ?(ЗначениеЗаполнено(Реквизит.Комментарий), Реквизит.Комментарий, Реквизит.Синоним))));
		
	КонецЦикла;
	
	Возврат Новый ФиксированныйМассив(Колонки);
	
КонецФункции

Функция КолонкиТаблицыШтрихкодыУпаковокДокументовОбмена() Экспорт
	
	Колонки = Новый Массив();
	
	МетаданныеРегистра = Метаданные.РегистрыСведений.SUI_ШтрихкодыУпаковокДокументовОбмена;
	
	Для Каждого Измерение Из МетаданныеРегистра.Измерения Цикл
		
		Если Измерение.Имя <> "ИмяОбъектаОписанияМетаданного" Тогда
			Колонки.Добавить(НовоеОписаниеКолонкиПоМетаданным(Измерение));
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Ресурс Из МетаданныеРегистра.Ресурсы Цикл
		
		Если Ресурс.Имя <> "ИмяОбъектаОписанияМетаданного" Тогда
			Колонки.Добавить(НовоеОписаниеКолонкиПоМетаданным(Ресурс));
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Реквизит Из МетаданныеРегистра.Реквизиты Цикл
		
		Если Реквизит.Имя <> "ИмяОбъектаОписанияМетаданного" Тогда
			Колонки.Добавить(НовоеОписаниеКолонкиПоМетаданным(Реквизит));
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Новый ФиксированныйМассив(Колонки);
	
КонецФункции

Функция КолонкиТаблицыОтсканированныеШтрихкодыУпаковок() Экспорт
	
	Колонки = Новый Массив();
	
	МетаданныеРегистра = Метаданные.РегистрыСведений.SUI_ОтсканированныеШтрихкодыУпаковокДокументовОбмена;
	
	Для Каждого Измерение Из МетаданныеРегистра.Измерения Цикл
		
		Если Измерение.Имя <> "ИмяОбъектаОписанияМетаданного" Тогда
			Колонки.Добавить(НовоеОписаниеКолонкиПоМетаданным(Измерение));
		КонецЕсли;
			
	КонецЦикла;
	
	Для Каждого Ресурс Из МетаданныеРегистра.Ресурсы Цикл
		
		Если Ресурс.Имя <> "ИмяОбъектаОписанияМетаданного" Тогда
			Колонки.Добавить(НовоеОписаниеКолонкиПоМетаданным(Ресурс));
		КонецЕсли;
			
	КонецЦикла;
	
	Для Каждого Реквизит Из МетаданныеРегистра.Реквизиты Цикл
		
		Если Реквизит.Имя <> "ИмяОбъектаОписанияМетаданного" Тогда
			Колонки.Добавить(НовоеОписаниеКолонкиПоМетаданным(Реквизит));
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Новый ФиксированныйМассив(Колонки);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовоеОписаниеКолонкиПоМетаданным(МетаданныеЭлемента)
	
	ОписаниеКолонки = Новый Структура();
	ОписаниеКолонки.Вставить("Имя", МетаданныеЭлемента.Имя);
	ОписаниеКолонки.Вставить("Заголовок", ?(ЗначениеЗаполнено(МетаданныеЭлемента.Комментарий), МетаданныеЭлемента.Комментарий, МетаданныеЭлемента.Синоним));
	ОписаниеКолонки.Вставить("Тип", МетаданныеЭлемента.Тип);
	
	Возврат Новый ФиксированнаяСтруктура(ОписаниеКолонки);
	
КонецФункции

#КонецОбласти
