
#Область ПрограммныйИнтерфейс

Функция ПараметрыОткрытияНастройкиСхемыКомпоновкиДанных(ОповещениеОЗавершении, ФормаВладелец) Экспорт
	
	Параметры = Новый Структура();
	
	Параметры.Вставить("ОповещениеОЗавершении", ОповещениеОЗавершении);
	Параметры.Вставить("ФормаВладелец", 		ФормаВладелец);
	Параметры.Вставить("Уникальность", 			Неопределено);
	Параметры.Вставить("Окно", 					Неопределено);
	Параметры.Вставить("НавигационнаяСсылка", 	Неопределено);
	Параметры.Вставить("РежимОткрытия", 		Неопределено);
	
	Возврат Параметры;
	
КонецФункции

Функция ПараметрыНастройкиСхемыКомпоновкиДанных(АдресСхемыКомпоновки = "", АдресНастроекКомпоновкиДанных = "", ИдентификаторФормы = Неопределено) Экспорт
	
	Параметры = Новый Структура();
	
	Параметры.Вставить("АдресСхемыКомпоновкиДанных",						АдресСхемыКомпоновки);
	Параметры.Вставить("АдресНастроекКомпоновкиДанных",						АдресНастроекКомпоновкиДанных);
	Параметры.Вставить("УникальныйИдентификатор",							ИдентификаторФормы);
	Параметры.Вставить("Заголовок",											"");
	Параметры.Вставить("ТолькоПросмотр",									Ложь);
	Параметры.Вставить("НеНастраиватьВыбор", 								Ложь);
	Параметры.Вставить("НеНастраиватьПараметры", 							Ложь);
	Параметры.Вставить("НеНастраиватьОтбор", 								Ложь);
	Параметры.Вставить("НеНастраиватьПользовательскиеПоля", 				Истина);
	Параметры.Вставить("НеНастраиватьПорядок", 								Ложь);
	Параметры.Вставить("НеРедактироватьСхемуКомпоновкиДанных",				Ложь);
	Параметры.Вставить("НеЗагружатьСхемуКомпоновкиДанныхИзФайла",			Ложь);
	Параметры.Вставить("НеПомещатьНастройкиВСхемуКомпоновкиДанных",			Истина);
	Параметры.Вставить("ПроцедураПриИнициализацииНастроекКомпоновки",		"");
	Параметры.Вставить("ПроцедураПроверкиСхемыКомпоновкиДанных",			"");
	Параметры.Вставить("ПроцедураПомещенияНастроекВСхемуКомпоновкиДанных",	"");
	
	Возврат Параметры;
	
КонецФункции

// Открыть настройки компоновки данных.
// 
// Параметры:
//  ПараметрыОткрытия - Структура - см. SUI_КомпоновкаДанныхКлиент.ПараметрыНастройкиСхемыКомпоновкиДанных
//  ПараметрыНастройки - Структура - см. SUI_КомпоновкаДанныхКлиент.ПараметрыНастройкиСхемыКомпоновкиДанных
//@skip-check doc-comment-complex-type-with-link
Процедура ОткрытьНастройкиКомпоновкиДанных(ПараметрыОткрытия, ПараметрыНастройки) Экспорт
	
	ОткрытьФорму("ОбщаяФорма.SUI_УпрощеннаяНастройкаСхемыКомпоновкиДанных",
		ПараметрыНастройки, 
		ПараметрыОткрытия.ФормаВладелец,
		ПараметрыОткрытия.Уникальность,
		ПараметрыОткрытия.Окно,
		ПараметрыОткрытия.НавигационнаяСсылка,
		ПараметрыОткрытия.ОповещениеОЗавершении,
		ПараметрыОткрытия.РежимОткрытия);
	
КонецПроцедуры

#КонецОбласти
