
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	

	УстановитьОтборыВТаблицах();
		
	SUI_ИнтеграцияВКонфигурацию.УстановитьДействиеОткрытияИдентификаторов(ЭтотОбъект, "id_");

	ОбновитьСсылкуИдентификатора();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ЗначениеЗаполнено(СсылкаДокумента1С) Тогда
		SUI_ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не верный идентификатор Simple.'"), , "Запись.id_doc", , Отказ);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.sid = Запись.ИсходныйКлючЗаписи.sid Тогда
		ТекущийОбъект.ЗаписьИсторииДанных.ДополнительныеДанные.Вставить("НеУдалятьДанные");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

//@skip-check module-structure-form-event-regions
//@skip-check module-unused-method
&НаКлиенте
Процедура SUI_Переопределяемый_ОткрытиеИдентификатора(Элемент, СтандартнаяОбработка)
	SUI_ИнтеграцияВКонфигурациюКлиент.ОткрытиеИдентификатора(Неопределено, Элемент.ТекстРедактирования, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура id_docПриИзменении(Элемент)
	ОбновитьСсылкуИдентификатора();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОтборыВТаблицах()
	
	SUI_КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(ТаблицаТовары.Отбор, 			"sid_doc", Запись.sid);
	SUI_КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(ТаблицаСерии.Отбор, 				"sid_doc", Запись.sid);
	SUI_КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(ТаблицаШтрихкодыУпаковок.Отбор, 	"sid_doc", Запись.sid);
	SUI_КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(ТаблицаПотокШтрихкодов.Отбор, 	"sid_doc", Запись.sid);
	SUI_КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(ТаблицаПересчетТоваров.Отбор, 	"sid_doc", Запись.sid);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСсылкуИдентификатора()
	СсылкаДокумента1С = SUI_ИнтеграцияВКонфигурацию.СсылкаПоИдентификаторуSimple(Запись.id_doc);
	Заголовок = СсылкаДокумента1С;
КонецПроцедуры

#КонецОбласти
