
#Область ПрограммныйИнтерфейс

Функция КоличествоДнейХранения() Экспорт
	Возврат Константы.SUI_ХранениеЛоговHTTPЗапросовВДнях.Получить();
КонецФункции

Процедура ВыполнитьОчисткуЛогов() Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("SUI_ЛогированиеHTTPЗапросов") Тогда
		Возврат;
	КонецЕсли;
	
	ДниХранения = Константы.SUI_ХранениеЛоговHTTPЗапросовВДнях.Получить();
	
	Если Не ЗначениеЗаполнено(ДниХранения) Тогда
		Возврат;
	КонецЕсли;

	SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(НСтр("ru = 'Удаление'")), УровеньЖурналаРегистрации.Примечание, 
		Метаданные.ОбщиеМодули.SUI_ЛогированиеHTTPЗапросов, , НСтр("ru = 'Начало удаления логов HTTP запросов'"));
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	SUI_ЛогиHTTPЗапросов.Период,
		|	SUI_ЛогиHTTPЗапросов.SID,
		|	SUI_ЛогиHTTPЗапросов.Метод
		|ИЗ
		|	РегистрСведений.SUI_ЛогированиеHTTPЗапросов КАК SUI_ЛогиHTTPЗапросов
		|ГДЕ
		|	SUI_ЛогиHTTPЗапросов.Период < &ДатаНачалаЗаписей
		|
		|УПОРЯДОЧИТЬ ПО
		|	SUI_ЛогиHTTPЗапросов.Период";
	
	Запрос.УстановитьПараметр("ДатаНачалаЗаписей", ТекущаяДатаСеанса() - 86400 * ДниХранения);
	
	Пока Истина Цикл
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			Прервать;
		КонецЕсли;
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.SUI_ЛогированиеHTTPЗапросов");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Период", "Период");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("SID", "SID");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Метод", "Метод");
			Блокировка.Заблокировать();
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
			
				НаборЗаписей = РегистрыСведений.SUI_ЛогированиеHTTPЗапросов.СоздатьНаборЗаписей();
				
				НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
				НаборЗаписей.Отбор.SID.Установить(Выборка.SID);
				НаборЗаписей.Отбор.Метод.Установить(Выборка.Метод);
				
				НаборЗаписей.Записать(Истина);
			
			КонецЦикла;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			Если ТранзакцияАктивна() Тогда
				ОтменитьТранзакцию();
			КонецЕсли;
			SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(НСтр("ru = 'Удаление'")), ,
				Метаданные.ОбщиеМодули.SUI_ЛогированиеHTTPЗапросов, , ИнформацияОбОшибке());
			ВызватьИсключение;
		КонецПопытки;
		
	КонецЦикла;

	SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(НСтр("ru = 'Удаление'")), 
		УровеньЖурналаРегистрации.Примечание, 
		Метаданные.ОбщиеМодули.SUI_ЛогированиеHTTPЗапросов, , 
		НСтр("ru = 'Завершение удаления логов HTTP запросов'"));
	
КонецПроцедуры

#Область УстаревшиеПроцедурыИФункции

// Устарела.
Функция БазовыйURL(HTTPСервисЗапрос) Экспорт 
	
	БазовыйURL = HTTPСервисЗапрос.Заголовки.Получить("X-Forwarded-Path");
	Если БазовыйURL = Неопределено Тогда
		Возврат НормализоватьАдрес(HTTPСервисЗапрос.БазовыйURL);
	Иначе
		ЧастиАдреса = СтрРазделить(НормализоватьАдрес(HTTPСервисЗапрос.БазовыйURL), "/", Ложь);
		Возврат ЧастиАдреса[0] + "//" + ЧастиАдреса[1] + БазовыйURL;
	КонецЕсли;
	
КонецФункции

// Устарела.
Функция НормализоватьАдрес(Адрес) Экспорт 
	
	ЧастиАдреса = СтрРазделить(Адрес, "/", Ложь);
	
	Протокол = СокрЛП(ЧастиАдреса[0]) + "//";
	ЧастиАдреса.Удалить(0);
	
	ЧастиИмени = СтрРазделить(СокрЛП(ЧастиАдреса[0]), ":");
	ЧастиАдреса.Удалить(0);
	ИмяСервера = ЧастиИмени[0];
	ПортСервера = ?(ЧастиИмени.Количество() = 1, "", СокрЛП(ЧастиИмени[1]));
	Если Протокол = "http://" Тогда
		ПортСервера = ?(ПустаяСтрока(ПортСервера) Или ПортСервера = "80", "", ":" + ПортСервера);
	ИначеЕсли Протокол = "https://" Тогда
		ПортСервера = ?(ПустаяСтрока(ПортСервера) Или ПортСервера = "443", "", ":" + ПортСервера);
	Иначе                                                 
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Неизвестный протокол: %1'"), Протокол);
	КонецЕсли;
	
	Путь = "/" + СтрСоединить(ЧастиАдреса, "/");
	
	Возврат Протокол + ИмяСервера + ПортСервера + Путь;
    
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриДобавленииРегламентныхЗаданийПодсистемы(РегламентныеЗаданияПодсистемы) Экспорт
	
	// ВыполнитьОчисткуЛогов
	РегламентноеЗаданиеПодсистемы = РегламентныеЗаданияПодсистемы.Добавить();
	РегламентноеЗаданиеПодсистемы.Ключ = SUI_ЛогированиеHTTPЗапросовКлиентСервер.КлючиРегламентныхЗаданий().ВыполнитьОчисткуЛогов;
	РегламентноеЗаданиеПодсистемы.Наименование = НСтр("ru = 'Simple: Очистка записей логирования HTTP запросов'");
	РегламентноеЗаданиеПодсистемы.ИмяМетода = "SUI_ЛогированиеHTTPЗапросов.ВыполнитьОчисткуЛогов";
	РегламентноеЗаданиеПодсистемы.КоличествоПовторовПриАварийномЗавершении = 1;
	РегламентноеЗаданиеПодсистемы.ИнтервалПовтораПриАварийномЗавершении = 60;
	РегламентноеЗаданиеПодсистемы.Расписание.ПериодПовтораДней = 1;
	
КонецПроцедуры

Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия 				= "1.0.0.3";
	Обработчик.Процедура 			= "SUI_ЛогированиеHTTPЗапросов.ПриОбновленииНаВерсию_1_0_0_3";
	Обработчик.РежимВыполнения 		= "Оперативно";
	Обработчик.Комментарий 			= НСтр("ru = 'Перезапись записей логирования HTTP запросов'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия 				= "1.0.0.7";
	Обработчик.Процедура 			= "SUI_ЛогированиеHTTPЗапросов.ПриОбновленииНаВерсию_1_0_0_7";
	Обработчик.РежимВыполнения 		= "Оперативно";
	Обработчик.Комментарий 			= НСтр("ru = 'Перезапись записей логирования HTTP запросов'");
	
КонецПроцедуры

Процедура ПриОбновленииНаВерсию_1_0_0_3() Экспорт
	
	// Перенести данные лог записей из ХранилищаЗначений в ресурсы строковых типов
	
	Если Метаданные.РегистрыСведений.SUI_ЛогированиеHTTPЗапросов.Реквизиты.Найти("Удалить_Данные") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	SUI_ЛогиHTTPЗапросов.Период,
		|	SUI_ЛогиHTTPЗапросов.SID,
		|	SUI_ЛогиHTTPЗапросов.Метод,
		|	SUI_ЛогиHTTPЗапросов.Удалить_Данные
		|ИЗ
		|	РегистрСведений.SUI_ЛогированиеHTTPЗапросов КАК SUI_ЛогиHTTPЗапросов
		|ГДЕ
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(SUI_ЛогиHTTPЗапросов.ДанныеЗапроса КАК СТРОКА(3)) = ""   ""
		|		И ВЫРАЗИТЬ(SUI_ЛогиHTTPЗапросов.ДанныеОтвета КАК СТРОКА(3)) = ""   ""
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ОписаниеТипаСоответствие = Новый ОписаниеТипов("Соответствие");
	ОписаниеТипаСтрока = SUI_ОбщегоНазначения.ОписаниеТипаСтрока(0);
	
	ВсегоЗаписей = Выборка.Количество();
	СчетчикПрогресса = 0;
	ТекущийСчетчик = 1;
	
	Пока Выборка.Следующий() Цикл
		
		Данные = ОписаниеТипаСтрока.ПривестиЗначение(Выборка.Удалить_Данные.Получить());
		Данные = ОписаниеТипаСоответствие.ПривестиЗначение(SUI_ЛогированиеHTTPЗапросовКлиентСервер.ДанныеJSON(Данные, Истина));
		
		ДанныеHTTPЗапрос = Данные.Получить("HTTPЗапрос");
		Если ДанныеHTTPЗапрос = Неопределено Тогда
			ДанныеHTTPЗапрос = Новый Структура("description", 
				НСтр("ru = 'Не удалось востановить данные записи логирования при обновлении на версию 1.0.0.3.'"));
		КонецЕсли;

		ДанныеHTTPОтвет = Данные.Получить("HTTPОтвет");
		Если ДанныеHTTPОтвет = Неопределено Тогда
			ДанныеHTTPОтвет = Новый Структура("description", 
				НСтр("ru = 'Не удалось востановить данные записи логирования при обновлении на версию 1.0.0.3.'"));
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.SUI_ЛогированиеHTTPЗапросов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
		НаборЗаписей.Отбор.SID.Установить(Выборка.SID);
		НаборЗаписей.Отбор.Метод.Установить(Выборка.Метод);
		
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() > 0 Тогда
			
			Для ИндексЗаписи = 0 По НаборЗаписей.Количество()-1 Цикл
				
				Если ИндексЗаписи = 0 Тогда
					НаборЗаписей[ИндексЗаписи].ДанныеЗапроса = SUI_ОбщегоНазначенияКлиентСервер.ДанныеВСтрокуJSON(
						ДанныеHTTPЗапрос, , "ПреобразованиеДанныхJSON", SUI_ЛогированиеHTTPЗапросовВызовСервера);
					НаборЗаписей[ИндексЗаписи].ДанныеОтвета = SUI_ОбщегоНазначенияКлиентСервер.ДанныеВСтрокуJSON(
						ДанныеHTTPОтвет, , "ПреобразованиеДанныхJSON", SUI_ЛогированиеHTTPЗапросовВызовСервера);
				Иначе
					НаборЗаписей.Удалить(НаборЗаписей[ИндексЗаписи]);
				КонецЕсли;

			КонецЦикла;
			
			НаборЗаписей.Записать(Истина);
			
		КонецЕсли;
		
		SUI_ОбновлениеSimple.СообщениеПрогессаВыполненияОбработчика(ВсегоЗаписей, СчетчикПрогресса, ТекущийСчетчик);
		ТекущийСчетчик = ТекущийСчетчик+1;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриОбновленииНаВерсию_1_0_0_7() Экспорт
	
	// Измерение МобильноеУстройство не используется. Перенести код МУ в ресурс ИдентификаторУстройства
	
	Если Метаданные.РегистрыСведений.SUI_ЛогированиеHTTPЗапросов.Измерения.Найти("Удалить_МобильноеУстройство") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	SUI_ЛогированиеHTTPЗапросов.Период,
		|	SUI_ЛогированиеHTTPЗапросов.SID,
		|	SUI_ЛогированиеHTTPЗапросов.Метод,
		|	SUI_ЛогированиеHTTPЗапросов.Удалить_МобильноеУстройство.Код КАК ИдентификаторУстройства
		|ИЗ
		|	РегистрСведений.SUI_ЛогированиеHTTPЗапросов КАК SUI_ЛогированиеHTTPЗапросов
		|ГДЕ
		|	SUI_ЛогированиеHTTPЗапросов.ИдентификаторУстройства = """"
		|	И
		|		SUI_ЛогированиеHTTPЗапросов.Удалить_МобильноеУстройство <> ЗНАЧЕНИЕ(ПланОбмена.SUI_МобильныеУстройства.ПустаяСсылка)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ВсегоЗаписей = Выборка.Количество();
	СчетчикПрогресса = 0;
	ТекущийСчетчик = 1;
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.SUI_ЛогированиеHTTPЗапросов");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Период", "Период");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("SID", "SID");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Метод", "Метод");
		Блокировка.Заблокировать();
		
		Пока Выборка.Следующий() Цикл

			НаборЗаписей = РегистрыСведений.SUI_ЛогированиеHTTPЗапросов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
			НаборЗаписей.Отбор.SID.Установить(Выборка.SID);
			НаборЗаписей.Отбор.Метод.Установить(Выборка.Метод);
			
			НаборЗаписей.Прочитать();
			
			Если НаборЗаписей.Количество() > 0 Тогда
				
				Для ИндексЗаписи = 0 По НаборЗаписей.Количество() - 1 Цикл
					
					Если ИндексЗаписи = 0 Тогда
						НаборЗаписей[ИндексЗаписи].ИдентификаторУстройства = Выборка.ИдентификаторУстройства;
					Иначе
						НаборЗаписей.Удалить(НаборЗаписей[ИндексЗаписи]);
					КонецЕсли;
					
				КонецЦикла;
				
				НаборЗаписей.Записать(Истина);
				
			КонецЕсли;
			
			SUI_ОбновлениеSimple.СообщениеПрогессаВыполненияОбработчика(ВсегоЗаписей, СчетчикПрогресса, ТекущийСчетчик);
			ТекущийСчетчик = ТекущийСчетчик+1;

		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура ВыгрузитьЛогированиеHTTPЗапросовВФайл(ПараметрыВыгрузки, АдресХранения) Экспорт 
	
	Перем ФайлРезультат;
	
	Схема = РегистрыСведений.SUI_ЛогированиеHTTPЗапросов.ПолучитьМакет("ПолучениеЗаписейЛогирования");

	Идентификаторы = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ПараметрыВыгрузки, "Идентификаторы", Новый Массив(), Тип("Массив"));
	Если Идентификаторы.Количество() > 0 Тогда
		SUI_КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(Схема.НастройкиПоУмолчанию, "SID", Идентификаторы, ВидСравненияКомпоновкиДанных.ВСписке);
	КонецЕсли;

	МакетКомпоновки = SUI_КомпоновкаДанныхСервер.ПолучитьМакетКомпоновки(Схема, Схема.НастройкиПоУмолчанию);
	Запрос = SUI_КомпоновкаДанныхСервер.ПолучитьЗапросИзМакетаКомпоновки(МакетКомпоновки, Схема.НаборыДанных[0].Имя);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда

		ПутьККаталогу = ПолучитьВременныйКаталогДляВыгрузкиЛогирования();
		
		Попытка

			ФайлыЛогирования = Новый Массив();
			
			ИменаСвойств = SUI_ОбщегоНазначения.ПолучитьИменаКолонокРезультатаЗапроса(РезультатЗапроса);
			
			Записи = Новый Массив();
			
			ИндексЗаписи = 0;
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				
				Если ИндексЗаписи = 10000 Тогда
					ФайлыЛогирования.Добавить(ЗаписатьДанныеВФайлJSON(Записи, ПутьККаталогу));
					Записи.Очистить();
					ИндексЗаписи = 0;
				КонецЕсли;
				
				ДанныеЗаписи = Новый Структура(ИменаСвойств);
				ЗаполнитьЗначенияСвойств(ДанныеЗаписи, Выборка);
				
				ДанныеЗаписи.request = SUI_ЛогированиеHTTPЗапросовКлиентСервер.ДанныеJSON(ДанныеЗаписи.request, Истина);
				ДанныеЗаписи.response = SUI_ЛогированиеHTTPЗапросовКлиентСервер.ДанныеJSON(ДанныеЗаписи.response, Истина);
				
				Записи.Добавить(ДанныеЗаписи);
				
				ИндексЗаписи = ИндексЗаписи + 1;
				
			КонецЦикла;
			
			Если Записи.Количество() > 0 Тогда
				ФайлыЛогирования.Добавить(ЗаписатьДанныеВФайлJSON(Записи, ПутьККаталогу));
				Записи.Очистить();
				ИндексЗаписи = 0;
			КонецЕсли;
			
			Если ФайлыЛогирования.Количество() > 0 Тогда

				ФайлАрхив = Новый ЗаписьZipФайла();
				
				ДанныеМанифеста = Новый Структура();
				ДанныеМанифеста.Вставить("number_of_records", Выборка.Количество());
				ДанныеМанифеста.Вставить("files", Новый Массив());
				
				Для индекс = 0 По ФайлыЛогирования.ВГраница() Цикл
					ФайлАрхив.Добавить(ФайлыЛогирования[индекс]);
					ДанныеМанифеста.files.Добавить(СтрЗаменить(ФайлыЛогирования[индекс], ПутьККаталогу, ""));
				КонецЦикла;
				
				ФайлАрхив.Добавить(ЗаписатьДанныеВФайлJSON(ДанныеМанифеста, ПутьККаталогу, "manifest"));
	
				ФайлРезультат = ФайлАрхив.ПолучитьДвоичныеДанные(, , МетодСжатияZIP.Сжатие, УровеньСжатияZIP.Максимальный);
	
			КонецЕсли;

		Исключение
			SUI_ФайловаяСистема.УдалитьВременныйКаталог(ПутьККаталогу);
			ВызватьИсключение;
		КонецПопытки;
		
		SUI_ФайловаяСистема.УдалитьВременныйКаталог(ПутьККаталогу);
		
	КонецЕсли;

	Если ФайлРезультат = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Отсутствуют данные для сохранения'");
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(ФайлРезультат, АдресХранения);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИмяСобытия(ВложенноеСобытие = "")
	Возврат SUI_ЛогированиеHTTPЗапросовКлиентСервер.ИмяСобытия(ВложенноеСобытие);
КонецФункции

Функция ПолучитьВременныйКаталогДляВыгрузкиЛогирования()
	Расширение = СтрШаблон("%1_logging", SUI_SimpleКлиентСервер.ИмяРасширения());
	Возврат SUI_ФайловаяСистема.СоздатьВременныйКаталог(Расширение);
КонецФункции

Функция СформироватьПутьКФайлуЛогирования(ПутьККаталогу, Знач ИмяФайла = "")
	
	Если ПустаяСтрока(ИмяФайла) Тогда
		ИмяФайла = СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", "");
	КонецЕсли;
	
	Возврат ПутьККаталогу + ИмяФайла + ".json";
	
КонецФункции

Функция ЗаписатьДанныеВФайлJSON(Данные, ПутьККаталогу, ИмяФайла = "")
	
	ПутьКФайлу = СформироватьПутьКФайлуЛогирования(ПутьККаталогу, ИмяФайла);
	
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(, Символы.Таб);
	
	НастройкиСериализацииJSON = Новый НастройкиСериализацииJSON();
	НастройкиСериализацииJSON.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.УниверсальнаяДата;
	НастройкиСериализацииJSON.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.ОткрытьФайл(ПутьКФайлу, , , ПараметрыЗаписиJSON);
	ЗаписатьJSON(ЗаписьJSON, Данные, НастройкиСериализацииJSON, "ПреобразованиеДанныхJSON", SUI_ЛогированиеHTTPЗапросов);
	ЗаписьJSON.Закрыть();
	
	Возврат ПутьКФайлу;
	
КонецФункции

Функция ПреобразованиеДанныхJSON(Свойство, Значение, ДополнительныеПараметры, Отказ) Экспорт
	
	Если Значение <> Неопределено Тогда
	
		ТипЗначения = XMLТипЗнч(Значение).ИмяТипа;
		
		Если ТипЗначения = Неопределено Тогда
			Возврат Null;
		ИначеЕсли СтрНайти(ТипЗначения, "Ref.") > 0 Или ТипЗначения = "UUID" Тогда
			Возврат Строка(Значение);
		КонецЕсли;

	КонецЕсли;

КонецФункции

#КонецОбласти
