
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипЗначенияДанныеЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипЗначенияДанныеЗаполнения = Тип("Структура") И Не ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		ЗаполнитьВсемиПоУстановленномуОтбору();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьВсемиПоУстановленномуОтбору()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	МобильныеУстройства.Ссылка КАК МобильноеУстройство,
		|	НастройкиДокументов.Ссылка КАК НастройкаДокумента
		|ИЗ
		|	ПланОбмена.SUI_МобильныеУстройства КАК МобильныеУстройства,
		|	Справочник.SUI_НастройкиДокументов КАК НастройкиДокументов
		|ГДЕ
		|	НЕ МобильныеУстройства.ЭтотУзел
		|	И ВЫБОР
		|		КОГДА &МобильноеУстройство = НЕОПРЕДЕЛЕНО
		|		ИЛИ &МобильноеУстройство = ЗНАЧЕНИЕ(ПланОбмена.SUI_МобильныеУстройства.ПустаяСсылка)
		|			ТОГДА НЕ МобильныеУстройства.ПометкаУдаления
		|		ИНАЧЕ МобильныеУстройства.Ссылка = &МобильноеУстройство
		|	КОНЕЦ
		|	И ВЫБОР
		|		КОГДА &НастройкаДокумента = НЕОПРЕДЕЛЕНО
		|		ИЛИ &НастройкаДокумента = ЗНАЧЕНИЕ(Справочник.SUI_НастройкиДокументов.ПустаяСсылка)
		|			ТОГДА НастройкиДокументов.Используется
		|			И НЕ НастройкиДокументов.ПометкаУдаления
		|		ИНАЧЕ НастройкиДокументов.Ссылка = &НастройкаДокумента
		|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("МобильноеУстройство", Отбор.МобильноеУстройство.Значение);
	Запрос.УстановитьПараметр("НастройкаДокумента", Отбор.НастройкаДокумента.Значение);
	
	Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
