
#Область ПрограммныйИнтерфейс

Функция МакетВBase64(Макет, ЭтоZPL) Экспорт

	СтрокаBase64Макета = Неопределено;
	
	Попытка
		
		Если ЭтоZPL Тогда
			
			Поток = Новый ПотокВПамяти;
			
			Запись = Новый ЗаписьДанных(Поток, КодировкаТекста.UTF8);
		    Запись.ЗаписатьСимволы(Макет);
		    Запись.Закрыть();
		    
		    СтрокаBase64Макета = Base64Строка(Поток.ЗакрытьИПолучитьДвоичныеДанные());
			    
		Иначе
			
			ТабличныйДокумент = ТабличныйДокументМакетаПоЗначению(Макет);
		
			Если ТабличныйДокумент <> Неопределено Тогда
				СтрокаBase64Макета = ДвоичныеДанныеТабличногоДокументаКакHTML(ТабличныйДокумент);
			КонецЕсли;

		КонецЕсли;
		
	Исключение
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(), , 
			Метаданные.ОбщиеМодули.SUI_ШаблоныЭтикеток, , ИнформацияОбОшибке());
	КонецПопытки;
	
	Возврат СтрокаBase64Макета;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИмяСобытия(ВложенноеСобытие = "")
	Возврат НСтр("ru = 'Шаблоны этикеток'") + ?(ЗначениеЗаполнено(ВложенноеСобытие), ". " + ВложенноеСобытие, "");
КонецФункции

Функция СоздатьОписаниеМакета()
	
	Результат = Новый Структура;
	Результат.Вставить("Поля", Новый Массив);
	Результат.Вставить("Ширина", 0);
	Результат.Вставить("Высота", 0);
	Результат.Вставить("Ориентация", 0);
	Результат.Вставить("Масштаб", 0);
	
	Возврат Результат;
	
КонецФункции

Функция ТаблицаПолейXMLОписанияМакета()
	
	Таблица = Новый ТаблицаЗначений();
	
	Таблица.Колонки.Добавить("Наименование", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	Таблица.Колонки.Добавить("Тип", ОбщегоНазначения.ОписаниеТипаСтрока(10));
	Таблица.Колонки.Добавить("Значение", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	Таблица.Колонки.Добавить("Лево", ОбщегоНазначения.ОписаниеТипаЧисло(4, 1, ДопустимыйЗнак.Неотрицательный));
	Таблица.Колонки.Добавить("Право", ОбщегоНазначения.ОписаниеТипаЧисло(4, 1, ДопустимыйЗнак.Неотрицательный));
	Таблица.Колонки.Добавить("Верх", ОбщегоНазначения.ОписаниеТипаЧисло(4, 1, ДопустимыйЗнак.Неотрицательный));
	Таблица.Колонки.Добавить("Низ", ОбщегоНазначения.ОписаниеТипаЧисло(4, 1, ДопустимыйЗнак.Неотрицательный));
	Таблица.Колонки.Добавить("Ориентация", ОбщегоНазначения.ОписаниеТипаЧисло(3, , ДопустимыйЗнак.Неотрицательный));
	Таблица.Колонки.Добавить("ИмяШрифта", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	Таблица.Колонки.Добавить("РазмерШрифта", ОбщегоНазначения.ОписаниеТипаЧисло(2, , ДопустимыйЗнак.Неотрицательный));
	Таблица.Колонки.Добавить("Жирный", Новый ОписаниеТипов("Булево"));
	Таблица.Колонки.Добавить("Наклонный", Новый ОписаниеТипов("Булево"));
	Таблица.Колонки.Добавить("Подчеркивание", Новый ОписаниеТипов("Булево"));
	Таблица.Колонки.Добавить("Зачеркивание", Новый ОписаниеТипов("Булево"));
	Таблица.Колонки.Добавить("РамкаСлева", Новый ОписаниеТипов("Булево"));
	Таблица.Колонки.Добавить("РамкаСверху", Новый ОписаниеТипов("Булево"));
	Таблица.Колонки.Добавить("РамкаСправа", Новый ОписаниеТипов("Булево"));
	Таблица.Колонки.Добавить("РамкаСнизу", Новый ОписаниеТипов("Булево"));
	Таблица.Колонки.Добавить("ТипРамки", ОбщегоНазначения.ОписаниеТипаСтрока(6));
	Таблица.Колонки.Добавить("ТолщинаРамки", ОбщегоНазначения.ОписаниеТипаЧисло(1, , ДопустимыйЗнак.Неотрицательный));	
	Таблица.Колонки.Добавить("ТипШтрихкода", ОбщегоНазначения.ОписаниеТипаСтрока(30));
	Таблица.Колонки.Добавить("ПодписьШтрихкода", Новый ОписаниеТипов("Булево"));
	Таблица.Колонки.Добавить("РазмерШрифтаПодписи", ОбщегоНазначения.ОписаниеТипаЧисло(2, , ДопустимыйЗнак.Неотрицательный));
	Таблица.Колонки.Добавить("ПоложениеПоГоризонтали", ОбщегоНазначения.ОписаниеТипаСтрока(6));
	Таблица.Колонки.Добавить("ПоложениеПоВертикали", ОбщегоНазначения.ОписаниеТипаСтрока(6));
	Таблица.Колонки.Добавить("Многострочность", Новый ОписаниеТипов("Булево"));
	Таблица.Колонки.Добавить("КонтрольныйСимвол", Новый ОписаниеТипов("Булево"));
	Таблица.Колонки.Добавить("ТипЗаполнения", ОбщегоНазначения.ОписаниеТипаСтрока(9));
	Таблица.Колонки.Добавить("ЗначениеПоУмолчанию", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	Таблица.Колонки.Добавить("Представление", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	Таблица.Колонки.Добавить("Формат", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	Таблица.Колонки.Добавить("Фон", Новый ОписаниеТипов("Цвет"));
	
	Возврат Таблица;
	
КонецФункции

Функция ПолучитьОписаниеМакета(Источник, СообщениеОбОшибке, Результат) Экспорт
	
	Результат = СоздатьОписаниеМакета();
	
	ЧтениеXML = Новый ЧтениеXML();
	ПараметрыЧтения = Новый ПараметрыЧтенияXML("1.0");
	ЧтениеXML.УстановитьСтроку(Источник, ПараметрыЧтения);
	
	ШаблонСообщенияОбОшибке = НСтр("ru='При чтении файла атрибута %1 элемента %2 произошла ошибка.'");
	ТекстСообщенияОбОшибке = "";
	
	Пока ПрочитатьЭлементXML(ЧтениеXML, ТекстСообщенияОбОшибке) Цикл
		
		ЗначениеАтрибута = Неопределено;
		Если ЧтениеXML.Имя="Formatting" И ЧтениеXML.ТипУзла=ТипУзлаXML.НачалоЭлемента Тогда
			
			Если ПрочитатьАтрибут(ЧтениеXML, "Width", ЗначениеАтрибута) Тогда
				Результат.Ширина = Число(ЗначениеАтрибута);
			Иначе
				СообщениеОбОшибке = СтрШаблон(ШаблонСообщенияОбОшибке, "Width", "Formatting");
				Возврат Ложь;
			КонецЕсли;
			
			Если ПрочитатьАтрибут(ЧтениеXML, "Height", ЗначениеАтрибута) Тогда
				Результат.Вставить("Высота", Число(ЗначениеАтрибута));
			Иначе
				СообщениеОбОшибке = СтрШаблон(ШаблонСообщенияОбОшибке, "Height", "Formatting");
				Возврат Ложь;
			КонецЕсли;
			
			Если ПрочитатьАтрибут(ЧтениеXML, "Orientation", ЗначениеАтрибута) Тогда
				Результат.Вставить("Ориентация", Число(ЗначениеАтрибута));
			Иначе
				Результат.Вставить("Ориентация", 0);
			КонецЕсли;
			
			Если ПрочитатьАтрибут(ЧтениеXML, "Scale", ЗначениеАтрибута) Тогда
				Результат.Вставить("Масштаб", Число(ЗначениеАтрибута));
			Иначе
				Результат.Вставить("Масштаб", 1);
			КонецЕсли;
			
		ИначеЕсли (ЧтениеXML.Имя="Text" ИЛИ ЧтениеXML.Имя="Barcode" ИЛИ ЧтениеXML.Имя="Image" ИЛИ ЧтениеXML.Имя="UserData") И ЧтениеXML.ТипУзла=ТипУзлаXML.НачалоЭлемента Тогда
			
			НовоеПоле = Новый Структура;
			НовоеПоле.Вставить("Тип", ЧтениеXML.Имя);
			
			Если ПрочитатьАтрибут(ЧтениеXML, "FieldName", ЗначениеАтрибута) Тогда
				НовоеПоле.Вставить("Наименование", ЗначениеАтрибута);
			Иначе
				СообщениеОбОшибке = СтрШаблон(ШаблонСообщенияОбОшибке, "FieldName", "UserData");
				Возврат Ложь;
			КонецЕсли;
			
			Если ПрочитатьАтрибут(ЧтениеXML, "TypeFill", ЗначениеАтрибута) Тогда
				
				Если ЗначениеАтрибута=Неопределено Тогда
					СообщениеОбОшибке = СтрШаблон(ШаблонСообщенияОбОшибке, "TypeFill", "UserData");
					Возврат Ложь;
				КонецЕсли;
				
				НовоеПоле.Вставить("ТипЗаполнения", ЗначениеАтрибута);
				
				Если ЗначениеАтрибута="Parameter" Тогда
					
					Если ПрочитатьАтрибут(ЧтениеXML, "ValueDefault", ЗначениеАтрибута) Тогда
						НовоеПоле.Вставить("ЗначениеПоУмолчанию", ЗначениеАтрибута);
					КонецЕсли;
					
					Если ПрочитатьАтрибут(ЧтениеXML, "Value", ЗначениеАтрибута) Тогда
						Если ЗначениеАтрибута=Неопределено Тогда
							СообщениеОбОшибке = СтрШаблон(ШаблонСообщенияОбОшибке, "Value", "UserData");
							Возврат Ложь;
						Иначе
							НовоеПоле.Вставить("Значение", ЗначениеАтрибута);
						КонецЕсли;
					Иначе
						СообщениеОбОшибке = СтрШаблон(ШаблонСообщенияОбОшибке, "Value", "UserData");
						Возврат Ложь;
					КонецЕсли;
				Иначе
					Если ПрочитатьАтрибут(ЧтениеXML, "Value", ЗначениеАтрибута) Тогда
						НовоеПоле.Вставить("Значение", ЗначениеАтрибута);
					КонецЕсли;
				КонецЕсли;
			Иначе
				СообщениеОбОшибке = СтрШаблон(ШаблонСообщенияОбОшибке, "TypeFill", "UserData");
				Возврат Ложь;
			КонецЕсли;
			
			Если НовоеПоле.Тип<>"UserData" Тогда
				
				Если ПрочитатьАтрибут(ЧтениеXML, "Left", ЗначениеАтрибута) Тогда
					НовоеПоле.Вставить("Лево", Число(ЗначениеАтрибута));
				Иначе
					СообщениеОбОшибке = СтрШаблон(ШаблонСообщенияОбОшибке, "Left", "Text");
					Возврат Ложь;
				КонецЕсли;
				
				Если ПрочитатьАтрибут(ЧтениеXML, "Top", ЗначениеАтрибута) Тогда
					НовоеПоле.Вставить("Верх", Число(ЗначениеАтрибута));
				Иначе
					СообщениеОбОшибке = СтрШаблон(ШаблонСообщенияОбОшибке, "Top", "Text");
					Возврат Ложь;
				КонецЕсли;
				
				Если ПрочитатьАтрибут(ЧтениеXML, "Width", ЗначениеАтрибута) Тогда
					НовоеПоле.Вставить("Право", НовоеПоле.Лево + Число(ЗначениеАтрибута) - 1);
				Иначе
					СообщениеОбОшибке = СтрШаблон(ШаблонСообщенияОбОшибке, "Width", "Text");
					Возврат Ложь;
				КонецЕсли;
				
				Если ПрочитатьАтрибут(ЧтениеXML, "Height", ЗначениеАтрибута) Тогда
					НовоеПоле.Вставить("Низ", НовоеПоле.Верх + Число(ЗначениеАтрибута) - 1);
				Иначе
					СообщениеОбОшибке = СтрШаблон(ШаблонСообщенияОбОшибке, "Height", "Text");
					Возврат Ложь;
				КонецЕсли;
				
				Если ПрочитатьАтрибут(ЧтениеXML, "Orientation", ЗначениеАтрибута) Тогда
					НовоеПоле.Вставить("Ориентация", Число(ЗначениеАтрибута));
				КонецЕсли;
				
				Если НовоеПоле.Тип="Text" Тогда
					
					Если ПрочитатьАтрибут(ЧтениеXML, "FontName", ЗначениеАтрибута) Тогда
						НовоеПоле.Вставить("ИмяШрифта", ЗначениеАтрибута);
					КонецЕсли;
					
					Если ПрочитатьАтрибут(ЧтениеXML, "FontSize", ЗначениеАтрибута) Тогда
						НовоеПоле.Вставить("РазмерШрифта", Число(ЗначениеАтрибута));
					Иначе
						СообщениеОбОшибке = СтрШаблон(ШаблонСообщенияОбОшибке, "FontSize", "Text");
						Возврат Ложь;
					КонецЕсли;
					
					Если ПрочитатьАтрибут(ЧтениеXML, "FontStyle", ЗначениеАтрибута) Тогда
						ЗначениеСтильШрифта = ЗначениеАтрибута;
						НовоеПоле.Вставить("Жирный", Найти(ЗначениеСтильШрифта, "Bold")>0);
						НовоеПоле.Вставить("Наклонный", Найти(ЗначениеСтильШрифта, "Italic")>0);
						НовоеПоле.Вставить("Подчеркивание",  Найти(ЗначениеСтильШрифта, "Underline")>0);
						НовоеПоле.Вставить("Зачеркивание", Найти(ЗначениеСтильШрифта, "Strikeout")>0);
					КонецЕсли;
					
					Если ПрочитатьАтрибут(ЧтениеXML, "Align", ЗначениеАтрибута) Тогда
						НовоеПоле.Вставить("ПоложениеПоГоризонтали", ЗначениеАтрибута);
					КонецЕсли;
					
					Если ПрочитатьАтрибут(ЧтениеXML, "VAlign", ЗначениеАтрибута) Тогда
						НовоеПоле.Вставить("ПоложениеПоВертикали", ЗначениеАтрибута);
					КонецЕсли;
					
					Если ПрочитатьАтрибут(ЧтениеXML, "Multiline", ЗначениеАтрибута) Тогда
						НовоеПоле.Вставить("Многострочность", ЗначениеАтрибута);
					КонецЕсли;
					
				ИначеЕсли НовоеПоле.Тип="Barcode" Тогда
					
					Если ПрочитатьАтрибут(ЧтениеXML, "Type", ЗначениеАтрибута) Тогда
						НовоеПоле.Вставить("ТипШтрихкода", ЗначениеАтрибута);
					Иначе
						СообщениеОбОшибке = СтрШаблон(ШаблонСообщенияОбОшибке, "Type", "Barcode");
						Возврат Ложь;
					КонецЕсли;
					
					Если ПрочитатьАтрибут(ЧтениеXML, "PrintHRI", ЗначениеАтрибута) Тогда
						НовоеПоле.Вставить("ПодписьШтрихкода", ЗначениеАтрибута);
						ПодписьШтрихкода = ЗначениеАтрибута;
					Иначе
						ПодписьШтрихкода = Истина;
					КонецЕсли;
					
					Если ПрочитатьАтрибут(ЧтениеXML, "FontSize", ЗначениеАтрибута) Тогда
						Если ПодписьШтрихкода И ЗначениеАтрибута=Неопределено Тогда
							СообщениеОбОшибке = СтрШаблон(ШаблонСообщенияОбОшибке, "FontSize", "Barcode");
							ШаблонДополнение = НСтр("ru='При значении атрибута %1 = %2 указание значения атрибута %3 обязательно.'");
							СообщениеОбОшибке = СообщениеОбОшибке + Символы.НПП + СтрШаблон(ШаблонДополнение, "PrintHRI", "True", "FontSize");
							Возврат Ложь;
						КонецЕсли;
						НовоеПоле.Вставить("РазмерШрифтаПодписи", Число(ЗначениеАтрибута));
					КонецЕсли;
					
					Если ПрочитатьАтрибут(ЧтениеXML, "CheckSymbol", ЗначениеАтрибута) Тогда
						НовоеПоле.Вставить("КонтрольныйСимвол", ЗначениеАтрибута);
					КонецЕсли;
					
				КонецЕсли;
				
				Если НовоеПоле.Тип = "Text" ИЛИ НовоеПоле.Тип = "Image" Тогда
					
					Если ПрочитатьАтрибут(ЧтениеXML, "Border", ЗначениеАтрибута) Тогда
						ЗначениеBorder = ЗначениеАтрибута;
						НовоеПоле.Вставить("РамкаСлева", Найти(ЗначениеBorder, "Left")>0);
						НовоеПоле.Вставить("РамкаСверху", Найти(ЗначениеBorder, "Top")>0);
						НовоеПоле.Вставить("РамкаСправа",  Найти(ЗначениеBorder, "Right")>0);
						НовоеПоле.Вставить("РамкаСнизу", Найти(ЗначениеBorder, "Bottom")>0);
						Если ЗначениеЗаполнено(ЗначениеBorder) Тогда
							Если ПрочитатьАтрибут(ЧтениеXML, "BorderStyle", ЗначениеАтрибута) Тогда
								НовоеПоле.Вставить("ТипРамки", ЗначениеАтрибута);
							КонецЕсли;
							Если ПрочитатьАтрибут(ЧтениеXML, "BorderWidth", ЗначениеАтрибута) Тогда
								НовоеПоле.Вставить("ТолщинаРамки", Число(ЗначениеАтрибута));
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если НовоеПоле.Тип="UserData" ИЛИ НовоеПоле.Тип="Text" Тогда
				Если ПрочитатьАтрибут(ЧтениеXML, "Format", ЗначениеАтрибута) Тогда
					НовоеПоле.Вставить("Формат", ЗначениеАтрибута);
				КонецЕсли;
			КонецЕсли;
			Результат.Поля.Добавить(НовоеПоле);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ТекстСообщенияОбОшибке) Тогда
		СообщениеОбОшибке = ТекстСообщенияОбОшибке;
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Функция ПрочитатьАтрибут(ЧтениеXML, ИмяАтрибута, ЗначениеАтрибута)
	
	Значение = ЧтениеXML.ЗначениеАтрибута(ИмяАтрибута);
	
	Если Значение = Неопределено Тогда
		ЗначениеАтрибута = Неопределено;
		Возврат Ложь;
	Иначе
		ЗначениеАтрибута = XMLЗначение(Тип("Строка"), Значение);
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Функция ПрочитатьЭлементXML(ЧтениеXML, ТекстСообщенияОбОшибке)
	
	Попытка
		Результат = ЧтениеXML.Прочитать();
	Исключение
		ТекстСообщенияОбОшибке = НСтр("ru = 'При чтении XML-описания макета произошла ошибка.'");
		Результат = Ложь;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Процедура ВставитьКартинкуВТабличныйДокумент(ТабличныйДокумент, Область, ИмяПоля, Картинка)
	
	РисунокШтрихкода = ТабличныйДокумент.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
	
	Индекс = ТабличныйДокумент.Рисунки.Индекс(РисунокШтрихкода);
	
	ТабличныйДокумент.Рисунки[Индекс].Картинка = Картинка;
	ТабличныйДокумент.Рисунки[Индекс].Имя = ИмяПоля;
	ТабличныйДокумент.Рисунки[Индекс].Расположить(Область);
	
	ТабличныйДокумент.Рисунки[Индекс].ГраницаСверху = Ложь;
	ТабличныйДокумент.Рисунки[Индекс].ГраницаСлева = Ложь;
	ТабличныйДокумент.Рисунки[Индекс].ГраницаСнизу = Ложь;
	ТабличныйДокумент.Рисунки[Индекс].ГраницаСправа = Ложь;
	
КонецПроцедуры

Функция ЭтоКартинка(Файл)
	Возврат SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.МассивЗначений(".png", ".jpg", ".jpeg", ".svg").Найти(Файл.Расширение) <> Неопределено;
КонецФункции

Функция ТабличныйДокументМакетаПоЗначению(Макет)

	ТипЗначенияМакета = ТипЗнч(Макет);

	Если ТипЗначенияМакета = Тип("ХранилищеЗначения") Тогда
		Возврат ТабличныйДокументМакетаПоЗначению(Макет.Получить());
	ИначеЕсли ТипЗначенияМакета = Тип("ТабличныйДокумент") Тогда
		Возврат Макет;
	ИначеЕсли ТипЗначенияМакета = Тип("Структура") Или ТипЗначенияМакета = Тип("ФиксированнаяСтруктура") Тогда
		
		Если Макет.Свойство("МакетЭтикетки") Тогда
		
			МакетЭтикетки = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Макет, "МакетЭтикетки", , Тип("ТабличныйДокумент"));
			
			ПараметрыШаблона = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Макет, "ПараметрыШаблона", 
				Новый Соответствие(), Тип("Соответствие"));
			
			Для Каждого ПараметрШаблона Из ПараметрыШаблона Цикл
				
				НайденнаяОбласть = МакетЭтикетки.НайтиТекст("[" + ПараметрШаблона.Значение + "]");
				
				Если НайденнаяОбласть = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				НайденнаяОбласть.Текст = СтрЗаменить(НайденнаяОбласть.Текст, 
					"[" + ПараметрШаблона.Значение + "]", 
					"[" + ПараметрШаблона.Ключ + "]");
				
			КонецЦикла;
			
			Для Каждого Рисунок Из МакетЭтикетки.Рисунки Цикл
				
				Если СтрНачинаетсяС(Рисунок.Имя, "Штрихкод") И СтрДлина(Рисунок.Имя) > 8 Тогда
					
					Если Не ЗначениеЗаполнено(Рисунок.Картинка) Тогда
						Рисунок.Картинка = Новый Картинка(SUI_ШаблоныЭтикетокПовтИсп.КартинкаШтрихкода());
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		ИначеЕсли Макет.Свойство("XMLОписаниеМакета") Тогда
			МакетЭтикетки = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Макет, "XMLОписаниеМакета", "", Тип("Строка"));
		Иначе
			МакетЭтикетки = Неопределено;
		КонецЕсли;

		Возврат ТабличныйДокументМакетаПоЗначению(МакетЭтикетки);
		
	ИначеЕсли ТипЗначенияМакета = Тип("Строка") Тогда
		Возврат ТабличныйДокументПоXMLОписаниюМакета(Макет);
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

Функция ТабличныйДокументПоXMLОписаниюМакета(XMLОписаниеМакета)
	
	Если Не СтрНачинаетсяС(XMLОписаниеМакета, "<?xml version=""1.0""") Тогда
		Возврат Неопределено;
	КонецЕсли;

	СообщениеОбОшибке = Неопределено;
	СодержимоеXMLФайла = СоздатьОписаниеМакета();
	
	Если Не ПолучитьОписаниеМакета(XMLОписаниеМакета, СообщениеОбОшибке, СодержимоеXMLФайла) Тогда
		ВызватьИсключение СообщениеОбОшибке;
	КонецЕсли;
	
	Поля = ТаблицаПолейXMLОписанияМакета();
	
	ТабличныйДокумент = Новый ТабличныйДокумент();

	ОдинМиллиметрШирины = 0.535;
	ОдинМиллиметрВысоты = 2.711;
	//ШагСетки 			= 1;
	ШагСетки 			= СодержимоеXMLФайла.Масштаб;
	ШиринаЭтикетки 		= СодержимоеXMLФайла.Ширина;
	ВысотаЭтикетки 		= СодержимоеXMLФайла.Высота;

	ТабличныйДокумент.Область().АвтоВысотаСтроки = Ложь;	
	ТабличныйДокумент.Область().ВысотаСтроки = ОдинМиллиметрВысоты;
	ТабличныйДокумент.Область().ШиринаКолонки = ОдинМиллиметрШирины;
	ТабличныйДокумент.Область(2, 2, ВысотаЭтикетки+1, ШиринаЭтикетки+1).ЦветФона = Новый Цвет(255,255,255);
	
	Для Каждого ТекПоле Из СодержимоеXMLФайла.Поля Цикл
		
		НовоеПоле = Поля.Добавить();
		ЗаполнитьЗначенияСвойств(НовоеПоле, ТекПоле);
		
		Если ТекПоле.Тип = "Text" Или ТекПоле.Тип = "UserData" Тогда
			НовоеПоле.Представление = ТекПоле.Значение;
		ИначеЕсли ТекПоле.Тип = "Barcode" Тогда
			НовоеПоле.Представление = СтрШаблон(НСтр("ru = 'Штрихкод %1'"), Строка(ТекПоле.ТипШтрихкода));
		ИначеЕсли ТекПоле.Тип = "Image" Тогда
			НовоеПоле.Представление = НСтр("ru = 'Картинка'");
		КонецЕсли;
		
		Если ТекПоле.Тип <> "UserData" Тогда
			ДобавитьОформлениеПоляВТабличныйДокумент(ТабличныйДокумент, ШагСетки, НовоеПоле);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Процедура ДобавитьОформлениеПоляВТабличныйДокумент(ТабличныйДокумент, ШагСетки, ОписаниеПоля)
	
	Область = ТабличныйДокумент.Область((ОписаниеПоля.Верх-1)/ШагСетки+1, (ОписаниеПоля.Лево-1)/ШагСетки+1, ОписаниеПоля.Низ/ШагСетки, ОписаниеПоля.Право/ШагСетки);
	Область.Объединить();
	Область.Имя = ОписаниеПоля.Наименование;
	
	Если ОписаниеПоля.Тип = "Text" Тогда
		
		Если ОписаниеПоля.ТипЗаполнения = "Constant" Тогда
			Область.Заполнение=ТипЗаполненияОбластиТабличногоДокумента.Текст;
			Область.Текст = ОписаниеПоля.Значение;
		Иначе
			//Область.Заполнение=ТипЗаполненияОбластиТабличногоДокумента.Параметр;
			//Область.Параметр = ОписаниеПоля.Значение;
			Область.Заполнение=ТипЗаполненияОбластиТабличногоДокумента.Шаблон;
			Область.Параметр = "[" + ОписаниеПоля.Значение + "]";
		КонецЕсли;
		
		Если ОписаниеПоля.Многострочность Тогда
			Область.РазмещениеТекста=ТипРазмещенияТекстаТабличногоДокумента.Переносить;
		Иначе
			Область.РазмещениеТекста=ТипРазмещенияТекстаТабличногоДокумента.Обрезать;
		КонецЕсли;
		
		Область.ОриентацияТекста = ОписаниеПоля.Ориентация;
		
		Если ОписаниеПоля.ПоложениеПоГоризонтали = "Left" Тогда
			Область.ГоризонтальноеПоложение=ГоризонтальноеПоложение.Лево;
		ИначеЕсли ОписаниеПоля.ПоложениеПоГоризонтали = "Center" Тогда
			Область.ГоризонтальноеПоложение=ГоризонтальноеПоложение.Центр;
		ИначеЕсли ОписаниеПоля.ПоложениеПоГоризонтали = "Right" Тогда
			Область.ГоризонтальноеПоложение=ГоризонтальноеПоложение.Право;
		Иначе
			Область.ГоризонтальноеПоложение=ГоризонтальноеПоложение.Лево;
		КонецЕсли;
		
		Если ОписаниеПоля.ПоложениеПоВертикали = "Top" Тогда
			Область.ВертикальноеПоложение=ВертикальноеПоложение.Верх;
		ИначеЕсли ОписаниеПоля.ПоложениеПоВертикали = "Center" Тогда
			Область.ВертикальноеПоложение=ВертикальноеПоложение.Центр;
		ИначеЕсли ОписаниеПоля.ПоложениеПоВертикали = "Bottom" Тогда
			Область.ВертикальноеПоложение=ВертикальноеПоложение.Низ;
		Иначе
			Область.ВертикальноеПоложение=ВертикальноеПоложение.Верх;
		КонецЕсли;
		
		Если ШагСетки=1 Тогда
			Множитель = 1;
		ИначеЕсли ШагСетки=0.5 Тогда
			Множитель = 2;
		ИначеЕсли ШагСетки = 0.2 Тогда
			Множитель = 5;
		Иначе
			Множитель = 10;
		КонецЕсли;
		
		Область.Шрифт = Новый Шрифт(ОписаниеПоля.ИмяШрифта,ОписаниеПоля.РазмерШрифта * Множитель, ОписаниеПоля.Жирный, 
			ОписаниеПоля.Наклонный, ОписаниеПоля.Подчеркивание, ОписаниеПоля.Зачеркивание);

	ИначеЕсли ОписаниеПоля.Тип = "Barcode" Тогда		
		
		Если ОписаниеПоля.ТипЗаполнения = "Constant" Тогда
			ВставитьКартинкуВТабличныйДокумент(ТабличныйДокумент, Область, ОписаниеПоля.Наименование,
				Новый Картинка(Base64Значение(ОписаниеПоля.ЗначениеПоУмолчанию)));  
		ИначеЕсли ОписаниеПоля.ТипЗаполнения = "Parameter" Тогда
			ВставитьКартинкуВТабличныйДокумент(ТабличныйДокумент, Область, ОписаниеПоля.Наименование,
				Новый Картинка(SUI_ШаблоныЭтикетокПовтИсп.КартинкаШтрихкода()));
		КонецЕсли;

		Область.Текст = НСтр("ru = 'Barcode'");
		Область.РазмещениеТекста=ТипРазмещенияТекстаТабличногоДокумента.Переносить;
		
		Если ШагСетки=1 Тогда
			РазмерШрифта = 8;
		ИначеЕсли ШагСетки=0.5 Тогда
			РазмерШрифта = 16;
		ИначеЕсли ШагСетки = 0.2 Тогда
			РазмерШрифта = 24;
		Иначе
			РазмерШрифта = 36;
		КонецЕсли;
		
		Область.Шрифт = Новый Шрифт(, РазмерШрифта);
		Область.ОриентацияТекста = ОписаниеПоля.Ориентация;
		Область.ГоризонтальноеПоложение=ГоризонтальноеПоложение.Центр;
		Область.ВертикальноеПоложение=ВертикальноеПоложение.Центр;
		
	ИначеЕсли ОписаниеПоля.Тип = "Image" Тогда
		
		Если ОписаниеПоля.ТипЗаполнения = "Constant" Тогда
			ВставитьКартинкуВТабличныйДокумент(ТабличныйДокумент, Область, ОписаниеПоля.Наименование, 
				Новый Картинка(Base64Значение(ОписаниеПоля.Значение))); 
		Иначе
			ВставитьКартинкуВТабличныйДокумент(ТабличныйДокумент, Область, ОписаниеПоля.Наименование, 
				Новый Картинка(Base64Значение(ОписаниеПоля.ЗначениеПоУмолчанию)));
		КонецЕсли;

		Область.Текст = НСтр("ru = 'Image'");
		Область.РазмещениеТекста=ТипРазмещенияТекстаТабличногоДокумента.Переносить;
		
		Если ШагСетки=1 Тогда
			РазмерШрифта = 8;
		ИначеЕсли ШагСетки=0.5 Тогда
			РазмерШрифта = 16;
		ИначеЕсли ШагСетки = 0.2 Тогда
			РазмерШрифта = 24;
		Иначе
			РазмерШрифта = 36;
		КонецЕсли;
		
		Область.Шрифт = Новый Шрифт(, РазмерШрифта);
		Область.ОриентацияТекста = ОписаниеПоля.Ориентация;
		Область.ГоризонтальноеПоложение=ГоризонтальноеПоложение.Центр;
		Область.ВертикальноеПоложение=ВертикальноеПоложение.Центр;
		
	КонецЕсли;
	
	Если ОписаниеПоля.Тип = "Text" Или ОписаниеПоля.Тип = "Image" Тогда
		
		Если ОписаниеПоля.ТипРамки = "Solid" Тогда
			ТипЛинии = ТипЛинииЯчейкиТабличногоДокумента.Сплошная;
		ИначеЕсли ОписаниеПоля.ТипРамки = "Double" Тогда
			ТипЛинии = ТипЛинииЯчейкиТабличногоДокумента.Двойная;
		ИначеЕсли ОписаниеПоля.ТипРамки = "Dotted" Тогда
			ТипЛинии = ТипЛинииЯчейкиТабличногоДокумента.Точечная;
		ИначеЕсли ОписаниеПоля.ТипРамки = "Dashed" Тогда
			ТипЛинии = ТипЛинииЯчейкиТабличногоДокумента.БольшойПунктир;
		Иначе
			ТипЛинии = ТипЛинииЯчейкиТабличногоДокумента.НетЛинии;
		КонецЕсли;
		
		Рамка = Новый Линия(ТипЛинии, ОписаниеПоля.ТолщинаРамки);
		
		Если ОписаниеПоля.РамкаСлева Тогда
			Область.ГраницаСлева=Рамка;
		Иначе
			Область.ГраницаСлева=Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии, 0);
		КонецЕсли;
		
		Если ОписаниеПоля.РамкаСправа Тогда
			Область.ГраницаСправа=Рамка;
		Иначе
			Область.ГраницаСправа=Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии, 0);
		КонецЕсли;
		
		Если ОписаниеПоля.РамкаСверху Тогда
			Область.ГраницаСверху=Рамка;
		Иначе
			Область.ГраницаСверху=Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии, 0);
		КонецЕсли;
		
		Если ОписаниеПоля.РамкаСнизу Тогда
			Область.ГраницаСнизу=Рамка;
		Иначе
			Область.ГраницаСнизу=Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии, 0);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОписаниеПоля.Тип = "Barcode" Или ОписаниеПоля.Тип = "Image" Тогда
		Область.ЦветФона = Новый Цвет(235, 235, 235);
	Иначе
		
		Если Не ОписаниеПоля.РамкаСлева И Не ОписаниеПоля.РамкаСверху И Не ОписаниеПоля.РамкаСправа И Не ОписаниеПоля.РамкаСнизу Тогда
			Рамка = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
			Область.ГраницаСлева = Рамка;
			Область.ГраницаСверху = Рамка;
			Область.ГраницаСправа = Рамка;
			Область.ГраницаСнизу = Рамка;
			Область.ЦветРамки = Новый Цвет(235, 235, 235);
		Иначе
			Область.ЦветРамки = Новый Цвет(0, 0, 0);
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

Функция ДвоичныеДанныеТабличногоДокументаКакHTML(ТабличныйДокумент, ВернутьСтрокойBase64 = Истина)
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(".html");
		
	ТабличныйДокумент.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.HTML);
	
	ЗаписатьКартинкиHTMLСтрокойBase64(ИмяВременногоФайла);
	
	ДвоичныеДанныеТабличногоДокумента = Новый ДвоичныеДанные(ИмяВременногоФайла);

	Если ВернутьСтрокойBase64 Тогда
		ДвоичныеДанныеТабличногоДокумента = Base64Строка(ДвоичныеДанныеТабличногоДокумента);
	КонецЕсли;

	УдалитьФайлы(ИмяВременногоФайла);
	
	Возврат ДвоичныеДанныеТабличногоДокумента;
	
КонецФункции

Процедура ЗаписатьКартинкиHTMLСтрокойBase64(ПутьКФайлуHTML)
	
	ФайлHTML = Новый Файл(ПутьКФайлуHTML);
	
	Если Не ФайлHTML.Существует() Или ФайлHTML.ЭтоКаталог() Тогда
		Возврат;
	КонецЕсли;
	
	КаталогФайлов = Новый Файл(ФайлHTML.Путь + ФайлHTML.ИмяБезРасширения + "_files");
	
	Если Не КаталогФайлов.Существует() Или Не КаталогФайлов.ЭтоКаталог() Тогда
		Возврат;
	КонецЕсли;
	
	ФайлыВКаталоге = НайтиФайлы(КаталогФайлов.ПолноеИмя, "*.*");
	
	Если ФайлыВКаталоге.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаФайлы = ТаблицаФайлыКаталогаФайлаHTML();
	
	Для Каждого ФайлВКаталоге Из ФайлыВКаталоге Цикл

		Если Не ЭтоКартинка(ФайлВКаталоге) Тогда
			Продолжить;
		КонецЕсли;
		
		ДобавитьДанныеФайлаКаталогаФайлаHTMLВТаблицу(ТаблицаФайлы, ФайлВКаталоге);

	КонецЦикла;
	
	Если ТаблицаФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстHTML = Новый ТекстовыйДокумент;
   	ТекстHTML.Прочитать(ФайлHTML.ПолноеИмя);
	
	Для НомерСтроки = 1 По ТекстHTML.КоличествоСтрок() Цикл
				
		СтрокаТекстаHTML = ТекстHTML.ПолучитьСтроку(НомерСтроки);
		
		Для Каждого ФайлВТаблице Из ТаблицаФайлы Цикл
			
			НомерСимволаIMG = Найти(СтрокаТекстаHTML, "<IMG SRC = """ + КаталогФайлов.Имя + "/" + ФайлВТаблице.Имя + """ ALT = """"");
					
			Если НомерСимволаIMG = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			НачалоТекстаКартинки = СтрНайти(СтрокаТекстаHTML, """>");
					
			Если НачалоТекстаКартинки > 0 Тогда
				
				ТекстКартинки = Сред(СтрокаТекстаHTML, НачалоТекстаКартинки + 1, НомерСимволаIMG - НачалоТекстаКартинки + 10);
				
				Если Лев(ТекстКартинки, 1) = ">" И Прав(ТекстКартинки, 11) = "<IMG SRC = " Тогда
					ТекстКартинки = Сред(ТекстКартинки, 2, СтрДлина(ТекстКартинки) - 12);
				Иначе
					ТекстКартинки = "";
				КонецЕсли;
				
			Иначе
				ТекстКартинки = "";
			КонецЕсли;

			СтрокаЗамены = СтрЗаменить(СтрокаТекстаHTML, 
				"<IMG SRC = """ + КаталогФайлов.Имя + "/" + ФайлВТаблице.Имя + """ ALT = """"", 
				"<IMG SRC = ""data:image/png;base64," + ФайлВТаблице.СтрокаBase64 + """ ALT = """ + ТекстКартинки + """");
			
			Если ЗначениеЗаполнено(ТекстКартинки) Тогда
				СтрокаЗамены = СтрЗаменить(СтрокаЗамены, ">" + ТекстКартинки + "<IMG SRC =", "><IMG SRC =");
			КонецЕсли;
			
			ТекстHTML.ЗаменитьСтроку(НомерСтроки, СтрокаЗамены);
			
			ТаблицаФайлы.Удалить(ФайлВТаблице);
			
			Прервать;
			
		КонецЦикла;

		Если ТаблицаФайлы.Количество() = 0 Тогда
			Прервать;
		КонецЕсли;

	КонецЦикла;
	
	ТекстHTML.Записать(ФайлHTML.ПолноеИмя);
			
КонецПроцедуры

Функция ТаблицаФайлыКаталогаФайлаHTML()
	
	Таблица = Новый ТаблицаЗначений;
	
	Таблица.Колонки.Добавить("Имя", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	Таблица.Колонки.Добавить("СтрокаBase64", ОбщегоНазначения.ОписаниеТипаСтрока(0));

	Возврат Таблица;

КонецФункции

Процедура ДобавитьДанныеФайлаКаталогаФайлаHTMLВТаблицу(Таблица, ФайлКаталога)
	
	СтрокаФайл = Таблица.Добавить();
		
	СтрокаФайл.Имя = ФайлКаталога.Имя;
	СтрокаФайл.СтрокаBase64 = Base64Строка(Новый ДвоичныеДанные(ФайлКаталога.ПолноеИмя));
		
КонецПроцедуры

#КонецОбласти
