
#Область ПрограммныйИнтерфейс

Функция ПустойПакет(ФорматПакета, ДанныеПакета = Неопределено) Экспорт
	
	Пакет = Новый Структура();
	
	Пакет.Вставить("format", 				ФорматПакета);
	Пакет.Вставить("data", 					ДанныеПакета);
	Пакет.Вставить("messages", 				Новый Массив());
	
	Возврат Пакет;

КонецФункции

Функция ФорматПакета_Ждать() Экспорт
	Возврат "is_ok";
КонецФункции

Функция ФорматПакета_НетДанных() Экспорт
	Возврат "no_data";
КонецФункции

Функция ФорматПакета_ЕстьДанные() Экспорт
	Возврат "is_data";
КонецФункции

Функция ФорматПакета_Команда() Экспорт
	Возврат "is_cmd";
КонецФункции

Функция ФорматПакета_НастройкиМобильныхУстройств() Экспорт
	Возврат "is_settings";
КонецФункции

Функция КлючТаблицы_ДокументыЗавершенные() Экспорт
	Возврат "ДокументыЗавершенные";
КонецФункции

Функция КлючТаблицы_ОтменаРегистрации() Экспорт
	Возврат "ОтменаРегистрации";
КонецФункции

Функция КлючТаблицы_Сообщения() Экспорт
	Возврат "Сообщения";
КонецФункции

Функция КлючДанных_ДополнительныеРеквизиты() Экспорт
	Возврат "additional_details";
КонецФункции

Функция МаксимальныйРазмерПакета() Экспорт
	Возврат 25000;
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ИмяСобытия(ВложенноеСобытие = "") Экспорт
	Возврат НСтр("ru = 'Пакеты данных'") + ?(ПустаяСтрока(ВложенноеСобытие), "", ". " + ВложенноеСобытие);
КонецФункции

#КонецОбласти
