
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ОбработатьЗагрузкуДокументовПриОбмене(МобильноеУстройство, ДанныеДокументов) Экспорт
	
	ТаблицаДокументов = Новый ТаблицаЗначений();
	ТаблицаДокументов.Колонки.Добавить("id", Новый ОписаниеТипов("УникальныйИдентификатор"));
	ТаблицаДокументов.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ДокументСсылка.SUI_ДокументОбмена"));
	ТаблицаДокументов.Колонки.Добавить("ИндексВСписке", Новый ОписаниеТипов("Число"));
	ТаблицаДокументов.Колонки.Добавить("ЗагрузкаВОбъект", Новый ОписаниеТипов("Булево"));
	
	ТекущийИндекс = 0;
	Для Каждого ДанныеДокумента Из ДанныеДокументов.RS_docs Цикл
		
		СтрокаТаблицаДокументов = ТаблицаДокументов.Добавить();
		СтрокаТаблицаДокументов.id = ДанныеДокумента.id;
		СтрокаТаблицаДокументов.Ссылка = ПолучитьСсылку(ДанныеДокумента.id);
		СтрокаТаблицаДокументов.ИндексВСписке = ТекущийИндекс;
		
		Если Не ПустаяСтрока(ДанныеДокумента.comment) Или
			ДанныеДокумента.tbl_products.Количество() > 0 Или
			ДанныеДокумента.tbl_series.Количество() > 0 Или
			ДанныеДокумента.tbl_marks.Количество() > 0 Тогда
			СтрокаТаблицаДокументов.ЗагрузкаВОбъект = Истина;
		КонецЕсли;
		
		ТекущийИндекс = ТекущийИндекс+1;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаДокументов.Ссылка,
		|	ТаблицаДокументов.id,
		|	ТаблицаДокументов.ЗагрузкаВОбъект
		|ПОМЕСТИТЬ втТаблицаДокументов
		|ИЗ
		|	&ТаблицаДокументов КАК ТаблицаДокументов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаДокументов.Ссылка,
		|	ТаблицаДокументов.id,
		|	ТаблицаДокументов.ЗагрузкаВОбъект,
		|	ДокументОбмена.Ссылка ЕСТЬ NULL КАК СсылкаНеСуществует,
		|	ЕСТЬNULL(ДокументОбмена.Состояние, ЗНАЧЕНИЕ(Перечисление.SUI_СостоянияДокументовОбмена.ПустаяСсылка)) КАК Состояние,
		|	ЕСТЬNULL(ДокументОбмена.ПометкаУдаления, ЛОЖЬ) КАК ПометкаУдаления
		|ИЗ
		|	(ВЫБРАТЬ
		|		Ссылка КАК Ссылка,
		|		id КАК id,
		|		МАКСИМУМ(ЗагрузкаВОбъект) КАК ЗагрузкаВОбъект
		|	ИЗ
		|		втТаблицаДокументов
		|	СГРУППИРОВАТЬ ПО
		|		Ссылка,
		|		id) КАК ТаблицаДокументов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.SUI_ДокументОбмена КАК ДокументОбмена
		|		ПО ТаблицаДокументов.Ссылка = ДокументОбмена.Ссылка
		|ДЛЯ ИЗМЕНЕНИЯ
		|	Документ.SUI_ДокументОбмена";
	
	Запрос.УстановитьПараметр("ТаблицаДокументов", ТаблицаДокументов);
	
	ТекущаяСсылка = Неопределено;
	
	НачатьТранзакцию();
	
	Попытка
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			
			ИсключаемыеСостояния = ИсключаемыеСостоянияДокументаПриЗагрузкеИзОбмена();
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				СменитьСостояние = Ложь;
				
				ТекущаяСсылка = Выборка.Ссылка;
				
				Если Выборка.СсылкаНеСуществует Тогда
					ОбщегоНазначения.СообщитьПользователю(СтрШаблон(
						НСтр("ru = 'Загрузка в документ обмена с ID ""%1"" пропущена по причине: Документ обмена не найден.'"), 
						Выборка.id));
					Продолжить;
				КонецЕсли;
				
				Если Выборка.ПометкаУдаления Тогда
					ОбщегоНазначения.СообщитьПользователю(СтрШаблон(
						НСтр("ru = 'Загрузка в документ обмена с ID ""%1"" пропущена по причине: Документ обмена помечен на удаление.'"), 
						Выборка.id));
					Продолжить;
				КонецЕсли;
				
				Если ИсключаемыеСостояния.Найти(Выборка.Состояние) <> Неопределено Тогда
					ОбщегоНазначения.СообщитьПользователю(СтрШаблон(
						НСтр("ru = 'Загрузка в документ обмена с ID ""%1"" пропущена по причине: Документ обмена в состоянии %2.'"), 
						Выборка.id, Выборка.Состояние));
					Продолжить;
				КонецЕсли;
				
				Если Выборка.ЗагрузкаВОбъект Тогда
					ДокументОбменаОбъект = Выборка.Ссылка.ПолучитьОбъект();
				Иначе
					ДокументОбменаОбъект = Неопределено;
				КонецЕсли;
				
				Для Каждого СтрокаИзТаблицы Из ТаблицаДокументов.НайтиСтроки(Новый Структура("Ссылка", Выборка.Ссылка)) Цикл
					
					ДокументОбменаXDTO = ДанныеДокументов.RS_docs.ПолучитьXDTO(СтрокаИзТаблицы.ИндексВСписке);
					
					// Заполнить докумен обмена
					Если ДокументОбменаОбъект <> Неопределено Тогда
						ДокументОбменаОбъект.Заполнить(ДокументОбменаXDTO);
					КонецЕсли;
					
					// Загрузить поток штрихкодов
					Если ДокументОбменаXDTO.tbl_barcode_flow.Количество() > 0 Тогда
						РегистрыСведений.SUI_ПотокШтрихкодов.ЗагрузитьПоток(МобильноеУстройство, Выборка.Ссылка, 
							ДокументОбменаXDTO.tbl_barcode_flow);
						СменитьСостояние = Истина;
					КонецЕсли;
					
				КонецЦикла;
				
				Если ДокументОбменаОбъект <> Неопределено Тогда
					
					ДокументОбменаОбъект.ОбменДанными.Загрузка = Истина;
					ДокументОбменаОбъект.ОбменДанными.Отправитель = МобильноеУстройство;
					
					СменитьСостояниеДокументаОбмена(ДокументОбменаОбъект, Перечисления.SUI_СостоянияДокументовОбмена.Загружен,
						МобильноеУстройство);
					
					ДокументОбменаОбъект.Записать();
					
				ИначеЕсли СменитьСостояние Тогда
					СменитьСостояниеДокументаОбмена(Выборка.Ссылка, Перечисления.SUI_СостоянияДокументовОбмена.Загружен,
						МобильноеУстройство);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(SUI_ДокументыОбменаКлиентСервер.ИмяСобытия(НСтр("ru = 'Загрузка'")), , , 
			ТекущаяСсылка, ИнформацияОбОшибке());
		ВызватьИсключение;
	КонецПопытки;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
    Поля.Добавить("Номер");
    Поля.Добавить("Дата");
    Поля.Добавить("ТипДокумента");
    
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление = СтрШаблон(НСтр("ru = 'Документ обмена %1 от %2 (%3)'"), Данные.Номер, Данные.Дата, Данные.ТипДокумента);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

//@skip-check method-too-many-params
//@skip-check doc-comment-parameter-section
//@skip-check doc-comment-export-function-return-section
Функция ВычислитьКлючСвязи(Параметр1, Параметр2 = Неопределено, Параметр3 = Неопределено, Параметр4 = Неопределено, 
	Параметр5 = Неопределено, Параметр6 = Неопределено, Параметр7 = Неопределено, Параметр8 = Неопределено, Параметр9 = Неопределено) Экспорт
	
	ПереданныеПараметры = Новый Массив();
	ПереданныеПараметры.Добавить(Параметр9);
	ПереданныеПараметры.Добавить(Параметр8);
	ПереданныеПараметры.Добавить(Параметр7);
	ПереданныеПараметры.Добавить(Параметр6);
	ПереданныеПараметры.Добавить(Параметр5);
	ПереданныеПараметры.Добавить(Параметр4);
	ПереданныеПараметры.Добавить(Параметр3);
	ПереданныеПараметры.Добавить(Параметр2);
	ПереданныеПараметры.Добавить(Параметр1);
	
	ПараметрыКВычислению = Новый Массив();
	
	Для индекс = 0 По ПереданныеПараметры.ВГраница() Цикл
		
		Если ПараметрыКВычислению.Количество() = 0 И ПереданныеПараметры[индекс] = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыКВычислению.Вставить(0, ПереданныеПараметры[индекс]);
		
	КонецЦикла;
	
	Возврат НРег(ОбщегоНазначения.КонтрольнаяСуммаСтрокой(ПараметрыКВычислению, ХешФункция.SHA256));
	
КонецФункции

Функция НовыйУникальныйИдентификатор() Экспорт
	Возврат Новый УникальныйИдентификатор();
КонецФункции

Функция ТаблицаЗначенийПоТипуТаблицы(ТипТаблицы) Экспорт
	
	Таблица = Новый ТаблицаЗначений();
	
	Для Каждого Элемент Из SUI_ДокументыОбменаПовтИсп.КолонкиТабличнойЧасти(ТипТаблицы) Цикл
		Таблица.Колонки.Добавить(Элемент.Ключ, Элемент.Значение.Тип, Элемент.Значение.Синоним);
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

Функция ВыгрузитьРезультатСхемыКомпоновкиДанных(ПараметрыКомпоновки, ОжидаемыеКолонки = Неопределено) Экспорт
	
	Результат = SUI_КомпоновкаДанныхСервер.ВыгрузитьРезультатСхемыКомпоновкиДанных(ПараметрыКомпоновки);
	
	ДопустимыеСимволыКолонок = SUI_СтроковыеФункцииКлиентСервер.АлфавитБуквыЛатинские()
		+ SUI_СтроковыеФункцииКлиентСервер.АлфавитБуквыРусские()
		+ SUI_СтроковыеФункцииКлиентСервер.АлфавитЦифры()
		+ "_";
	
	КолонкаКлючСвязи = Результат.Колонки.Найти("SUI_КлючСвязи");
		
	НомерНеизвестнойКолонки = 0;
	Для Каждого Колонка Из Результат.Колонки Цикл
		
		НовоеИмяКолонки = SUI_СтроковыеФункцииКлиентСервер.ПривестиСтрокуКРазрешеннымСимволам(Колонка.Заголовок, ДопустимыеСимволыКолонок);
		
		// Служебные поля, которые заполняются при записи документа обмена
		Если НовоеИмяКолонки = "КлючСвязи" И КолонкаКлючСвязи <> Неопределено И КолонкаКлючСвязи <> Колонка Тогда
			НовоеИмяКолонки = "";
		КонецЕсли;
		
		Если Колонка = Результат.Колонки.Найти(НовоеИмяКолонки) Тогда
			Продолжить;
		КонецЕсли;
		
		Пока Истина Цикл
			
			Если ПустаяСтрока(НовоеИмяКолонки) Тогда
				НовоеИмяКолонки = НСтр("ru = 'Поле'");
			КонецЕсли;
			
			Если Результат.Колонки.Найти(НовоеИмяКолонки) = Неопределено Тогда
				Колонка.Имя = НовоеИмяКолонки;
				Прервать;
			КонецЕсли;
			
			НовоеИмяКолонки = СтрШаблон(НСтр("ru = 'Поле%1'"), Формат(НомерНеизвестнойКолонки, "ЧДЦ=0; ЧГ=0;"));
			НомерНеизвестнойКолонки = НомерНеизвестнойКолонки+1;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если ОжидаемыеКолонки <> Неопределено Тогда
		
		Для Каждого Колонка Из ОжидаемыеКолонки.Колонки Цикл
			
			Если Результат.Колонки.Найти(Колонка.Имя) = Неопределено Тогда
				Результат.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения, Колонка.Заголовок);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ВыполнитьПроверкуДокументаОбменаВФоне(Параметры, АдресРезультата) Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("ДеревоРезультат", Новый ДеревоЗначений());
	Результат.Вставить("СтатусПроверки", "");
	
	Результат.ДеревоРезультат.Колонки.Добавить("ИндексКартинки", ОбщегоНазначения.ОписаниеТипаЧисло(1, , ДопустимыйЗнак.Неотрицательный));
	Результат.ДеревоРезультат.Колонки.Добавить("Информация", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	
	ДокументОбмена = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ДокументОбмена", 
		ПустаяСсылка(), Тип("ДокументСсылка.SUI_ДокументОбмена"));
	
	Если ДокументОбмена.Пустая() Или Не ОбщегоНазначения.СсылкаСуществует(ДокументОбмена) Тогда
		ДобавитьИнформациюВДеревоПроверки(Результат.ДеревоРезультат, ДокументОбмена, 
			НСтр("ru = 'Не удалось определить документ обмена'"), 1);
	Иначе
		
		Попытка
			ЗаблокироватьДанныеДляРедактирования(ДокументОбмена);
			РазблокироватьДанныеДляРедактирования(ДокументОбмена);
		Исключение
			ПричинаБлокировкиДокументаОбмена = ОбработкаОшибок.ПредставлениеОшибкиДляПользователя(ИнформацияОбОшибке());
		КонецПопытки;
		
		Если Не ПустаяСтрока(ПричинаБлокировкиДокументаОбмена) Тогда
			ДобавитьИнформациюВДеревоПроверки(Результат.ДеревоРезультат, СтрШаблон(НСтр("ru = 'Документ обмена: %1'"), ДокументОбмена), 
				ПричинаБлокировкиДокументаОбмена, 1);
		Иначе
			
			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ
				|	ЕСТЬNULL(НастройкиДокументов.Ссылка, ЗНАЧЕНИЕ(Справочник.SUI_НастройкиДокументовОбмена.ПустаяСсылка)) КАК
				|		НастройкаДокумента,
				|	ЕСТЬNULL(НастройкиДокументов.Используется, ЛОЖЬ) КАК НастройкаДокументаИспользуется,
				|	ЕСТЬNULL(НастройкиДокументов.ПометкаУдаления, ЛОЖЬ) КАК НастройкаДокументаПометкаУдаления,
				|	ЕСТЬNULL(НастройкиДокументов.ИмяМетаданныхДокумента, ЛОЖЬ) КАК НастройкаДокументаИмяМетаданныхДокумента,
				|	ДокументОбмена.ДокументОснование КАК ДокументОснование,
				|	ДокументОбмена.Состояние КАК Состояние,
				|	ДокументОбмена.ПометкаУдаления КАК ПометкаУдаления,
				|	ДокументОбмена.ТипДокумента КАК ТипДокумента
				|ИЗ
				|	Документ.SUI_ДокументОбмена КАК ДокументОбмена
				|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.SUI_НастройкиДокументовОбмена КАК НастройкиДокументов
				|		ПО ВЫБОР
				|			КОГДА &НастройкаДокументаДляПроверки = НЕОПРЕДЕЛЕНО
				|				ТОГДА ДокументОбмена.НастройкаДокумента = НастройкиДокументов.Ссылка
				|			ИНАЧЕ НастройкиДокументов.Ссылка = &НастройкаДокументаДляПроверки
				|		КОНЕЦ
				|ГДЕ
				|	ДокументОбмена.Ссылка = &ДокументОбмена
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	""Табличная часть: Товары"" КАК ОбластьПроверки,
				|	КОЛИЧЕСТВО(СтатусОбработки) КАК КоличествоПроверки,
				|	СтатусОбработки КАК СтатусОбработки
				|ИЗ
				|	Документ.SUI_ДокументОбмена.Товары
				|ГДЕ
				|	Ссылка = &ДокументОбмена
				|СГРУППИРОВАТЬ ПО
				|	СтатусОбработки
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	""Табличная часть: Серии"",
				|	КОЛИЧЕСТВО(СтатусОбработки),
				|	СтатусОбработки
				|ИЗ
				|	Документ.SUI_ДокументОбмена.Серии
				|ГДЕ
				|	Ссылка = &ДокументОбмена
				|СГРУППИРОВАТЬ ПО
				|	СтатусОбработки
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	""Табличная часть: Штрихкоды упаковок"",
				|	КОЛИЧЕСТВО(СтатусОбработки),
				|	СтатусОбработки
				|ИЗ
				|	Документ.SUI_ДокументОбмена.ШтрихкодыУпаковок
				|ГДЕ
				|	Ссылка = &ДокументОбмена
				|СГРУППИРОВАТЬ ПО
				|	СтатусОбработки
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	""Групповой пересчет"",
				|	КОЛИЧЕСТВО(ИдентификаторЗаписи),
				|	ЗНАЧЕНИЕ(Перечисление.SUI_СтатусыОбработкиСтрок.ТребуетсяОбработка)
				|ИЗ
				|	РегистрСведений.SUI_ГрупповойПересчет
				|ГДЕ
				|	ДокументОбмена = &ДокументОбмена
				|СГРУППИРОВАТЬ ПО
				|	ЗНАЧЕНИЕ(Перечисление.SUI_СтатусыОбработкиСтрок.ТребуетсяОбработка)
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	""Поток штрихкодов"",
				|	КОЛИЧЕСТВО(ИдентификаторЗаписи),
				|	ЗНАЧЕНИЕ(Перечисление.SUI_СтатусыОбработкиСтрок.ТребуетсяОбработка)
				|ИЗ
				|	РегистрСведений.SUI_ПотокШтрихкодов
				|ГДЕ
				|	ДокументОбмена = &ДокументОбмена
				|СГРУППИРОВАТЬ ПО
				|	ЗНАЧЕНИЕ(Перечисление.SUI_СтатусыОбработкиСтрок.ТребуетсяОбработка)
				|ИТОГИ
				|ПО
				|	ОбластьПроверки,
				|	СтатусОбработки";
			
			Запрос.УстановитьПараметр("ДокументОбмена", ДокументОбмена);
			
			Если Параметры.Свойство("НастройкаДокумента") Тогда
				Запрос.УстановитьПараметр("НастройкаДокументаДляПроверки", Параметры.НастройкаДокумента);
			Иначе
				Запрос.УстановитьПараметр("НастройкаДокументаДляПроверки", Неопределено);
			КонецЕсли;
			
			РезультатыЗапроса = Запрос.ВыполнитьПакет();
			
			ВыборкаДокументОбмена = РезультатыЗапроса[0].Выбрать();
			ВыборкаДокументОбмена.Следующий();
			
			Если ВыборкаДокументОбмена.Состояние = Перечисления.SUI_СостоянияДокументовОбмена.Завершен Или
				ВыборкаДокументОбмена.Состояние = Перечисления.SUI_СостоянияДокументовОбмена.Отменен Тогда
				ДобавитьИнформациюВДеревоПроверки(Результат.ДеревоРезультат, СтрШаблон(НСтр("ru = 'Документ обмена: %1'"), ДокументОбмена), 
					СтрШаблон(НСтр("ru = 'Состояние документа: %1'"), ВыборкаДокументОбмена.Состояние), 1);
			ИначеЕсли ВыборкаДокументОбмена.Состояние = Перечисления.SUI_СостоянияДокументовОбмена.Новый Или
				ВыборкаДокументОбмена.Состояние = Перечисления.SUI_СостоянияДокументовОбмена.ВРаботе Тогда
				ДобавитьИнформациюВДеревоПроверки(Результат.ДеревоРезультат, СтрШаблон(НСтр("ru = 'Документ обмена: %1'"), ДокументОбмена), 
					СтрШаблон(НСтр("ru = 'Состояние документа: %1'"), ВыборкаДокументОбмена.Состояние), 2);
			Иначе
				ДобавитьИнформациюВДеревоПроверки(Результат.ДеревоРезультат, СтрШаблон(НСтр("ru = 'Документ обмена: %1'"), ДокументОбмена), , 3);
			КонецЕсли;
			
			Если ВыборкаДокументОбмена.ПометкаУдаления Тогда
				ДобавитьИнформациюВДеревоПроверки(Результат.ДеревоРезультат, СтрШаблон(НСтр("ru = 'Документ обмена: %1'"), ДокументОбмена), 
					НСтр("ru = 'Документ обмена помечен на удаление'"), 2);
			КонецЕсли;
			
			Если ВыборкаДокументОбмена.НастройкаДокумента.Пустая() Тогда
				ДобавитьИнформациюВДеревоПроверки(Результат.ДеревоРезультат, СтрШаблон(НСтр("ru = 'Настройка документа: %1'"), ВыборкаДокументОбмена.НастройкаДокумента), 
					НСтр("ru = 'Не удалось определить настройку документа обмена'"), 1);
			ИначеЕсли Не ВыборкаДокументОбмена.НастройкаДокументаИспользуется Тогда
				ДобавитьИнформациюВДеревоПроверки(Результат.ДеревоРезультат, СтрШаблон(НСтр("ru = 'Настройка документа: %1'"), ВыборкаДокументОбмена.НастройкаДокумента), 
					НСтр("ru = 'Настройка документа не используется'"), 2);
			ИначеЕсли ВыборкаДокументОбмена.НастройкаДокументаПометкаУдаления Тогда
				ДобавитьИнформациюВДеревоПроверки(Результат.ДеревоРезультат, СтрШаблон(НСтр("ru = 'Настройка документа: %1'"), ВыборкаДокументОбмена.НастройкаДокумента), 
					НСтр("ru = 'Настройка документа помечена на удаление'"), 2);
			Иначе
				ДобавитьИнформациюВДеревоПроверки(Результат.ДеревоРезультат, СтрШаблон(НСтр("ru = 'Настройка документа: %1'"), ВыборкаДокументОбмена.НастройкаДокумента), , 3);
			КонецЕсли;
			
			ДокументОснование = SUI_ИнтеграцияВКонфигурацию.СсылкаПоИдентификаторуSimple(ВыборкаДокументОбмена.ДокументОснование);
			
			Если ДокументОснование = Неопределено Или Не ОбщегоНазначения.СсылкаСуществует(ДокументОснование) Тогда
				ДобавитьИнформациюВДеревоПроверки(Результат.ДеревоРезультат, СтрШаблон(НСтр("ru = 'Документ основание: %1'"), ДокументОснование), 
					НСтр("ru = 'Не удалось определить документ основание документа обмена'"), 1);
			ИначеЕсли Не SUI_ОбщегоНазначенияПереопределяемый.ЭтоСсылкаДокумента(ДокументОснование) Тогда
				ДобавитьИнформациюВДеревоПроверки(Результат.ДеревоРезультат, СтрШаблон(НСтр("ru = 'Документ основание: %1'"), ДокументОснование), 
					СтрШаблон(НСтр("ru = 'Документ основание (%1) должен быть типом документ'"), ДокументОснование), 1);
			Иначе
				
				ПричинаБлокировкиДокументаОснования = "";
				Попытка
					ЗаблокироватьДанныеДляРедактирования(ДокументОснование);
					РазблокироватьДанныеДляРедактирования(ДокументОснование);
				Исключение
					ПричинаБлокировкиДокументаОснования = ОбработкаОшибок.ПредставлениеОшибкиДляПользователя(ИнформацияОбОшибке());
				КонецПопытки;
				
				Если Не ПустаяСтрока(ПричинаБлокировкиДокументаОснования) Тогда
					ДобавитьИнформациюВДеревоПроверки(Результат.ДеревоРезультат, СтрШаблон(НСтр("ru = 'Документ основание: %1'"), ДокументОснование), 
						ПричинаБлокировкиДокументаОснования, 1);
				Иначе
					
					ДобавитьИнформациюВДеревоПроверки(Результат.ДеревоРезультат, СтрШаблон(НСтр("ru = 'Документ основание: %1'"), ДокументОснование), , 3);
				
					Если Не ВыборкаДокументОбмена.НастройкаДокумента.Пустая() И
						ДокументОснование.Метаданные().Имя <> ВыборкаДокументОбмена.НастройкаДокументаИмяМетаданныхДокумента Тогда
						ДобавитьИнформациюВДеревоПроверки(Результат.ДеревоРезультат, СтрШаблон(НСтр("ru = 'Документ основание: %1'"), ДокументОснование), 
							СтрШаблон(НСтр("ru = 'Документ основание (%1) не принадлежит настройке %2'"), ДокументОснование, ВыборкаДокументОбмена.НастройкаДокумента), 1);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			ОбластиТЧ = Новый Соответствие();
			ПроверяемыеПустыеОбласти = Новый Массив();
			ПроверяемыеПустыеОбласти.Добавить("Табличная часть: Товары");
			ПроверяемыеПустыеОбласти.Добавить("Табличная часть: Серии");
			ПроверяемыеПустыеОбласти.Добавить("Табличная часть: Штрихкоды упаковок");
			
			ВыборкаОбработкаДанных = РезультатыЗапроса[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаОбработкаДанных.Следующий() Цикл
				
				Всего = 0;
				НеОбработано = 0;
				
				ВыборкаСтатусПроверки = ВыборкаОбработкаДанных.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаСтатусПроверки.Следующий() Цикл
					
					ДетальныеЗаписи = ВыборкаСтатусПроверки.Выбрать();
					
					Пока ДетальныеЗаписи.Следующий() Цикл
						
						Всего = Всего + ДетальныеЗаписи.КоличествоПроверки;
						Если ДетальныеЗаписи.КоличествоПроверки > 0 И
							ДетальныеЗаписи.СтатусОбработки <> Перечисления.SUI_СтатусыОбработкиСтрок.ОбработкаНеТребуется Тогда
							НеОбработано = НеОбработано + ДетальныеЗаписи.КоличествоПроверки;
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЦикла;
				
				Если ПроверяемыеПустыеОбласти.Найти(ВыборкаОбработкаДанных.ОбластьПроверки) <> Неопределено Тогда
					ОбластиТЧ.Вставить(ВыборкаОбработкаДанных.ОбластьПроверки, Всего);
				КонецЕсли;
				
				Если НеОбработано > 0 Тогда
					ДобавитьИнформациюВДеревоПроверки(Результат.ДеревоРезультат, ВыборкаОбработкаДанных.ОбластьПроверки, 
						СтрШаблон(НСтр("ru = 'Необработано данных: %1'"), НеОбработано), 2);
				КонецЕсли;
				
			КонецЦикла;
			
			Если ВыборкаДокументОбмена.ТипДокумента = Перечисления.SUI_ТипыДокументовОбмена.Документ Или
				ВыборкаДокументОбмена.ТипДокумента = Перечисления.SUI_ТипыДокументовОбмена.АдресноеХранениеОтбор Или
				ВыборкаДокументОбмена.ТипДокумента = Перечисления.SUI_ТипыДокументовОбмена.АдресноеХранениеРазмещение Тогда
				
				Если SUI_ОбщегоНазначенияКлиентСервер.ЗначениеСоответствия(ОбластиТЧ, ПроверяемыеПустыеОбласти[0], 0) = 0 И
					SUI_ОбщегоНазначенияКлиентСервер.ЗначениеСоответствия(ОбластиТЧ, ПроверяемыеПустыеОбласти[1], 0) = 0 И
					SUI_ОбщегоНазначенияКлиентСервер.ЗначениеСоответствия(ОбластиТЧ, ПроверяемыеПустыеОбласти[2], 0) = 0 Тогда
					ДобавитьИнформациюВДеревоПроверки(Результат.ДеревоРезультат, ПроверяемыеПустыеОбласти[0], 
						НСтр("ru = 'Отсутствуют данные'"), 1);
					ДобавитьИнформациюВДеревоПроверки(Результат.ДеревоРезультат, ПроверяемыеПустыеОбласти[1], 
						НСтр("ru = 'Отсутствуют данные'"), 1);
					ДобавитьИнформациюВДеревоПроверки(Результат.ДеревоРезультат, ПроверяемыеПустыеОбласти[2], 
						НСтр("ru = 'Отсутствуют данные'"), 1);
				КонецЕсли;
				
			ИначеЕсли ВыборкаДокументОбмена.ТипДокумента = Перечисления.SUI_ТипыДокументовОбмена.СборШтрихкодов Тогда
				
				Если SUI_ОбщегоНазначенияКлиентСервер.ЗначениеСоответствия(ОбластиТЧ, ПроверяемыеПустыеОбласти[0], 0) = 0 Тогда
					ДобавитьИнформациюВДеревоПроверки(Результат.ДеревоРезультат, ПроверяемыеПустыеОбласти[0], 
						НСтр("ru = 'Отсутствуют данные'"), 1);
				КонецЕсли;
				
			ИначеЕсли ВыборкаДокументОбмена.ТипДокумента = Перечисления.SUI_ТипыДокументовОбмена.ПустаяСсылка() Тогда
				
				Если SUI_ОбщегоНазначенияКлиентСервер.ЗначениеСоответствия(ОбластиТЧ, ПроверяемыеПустыеОбласти[1], 0) = 0 И
					SUI_ОбщегоНазначенияКлиентСервер.ЗначениеСоответствия(ОбластиТЧ, ПроверяемыеПустыеОбласти[2], 0) = 0 Тогда
					ДобавитьИнформациюВДеревоПроверки(Результат.ДеревоРезультат, ПроверяемыеПустыеОбласти[1], 
						НСтр("ru = 'Отсутствуют данные'"), 1);
					ДобавитьИнформациюВДеревоПроверки(Результат.ДеревоРезультат, ПроверяемыеПустыеОбласти[2], 
						НСтр("ru = 'Отсутствуют данные'"), 1);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Для Каждого СтрокаРодитель Из Результат.ДеревоРезультат.Строки Цикл
		
		СтрокаРодитель.ИндексКартинки = 3;
		
		Для Каждого СтрокаПодчиненная Из СтрокаРодитель.Строки Цикл
			
			Если СтрокаПодчиненная.ИндексКартинки = 1 Тогда
				СтрокаРодитель.ИндексКартинки = 1;
			ИначеЕсли СтрокаПодчиненная.ИндексКартинки = 2 И СтрокаРодитель.ИндексКартинки <> 1 Тогда
				СтрокаРодитель.ИндексКартинки = 2;
			ИначеЕсли СтрокаПодчиненная.ИндексКартинки = 0 И СтрокаРодитель.ИндексКартинки = 3 Тогда
				СтрокаРодитель.ИндексКартинки = 0;
			КонецЕсли;
			
		КонецЦикла;
		
		Если СтрокаРодитель.ИндексКартинки = 1 Тогда
			Результат.СтатусПроверки = "ВыполненаСОшибками";
		ИначеЕсли СтрокаРодитель.ИндексКартинки = 2 И Результат.СтатусПроверки <> "ЕстьОшибки" Тогда
			Результат.СтатусПроверки = "ВыполненаСПредупреждениями";
		КонецЕсли;
		
	КонецЦикла;
	
	Если ПустаяСтрока(Результат.СтатусПроверки) Тогда
		Результат.СтатусПроверки = "Выполнена";
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата)
	
КонецПроцедуры

Процедура ВыполнитьАлгоритмПолученияШтрихкодаДокумента(Знач Алгоритм, ДокументСсылка, Штрихкод) Экспорт
	
	Если ЗначениеЗаполнено(Алгоритм) Тогда
			
		Попытка
			УстановитьБезопасныйРежим(Истина);
			SUI_ОбщегоНазначения.ПередВыполнениемПроизвольногоАлгоритма();
			Выполнить(Алгоритм);
			УстановитьБезопасныйРежим(Ложь);
		Исключение
			ШаблонСообщения = НСтр("ru = 'Ошибка выполнения алгоритма получения штрихкода документа.
			|Проверьте алгоритм получения штрихкода документа в настройках подсистемы %1.
			|
			|%2'");
			ВызватьИсключение СтрШаблон(ШаблонСообщения, SUI_SimpleКлиентСервер.Представление(),
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПолучателейОбменаДанными(ДокументОбмена, Знач Получатели = Неопределено) Экспорт
	
	ДокументОбмена.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
	ДокументОбмена.ОбменДанными.Получатели.Очистить();
	
	Если ДокументОбмена.ДополнительныеСвойства.Свойство("ОтключитьМеханизмРегистрацииОбъектов") Или
		ДокументОбмена.ПометкаУдаления Или
		ДокументОбмена.Состояние = Перечисления.SUI_СостоянияДокументовОбмена.Новый Тогда
		Возврат;
	КонецЕсли;
	
	Если Получатели = Неопределено И 
		(ДокументОбмена.Состояние = Перечисления.SUI_СостоянияДокументовОбмена.КВыгрузке Или
		(ДокументОбмена.ОбменДанными.Загрузка И ЗначениеЗаполнено(ДокументОбмена.ОбменДанными.Отправитель))) Тогда
			
		Получатели = РегистрыСведений.SUI_ВладельцыНастроекДокументов.ПолучитьМобильныеУстройстваПоНастройке(
			ДокументОбмена.НастройкаДокумента);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Получатели) Тогда
		
		Для индекс = 0 По Получатели.ВГраница() Цикл
			
			Если Получатели[индекс] = ДокументОбмена.ОбменДанными.Отправитель Тогда
				Продолжить;
			КонецЕсли;
			
			ДокументОбмена.ОбменДанными.Получатели.Добавить(Получатели[индекс]);
			
		КонецЦикла;
		
		СменитьСостояниеДокументаОбмена(ДокументОбмена, Перечисления.SUI_СостоянияДокументовОбмена.Выгружен,
			ДокументОбмена.ОбменДанными.Отправитель);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СменитьСостояниеДокументаОбмена(ДокументОбмена, Состояние, МобильноеУстройство = Неопределено) Экспорт
	
	Если SUI_ОбщегоНазначения.ЭтоОбъект(ДокументОбмена) Тогда
		
		ДокументОбмена.Состояние = Состояние;
		ДокументОбмена.ДатаСостояния = ТекущаяДатаСеанса();
		ДокументОбмена.ВладелецСостояния = МобильноеУстройство;
		
	Иначе
		
		ДокументОбменаОбъект = ДокументОбмена.ПолучитьОбъект();
		
		ДокументОбменаОбъект.Состояние = Состояние;
		ДокументОбменаОбъект.ДатаСостояния = ТекущаяДатаСеанса();
		ДокументОбменаОбъект.ВладелецСостояния = МобильноеУстройство;
		
		ДокументОбменаОбъект.ДополнительныеСвойства.Вставить("SUI_ОтключитьОбработчики");
		
		ДокументОбменаОбъект.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

#Область ЗагрузкаДокументаОбменаВДокументОснование

//@skip-check query-in-loop
Процедура ЗагрузитьДокументОбменаВДокументОснованиеВФоне(Параметры, АдресРезультата) Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ДокументОбмена.Ссылка КАК ДокументОбмена,
			|	ДокументОбмена.ДокументОснование,
			|	ЕСТЬNULL(НастройкиДокументовОбмена.Ссылка, ЗНАЧЕНИЕ(Справочник.SUI_НастройкиДокументовОбмена.ПустаяСсылка)) КАК
			|		НастройкаДокумента,
			|	ДокументОбмена.ТипДокумента
			|ИЗ
			|	Документ.SUI_ДокументОбмена КАК ДокументОбмена
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.SUI_НастройкиДокументовОбмена КАК НастройкиДокументовОбмена
			|		ПО ВЫБОР
			|			КОГДА &НастройкаДокумента = НЕОПРЕДЕЛЕНО
			|				ТОГДА ДокументОбмена.НастройкаДокумента = НастройкиДокументовОбмена.Ссылка
			|			ИНАЧЕ НастройкиДокументовОбмена.Ссылка = &НастройкаДокумента
			|		КОНЕЦ
			|ГДЕ
			|	ДокументОбмена.Ссылка = &ДокументОбмена
			|ДЛЯ ИЗМЕНЕНИЯ
			|	Документ.SUI_ДокументОбмена,
			|	Справочник.SUI_НастройкиДокументовОбмена";
		
		Запрос.УстановитьПараметр("ДокументОбмена", Параметры.ДокументОбмена);
		Запрос.УстановитьПараметр("НастройкаДокумента", ?(Параметры.Свойство("НастройкаДокумента"), Параметры.НастройкаДокумента, Неопределено));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ОбщегоНазначенияКлиентСервер.Проверить(Не РезультатЗапроса.Пустой(), 
			СтрШаблон(НСтр("ru = 'Не удалось получить документ обмена (%1)'"), Параметры.ДокументОбмена));
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		ДанныеДокументаОбмена = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Выборка);
		
		ДанныеНастройки = Справочники.SUI_НастройкиДокументовОбмена.СформироватьДанныеНастройки(ДанныеДокументаОбмена.НастройкаДокумента);
		ОбщегоНазначенияКлиентСервер.Проверить(ДанныеНастройки <> Неопределено, 
			СтрШаблон(НСтр("ru = 'Не получить данные настройки документа обмена (%1)'"), ДанныеДокументаОбмена.НастройкаДокумента));
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Ссылка
			|ИЗ
			|	Документ." + ДанныеНастройки.ИмяМетаданныхДокумента + "
			|ГДЕ
			|	Ссылка = &Ссылка
			|ДЛЯ ИЗМЕНЕНИЯ
			|	Документ." + ДанныеНастройки.ИмяМетаданныхДокумента;
		
		Запрос.УстановитьПараметр("Ссылка", 
			SUI_ИнтеграцияВКонфигурацию.СсылкаПоИдентификаторуSimple(ДанныеДокументаОбмена.ДокументОснование, Истина));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ОбщегоНазначенияКлиентСервер.Проверить(Не РезультатЗапроса.Пустой(), 
			СтрШаблон(НСтр("ru = 'Не удалось получить ссылку документа основания (%1)'"), ДанныеДокументаОбмена.ДокументОснование));
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		СвязиТаблиц = Новый Соответствие();
		ДокументОбменаОбъект = ДанныеДокументаОбмена.ДокументОбмена.ПолучитьОбъект();
		ДокументОснованиеОбъект = Выборка.Ссылка.ПолучитьОбъект();
		МодифицированностьДокументаОбмена = Ложь;
		
		// Установить ссылку документа основания в параметр схемы компоновки данных
		SUI_КомпоновкаДанныхСервер.ДобавитьПараметр(ДанныеНастройки.СхемаКомпоновкиДанных, "Ссылка", , ДокументОснованиеОбъект.Ссылка, , Истина);
		SUI_КомпоновкаДанныхКлиентСервер.ДобавитьГруппировку(ДанныеНастройки.СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
		
		Для индекс = 0 По ДанныеНастройки.ПорядокНастройкиТаблиц.ВГраница() Цикл
			
			КлючТаблица = ДанныеНастройки.ПорядокНастройкиТаблиц[индекс];
			
			НастройкаТаблицы = ДанныеНастройки.НастройкиТаблиц.Получить(КлючТаблица);
			
			Если НастройкаТаблицы = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ТаблицаРезультат = ТаблицаДокументаОбменаСНомеромСтрокДокументаОснования(ДокументОбменаОбъект.Ссылка, 
				КлючТаблица, НастройкаТаблицы, ДанныеНастройки.СхемаКомпоновкиДанных);
			
			Если ТаблицаРезультат = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			СоответствияСтрок = ТаблицаРезультат.Выгрузить().Скопировать(, "ИдентификаторСтроки,КлючСвязи,НомерСтроки,НомерСтрокиПриемник");
			СоответствияСтрок.Колонки.Добавить("СтрокаИсточник");
			СоответствияСтрок.Колонки.Добавить("СтрокаПриемник");
			СоответствияСтрок.Колонки.Добавить("НоваяСтрокаПриемник", Новый ОписаниеТипов("Булево"));
			СоответствияСтрок.Колонки.Добавить("МодифицированностьИсточник", Новый ОписаниеТипов("Булево"));
			СоответствияСтрок.Колонки.Добавить("МодифицированностьПриемник", Новый ОписаниеТипов("Булево"));
			
			Если Не ТаблицаРезультат.Пустой() Тогда
				
				ИмяРеквизитаКоличествоФакт = НастройкаТаблицы.СоответствиеРеквизитов.Получить("КоличествоФакт");
				
				Если КлючТаблица = Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары Или
					КлючТаблица = Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор Или
					КлючТаблица = Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение Или
					КлючТаблица = Перечисления.SUI_ТипыТаблицДокументовОбмена.ПотокШтрихкодов Тогда
					ТекущаяТЧОбмена = ДокументОбменаОбъект.Товары;
				ИначеЕсли КлючТаблица = Перечисления.SUI_ТипыТаблицДокументовОбмена.Серии Тогда
					ТекущаяТЧОбмена = ДокументОбменаОбъект.Серии;
				ИначеЕсли КлючТаблица = Перечисления.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок Тогда
					ТекущаяТЧОбмена = ДокументОбменаОбъект.ШтрихкодыУпаковок;
				Иначе
					Продолжить;
				КонецЕсли;
				
				ТекущаяТЧ = ДокументОснованиеОбъект[НастройкаТаблицы.ИмяТабличнойЧасти];
				ЗаполнятьЧерезАлгоритм = (Не ПустаяСтрока(НастройкаТаблицы.АлгоритмОбработкиСтрокЗагрузкиДанных));
				
				ТаблицаВыборка = ТаблицаРезультат.Выбрать();
				
				Пока ТаблицаВыборка.Следующий() Цикл
					
					СоответствиеСтрок = СоответствияСтрок.Найти(ТаблицаВыборка.ИдентификаторСтроки, "ИдентификаторСтроки");
					
					Если СоответствиеСтрок = Неопределено Тогда
						Продолжить;
					КонецЕсли;
					
					СоответствиеСтрок.СтрокаИсточник = ТекущаяТЧОбмена.Найти(ТаблицаВыборка.НомерСтроки, "НомерСтроки");
					
					Если СоответствиеСтрок.СтрокаИсточник = Неопределено Тогда
						СоответствияСтрок.Удалить(СоответствиеСтрок);
						Продолжить;
					КонецЕсли;
					
					Если ТаблицаВыборка.НомерСтрокиПриемник > 0 Тогда
						СоответствиеСтрок.СтрокаПриемник = ТекущаяТЧ.Найти(ТаблицаВыборка.НомерСтрокиПриемник, "НомерСтроки");
					КонецЕсли;
					
					Если Не ЗначениеЗаполнено(СоответствиеСтрок.СтрокаПриемник) Тогда
						СоответствиеСтрок.СтрокаПриемник = ТекущаяТЧ.Добавить();
						СоответствиеСтрок.НомерСтрокиПриемник = СоответствиеСтрок.СтрокаПриемник.НомерСтроки;
						СоответствиеСтрок.НоваяСтрокаПриемник = Истина;
						СоответствиеСтрок.МодифицированностьПриемник = Истина;
					КонецЕсли;
					
				КонецЦикла;
				
				Для Каждого СоответствиеСтрок Из СоответствияСтрок Цикл
					
					ТаблицаВыборка.Сбросить();
					Если ТаблицаВыборка.НайтиСледующий(Новый Структура("ИдентификаторСтроки,НомерСтроки", СоответствиеСтрок.ИдентификаторСтроки, СоответствиеСтрок.НомерСтроки)) Тогда
						ДанныеИзВыборки = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаВыборка);
					Иначе
						Продолжить;
					КонецЕсли;
					
					Если ЗаполнятьЧерезАлгоритм Тогда
						
						SUI_ИнтеграцияВКонфигурацию.ВосстановитьСсылкиИдентификаторовSimple(ДанныеИзВыборки);
						
						ПараметрыОбработки = Новый Структура();
						ПараметрыОбработки.Вставить("ДокументОбменаСсылка", ДокументОбменаОбъект.Ссылка);
						ПараметрыОбработки.Вставить("ДокументОснованиеОбъект", ДокументОснованиеОбъект);
						ПараметрыОбработки.Вставить("Алгоритм", НастройкаТаблицы.АлгоритмОбработкиСтрокЗагрузкиДанных);
						ПараметрыОбработки.Вставить("СоответствиеРеквизитов", НастройкаТаблицы.СоответствиеРеквизитов);
						ПараметрыОбработки.Вставить("РеквизитыИдентификации", НастройкаТаблицы.РеквизитыИдентификации);
						ПараметрыОбработки.Вставить("ДанныеЗаполнения", ДанныеИзВыборки);
						ПараметрыОбработки.Вставить("ТабличнаяЧастьПриемник", ТекущаяТЧ);
						ПараметрыОбработки.Вставить("СтрокаПриемник", СоответствиеСтрок.СтрокаПриемник);
						ПараметрыОбработки.Вставить("ЭтоНоваяСтрока", СоответствиеСтрок.НоваяСтрокаПриемник);
						ПараметрыОбработки.Вставить("СтрокаИсточник", СоответствиеСтрок.СтрокаИсточник);
						
						РезультатОбработки = ОбработатьСтрокуТабличнойЧастиЧерезАлгоритм(ПараметрыОбработки);
						
						Если РезультатОбработки.СтрокаПриемникУдалена Тогда
							СоответствиеСтрок.НомерСтрокиПриемник = 0;
						КонецЕсли;
						
						Если РезультатОбработки.СтрокаИсточникМодифицированна Тогда
							СоответствиеСтрок.МодифицированностьИсточник = Истина;
							МодифицированностьДокументаОбмена = Истина;
						КонецЕсли;
						
					ИначеЕсли СоответствиеСтрок.НоваяСтрокаПриемник Тогда
						
						ДанныеКЗаполнению = СопоставитьДанныеСтрокиКЗагрузке(ДанныеИзВыборки, 
							НастройкаТаблицы.СоответствиеРеквизитов, "КоличествоПлан");
						SUI_ИнтеграцияВКонфигурацию.ВосстановитьСсылкиИдентификаторовSimple(ДанныеКЗаполнению);
						ЗаполнитьЗначенияСвойств(СоответствиеСтрок.СтрокаПриемник, ДанныеКЗаполнению);
						
						СоответствиеСтрок.СтрокаИсточник.КлючСвязи = ВычислитьКлючСвязиПриОбработкеСтроки(
							СоответствиеСтрок.СтрокаПриемник, НастройкаТаблицы.РеквизитыИдентификации);
						
						СоответствиеСтрок.МодифицированностьПриемник = Истина;
						
					ИначеЕсли ИмяРеквизитаКоличествоФакт <> Неопределено И 
						ДанныеИзВыборки.КоличествоФакт <> СоответствиеСтрок.СтрокаПриемник[ИмяРеквизитаКоличествоФакт] Тогда
						
						СоответствиеСтрок.СтрокаПриемник[ИмяРеквизитаКоличествоФакт] = ДанныеИзВыборки.КоличествоФакт;
						СоответствиеСтрок.МодифицированностьПриемник = Истина;
						
					КонецЕсли;
					
					//TODO: 05.08.2024 - artem - Заполнить реквизиты в строке ТЧ (постобработка)
					
				КонецЦикла;
				
			КонецЕсли;
			
			СоответствияСтрок.Колонки.Удалить("СтрокаИсточник");
			СоответствияСтрок.Колонки.Удалить("СтрокаПриемник");
			
			СвязьТаблицы = Новый Структура();
			СвязьТаблицы.Вставить("ИмяТабличнойЧасти", НастройкаТаблицы.ИмяТабличнойЧасти);
			СвязьТаблицы.Вставить("ТаблицаСвязей", СоответствияСтрок);
			СвязьТаблицы.Вставить("ДанныеНастройки", Новый Структура());
			
			СвязьТаблицы.ДанныеНастройки.Вставить("АлгоритмОбработкиСтрок", НастройкаТаблицы.АлгоритмОбработкиСтрокЗагрузкиДанных);
			СвязьТаблицы.ДанныеНастройки.Вставить("СоответствиеРеквизитов", НастройкаТаблицы.СоответствиеРеквизитов);
			СвязьТаблицы.ДанныеНастройки.Вставить("РеквизитыИдентификации", НастройкаТаблицы.РеквизитыИдентификации);
			СвязьТаблицы.ДанныеНастройки.Вставить("ИмяРеквизитаКоличествоФакт", ИмяРеквизитаКоличествоФакт);
			
			СвязиТаблиц.Вставить(КлючТаблица, СвязьТаблицы);
			
		КонецЦикла;
		
		//TODO: 05.08.2024 - artem - Заполнить реквизиты Документа (постобработка)
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(SUI_ДокументыОбменаКлиентСервер.ИмяСобытия(), ,
			Метаданные.Документы.SUI_ДокументОбмена, SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ДокументОбмена"), ИнформацияОбОшибке());
		ВызватьИсключение;
	КонецПопытки;
	
	Результат = Новый Структура();
	Результат.Вставить("МодифицированностьДокументаОбмена", МодифицированностьДокументаОбмена);
	Результат.Вставить("ДокументОбменаОбъект", СериализаторXDTO.ЗаписатьXDTO(ДокументОбменаОбъект));
	Результат.Вставить("ДокументОбменаСсылка", ДокументОбменаОбъект.Ссылка);
	Результат.Вставить("ДокументОснованиеОбъектXML", ОбщегоНазначения.ЗначениеВСтрокуXML(ДокументОснованиеОбъект));
	Результат.Вставить("ДокументОснованиеСсылка", ДокументОснованиеОбъект.Ссылка);
	Результат.Вставить("СвязиТаблиц", СвязиТаблиц);
	Результат.Вставить("ПроводитьДокументОснованиеПриЗаписи", ДанныеНастройки.ПроводитьДокумент);
	Результат.Вставить("ТипДокумента", ДанныеДокументаОбмена.ТипДокумента);
	
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	
КонецПроцедуры

// Обработать строку табличной части через алгоритм.
// 
// Параметры:
//  Параметры - Структура - Параметры обработки:
//  * ДокументОбменаСсылка - ДокументСсылка.SUI_ДокументОбмена - 
//  * ДанныеЗаполнения - Структура - Структура данных из строки источник
//  * ДокументОснованиеОбъект - ДокументОбъект - Объект документа 1С
//  * ТабличнаяЧастьПриемник - ТабличнаяЧасть - Табличная часть документ 1С
//  * СтрокаПриемник - СтрокаТабличнойЧасти - Строка табличной части документа 1С
//  * ЭтоНоваяСтрока - Булево - Признак добавленой строки
//  * СтрокаИсточник - СтрокаТабличнойЧасти - Строка табличной части документа обмена
//  * Алгоритм - Строка - Алгоритм обработки строк
//  * СоответствиеРеквизитов - Соответствие из Структура - Соответствие реквизитов из настройки документа обмена
//  * РеквизитыИдентификации - Массив из Строка - Реквизиты идентификации строки из настройки документа обмена
// 
// Возвращаемое значение:
//  Структура - Обработать строку табличной части через алгоритм:
// * СтрокаПриемникУдалена - Булево - Строка приемника была удалена
// * СтрокаИсточникМодифицированна - Булево - Строка источника была модифицирована
Функция ОбработатьСтрокуТабличнойЧастиЧерезАлгоритм(Параметры) Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("СтрокаПриемникУдалена", Ложь);
	Результат.Вставить("СтрокаИсточникМодифицированна", Ложь);
	
	ПараметрыАлгоритма = Новый Массив();
	ПараметрыАлгоритма.Добавить(Параметры.ДокументОбменаСсылка);
	ПараметрыАлгоритма.Добавить(Параметры.ДанныеЗаполнения);
	ПараметрыАлгоритма.Добавить(Параметры.ДокументОснованиеОбъект);
	ПараметрыАлгоритма.Добавить(Параметры.СтрокаПриемник);
	ПараметрыАлгоритма.Добавить(Параметры.ЭтоНоваяСтрока);
	
	ПараметрыАлгоритма = Обработки.SUI_РедакторКода.ВыполнитьКодЧерезМетодКонфигурации(
		"Документы.SUI_ДокументОбмена.ВыполнитьАлгоритмОбработкиСтрок", 
		Параметры.Алгоритм, ПараметрыАлгоритма, Истина);
	
	Параметры.ДокументОснованиеОбъект = ПараметрыАлгоритма[ПараметрыАлгоритма.ВГраница()-2];
	Параметры.СтрокаПриемник = ПараметрыАлгоритма[ПараметрыАлгоритма.ВГраница()-1];
	
	Если Параметры.ТабличнаяЧастьПриемник.Индекс(Параметры.СтрокаПриемник) < 0 Тогда
		Результат.СтрокаПриемникУдалена = Истина;
	Иначе
		
		ДанныеДоАлгоритма = Новый Структура();
		ДанныеПослеАлгоритма = Новый Структура();
		Для Каждого СоответствиеРеквизитов Из Параметры.СоответствиеРеквизитов Цикл
			
			Если СоответствиеРеквизитов.Ключ <> "КоличествоПлан" Тогда
				ДанныеДоАлгоритма.Вставить(СоответствиеРеквизитов.Ключ, Параметры.СтрокаИсточник[СоответствиеРеквизитов.Ключ]);
				ДанныеПослеАлгоритма.Вставить(СоответствиеРеквизитов.Ключ, Параметры.СтрокаПриемник[СоответствиеРеквизитов.Значение]);
			КонецЕсли;
			
		КонецЦикла;
		
		SUI_ИнтеграцияВКонфигурацию.ПривестиСсылкиКИдентификаторамSimple(ДанныеПослеАлгоритма);
		ЗаполнитьЗначенияСвойств(Параметры.СтрокаИсточник, ДанныеПослеАлгоритма);
		
		Если Не ОбщегоНазначения.КоллекцииИдентичны(ДанныеДоАлгоритма, ДанныеПослеАлгоритма) Тогда
			Результат.СтрокаИсточникМодифицированна = Истина;
		КонецЕсли;
		
		НовыйКлючСвязи = ВычислитьКлючСвязиПриОбработкеСтроки(Параметры.СтрокаПриемник, Параметры.РеквизитыИдентификации);
		
		Если НовыйКлючСвязи <> Параметры.СтрокаИсточник.КлючСвязи Тогда
			Параметры.СтрокаИсточник.КлючСвязи = НовыйКлючСвязи;
			Результат.СтрокаИсточникМодифицированна = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ВыполнитьАлгоритмОбработкиСтрок(Знач Алгоритм, Знач ДокументОбмена, Знач ДанныеЗаполнения, ДокументОбъект, ТекущаяСтрока, Знач НоваяСтрока) Экспорт
	
	Если ЗначениеЗаполнено(Алгоритм) Тогда
			
		Попытка
			УстановитьБезопасныйРежим(Истина);
			SUI_ОбщегоНазначения.ПередВыполнениемПроизвольногоАлгоритма();
			Выполнить(Алгоритм);
			УстановитьБезопасныйРежим(Ложь);
		Исключение
			ШаблонСообщения = НСтр("ru = 'Ошибка выполнения алгоритма обработки строк табличной части.
			|Проверьте алгоритм обработки строк табличной части в настройке документа.
			|
			|%2'");
			ВызватьИсключение СтрШаблон(ШаблонСообщения, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьАлгоритмПередЗаписью(Знач Алгоритм, ДокументОбъект) Экспорт
	
	Если ЗначениеЗаполнено(Алгоритм) Тогда
			
		Попытка
			УстановитьБезопасныйРежим(Истина);
			SUI_ОбщегоНазначения.ПередВыполнениемПроизвольногоАлгоритма();
			Выполнить(Алгоритм);
			УстановитьБезопасныйРежим(Ложь);
		Исключение
			ШаблонСообщения = НСтр("ru = 'Ошибка выполнения алгоритма перед записью.
			|Проверьте алгоритм перед записью в настройке документа.
			|
			|%2'");
			ВызватьИсключение СтрШаблон(ШаблонСообщения, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьАлгоритмПослеЗаписи(Знач Алгоритм, ДокументОбъект) Экспорт
	
	Если ЗначениеЗаполнено(Алгоритм) Тогда
			
		Попытка
			УстановитьБезопасныйРежим(Истина);
			SUI_ОбщегоНазначения.ПередВыполнениемПроизвольногоАлгоритма();
			Выполнить(Алгоритм);
			УстановитьБезопасныйРежим(Ложь);
		Исключение
			ШаблонСообщения = НСтр("ru = 'Ошибка выполнения алгоритма после записи.
			|Проверьте алгоритм после записи в настройке документа.
			|
			|%2'");
			ВызватьИсключение СтрШаблон(ШаблонСообщения, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ЗаписатьДокументОснование(ДокументОснованиеОбъект, НастройкаДокумента, Знач ДополнительныеПараметры = Неопределено) Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("ДокументЗаписан", Ложь);
	Результат.Вставить("ДокументПроведен", Ложь);
	
	Отказ = Ложь;
	
	ПараметрыЗаписи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НастройкаДокумента, "ПроводитьДокумент,
	|АлгоритмПередЗаписью,АлгоритмПослеЗаписи");
	
	ОписаниеТипаСтруктура = Новый ОписаниеТипов("Структура");
	ДополнительныеПараметры = ОписаниеТипаСтруктура.ПривестиЗначение(ДополнительныеПараметры);
	
	Если ДополнительныеПараметры.Свойство("ПроводитьДокумент") Тогда
		ПараметрыЗаписи.ПроводитьДокумент = ДополнительныеПараметры.ПроводитьДокумент;
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("АлгоритмПередЗаписью") Тогда
		ПараметрыЗаписи.АлгоритмПередЗаписью = ДополнительныеПараметры.АлгоритмПередЗаписью;
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("АлгоритмПослеЗаписи") Тогда
		ПараметрыЗаписи.АлгоритмПослеЗаписи = ДополнительныеПараметры.АлгоритмПослеЗаписи;
	КонецЕсли;
	
	// Алгоритм перед записью
	Если Не ДополнительныеПараметры.Свойство("НеВыполнятьАлгоритмПередЗаписью") Тогда
		
		ПараметрыАлгоритма = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДокументОснованиеОбъект);
		
		ПараметрыАлгоритма = Обработки.SUI_РедакторКода.ВыполнитьКодЧерезМетодКонфигурации(
			"Документы.SUI_ДокументОбмена.ВыполнитьАлгоритмПередЗаписью", 
			ПараметрыЗаписи.АлгоритмПередЗаписью, 
			ПараметрыАлгоритма, 
			Истина);
		
		ДокументОснованиеОбъект = ПараметрыАлгоритма[ПараметрыАлгоритма.ВГраница()];
		
	КонецЕсли;
	
	Если Не ДополнительныеПараметры.Свойство("ОтключитьПроверкуЗаполнения") И Не ДокументОснованиеОбъект.ПроверитьЗаполнение() Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если Не Отказ Тогда
		
		// Режим записи
		РежимЗаписи = РежимЗаписиДокумента.Запись;
		Если ПараметрыЗаписи.ПроводитьДокумент И ДокументОснованиеОбъект.ПометкаУдаления Тогда
			ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru = 'Документ основание помечен на удаление, проведение документа невозможно.'"));
		ИначеЕсли ПараметрыЗаписи.ПроводитьДокумент Тогда
			РежимЗаписи = РежимЗаписиДокумента.Проведение;
		КонецЕсли;
		
		// Установка дополнительных свойств
		Если ДополнительныеПараметры.Свойство("ДополнительныеСвойства") Тогда
			
			Для Каждого ДополнительноеСвойство Из ДополнительныеПараметры.ДополнительныеСвойства Цикл
				ДокументОснованиеОбъект.ДополнительныеСвойства.Вставить(ДополнительноеСвойство.Ключ, ДополнительноеСвойство.Значение);
			КонецЦикла;
			
		КонецЕсли;
		
		Если ДополнительныеПараметры.Свойство("ОтключитьРегистрацию") Тогда
			ДокументОснованиеОбъект.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
		КонецЕсли;
		
		Если ДополнительныеПараметры.Свойство("ОтключитьСобытияSimple") Тогда
			ДокументОснованиеОбъект.ДополнительныеСвойства.Вставить("ОтключитьСобытияSimple");
		КонецЕсли;
		
		Если Не ДополнительныеПараметры.Свойство("ОтключитьРежимЗагрузки") Тогда
			ДокументОснованиеОбъект.ОбменДанными.Загрузка = Истина;
		КонецЕсли;
		
		// Запись документа
		ДокументОснованиеОбъект.Записать(РежимЗаписи);
		
		Результат.ДокументЗаписан = Истина;
		Результат.ДокументПроведен = (РежимЗаписи = РежимЗаписиДокумента.Проведение);
		
		// Алгоритм После записи
		Если Не ДополнительныеПараметры.Свойство("НеВыполнятьАлгоритмПослеЗаписи") Тогда
			
			ПараметрыАлгоритма = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДокументОснованиеОбъект);
			
			ПараметрыАлгоритма = Обработки.SUI_РедакторКода.ВыполнитьКодЧерезМетодКонфигурации(
				"Документы.SUI_ДокументОбмена.ВыполнитьАлгоритмПослеЗаписи", 
				ПараметрыЗаписи.АлгоритмПередЗаписью, 
				ПараметрыАлгоритма, 
				Истина);
			
			ДокументОснованиеОбъект = ПараметрыАлгоритма[ПараметрыАлгоритма.ВГраница()];
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСтрокиКОбработке(ТабличнаяЧасть, Знач СтатусыКОбработке = Неопределено) Экспорт
	
	ОтборСтрок = Новый Структура();
	ОтборСтрок.Вставить("СтатусОбработки", Перечисления.SUI_СтатусыОбработкиСтрок.ТребуетсяОбработка);
	
	СтрокиКОбработке = ТабличнаяЧасть.НайтиСтроки(ОтборСтрок);
	
	Если СтатусыКОбработке <> Неопределено Тогда
		
		СтатусыКОбработке = ОбщегоНазначенияКлиентСервер.РазностьМассивов(СтатусыКОбработке,
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОтборСтрок.СтатусОбработки));
		
		Для индекс = 0 По СтатусыКОбработке.ВГраница() Цикл
			ОтборСтрок.СтатусОбработки = СтатусыКОбработке[индекс];
			СтрокиКОбработкеПоСтатусу = ТабличнаяЧасть.НайтиСтроки(ОтборСтрок);
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтрокиКОбработке, СтрокиКОбработкеПоСтатусу, Истина);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат СтрокиКОбработке;
	
КонецФункции

Процедура ОбработатьСтрокиШтрихкодовУпаковок(СтрокиКОбработке, СтрокиОбработаны = Ложь) Экспорт
	
	Если СтрокиКОбработке.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НастройкаШтрихкодыУпаковок = SUI_НастройкиМетаданныхСервер.ПолучитьДополнительныеНастройки(
		Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыУпаковок);
	
	ТипАлгоритмаНормализации = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НастройкаШтрихкодыУпаковок, 
		"АлгоритмНормализацииЗначенияШтрихкода.Тип", Перечисления.SUI_ТипыАлгоритмов.ПустаяСсылка(), Тип("ПеречислениеСсылка.SUI_ТипыАлгоритмов"));
	АлгоритмНормализации = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НастройкаШтрихкодыУпаковок, 
		"АлгоритмНормализацииЗначенияШтрихкода.Алгоритм", "", Тип("Строка"));
	АлгоритмСоздания = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НастройкаШтрихкодыУпаковок, 
		"АлгоритмСозданияШтрихкодаУпаковки.Алгоритм", "", Тип("Строка"));
	
	Ошибки = Новый Массив();
	
	//TODO: 22.08.2024 - artem - Добавить проверку на включение ФО
	
	Если ТипАлгоритмаНормализации.Пустая() Тогда
		Ошибки.Добавить(НСтр("ru = 'Не удалось определить тип алгоритма нормализации значения штрихкода.'"));
	КонецЕсли;
	
	Если ПустаяСтрока(АлгоритмНормализации) И ТипАлгоритмаНормализации = Перечисления.SUI_ТипыАлгоритмов.Произвольный Тогда
		Ошибки.Добавить(НСтр("ru = 'Не заполнен алгоритм нормализации значения штрихкода упаковки.'"));
	КонецЕсли;
	
	Если ПустаяСтрока(АлгоритмСоздания) Тогда
		Ошибки.Добавить(НСтр("ru = 'Не заполнен алгоритм создания штрихкода упаковки.'"));
	КонецЕсли;
	
	Если Ошибки.Количество() > 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Обработка штрихкодов упаковок документа обмена не выполнена.
		|%1'"), СтрСоединить(Ошибки, Символы.ПС)));
		Возврат;
	КонецЕсли;
	
	КлючиДанных = "Номенклатура,Характеристика,Упаковка,ШтрихкодУпаковки,ЗначениеШтрихкода";
	
	Для индекс = 0 По СтрокиКОбработке.ВГраница() Цикл
		
		Если СтрокиКОбработке[индекс].СтатусОбработки = Перечисления.SUI_СтатусыОбработкиСтрок.ОбработкаНеТребуется Тогда
			Продолжить;
		КонецЕсли;
		
		Данные = Новый Структура(КлючиДанных);
		ЗаполнитьЗначенияСвойств(Данные, СтрокиКОбработке[индекс]);
		
		Данные.ЗначениеШтрихкода = SUI_ШтрихкодыУпаковок.НормализоватьЗначениеШтрихкода(ТипАлгоритмаНормализации,
			АлгоритмНормализации, Данные.ЗначениеШтрихкода);
		
		Если ЗначениеЗаполнено(Данные.ЗначениеШтрихкода) Тогда
			
			SUI_ИнтеграцияВКонфигурацию.ВосстановитьСсылкиИдентификаторовSimple(Данные, "ЗначениеШтрихкода");
			
			ПараметрыАлгоритма = Новый Массив();
			ПараметрыАлгоритма.Добавить(Данные.ШтрихкодУпаковки);
			ПараметрыАлгоритма.Добавить(Данные.Номенклатура);
			ПараметрыАлгоритма.Добавить(Данные.Характеристика);
			ПараметрыАлгоритма.Добавить(Данные.Упаковка);
			ПараметрыАлгоритма.Добавить(Данные.ЗначениеШтрихкода);
			
			ПараметрыАлгоритма = Обработки.SUI_РедакторКода.ВыполнитьКодЧерезМетодКонфигурации(
				"SUI_ШтрихкодыУпаковок.СоздатьШтрихкодУпаковкиПоАлгоритму", АлгоритмСоздания, ПараметрыАлгоритма);
			
			Данные.ШтрихкодУпаковки = SUI_ИнтеграцияВКонфигурацию.ИдентификаторSimpleПоСсылке(ПараметрыАлгоритма[0]);
			
			Если ЗначениеЗаполнено(Данные.ШтрихкодУпаковки) Тогда
				СтрокиКОбработке[индекс].ШтрихкодУпаковки = Данные.ШтрихкодУпаковки;
				СтрокиКОбработке[индекс].ЗначениеШтрихкода = Данные.ЗначениеШтрихкода;
				СтрокиКОбработке[индекс].СтатусОбработки = Перечисления.SUI_СтатусыОбработкиСтрок.ОбработкаНеТребуется;
			Иначе
				СтрокиКОбработке[индекс].СтатусОбработки = Перечисления.SUI_СтатусыОбработкиСтрок.ОбработкаНеВыполнена;
				ОбщегоНазначения.СообщитьПользователю(
					СтрШаблон(НСтр("ru = 'Для строки %1 не определен штрихкод упаковки по алгоритму'"), СтрокиКОбработке[индекс].НомерСтроки),,
					"Объект.ШтрихкодыУпаковок");
			КонецЕсли;
			
		Иначе
			СтрокиКОбработке[индекс].СтатусОбработки = Перечисления.SUI_СтатусыОбработкиСтрок.ОбработкаНеВыполнена;
			ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон(НСтр("ru = 'В строке %1 не удалось нормализовать значение штрихкода'"), СтрокиКОбработке[индекс].НомерСтроки),,
				"Объект.ШтрихкодыУпаковок");
		КонецЕсли;
		
		СтрокиОбработаны = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьСтрокиСерий(СтрокиКОбработке, СтрокиОбработаны = Ложь) Экспорт
	
	Если СтрокиКОбработке.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	АлгоритмСоздания = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		SUI_НастройкиМетаданныхСервер.ПолучитьДополнительныеНастройки(Перечисления.SUI_ТаблицыИнтеграции.СерииНоменклатуры), 
		"АлгоритмСозданияСерииНоменклатуры.Алгоритм", "", Тип("Строка"));
	
	Ошибки = Новый Массив();
	
	Если ПустаяСтрока(АлгоритмСоздания) Тогда
		Ошибки.Добавить(НСтр("ru = 'Не заполнен алгоритм создания серии номенклатуры.'"));
	КонецЕсли;
	
	//TODO: 22.08.2024 - artem - Добавить проверку на включение ФО
	
	Если Ошибки.Количество() > 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Обработка серий документа обмена не выполнена.
		|%1'"), СтрСоединить(Ошибки, Символы.ПС)));
		Возврат;
	КонецЕсли;
	
	КлючиДанных = "Серия,Номенклатура,Характеристика,Наименование,Номер,ДатаПроизводства,ГоденДо,КоличествоФакт";
	
	Для индекс = 0 По СтрокиКОбработке.ВГраница() Цикл
		
		Если СтрокиКОбработке[индекс].СтатусОбработки = Перечисления.SUI_СтатусыОбработкиСтрок.ОбработкаНеТребуется Тогда
			Продолжить;
		КонецЕсли;
		
		Данные = Новый Структура(КлючиДанных);
		ЗаполнитьЗначенияСвойств(Данные, СтрокиКОбработке[индекс]);
		
		SUI_ИнтеграцияВКонфигурацию.ВосстановитьСсылкиИдентификаторовSimple(Данные, "Наименование,Номер,ДатаПроизводства,ГоденДо,КоличествоФакт");
		
		ПараметрыАлгоритма = Новый Массив();
		ПараметрыАлгоритма.Добавить(Данные.Серия);
		ПараметрыАлгоритма.Добавить(Данные.Номенклатура);
		ПараметрыАлгоритма.Добавить(Данные.Характеристика);
		ПараметрыАлгоритма.Добавить(Данные.Наименование);
		ПараметрыАлгоритма.Добавить(Данные.Номер);
		ПараметрыАлгоритма.Добавить(Данные.ДатаПроизводства);
		ПараметрыАлгоритма.Добавить(Данные.ГоденДо);
		ПараметрыАлгоритма.Добавить(Данные.КоличествоФакт);
		
		ПараметрыАлгоритма = Обработки.SUI_РедакторКода.ВыполнитьКодЧерезМетодКонфигурации(
			"SUI_СерииНоменклатуры.СоздатьСерииНоменклатурыПоАлгоритму", АлгоритмСоздания, ПараметрыАлгоритма);
		
		Данные.Серия = SUI_ИнтеграцияВКонфигурацию.ИдентификаторSimpleПоСсылке(ПараметрыАлгоритма[0]);
		
		Если ЗначениеЗаполнено(Данные.Серия) Тогда
			СтрокиКОбработке[индекс].Серия = Данные.Серия;
			СтрокиКОбработке[индекс].СтатусОбработки = Перечисления.SUI_СтатусыОбработкиСтрок.ОбработкаНеТребуется;
		Иначе
			СтрокиКОбработке[индекс].СтатусОбработки = Перечисления.SUI_СтатусыОбработкиСтрок.ОбработкаНеВыполнена;
			ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон(НСтр("ru = 'Для строки %1 не определена серия по алгоритму'"), СтрокиКОбработке[индекс].НомерСтроки),,
				"Объект.Серии");
		КонецЕсли;
		
		СтрокиОбработаны = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьИнформациюВДеревоПроверки(Дерево, ИнформацияРодитель, Информация, ИндексКартинки)
	
	СтрокаРодитель = Дерево.Строки.Найти(ИнформацияРодитель, "Информация", Ложь);
	
	Если СтрокаРодитель = Неопределено Тогда
		
		СтрокаРодитель = Дерево.Строки.Добавить();
		СтрокаРодитель.Информация = ИнформацияРодитель;
		
	КонецЕсли;
	
	Если ПустаяСтрока(Информация) Тогда
		СтрокаРодитель.ИндексКартинки = ИндексКартинки;
	Иначе
		СтрокаРодитель.ИндексКартинки = 9;
		ПодчиненнаяСтрока = СтрокаРодитель.Строки.Добавить();
		ПодчиненнаяСтрока.Информация = Информация;
		ПодчиненнаяСтрока.ИндексКартинки = ИндексКартинки;
	КонецЕсли;
	
КонецПроцедуры

Функция ИсключаемыеСостоянияДокументаПриЗагрузкеИзОбмена()
	
	Возврат Новый ФиксированныйМассив(SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.МассивЗначений(
		Перечисления.SUI_СостоянияДокументовОбмена.Новый,
		Перечисления.SUI_СостоянияДокументовОбмена.Завершен,
		Перечисления.SUI_СостоянияДокументовОбмена.Отменен));
	
КонецФункции

#Область ЗагрузкаДокументаОбменаВДокументОснование

Функция ТаблицаДокументаОбменаСНомеромСтрокДокументаОснования(ДокументОбмена, Таблица, НастройкаТаблицы, ОснованаяСхемаКомпоновки)
	
	Если Таблица = Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары Или
		Таблица = Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор Или
		Таблица = Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение Или
		Таблица = Перечисления.SUI_ТипыТаблицДокументовОбмена.ПотокШтрихкодов Тогда
		Запрос = ЗапросКТаблицеДокументаОбмена_Товары(ДокументОбмена, Таблица);
	ИначеЕсли Таблица = Перечисления.SUI_ТипыТаблицДокументовОбмена.Серии Тогда
		Запрос = ЗапросКТаблицеДокументаОбмена_Серии(ДокументОбмена);
	ИначеЕсли Таблица = Перечисления.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок Тогда
		Запрос = ЗапросКТаблицеДокументаОбмена_ШтрихкодыУпаковок(ДокументОбмена);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыРезультатКомпоновки = SUI_КомпоновкаДанныхСервер.ПараметрыРезультатСхемыКомпоновкиДанных();
	ПараметрыРезультатКомпоновки.СхемаКомпоновкиДанных = SUI_КомпоновкаДанныхСервер.СкопироватьСхемуКомпоновкиДанных(ОснованаяСхемаКомпоновки);
	ПараметрыРезультатКомпоновки.ВозможностьИспользованияВнешнихФункций = Истина;
	ПараметрыРезультатКомпоновки.ВыполнятьВПривилегированномРежиме = Истина;
	
	// Номер строки
	SUI_КомпоновкаДанныхКлиентСервер.ДобавитьВыбранноеПоле(
		ПараметрыРезультатКомпоновки.СхемаКомпоновкиДанных.НастройкиПоУмолчанию, 
		НастройкаТаблицы.ИмяТабличнойЧасти + ".НомерСтроки", "НомерСтроки");
	
	// Ключ связи
	РеквизитыИдентификацииСтрок = НастройкаТаблицы.ИмяТабличнойЧасти + "." 
		+ СтрСоединить(НастройкаТаблицы.РеквизитыИдентификации, "," + НастройкаТаблицы.ИмяТабличнойЧасти + ".");
	ВП_ИдентификацияСтрок = SUI_КомпоновкаДанныхСервер.ДобавитьВычисляемоеПоле(ПараметрыРезультатКомпоновки.СхемаКомпоновкиДанных, 
		"SUI_КлючСвязи", 
		"Документы.SUI_ДокументОбмена.ВычислитьКлючСвязи(" + РеквизитыИдентификацииСтрок + ")", 
		"КлючСвязи");
	ВП_ИдентификацияСтрок.ТипЗначения = ОбщегоНазначения.ОписаниеТипаСтрока(64);
	SUI_КомпоновкаДанныхКлиентСервер.ДобавитьВыбранноеПоле(ПараметрыРезультатКомпоновки.СхемаКомпоновкиДанных.НастройкиПоУмолчанию, 
		ВП_ИдентификацияСтрок.ПутьКДанным, ВП_ИдентификацияСтрок.Заголовок);
	
	Запрос.УстановитьПараметр("Приемник", ВыгрузитьРезультатСхемыКомпоновкиДанных(ПараметрыРезультатКомпоновки));
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция ЗапросКТаблицеДокументаОбмена_Товары(ДокументОбмена, ТипТаблицы)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Источник", ДокументОбмена);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Приемник.НомерСтроки,
		|	ВЫРАЗИТЬ(Приемник.КлючСвязи КАК СТРОКА(64)) КАК КлючСвязи
		|ПОМЕСТИТЬ втПриемник
		|ИЗ
		|	&Приемник КАК Приемник
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	КлючСвязи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Источник.НомерСтроки,
		|	ЕСТЬNULL(втПриемник.НомерСтроки, 0) КАК НомерСтрокиПриемник,
		|	Источник.ИдентификаторСтроки,
		|	Источник.КлючСвязи,
		|	Источник.Номенклатура,
		|	Источник.Характеристика,
		|	Источник.Упаковка,
		|	Источник.КоличествоФакт,
		|	&ДополнительныеПоля
		|ИЗ
		|	Документ.SUI_ДокументОбмена.Товары КАК Источник
		|		ЛЕВОЕ СОЕДИНЕНИЕ втПриемник КАК втПриемник
		|		ПО Источник.КлючСвязи = втПриемник.КлючСвязи
		|ГДЕ
		|	Источник.Ссылка = &Источник
		|	И Источник.СтатусОбработки = ЗНАЧЕНИЕ(Перечисление.SUI_СтатусыОбработкиСтрок.ОбработкаНеТребуется)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ втПриемник";
	
	ДополнительныеПоля = Новый Массив();
	
	Если ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары Тогда
		ДополнительныеПоля.Добавить("Источник.ВидЦены");
		ДополнительныеПоля.Добавить("Источник.Цена");
		ДополнительныеПоля.Добавить("Источник.СтатусУказанияСерии");
		ДополнительныеПоля.Добавить("Источник.ПризнакМаркировки");
		ДополнительныеПоля.Добавить("Источник.КоличествоПлан");
	ИначеЕсли ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор Или
		ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение Тогда
		ДополнительныеПоля.Добавить("Источник.Ячейка");
		ДополнительныеПоля.Добавить("Источник.СтатусУказанияСерии");
		ДополнительныеПоля.Добавить("Источник.ПризнакМаркировки");
		ДополнительныеПоля.Добавить("Источник.КоличествоПлан");
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДополнительныеПоля", СтрСоединить(ДополнительныеПоля, "," + Символы.ПС));
	
	Возврат Запрос;
	
КонецФункции

Функция ЗапросКТаблицеДокументаОбмена_Серии(ДокументОбмена)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Источник", ДокументОбмена);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Приемник.НомерСтроки,
		|	ВЫРАЗИТЬ(Приемник.КлючСвязи КАК СТРОКА(64)) КАК КлючСвязи
		|ПОМЕСТИТЬ втПриемник
		|ИЗ
		|	&Приемник КАК Приемник
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	КлючСвязи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Источник.НомерСтроки,
		|	ЕСТЬNULL(втПриемник.НомерСтроки, 0) КАК НомерСтрокиПриемник,
		|	Источник.ИдентификаторСтроки,
		|	Источник.КлючСвязи,
		|	Источник.Номенклатура,
		|	Источник.Характеристика,
		|	Источник.Серия,
		|	Источник.КоличествоФакт
		|ИЗ
		|	Документ.SUI_ДокументОбмена.Серии КАК Источник
		|		ЛЕВОЕ СОЕДИНЕНИЕ втПриемник КАК втПриемник
		|		ПО Источник.КлючСвязи = втПриемник.КлючСвязи
		|ГДЕ
		|	Источник.Ссылка = &Источник
		|	И Источник.СтатусОбработки = ЗНАЧЕНИЕ(Перечисление.SUI_СтатусыОбработкиСтрок.ОбработкаНеТребуется)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ втПриемник";
	
	Возврат Запрос;
	
КонецФункции

Функция ЗапросКТаблицеДокументаОбмена_ШтрихкодыУпаковок(ДокументОбмена)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Источник", ДокументОбмена);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Приемник.НомерСтроки,
		|	ВЫРАЗИТЬ(Приемник.КлючСвязи КАК СТРОКА(64)) КАК КлючСвязи
		|ПОМЕСТИТЬ втПриемник
		|ИЗ
		|	&Приемник КАК Приемник
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	КлючСвязи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Источник.НомерСтроки,
		|	ЕСТЬNULL(втПриемник.НомерСтроки, 0) КАК НомерСтрокиПриемник,
		|	Источник.ИдентификаторСтроки,
		|	Источник.КлючСвязи,
		|	Источник.ЗначениеШтрихкода,
		|	Источник.ШтрихкодУпаковки,
		|	Источник.Номенклатура,
		|	Источник.Характеристика,
		|	Источник.Упаковка
		|ИЗ
		|	Документ.SUI_ДокументОбмена.ШтрихкодыУпаковок КАК Источник
		|		ЛЕВОЕ СОЕДИНЕНИЕ втПриемник КАК втПриемник
		|		ПО Источник.КлючСвязи = втПриемник.КлючСвязи
		|ГДЕ
		|	Источник.Ссылка = &Источник
		|	И Источник.СтатусОбработки = ЗНАЧЕНИЕ(Перечисление.SUI_СтатусыОбработкиСтрок.ОбработкаНеТребуется)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ втПриемник";
	
	Возврат Запрос;
	
КонецФункции

Функция СопоставитьДанныеСтрокиКЗагрузке(ДанныеИзВыборки, СоответствияРеквизитовПриемника, Знач ИсключаемыеРеквизиты = "")
	
	СопоставленныеДанные = Новый Структура();
	
	ИсключаемыеРеквизиты = СтрРазделить(ИсключаемыеРеквизиты, ",", Ложь);
	
	Для Каждого СоответствиеРеквизитаПриемника Из СоответствияРеквизитовПриемника Цикл
		
		Если ИсключаемыеРеквизиты.Найти(СоответствиеРеквизитаПриемника.Ключ) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ДанныеИзВыборки.Свойство(СоответствиеРеквизитаПриемника.Ключ) Тогда
			СопоставленныеДанные.Вставить(СоответствиеРеквизитаПриемника.Значение, ДанныеИзВыборки[СоответствиеРеквизитаПриемника.Ключ]);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СопоставленныеДанные;
	
КонецФункции

Функция ВычислитьКлючСвязиПриОбработкеСтроки(СтрокаТабличнойЧасти, РеквизитыИдентификации)
	
	УстановитьБезопасныйРежим(Истина);
	
	SUI_ОбщегоНазначения.ПередВыполнениемПроизвольногоАлгоритма();
	
	ПараметрыКВычислению = Новый Массив();
	Для Индекс = 0 По РеквизитыИдентификации.ВГраница() Цикл 
		ПараметрыКВычислению.Добавить("СтрокаТабличнойЧасти[РеквизитыИдентификации[" + XMLСтрока(Индекс) + "]]");
	КонецЦикла;
	
	Возврат Вычислить(СтрШаблон("Документы.SUI_ДокументОбмена.ВычислитьКлючСвязи(%1)", СтрСоединить(ПараметрыКВычислению, ",")));
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
