
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Запись.ИсходныйКлючЗаписи.Пустой() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Результаты.Сообщения
			|ИЗ
			|	РегистрСведений.SUI_РезультатыОбработкиВходящихСообщенийОбменаДанными КАК Результаты
			|ГДЕ
			|	Результаты.ID = &ID";
		
		Запрос.УстановитьПараметр("ID", Запись.ID);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			
			ОписаниеТипаМассив = Новый ОписаниеТипов("Массив");
			Сообщения = СтрСоединить(ОписаниеТипаМассив.ПривестиЗначение(Выборка.Сообщения.Получить()), Символы.ПС);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
