
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Запись.ИсходныйКлючЗаписи.Пустой() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Сообщения
			|ИЗ
			|	РегистрСведений.SUI_РезультатыОбработкиВходящихСообщенийОбменаДанными
			|ГДЕ
			|	ID = &ID";
		
		Запрос.УстановитьПараметр("ID", Запись.ID);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			
			ОписаниеТипаМассив = Новый ОписаниеТипов("Массив");
			МассивСообщений = ОписаниеТипаМассив.ПривестиЗначение(Выборка.Сообщения.Получить());
			
			Для индекс = 0 По МассивСообщений.ВГраница() Цикл
				
				Если индекс > 0 Тогда
					Сообщения = Сообщения + Символы.ПС;
				КонецЕсли;
				
				Сообщения = Сообщения + СтрШаблон("[%1] %2", Формат(индекс, "ЧДЦ=0; ЧН=0; ЧГ=0;"), МассивСообщений[индекс]);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВернутьСообщение(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ВернутьСообщениеПодтверждение", ЭтотОбъект);
	
	ПоказатьВопрос(Оповещение, НСтр("ru = 'Вернуть сообщение?'"), РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВернутьСообщениеПодтверждение(Подтверждение, ДополнительныеПараметры) Экспорт
	
	Если Подтверждение <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Результат = ВернутьСообщениеНаСервере(Запись.ID);
	
	Закрыть();
	
	Если Результат.СообщениеОбменаКлючЗаписи <> Неопределено Тогда
		ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъекта(Результат.СообщениеОбменаКлючЗаписи);
	КонецЕсли;
	
	Если Результат.РезультатСообщенияОбменаКлючЗаписи <> Неопределено Тогда
		ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъекта(Результат.РезультатСообщенияОбменаКлючЗаписи);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВернутьСообщениеНаСервере(Идентификатор)
	
	Результат = Новый Структура("СообщениеОбменаКлючЗаписи,РезультатСообщенияОбменаКлючЗаписи");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СообщениеОбменаДанными
		|ИЗ
		|	РегистрСведений.SUI_РезультатыОбработкиВходящихСообщенийОбменаДанными
		|ГДЕ
		|	ID = &ID
		|ДЛЯ ИЗМЕНЕНИЯ
		|	РегистрСведений.SUI_РезультатыОбработкиВходящихСообщенийОбменаДанными";
	
	Запрос.УстановитьПараметр("ID", Идентификатор);
	
	НачатьТранзакцию();
	
	Попытка
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ОбщегоНазначенияКлиентСервер.Проверить(Не РезультатЗапроса.Пустой(),
			НСтр("ru = 'Не удалось получить данные сообщения обмена'"));
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		ДанныеСообщенияОбмена = Выборка.СообщениеОбменаДанными.Получить();
		
		ДополнительныеДанные = Новый Структура("Сворачивать,ДатаЗаписи");
		ЗаполнитьЗначенияСвойств(ДополнительныеДанные, ДанныеСообщенияОбмена);
		ДополнительныеДанные.Вставить("ID", Идентификатор);
		ДополнительныеДанные.Вставить("НеОбрабатывать", Истина);
		ДополнительныеДанные.Вставить("ДатаВозврата", ТекущаяДатаСеанса());
		
		// Создать сообщение
		ИдентификаторСообщенияОбмена = РегистрыСведений.SUI_СообщенияОбменаДанными.Создать(
			ДанныеСообщенияОбмена.Отправитель, 
			ДанныеСообщенияОбмена.Получатель,
			ДанныеСообщенияОбмена.Данные, 
			ДанныеСообщенияОбмена.Приоритет,
			ДанныеСообщенияОбмена.ВидДанных,
			ДополнительныеДанные);
		
		ОбщегоНазначенияКлиентСервер.Проверить(ИдентификаторСообщенияОбмена <> Неопределено,
			НСтр("ru = 'Не удалось вернуть сообщение обмена данными'"));
		
		СтруктураКлюча = Новый Структура();
		СтруктураКлюча.Вставить("ID", ИдентификаторСообщенияОбмена);
		СтруктураКлюча.Вставить("Отправитель", ДанныеСообщенияОбмена.Отправитель);
		СтруктураКлюча.Вставить("Получатель", ДанныеСообщенияОбмена.Получатель);
		Результат.СообщениеОбменаКлючЗаписи = РегистрыСведений.SUI_СообщенияОбменаДанными.СоздатьКлючЗаписи(СтруктураКлюча);
		
		// Удалить результат
		РегистрыСведений.SUI_РезультатыОбработкиВходящихСообщенийОбменаДанными.УдалитьРезультат(Идентификатор);
		
		СтруктураКлюча = Новый Структура();
		СтруктураКлюча.Вставить("ID", Идентификатор);
		Результат.РезультатСообщенияОбменаКлючЗаписи = РегистрыСведений.SUI_РезультатыОбработкиВходящихСообщенийОбменаДанными.СоздатьКлючЗаписи(СтруктураКлюча);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
