
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура СформироватьФайлОбращения(Параметры, АдресРезультата) Экспорт
	
	Отчет = Новый Соответствие();
	Отчет.Вставить("time", ТекущаяДатаСеанса());
	Отчет.Вставить("message", Параметры.Сообщение);
	
	КаталогОтчета = ФайловаяСистема.СоздатьВременныйКаталог();
	
	Попытка
		
		УстановитьПривилегированныйРежим(Истина);
		
		ДополнитьИнформациейОКлиенте(Отчет);
		ДополнитьИнформациейОКонфигурации(Отчет);
		ДополнитьИнформациейОДанныхРасширения(Отчет);
		
		УстановитьПривилегированныйРежим(Ложь);	
		
		ДополнитьИнформациейОМобильномПриложении(Отчет, Параметры);
		ДополнитьИнформацийОСобытияхЖурналаРегистрации(Отчет, Параметры);
		ДополнитьИнформацийОВложениях(Отчет, Параметры, КаталогОтчета);
		ДополнитьИнформацийОЛогированииHTTPЗапросов(Отчет, Параметры, КаталогОтчета);
		
		ПутьКФайлуОтчета = SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(КаталогОтчета, "report.json");
		
		ЗаписьJSON = Новый ЗаписьJSON();
		ЗаписьJSON.ОткрытьФайл(ПутьКФайлуОтчета, , , Новый ПараметрыЗаписиJSON(, Символы.Таб));
		ЗаписатьJSON(ЗаписьJSON, Отчет, , "ПреобразованиеJSON", Обработки.SUI_ОбращениеВТехническуюПоддержку);
		ЗаписьJSON.Закрыть();
		
		ФайлАрхив = Новый ЗаписьZipФайла();
		ФайлАрхив.Добавить(SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(КаталогОтчета, "*.*"), 
			РежимСохраненияПутейZIP.СохранятьОтносительныеПути, 
			РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
		ФайлАрхив = ФайлАрхив.ПолучитьДвоичныеДанные(, , МетодСжатияZIP.Сжатие, УровеньСжатияZIP.Максимальный);
		
		ПоместитьВоВременноеХранилище(ФайлАрхив, АдресРезультата);
		
		ФайловаяСистема.УдалитьВременныйКаталог(КаталогОтчета);
		КаталогОтчета = Неопределено;
		
	Исключение
		Ошибка = ИнформацияОбОшибке();
		Если ЗначениеЗаполнено(КаталогОтчета) Тогда
			ФайловаяСистема.УдалитьВременныйКаталог(КаталогОтчета);
		КонецЕсли;
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации("", , , , Ошибка);
		ТекстОшибки = НСтр("ru = 'Не удалось сформировать обращение в техническую поддержку!'");
		ВызватьИсключение(ТекстОшибки, , , , Ошибка);
	КонецПопытки;
	
КонецПроцедуры

Функция ПреобразованиеJSON(Свойство, Значение, ДополнительныеПараметры, Отказ) Экспорт
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если ТипЗначения = Тип("Null") Тогда
		Значение = Неопределено;
	ИначеЕсли ТипЗначения <> Тип("Строка") И ТипЗначения <> Тип("Число") И 
		ТипЗначения <> Тип("Дата") И ТипЗначения <> Тип("Булево") Тогда
		Значение = Строка(Значение);
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоздатьКаталогВоВременномКаталоге(ВременныйКаталог, Имя)
	
	Путь = Новый Структура();
	Путь.Вставить("Относительный", Имя);
	Путь.Вставить("Абсолютный", SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(ВременныйКаталог, Путь.Относительный));
	
	СоздатьКаталог(Путь.Абсолютный);
	
	Файл = Новый Файл(Путь.Абсолютный);
	SUI_ОбщегоНазначенияКлиентСервер.Проверить(Файл.Существует() И Файл.ЭтоКаталог(), 
		СтрШаблон(НСтр("ru = 'Не удалось инициализировать временный каталог (%1)'"), Путь.Относительный));
	
	Возврат Путь;
	
КонецФункции

Процедура ДополнитьИнформациейОМобильномПриложении(Отчет, Параметры)
	
	ИнформацияОМобильномПриложении = Новый Соответствие();
	ИнформацияОМобильномПриложении.Вставить("version", Параметры.МобильноеПриложение.Версия);
	ИнформацияОМобильномПриложении.Вставить("configuration", Параметры.МобильноеПриложение.Конфигурация);
	ИнформацияОМобильномПриложении.Вставить("configurationVersion", Параметры.МобильноеПриложение.ВерсияКонфигурации);
	
	Отчет.Вставить("mobileInfo", ИнформацияОМобильномПриложении);
	
КонецПроцедуры

Процедура ДополнитьИнформациейОКлиенте(Отчет)
	
	СистемнаяИнформация = Новый СистемнаяИнформация();
	
	ИнформацияОКлиенте = Новый Соответствие();
	ИнформацияОКлиенте.Вставить("platformType", Строка(СистемнаяИнформация.ТипПлатформы));
	ИнформацияОКлиенте.Вставить("appVersion", СистемнаяИнформация.ВерсияПриложения);
	ИнформацияОКлиенте.Вставить("processor", СистемнаяИнформация.Процессор);
	ИнформацияОКлиенте.Вставить("RAM", СистемнаяИнформация.ОперативнаяПамять);
	ИнформацияОКлиенте.Вставить("osVersion", СистемнаяИнформация.ВерсияОС);
	
	Отчет.Вставить("clientInfo", ИнформацияОКлиенте);
	
КонецПроцедуры

Процедура ДополнитьИнформациейОКонфигурации(Отчет)
	
	ИнформацияОКонфигурации = Новый Соответствие();
	ИнформацияОКонфигурации.Вставить("name", Метаданные.Имя);
	ИнформацияОКонфигурации.Вставить("view", Метаданные.Синоним);
	ИнформацияОКонфигурации.Вставить("version", Метаданные.Версия);
	ИнформацияОКонфигурации.Вставить("edition", SUI_ОбщегоНазначения.РедакцияКонфигурации());
	ИнформацияОКонфигурации.Вставить("compatibilityMode", СтандартныеПодсистемыСервер.ВерсияРежимаСовместимости());
	ИнформацияОКонфигурации.Вставить("provider", Метаданные.Поставщик);
	ИнформацияОКонфигурации.Вставить("copyright", Метаданные.АвторскиеПрава);
	ИнформацияОКонфигурации.Вставить("addressConfiguration", Метаданные.АдресИнформацииОКонфигурации);
	ИнформацияОКонфигурации.Вставить("addressSupplier", Метаданные.АдресИнформацииОПоставщике);
	ИнформацияОКонфигурации.Вставить("summaryInformation", Метаданные.КраткаяИнформация);
	ИнформацияОКонфигурации.Вставить("detailedInformation", Метаданные.ПодробнаяИнформация);
	
	ДополнитьИнформациейОРасширениях(ИнформацияОКонфигурации);
	ДополнитьИнформациейОПодсистемах(ИнформацияОКонфигурации);
	
	Отчет.Вставить("configInfo", ИнформацияОКонфигурации);
	
КонецПроцедуры

Процедура ДополнитьИнформациейОРасширениях(Отчет)
	
	ИнформацияОРасширениях = Новый Массив();
	
	ОписанияРасширений = РасширенияКонфигурации.Получить();
	ИнформацияОПроблемахРасширений = РасширенияКонфигурации.ПолучитьИнформациюОПроблемахПримененияВСеансе();
	
	Для Каждого ОписаниеРасширенияКонфигурации Из ОписанияРасширений Цикл
		
		ХешСумма = SUI_ОбщегоНазначения.КонтрольнаяСуммаСтрокой(ОписаниеРасширенияКонфигурации.ХешСумма);
		ИнформацияОРасширении = Новый Соответствие();
		ИнформацияОРасширении.Вставить("id", ОписаниеРасширенияКонфигурации.УникальныйИдентификатор);
		ИнформацияОРасширении.Вставить("name", ОписаниеРасширенияКонфигурации.Имя);
		ИнформацияОРасширении.Вставить("view", ОписаниеРасширенияКонфигурации.Синоним);
		ИнформацияОРасширении.Вставить("version", ОписаниеРасширенияКонфигурации.Версия);
		ИнформацияОРасширении.Вставить("enabled", ОписаниеРасширенияКонфигурации.Активно);
		ИнформацияОРасширении.Вставить("safeMode", ОписаниеРасширенияКонфигурации.БезопасныйРежим);
		ИнформацияОРасширении.Вставить("purpose", Строка(ОписаниеРасширенияКонфигурации.Назначение));
		ИнформацияОРасширении.Вставить("useBasicRolesForAllUsers", ОписаниеРасширенияКонфигурации.ИспользоватьОсновныеРолиДляВсехПользователей);
		ИнформацияОРасширении.Вставить("usedInDistributed", ОписаниеРасширенияКонфигурации.ИспользуетсяВРаспределеннойИнформационнойБазе);
		ИнформацияОРасширении.Вставить("hashSum", ХешСумма);
		
		Если ОписаниеРасширенияКонфигурации.ИзменяетСтруктуруДанных() Тогда
			ИнформацияОРасширении.Вставить("modifiesStructureMetadata", Истина);
		Иначе
			ИнформацияОРасширении.Вставить("modifiesStructureMetadata", Ложь);
		КонецЕсли;
		
		ЗащитаОтОпасныхДействий = ОписаниеРасширенияКонфигурации.ЗащитаОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях;
		ИнформацияОРасширении.Вставить("protectionDangerousActions", ЗащитаОтОпасныхДействий);
		
		ОшибкиПрименения = Новый Массив();
		
		Для индекс = 0 По ИнформацияОПроблемахРасширений.ВГраница() Цикл
			
			Если ИнформацияОПроблемахРасширений[индекс].Расширение.УникальныйИдентификатор = ОписаниеРасширенияКонфигурации.УникальныйИдентификатор Тогда
				
				ОшибкаПрименения = Новый Соответствие();
				ОшибкаПрименения.Вставить("category", Строка(ИнформацияОПроблемахРасширений[индекс].Важность));
				ОшибкаПрименения.Вставить("error", ИнформацияОПроблемахРасширений[индекс].Описание);
				
				ОшибкиПрименения.Добавить(ОшибкаПрименения);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ИнформацияОРасширении.Вставить("errors", ОшибкиПрименения);
		
		ИнформацияОРасширениях.Добавить(ИнформацияОРасширении);
		
	КонецЦикла;
	
	Отчет.Вставить("extentions", ИнформацияОРасширениях);
	
КонецПроцедуры

Процедура ДополнитьИнформациейОПодсистемах(Отчет)
	
	ИнформацияОПодсистемах = Новый Массив();
	
	ОписанияПодсистем = ОбщегоНазначения.ОписанияПодсистем();
	
	Для индекс = 0 По ОписанияПодсистем.ВГраница() Цикл
		
		ИнформацияОПодсистеме = Новый Соответствие();
		ИнформацияОПодсистеме.Вставить("name", ОписанияПодсистем[индекс].Имя);
		ИнформацияОПодсистеме.Вставить("version", ОписанияПодсистем[индекс].Версия);
		
		ИнформацияОПодсистемах.Добавить(ИнформацияОПодсистеме);
		
	КонецЦикла;
	
	Отчет.Вставить("subsystems", ИнформацияОПодсистемах);
	
КонецПроцедуры

Процедура ДополнитьИнформациейОДанныхРасширения(Отчет) 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	SUI_АдресПубликацииБазы.Значение КАК АдресПубликации,
		|	SUI_ВерсияДанных.Значение КАК ВерсияДанных,
		|	SUI_ЗамещатьВПотокеШтрихкодов.Значение КАК ЗамещатьВПотокеШтрихкодов,
		|	SUI_ИспользоватьДополнительныеРеквизитыТаблиц.Значение КАК ИспользоватьДополнительныеРеквизитыТаблиц,
		|	SUI_ИспользоватьЗапросыАвторизацииМУ.Значение КАК ИспользоватьЗапросыАвторизацииМУ,
		|	SUI_ИспользоватьПользовательскийЗапрос.Значение КАК ИспользоватьПользовательскийЗапрос,
		|	SUI_КоличествоЗаданийВПотокеОчередиЗаданий.Значение КАК КоличествоЗаданийВПотокеОчередиЗаданий,
		|	SUI_ЛогированиеHTTPЗапросов.Значение КАК ЛогированиеHTTPЗапросов,
		|	SUI_ОнлайнОбмен.Значение КАК ОнлайнОбмен,
		|	SUI_ОфлайнОбмен.Значение КАК ОфлайнОбмен,
		|	SUI_ОткрыватьВыгрузкуДокументовОбменаОфлайн.Значение КАК ОткрыватьВыгрузкуДокументовОбменаОфлайн,
		|	SUI_ПроверятьСвязьСПользователямиПриОткрытииРабочегоМеста.Значение КАК
		|		ПроверятьСвязьСПользователямиПриОткрытииРабочегоМеста,
		|	SUI_РазмерПакетаДанных.Значение КАК РазмерПакетаДанных,
		|	SUI_РегистрироватьИзмененияПослеЗагрузкиДокументаИзМУ.Значение КАК РегистрироватьИзмененияПослеЗагрузкиДокументаИзМУ,
		|	SUI_СоздаватьШтрихкодыИзТСД.Значение КАК СоздаватьШтрихкодыИзТСД,
		|	SUI_СрокХраненияРезультатовОбработкиВходящихСообщенийОбмена.Значение КАК
		|		СрокХраненияРезультатовОбработкиВходящихСообщенийОбмена,
		|	SUI_ТаймаутВыгрузкиДанных.Значение КАК ТаймаутВыгрузкиДанных,
		|	SUI_ТаймаутПроверкиСвязи.Значение КАК ТаймаутПроверкиСвязи,
		|	SUI_УстановкаПредварительныхВерсий.Значение КАК УстановкаПредварительныхВерсий,
		|	SUI_ХранениеЛоговHTTPЗапросовВДнях.Значение КАК ХранениеЛоговHTTPЗапросовВДнях,
		|	SUI_ХранениеОбработанныхДокументовОбмена.Значение КАК ХранениеОбработанныхДокументовОбмена,
		|	SUI_ХранениеСообщенийМобильныхУстройствВДнях.Значение КАК ХранениеСообщенийМобильныхУстройствВДнях
		|ИЗ
		|	Константа.SUI_АдресПубликацииБазы КАК SUI_АдресПубликацииБазы,
		|	Константа.SUI_ВерсияДанных КАК SUI_ВерсияДанных,
		|	Константа.SUI_ЗамещатьВПотокеШтрихкодов КАК SUI_ЗамещатьВПотокеШтрихкодов,
		|	Константа.SUI_ИспользоватьДополнительныеРеквизитыТаблиц КАК SUI_ИспользоватьДополнительныеРеквизитыТаблиц,
		|	Константа.SUI_ИспользоватьЗапросыАвторизацииМУ КАК SUI_ИспользоватьЗапросыАвторизацииМУ,
		|	Константа.SUI_ИспользоватьПользовательскийЗапрос КАК SUI_ИспользоватьПользовательскийЗапрос,
		|	Константа.SUI_КоличествоЗаданийВПотокеОчередиЗаданий КАК SUI_КоличествоЗаданийВПотокеОчередиЗаданий,
		|	Константа.SUI_ЛогированиеHTTPЗапросов КАК SUI_ЛогированиеHTTPЗапросов,
		|	Константа.SUI_ОнлайнОбмен КАК SUI_ОнлайнОбмен,
		|	Константа.SUI_ОткрыватьВыгрузкуДокументовОбменаОфлайн КАК SUI_ОткрыватьВыгрузкуДокументовОбменаОфлайн,
		|	Константа.SUI_ОфлайнОбмен КАК SUI_ОфлайнОбмен,
		|	Константа.SUI_ПроверятьСвязьСПользователямиПриОткрытииРабочегоМеста КАК
		|		SUI_ПроверятьСвязьСПользователямиПриОткрытииРабочегоМеста,
		|	Константа.SUI_РазмерПакетаДанных КАК SUI_РазмерПакетаДанных,
		|	Константа.SUI_РегистрироватьИзмененияПослеЗагрузкиДокументаИзМУ КАК
		|		SUI_РегистрироватьИзмененияПослеЗагрузкиДокументаИзМУ,
		|	Константа.SUI_СоздаватьШтрихкодыИзТСД КАК SUI_СоздаватьШтрихкодыИзТСД,
		|	Константа.SUI_СрокХраненияРезультатовОбработкиВходящихСообщенийОбмена КАК
		|		SUI_СрокХраненияРезультатовОбработкиВходящихСообщенийОбмена,
		|	Константа.SUI_ТаймаутВыгрузкиДанных КАК SUI_ТаймаутВыгрузкиДанных,
		|	Константа.SUI_ТаймаутПроверкиСвязи КАК SUI_ТаймаутПроверкиСвязи,
		|	Константа.SUI_УстановкаПредварительныхВерсий КАК SUI_УстановкаПредварительныхВерсий,
		|	Константа.SUI_ХранениеЛоговHTTPЗапросовВДнях КАК SUI_ХранениеЛоговHTTPЗапросовВДнях,
		|	Константа.SUI_ХранениеОбработанныхДокументовОбмена КАК SUI_ХранениеОбработанныхДокументовОбмена,
		|	Константа.SUI_ХранениеСообщенийМобильныхУстройствВДнях КАК SUI_ХранениеСообщенийМобильныхУстройствВДнях
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	SUI_ИспользоватьТаблицу_Контрагенты.Значение КАК Контрагенты,
		|	SUI_ИспользоватьТаблицу_Номенклатура.Значение КАК Номенклатура,
		|	SUI_ИспользоватьТаблицу_ПользователиТСД.Значение КАК ПользователиТСД,
		|	SUI_ИспользоватьТаблицу_СерииНоменклатуры.Значение КАК СерииНоменклатуры,
		|	SUI_ИспользоватьТаблицу_Склады.Значение КАК Склады,
		|	SUI_ИспользоватьТаблицу_УпаковкиНоменклатуры.Значение КАК УпаковкиНоменклатуры,
		|	SUI_ИспользоватьТаблицу_ХарактеристикиНоменклатуры.Значение КАК ХарактеристикиНоменклатуры,
		|	SUI_ИспользоватьТаблицу_ШаблоныЭтикеток.Значение КАК ШаблоныЭтикеток,
		|	SUI_ИспользоватьТаблицу_ШтрихкодыНоменклатуры.Значение КАК ШтрихкодыНоменклатуры,
		|	SUI_ИспользоватьТаблицу_ШтрихкодыУпаковок.Значение КАК ШтрихкодыУпаковок,
		|	SUI_ИспользоватьТаблицу_Ячейки.Значение КАК Ячейки
		|ИЗ
		|	Константа.SUI_ИспользоватьТаблицу_Контрагенты КАК SUI_ИспользоватьТаблицу_Контрагенты,
		|	Константа.SUI_ИспользоватьТаблицу_Номенклатура КАК SUI_ИспользоватьТаблицу_Номенклатура,
		|	Константа.SUI_ИспользоватьТаблицу_ПользователиТСД КАК SUI_ИспользоватьТаблицу_ПользователиТСД,
		|	Константа.SUI_ИспользоватьТаблицу_СерииНоменклатуры КАК SUI_ИспользоватьТаблицу_СерииНоменклатуры,
		|	Константа.SUI_ИспользоватьТаблицу_Склады КАК SUI_ИспользоватьТаблицу_Склады,
		|	Константа.SUI_ИспользоватьТаблицу_УпаковкиНоменклатуры КАК SUI_ИспользоватьТаблицу_УпаковкиНоменклатуры,
		|	Константа.SUI_ИспользоватьТаблицу_ХарактеристикиНоменклатуры КАК SUI_ИспользоватьТаблицу_ХарактеристикиНоменклатуры,
		|	Константа.SUI_ИспользоватьТаблицу_ШаблоныЭтикеток КАК SUI_ИспользоватьТаблицу_ШаблоныЭтикеток,
		|	Константа.SUI_ИспользоватьТаблицу_ШтрихкодыНоменклатуры КАК SUI_ИспользоватьТаблицу_ШтрихкодыНоменклатуры,
		|	Константа.SUI_ИспользоватьТаблицу_ШтрихкодыУпаковок КАК SUI_ИспользоватьТаблицу_ШтрихкодыУпаковок,
		|	Константа.SUI_ИспользоватьТаблицу_Ячейки КАК SUI_ИспользоватьТаблицу_Ячейки";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ИнформацияОДанныхРасширения = Новый Массив();
	
	Выборка = РезультатыЗапроса[0].Выбрать();
	Выборка.Следующий();
	
	Для Каждого Колонка Из РезультатыЗапроса[0].Колонки Цикл
		
		ИнформацияОДанных = Новый Соответствие();
		ИнформацияОДанных.Вставить("key", Колонка.Имя);
		ИнформацияОДанных.Вставить("value", Выборка[Колонка.Имя]);
		
		ИнформацияОДанныхРасширения.Добавить(ИнформацияОДанных);
		
	КонецЦикла;
	
	Отчет.Вставить("extensionData", ИнформацияОДанныхРасширения);
	
	ИнформацияОбИспользуемыхТаблицах = Новый Массив();
	
	Выборка = РезультатыЗапроса[1].Выбрать();
	Выборка.Следующий();
	
	Для Каждого Колонка Из РезультатыЗапроса[1].Колонки Цикл
		
		ИнформацияОбИспользуемойТаблице = Новый Соответствие();
		ИнформацияОбИспользуемойТаблице.Вставить("name", Колонка.Имя);
		ИнформацияОбИспользуемойТаблице.Вставить("enabled", Выборка[Колонка.Имя]);
		
		ИнформацияОбИспользуемыхТаблицах.Добавить(ИнформацияОбИспользуемойТаблице);
		
	КонецЦикла;
	
	Отчет.Вставить("usedTables", ИнформацияОбИспользуемыхТаблицах);
	
КонецПроцедуры

Процедура ДополнитьИнформацийОВложениях(Отчет, Параметры, КаталогОтчета)
	
	ИнформацияОВложениях = Новый Структура();
	ИнформацияОВложениях.Вставить("dir", "");
	ИнформацияОВложениях.Вставить("rows", Новый Массив());
	
	Вложения = Параметры.Вложения;
	
	Если Вложения.Количество() > 0 Тогда
		
		ИнформацияОВложениях.dir = "attachments";
		ПутьКаталога = СоздатьКаталогВоВременномКаталоге(КаталогОтчета, ИнформацияОВложениях.dir);
		
		Для Каждого Вложение Из Вложения Цикл
			
			ИнформацияОВложении = Новый Соответствие();
			ИнформацияОВложении.Вставить("name", Вложение.Имя);
			ИнформацияОВложении.Вставить("description", Вложение.Описание);
			
			Если ЗначениеЗаполнено(Вложение.Представление) Тогда
				ИнформацияОВложении.Вставить("view", Вложение.Представление);
			Иначе
				ИнформацияОВложении.Вставить("view", Вложение.Имя);
			КонецЕсли;
			
			Если ПустаяСтрока(Вложение.Расширение) Или СтрЗаканчиваетсяНа(Вложение.Имя, Вложение.Расширение) Тогда
				ИмяФайла = Вложение.Имя;
			ИначеЕсли СтрНачинаетсяС(Вложение.Расширение, ".") Тогда
				ИмяФайла = Вложение.Имя + Вложение.Расширение;
			Иначе
				ИмяФайла = Вложение.Имя + "." + Вложение.Расширение;
			КонецЕсли;
			
			ПутьКФайлу = SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(ПутьКаталога.Абсолютный, ИмяФайла);
			ПутьКФайлу = SUI_ФайловаяСистемаСлужебныйКлиентСервер.УникальноеИмяФайла(ПутьКФайлу);
			
			Вложение.Данные.Записать(ПутьКФайлу);
			
			ФайлВложения = Новый Файл(ПутьКФайлу);
			ИнформацияОВложении.Вставить("file", ФайлВложения.Имя);
			
			ИнформацияОВложениях.rows.Добавить(ИнформацияОВложении);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Отчет.Вставить("attachments", ИнформацияОВложениях);
	
КонецПроцедуры

Процедура ДополнитьИнформацийОСобытияхЖурналаРегистрации(Отчет, Параметры)
	
	ИнформацияОСобытиях = Новый Массив();
	
	События = Параметры.СобытияЖурналаРегистрации;
	
	Для Каждого Событие Из События Цикл
		
		ИнформацияОСобытии = Новый Соответствие();
		ИнформацияОСобытии.Вставить("date", Событие.Дата);
		ИнформацияОСобытии.Вставить("dateServer", Событие.ДатаНаСервере);
		ИнформацияОСобытии.Вставить("level", Событие.Уровень);
		ИнформацияОСобытии.Вставить("name", Событие.Событие);
		ИнформацияОСобытии.Вставить("view", Событие.ПредставлениеСобытия);
		ИнформацияОСобытии.Вставить("computer", Событие.Компьютер);
		ИнформацияОСобытии.Вставить("server", Событие.РабочийСервер);
		ИнформацияОСобытии.Вставить("port", Событие.ОсновнойIPПорт);
		ИнформацияОСобытии.Вставить("portAdditional", Событие.ВспомогательныйIPПорт);
		ИнформацияОСобытии.Вставить("user", Событие.ИмяПользователя);
		ИнформацияОСобытии.Вставить("app", Событие.ПредставлениеПриложения);
		ИнформацияОСобытии.Вставить("session", Событие.Сеанс);
		ИнформацияОСобытии.Вставить("connection", Событие.Соединение);
		ИнформацияОСобытии.Вставить("metadata", Событие.ПредставлениеМетаданных);
		ИнформацияОСобытии.Вставить("transaction", Событие.Транзакция);
		ИнформацияОСобытии.Вставить("transactionStatus", Событие.СтатусТранзакции);
		ИнформацияОСобытии.Вставить("data", Событие.ПредставлениеДанных);
		ИнформацияОСобытии.Вставить("comment", Событие.Комментарий);
		
		ИнформацияОСобытиях.Добавить(ИнформацияОСобытии);
		
	КонецЦикла;
	
	Отчет.Вставить("logs", ИнформацияОСобытиях);
	
КонецПроцедуры

Процедура ДополнитьИнформацийОЛогированииHTTPЗапросов(Отчет, Параметры, КаталогОтчета)
	
	ИнформацияОЗаписях = Новый Структура();
	ИнформацияОЗаписях.Вставить("dir", "");
	ИнформацияОЗаписях.Вставить("rows", Новый Массив());
	
	ЗаписиЛогирования = Параметры.ЗаписиЛогированияHTTPЗапросов;
	
	Если ЗаписиЛогирования.Количество() > 0 Тогда
		
		ИнформацияОЗаписях.dir = "httpLogs";
		ПутьКаталога = СоздатьКаталогВоВременномКаталоге(КаталогОтчета, ИнформацияОЗаписях.dir);
		
		Для Каждого ЗаписьЛогирования Из ЗаписиЛогирования Цикл
			
			ИнформацияОЗаписи = Новый Соответствие();
			ИнформацияОЗаписи.Вставить("SID", ЗаписьЛогирования.SID);
			ИнформацияОЗаписи.Вставить("date", ЗаписьЛогирования.Период);
			ИнформацияОЗаписи.Вставить("method", ЗаписьЛогирования.Метод);
			ИнформацияОЗаписи.Вставить("statusCode", ЗаписьЛогирования.КодСостояния);
			ИнформацияОЗаписи.Вставить("deviceID", ЗаписьЛогирования.ИдентификаторУстройства);
			ИнформацияОЗаписи.Вставить("session", ЗаписьЛогирования.НомерСеанса);
			ИнформацияОЗаписи.Вставить("timestamp", ЗаписьЛогирования.МеткаВремени);
			ИнформацияОЗаписи.Вставить("url", ЗаписьЛогирования.URL);
			ИнформацияОЗаписи.Вставить("urlRelative", ЗаписьЛогирования.ОтносительныйURL);
			ИнформацияОЗаписи.Вставить("user", ЗаписьЛогирования.ИмяПользователя);
			
			ИмяФайлаЗапроса = "";
			ИмяФайлаОтвета = "";
			
			Если Не ПустаяСтрока(ЗаписьЛогирования.ДанныеЗапроса) Тогда
				
				ИмяФайлаЗапроса = "request" + ЗаписьЛогирования.SID + ".json";
				
				ПутьКФайлуЗапроса = SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(ПутьКаталога.Абсолютный, ИмяФайлаЗапроса);
				ПутьКФайлуЗапроса = SUI_ФайловаяСистемаСлужебныйКлиентСервер.УникальноеИмяФайла(ПутьКФайлуЗапроса);
				
				ФайлЗапроса = Новый Файл(ПутьКФайлуЗапроса);
				ИмяФайлаЗапроса = ФайлЗапроса.Имя;
				
				ЗаписьJSON = Новый ЗаписьJSON();
				ЗаписьJSON.ОткрытьФайл(ФайлЗапроса.ПолноеИмя);
				ЗаписьJSON.ЗаписатьБезОбработки(ЗаписьЛогирования.ДанныеЗапроса);
				ЗаписьJSON.Закрыть();
				
			КонецЕсли;
			
			Если Не ПустаяСтрока(ЗаписьЛогирования.ДанныеОтвета) Тогда
				
				ИмяФайлаОтвета = "response" + ЗаписьЛогирования.SID + ".json";
				
				ПутьКФайлуОтвета = SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(ПутьКаталога.Абсолютный, ИмяФайлаОтвета);
				ПутьКФайлуОтвета = SUI_ФайловаяСистемаСлужебныйКлиентСервер.УникальноеИмяФайла(ПутьКФайлуОтвета);
				
				ФайлОтвета = Новый Файл(ПутьКФайлуОтвета);
				ИмяФайлаОтвета = ФайлОтвета.Имя;
				
				ЗаписьJSON = Новый ЗаписьJSON();
				ЗаписьJSON.ОткрытьФайл(ФайлОтвета.ПолноеИмя);
				ЗаписьJSON.ЗаписатьБезОбработки(ЗаписьЛогирования.ДанныеОтвета);
				ЗаписьJSON.Закрыть();
				
			КонецЕсли;
			
			ИнформацияОЗаписи.Вставить("requestFile", ИмяФайлаЗапроса);
			ИнформацияОЗаписи.Вставить("responseFile", ИмяФайлаОтвета);
			
			ИнформацияОЗаписях.rows.Добавить(ИнформацияОЗаписи);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Отчет.Вставить("httpLogs", ИнформацияОЗаписях);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
