
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПодготовитьФайлОбращения(Параметры, АдресРезультата) Экспорт
	
	Перем ВременныйКаталог;
	
	Попытка
		
		ВременныйКаталог = ФайловаяСистема.СоздатьВременныйКаталог();
		
		Обращение = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.exchange-support.simple", "Issue"));
		
		Обращение.MobileApp = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.exchange-support.simple", "MobileApp"));
		Обращение.MobileApp.Version = Параметры.МобильноеПриложение.Версия;
		Обращение.MobileApp.Configuration = Параметры.МобильноеПриложение.Конфигурация;
		Обращение.MobileApp.ConfigurationVersion = Параметры.МобильноеПриложение.ВерсияКонфигурации;
		
		Обращение.Message = Параметры.Сообщение;
		
		СформироватьОписаниеОкружения(Обращение);
		
		СформироватьФайлыЗаписейЛогированияHTTPЗапросов(ВременныйКаталог, Обращение, Параметры.ЗаписиЛогированияHTTPЗапросов);
		
		СформироватьФайлыСобытийЖураналаРегистрации(ВременныйКаталог, Обращение, Параметры.СобытияЖурналаРегистрации);
		
		СформироватьФайлыВложений(ВременныйКаталог, Обращение, Параметры.Вложения);
		
		ИмяФайла = "Issue.xml";
		
		ЗаписьXML = Новый ЗаписьXML();
		ЗаписьXML.ОткрытьФайл(SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(ВременныйКаталог, ИмяФайла));
		ЗаписьXML.ЗаписатьБезОбработки(SUI_ОбщегоНазначения.ОбъектXDTOВСтрокуXML(Обращение));
		ЗаписьXML.Закрыть();
		
		ФайлАрхив = Новый ЗаписьZipФайла();
		ФайлАрхив.Добавить(SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(ВременныйКаталог, "*.*"), 
			РежимСохраненияПутейZIP.СохранятьОтносительныеПути, 
			РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
		ФайлАрхив = ФайлАрхив.ПолучитьДвоичныеДанные(, , МетодСжатияZIP.Сжатие, УровеньСжатияZIP.Максимальный);
		
		ПоместитьВоВременноеХранилище(ФайлАрхив, АдресРезультата);
		
		ФайловаяСистема.УдалитьВременныйКаталог(ВременныйКаталог);
		ВременныйКаталог = Неопределено;
		
	Исключение
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации("", , 
			Метаданные.Обработки.SUI_ОбращениеВТехническуюПоддержку, , ИнформацияОбОшибке());
		Если ЗначениеЗаполнено(ВременныйКаталог) Тогда
			ФайловаяСистема.УдалитьВременныйКаталог(ВременныйКаталог);
		КонецЕсли;
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоздатьКаталогВоВременномКаталоге(ВременныйКаталог, Имя)
	
	Путь = Новый Структура();
	Путь.Вставить("Относительный", Имя);
	Путь.Вставить("Абсолютный", SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(ВременныйКаталог, Путь.Относительный));
	
	СоздатьКаталог(Путь.Абсолютный);
	
	Файл = Новый Файл(Путь.Абсолютный);
	SUI_ОбщегоНазначенияКлиентСервер.Проверить(Файл.Существует() И Файл.ЭтоКаталог(), 
		СтрШаблон(НСтр("ru = 'Не удалось инициализировать временный каталог (%1)'"), Путь.Относительный));
	
	Возврат Путь;
	
КонецФункции

Процедура СформироватьОписаниеОкружения(Обращение)
	
	ТипОкружение = ФабрикаXDTO.Тип("http://www.exchange-support.simple", "Environment");
	Обращение.Environment = ФабрикаXDTO.Создать(ТипОкружение);
	
	СформироватьОписаниеОкружения_Платформа(Обращение.Environment);
	СформироватьОписаниеОкружения_Конфигурация(Обращение.Environment);
	СформироватьОписаниеОкружения_РасширениеSimple(Обращение.Environment);
	СформироватьОписаниеОкружения_Клиент(Обращение.Environment);
	СформироватьОписаниеОкружения_Компьютер(Обращение.Environment);
	
КонецПроцедуры

Процедура СформироватьОписаниеОкружения_Платформа(Окружение)
	
	ТипПлатформа = ФабрикаXDTO.Тип("http://www.exchange-support.simple", "Platform");
	Окружение.Platform = ФабрикаXDTO.Создать(ТипПлатформа);
	
	УстановитьПривилегированныйРежим(Истина);
	СистемнаяИнформация = Новый СистемнаяИнформация();
	
	Окружение.Platform.Version = СистемнаяИнформация.ВерсияПриложения;
	Окружение.Platform.Type = Строка(СистемнаяИнформация.ТипПлатформы);
	
	Окружение.Platform.Проверить();
	
КонецПроцедуры

Процедура СформироватьОписаниеОкружения_Конфигурация(Окружение)
	
	ТипКонфигурация = ФабрикаXDTO.Тип("http://www.exchange-support.simple", "Configuration");
	Окружение.Configuration = ФабрикаXDTO.Создать(ТипКонфигурация);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Окружение.Configuration.Name = Метаданные.Имя;
	Окружение.Configuration.Synonym = Метаданные.Синоним;
	Окружение.Configuration.Version = Метаданные.Версия;
	Окружение.Configuration.Edition = SUI_ОбщегоНазначения.РедакцияКонфигурации();
	Окружение.Configuration.SupportID = ОбщегоНазначения.ИдентификаторИнтернетПоддержкиКонфигурации();
	Окружение.Configuration.CompatibilityMode = СтандартныеПодсистемыСервер.ВерсияРежимаСовместимости();
	Окружение.Configuration.VersionSSL = СтандартныеПодсистемыСервер.ВерсияБиблиотеки();
	Окружение.Configuration.LanguageCode = ОбщегоНазначения.КодОсновногоЯзыка();
	Окружение.Configuration.IsFileDB = SUI_ОбщегоНазначения.ИнформационнаяБазаФайловая();
	Окружение.Configuration.IDFileDB = СтандартныеПодсистемыСервер.ИдентификаторИнформационнойБазы();
	Окружение.Configuration.IsBasicVersion = СтандартныеПодсистемыСервер.ЭтоБазоваяВерсияКонфигурации();
	
	ТипПодсистемы = ФабрикаXDTO.Тип("http://www.exchange-support.simple", "Subsystems");
	ТипПодсистема = ФабрикаXDTO.Тип("http://www.exchange-support.simple", "Subsystem");
	Окружение.Configuration.Subsystems = ФабрикаXDTO.Создать(ТипПодсистемы);
	
	Для Каждого ЭлементОписаниеПодсистемы Из ОбщегоНазначения.ОписанияПодсистем() Цикл
		
		ОписаниеПодсистемы = ФабрикаXDTO.Создать(ТипПодсистема);
		ОписаниеПодсистемы.Name = ЭлементОписаниеПодсистемы.Имя;
		ОписаниеПодсистемы.SupportID = ЭлементОписаниеПодсистемы.ИдентификаторИнтернетПоддержки;
		ОписаниеПодсистемы.Version = ЭлементОписаниеПодсистемы.Версия;
		ОписаниеПодсистемы.IsConfiguration = ЭлементОписаниеПодсистемы.ЭтоКонфигурация;
		ОписаниеПодсистемы.Проверить();
		
		Окружение.Configuration.Subsystems.Subsystem.Добавить(ОписаниеПодсистемы);
		
	КонецЦикла;
	
	Если Не ПустаяСтрока(ОбщегоНазначения.АдресПубликацииИнформационнойБазыВЛокальнойСети()) Или
		Не ПустаяСтрока(ОбщегоНазначения.АдресПубликацииИнформационнойБазыВИнтернете()) Тогда
		Окружение.Configuration.Published = Истина;
	Иначе
		Окружение.Configuration.Published = Ложь;
	КонецЕсли;
	
	ТипРазделениеДанных = ФабрикаXDTO.Тип("http://www.exchange-support.simple", "SeparationData");
	Окружение.Configuration.SeparationData = ФабрикаXDTO.Создать(ТипРазделениеДанных);
	Окружение.Configuration.SeparationData.Available = ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных();
	Окружение.Configuration.SeparationData.Enabled = ОбщегоНазначения.РазделениеВключено();
	Окружение.Configuration.SeparationData.Проверить();
	
	ТипРИБ = ФабрикаXDTO.Тип("http://www.exchange-support.simple", "DIB");
	Окружение.Configuration.DIB = ФабрикаXDTO.Создать(ТипРИБ);
	Окружение.Configuration.DIB.IsNodeDIB = ОбщегоНазначения.ЭтоПодчиненныйУзелРИБ();
	Окружение.Configuration.DIB.IsNodeDIBWithFilter = ОбщегоНазначения.ЭтоПодчиненныйУзелРИБСФильтром();
	Окружение.Configuration.DIB.AnUpdateIsRequired = ОбщегоНазначения.ТребуетсяОбновлениеКонфигурацииПодчиненногоУзлаРИБ();
	Окружение.Configuration.DIB.Проверить();
	
	Окружение.Configuration.Проверить();
	
КонецПроцедуры

Процедура СформироватьОписаниеОкружения_РасширениеSimple(Окружение)
	
	ТипРасширениеSimple = ФабрикаXDTO.Тип("http://www.exchange-support.simple", "ExtensionSimple");
	Окружение.ExtensionSimple = ФабрикаXDTO.Создать(ТипРасширениеSimple);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Окружение.ExtensionSimple.Version = SUI_Simple.Версия();
	Окружение.ExtensionSimple.ReplaceBarcodeFlow = Константы.SUI_ЗамещатьВПотокеШтрихкодов.Получить();
	Окружение.ExtensionSimple.RegisterChangesAfterUploadingDocument = 
		Константы.SUI_РегистрироватьИзмененияПослеЗагрузкиДокументаИзМУ.Получить();
	
	Окружение.ExtensionSimple.HTTPLoggingEnabled = ПолучитьФункциональнуюОпцию("SUI_ЛогированиеHTTPЗапросов");
	Окружение.ExtensionSimple.InstallingPreviewVersion = ПолучитьФункциональнуюОпцию("SUI_УстановкаПредварительныхВерсий");
	
	Если ПолучитьФункциональнуюОпцию("SUI_ОнлайнОбмен") Тогда
		Окружение.ExtensionSimple.ExchangeOption = XMLСтрока(Перечисления.SUI_ВариантОбмена.Онлайн);
	ИначеЕсли ПолучитьФункциональнуюОпцию("SUI_ОфлайнОбмен") Тогда
		Окружение.ExtensionSimple.ExchangeOption = XMLСтрока(Перечисления.SUI_ВариантОбмена.Офлайн);
	КонецЕсли;
	
	Если Не ПустаяСтрока(Константы.SUI_АдресПубликацииБазы.Получить()) Тогда
		Окружение.ExtensionSimple.Published = Истина;
	Иначе
		Окружение.ExtensionSimple.Published = Ложь;
	КонецЕсли;
	
	Окружение.ExtensionSimple.Проверить();
	
КонецПроцедуры

Процедура СформироватьОписаниеОкружения_Клиент(Окружение)
	
	ТипКлиент = ФабрикаXDTO.Тип("http://www.exchange-support.simple", "Client");
	Окружение.Client = ФабрикаXDTO.Создать(ТипКлиент);
	
	Окружение.Client.IsWindowsClient = ОбщегоНазначения.ЭтоWindowsКлиент();
	Окружение.Client.IsWindowsServer = ОбщегоНазначения.ЭтоWindowsСервер();
	Окружение.Client.IsLinuxClient = ОбщегоНазначения.ЭтоLinuxКлиент();
	Окружение.Client.IsLinuxServer = ОбщегоНазначения.ЭтоLinuxСервер();
	Окружение.Client.IsMacOSClient = ОбщегоНазначения.ЭтоMacOSКлиент();
	Окружение.Client.IsWebClient = ОбщегоНазначения.ЭтоВебКлиент();
	Окружение.Client.IsMobileClient = ОбщегоНазначения.ЭтоМобильныйКлиент();
	Окружение.Client.IsOfflineWorkplace = ОбщегоНазначения.ЭтоАвтономноеРабочееМесто();
	Окружение.Client.IsDebuggingMode = ОбщегоНазначения.РежимОтладки();
	Окружение.Client.ConnectedViaWebServer = ОбщегоНазначения.КлиентПодключенЧерезВебСервер();
	
	Окружение.Client.Проверить();
	
КонецПроцедуры

Процедура СформироватьОписаниеОкружения_Компьютер(Окружение)
	
	ТипКомпьютер = ФабрикаXDTO.Тип("http://www.exchange-support.simple", "Computer");
	Окружение.Computer = ФабрикаXDTO.Создать(ТипКомпьютер);
	
	УстановитьПривилегированныйРежим(Истина);
	СистемнаяИнформация = Новый СистемнаяИнформация();
	
	Окружение.Computer.AvailableRAM = ОбщегоНазначения.ОперативнаяПамятьДоступнаяКлиентскомуПриложению();
	Окружение.Computer.CPU = СистемнаяИнформация.Процессор;
	Окружение.Computer.OSVersion = СистемнаяИнформация.ВерсияОС;
	
	Окружение.Computer.Проверить();
	
КонецПроцедуры

Процедура СформироватьФайлыЗаписейЛогированияHTTPЗапросов(ВременныйКаталог, Обращение, Записи)
	
	ТипОписаниеЛоги = ФабрикаXDTO.Тип("http://www.exchange-support.simple", "HTTPLogs");
	Обращение.HTTPLogs = ФабрикаXDTO.Создать(ТипОписаниеЛоги);
	
	Обращение.HTTPLogs.Logs = РегистрыСведений.SUI_ЛогированиеHTTPЗапросов.СформироватьСписокЗаписей(
		ВременныйКаталог, Записи).Список;
	
	Обращение.HTTPLogs.Проверить();
	
КонецПроцедуры

Процедура СформироватьФайлыСобытийЖураналаРегистрации(ВременныйКаталог, Обращение, События)
	
	ТипОписаниеФайлов = ФабрикаXDTO.Тип("http://www.exchange-support.simple", "LogFiles");
	Обращение.LogFiles = ФабрикаXDTO.Создать(ТипОписаниеФайлов);
	
	КоличествоСобытий = События.Количество();
	
	Если КоличествоСобытий = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТипОписаниеФайла 	= ФабрикаXDTO.Тип("http://www.exchange-support.simple", "FileManifest");
	
	ТипЛог 				= ФабрикаXDTO.Тип("http://www.registration-log.simple", "Log");
	ТипСобытие 			= ФабрикаXDTO.Тип("http://www.registration-log.simple", "Event");
	ТипСоединение 		= ФабрикаXDTO.Тип("http://www.registration-log.simple", "Connect");
	ТипПорт 			= ФабрикаXDTO.Тип("http://www.registration-log.simple", "Port");
	ТипПользователь 	= ФабрикаXDTO.Тип("http://www.registration-log.simple", "User");
	ТипПриложение 		= ФабрикаXDTO.Тип("http://www.registration-log.simple", "App");
	ТипМетаданные 		= ФабрикаXDTO.Тип("http://www.registration-log.simple", "Metadata");
	ТипТранзакция 		= ФабрикаXDTO.Тип("http://www.registration-log.simple", "Transaction");
	ТипРазделениеДанных = ФабрикаXDTO.Тип("http://www.registration-log.simple", "DataSeparation");
	ТипДанные 			= ФабрикаXDTO.Тип("http://www.registration-log.simple", "Data");
	
	Обращение.LogFiles.Path = "Logs";
	ПутьКаталога = СоздатьКаталогВоВременномКаталоге(ВременныйКаталог, Обращение.LogFiles.Path);
	
	Для индекс = 0 По КоличествоСобытий - 1 Цикл
		
		Лог = ФабрикаXDTO.Создать(ТипЛог);
		
		Лог.Date = События[индекс].Дата;
		Лог.DateServer = События[индекс].ДатаНаСервере;
		Лог.Level = События[индекс].Уровень;
		
		Лог.Event = ФабрикаXDTO.Создать(ТипСобытие);
		Лог.Event.Name = События[индекс].Событие;
		Лог.Event.View = События[индекс].ПредставлениеСобытия;
		
		Лог.Connect = ФабрикаXDTO.Создать(ТипСоединение);
		Лог.Connect.Computer = События[индекс].Компьютер;
		Лог.Connect.Server = События[индекс].РабочийСервер;
		
		Лог.Connect.Port = ФабрикаXDTO.Создать(ТипПорт);
		Лог.Connect.Port.Main = События[индекс].ОсновнойIPПорт;
		Лог.Connect.Port.Additional = События[индекс].ВспомогательныйIPПорт;
		
		Лог.Connect.User = ФабрикаXDTO.Создать(ТипПользователь);
		Лог.Connect.User.ID = События[индекс].Пользователь;
		Лог.Connect.User.Name = События[индекс].ИмяПользователя;
		
		Лог.Connect.App = ФабрикаXDTO.Создать(ТипПриложение);
		Лог.Connect.App.Name = События[индекс].ИмяПриложения;
		Лог.Connect.App.View = События[индекс].ПредставлениеПриложения;
		
		Лог.Connect.Session = События[индекс].Сеанс;
		Лог.Connect.Connection = События[индекс].Соединение;
		
		Лог.Metadata = ФабрикаXDTO.Создать(ТипМетаданные);
		Лог.Metadata.Name = События[индекс].Метаданные;
		Лог.Metadata.View = События[индекс].ПредставлениеМетаданных;
		
		Лог.Transaction = ФабрикаXDTO.Создать(ТипТранзакция);
		Лог.Transaction.Name = События[индекс].Транзакция;
		Лог.Transaction.Status = События[индекс].СтатусТранзакции;
		
		Лог.DataSeparation = ФабрикаXDTO.Создать(ТипРазделениеДанных);
		Лог.DataSeparation.Name = События[индекс].РазделениеДанныхСеанса;
		Лог.DataSeparation.View = События[индекс].ПредставлениеРазделенияДанныхСеанса;
		
		Лог.Data = ФабрикаXDTO.Создать(ТипДанные);
		Лог.Data.Data = События[индекс].ПредставлениеДанных;
		Лог.Data.Comment = События[индекс].Комментарий;
		
		Лог.Проверить();
		
		ОписаниеФайла = ФабрикаXDTO.Создать(ТипОписаниеФайла);
		ОписаниеФайла.Order = индекс + 1;
		ОписаниеФайла.Path = Формат(индекс + 1, "ЧН=0; ЧГ=0;") + ".xml";
		
		ОписаниеФайла.Проверить();
		
		ЗаписьXML = Новый ЗаписьXML();
		ЗаписьXML.ОткрытьФайл(SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(ПутьКаталога.Абсолютный, ОписаниеФайла.Path));
		ЗаписьXML.ЗаписатьБезОбработки(SUI_ОбщегоНазначения.ОбъектXDTOВСтрокуXML(Лог));
		ЗаписьXML.Закрыть();
		
		Обращение.LogFiles.LogFile.Добавить(ОписаниеФайла);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьФайлыВложений(ВременныйКаталог, Обращение, Вложения)
	
	ТипОписаниеФайлов = ФабрикаXDTO.Тип("http://www.exchange-support.simple", "Attachments");
	Обращение.Attachments = ФабрикаXDTO.Создать(ТипОписаниеФайлов);
	
	КоличествоВложений = Вложения.Количество();
	
	Если КоличествоВложений = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТипОписаниеВложения = ФабрикаXDTO.Тип("http://www.exchange-support.simple", "Attachment");
	ТипОписаниеФайла = ФабрикаXDTO.Тип("http://www.exchange-support.simple", "FileManifest");
	
	Обращение.Attachments.Path = "Attachments";
	ПутьКаталога = СоздатьКаталогВоВременномКаталоге(ВременныйКаталог, Обращение.Attachments.Path);
	
	Для индекс = 0 По КоличествоВложений - 1 Цикл
		
		ОписаниеВложения = ФабрикаXDTO.Создать(ТипОписаниеВложения);
		ОписаниеВложения.Name = Вложения[индекс].Имя;
		
		Если ЗначениеЗаполнено(Вложения[индекс].Представление) Тогда
			ОписаниеВложения.View = Вложения[индекс].Представление;
		Иначе
			ОписаниеВложения.View = Вложения[индекс].Имя;
		КонецЕсли;
		
		ОписаниеВложения.Description = Вложения[индекс].Описание;
		
		РасширениеФайла = ?(СтрНачинаетсяС(Вложения[индекс].Расширение, "."), 
			Вложения[индекс].Расширение, 
			"." + Вложения[индекс].Расширение);
		ИмяФайла = Формат(индекс + 1, "ЧН=0; ЧГ=0;") + РасширениеФайла;
		Вложения[индекс].Данные.Записать(SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(ПутьКаталога.Абсолютный, ИмяФайла));
		
		ОписаниеВложения.File = ФабрикаXDTO.Создать(ТипОписаниеФайла);
		ОписаниеВложения.File.Order = индекс + 1;
		ОписаниеВложения.File.Path = ИмяФайла;
		ОписаниеВложения.File.Проверить();
		
		ОписаниеВложения.Проверить();
		
		Обращение.Attachments.Attachment.Добавить(ОписаниеВложения);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
