
#Область ПрограммныйИнтерфейс

Процедура ОтправитьСообщение(Получатель, ПараметрыВладельца) Экспорт
	
	ОткрытьФорму("РегистрСведений.SUI_СообщенияМобильныхУстройств.ФормаЗаписи", 
		Новый Структура("Получатель", Получатель),
		SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыВладельца, "Источник"),
		SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыВладельца, "Уникальность"),
		SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыВладельца, "Окно"),
		SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыВладельца, "НавигационнаяСсылка"));
		
КонецПроцедуры

#КонецОбласти
