
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("НастройкаДокумента") Тогда
		НастройкаДокумента = Параметры.НастройкаДокумента;
	КонецЕсли;
	
	ИнициализироватьСписокВыбора();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьЭлементыФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НастройкаДокументаПриИзменении(Элемент)
	ИнициализироватьСписокВыбора();
	ОбновитьЭлементыФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(НастройкаДокумента) И Элемент.ТекущиеДанные <> Неопределено Тогда
		Закрыть(Новый Структура("НастройкаДокумента, ДокументСсылка", НастройкаДокумента, Элемент.ТекущиеДанные.Ссылка));
	Иначе
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(НастройкаДокумента) И Элемент.ТекущиеДанные <> Неопределено Тогда
		Закрыть(Новый Структура("НастройкаДокумента, ДокументСсылка", НастройкаДокумента, Элемент.ТекущиеДанные.Ссылка));
	Иначе
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьЭлементыФормы()
	
	Элементы.Список.Доступность = ЗначениеЗаполнено(НастройкаДокумента);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьСписокВыбора()
	
	Список.Отбор.Элементы.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	SUI_НастройкиДокументов.ИмяОбъектаМетаданных,
		|	SUI_НастройкиДокументов.НастройкиСхемыКомпоновкиДанных
		|ИЗ
		|	Справочник.SUI_НастройкиДокументов КАК SUI_НастройкиДокументов
		|ГДЕ
		|	SUI_НастройкиДокументов.Ссылка = &Ссылка
		|	И SUI_НастройкиДокументов.Ссылка <> ЗНАЧЕНИЕ(Справочник.SUI_НастройкиДокументов.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Ссылка", НастройкаДокумента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Список.ТекстЗапроса = "ВЫБРАТЬ
		|	NULL КАК Ссылка";
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		НастройкиКД = Выборка.НастройкиСхемыКомпоновкиДанных.Получить();
		
		Если ТипЗнч(НастройкиКД) <> Тип("НастройкиКомпоновкиДанных") Тогда
			НастройкиКД = Новый НастройкиКомпоновкиДанных();
		КонецЕсли;
	
		Список.ТекстЗапроса = "ВЫБРАТЬ * ИЗ Документ." + Выборка.ИмяОбъектаМетаданных + " КАК Документ";
		Список.КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКД);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
