#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("АдресНастроек") И Не Параметры.Свойство("ВыгрузкаНастроек") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("АдресНастроек") Тогда
		//МассивЗагруженныхНастроек = Параметры.АдресНастроек;
		МассивЗагруженныхНастроек = ПолучитьИзВременногоХранилища(Параметры.АдресНастроек);
		
		Если Параметры.Свойство("ПерезаписыватьСуществующие") ТОгда
			ПерезаписыватьСуществующие = Параметры.ПерезаписыватьСуществующие;
		КонецЕсли;
		
		УдалитьИзВременногоХранилища(Параметры.АдресНастроек);
		
		Для Каждого Настройка Из МассивЗагруженныхНастроек Цикл 
			
			СтрокаТаблицыНастроек = ТаблицаНастроекДокументов.Добавить(); 
			СтрокаТаблицыНастроек.НаименованиеНастройкиДокумента = Настройка.Наименование; 
			СтрокаТаблицыНастроек.ИмяОбъектаМетаданных = Настройка.ИмяОбъектаМетаданных; 
			СтрокаТаблицыНастроек.Комментарий = ?(Настройка.Свойство("Комментарий"),Настройка.Комментарий, ""); 
			СтрокаТаблицыНастроек.КлючЗаписи = Новый УникальныйИдентификатор; 
			СтрокаТаблицыНастроек.Загружать = Истина;
			Настройка.Вставить("КлючЗаписи", СтрокаТаблицыНастроек.КлючЗаписи);
			
		КонецЦикла;
		
		АдресНастроек = ПоместитьВоВременноеХранилище(МассивЗагруженныхНастроек, УникальныйИдентификатор);
		
	ИначеЕсли Параметры.Свойство("ВыгрузкаНастроек") Тогда
		
		ВыгрузкаДанных = Параметры.ВыгрузкаНастроек;
		
		Элементы.ПерезаписыватьСуществующие.Видимость = Ложь;
		
		Если Не ВыгрузкаДанных Тогда
			Отказ = Истина;
			Возврат;	
		КонецЕсли; 
		
		Элементы.ТаблицаНастроекДокументовЗагружать.Заголовок = "Выгружать";
		Элементы.ЗагрузитьВыбранное.Заголовок = "Выгрузить выбранное"; 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	SUI_НастройкиДокументов.Ссылка КАК Ссылка,
		|	SUI_НастройкиДокументов.Наименование КАК Наименование,
		|	SUI_НастройкиДокументов.Комментарий КАК Комментарий,
		|	SUI_НастройкиДокументов.ИмяОбъектаМетаданных КАК ИмяОбъектаМетаданных
		|ИЗ
		|	Справочник.SUI_НастройкиДокументов КАК SUI_НастройкиДокументов
		|ГДЕ
		|	НЕ SUI_НастройкиДокументов.ПометкаУдаления";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтрокаТаблицыНастроек = ТаблицаНастроекДокументов.Добавить(); 
			СтрокаТаблицыНастроек.НаименованиеНастройкиДокумента = ВыборкаДетальныеЗаписи.Наименование; 
			СтрокаТаблицыНастроек.ИмяОбъектаМетаданных = ВыборкаДетальныеЗаписи.ИмяОбъектаМетаданных; 
			СтрокаТаблицыНастроек.Комментарий = ВыборкаДетальныеЗаписи.Комментарий; 
			СтрокаТаблицыНастроек.Ссылка = ВыборкаДетальныеЗаписи.Ссылка; 
			СтрокаТаблицыНастроек.Загружать = Истина;
		КонецЦикла;
			
	КонецЕсли;
	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьВыбранное(Команда)
	
	Если Не ВыгрузкаДанных Тогда
		
		ОчиститьСообщения();
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Загружать", Истина);
		СтрокиКЗагрузке = ТаблицаНастроекДокументов.НайтиСтроки(ПараметрыОтбора);
		
		Если СтрокиКЗагрузке.Количество() = 0 Тогда 
			SUI_ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбраны настройки.'"));
			Возврат;
		КонецЕсли;
		
		СтруктураВозврата = ИзмененияВыбораНаСервереЗагрузка();
		
		Закрыть(СтруктураВозврата);
		
	Иначе
		
		ОчиститьСообщения();
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Загружать", Истина);
		СтрокиКЗагрузке = ТаблицаНастроекДокументов.НайтиСтроки(ПараметрыОтбора);
		
		Если СтрокиКЗагрузке.Количество() = 0 Тогда 
			SUI_ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбраны настройки.'"));
			Возврат;
		КонецЕсли;
		
		СтруктураВозврата = ИзмененияВыбораНаСервереВыгрузка();
		
		Закрыть(СтруктураВозврата);
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	СнятьВыбратьВсе();
КонецПроцедуры

&НаКлиенте
Процедура УбратьВыборВсе(Команда)
	СнятьВыбратьВсе(Ложь);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ИзмененияВыбораНаСервереЗагрузка()
	
	МассивДокументов = ПолучитьИзВременногоХранилища(АдресНастроек);
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Загружать", Истина);
	СтрокиКЗагрузке = ТаблицаНастроекДокументов.НайтиСтроки(ПараметрыОтбора);
	
	МассивИтоговый = Новый Массив;
	
	Для Каждого СтрокаМассиваДокументов Из МассивДокументов Цикл 
		Для Каждого Строка Из СтрокиКЗагрузке Цикл
			Если Строка.КлючЗаписи = СтрокаМассиваДокументов.КлючЗаписи Тогда
				МассивИтоговый.Добавить(СтрокаМассиваДокументов);
				Прервать;
			КонецЕсли;	
		КонецЦикла;	
	КонецЦикла;
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ПерезаписыватьСуществующие",ПерезаписыватьСуществующие);
	СтруктураВозврата.Вставить("АдресНастроек",ПоместитьВоВременноеХранилище(МассивИтоговый));
	
	Возврат СтруктураВозврата;
	
КонецФункции 

&НаСервере
Функция ИзмененияВыбораНаСервереВыгрузка()
		
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Загружать", Истина);
	СтрокиКЗагрузке = ТаблицаНастроекДокументов.НайтиСтроки(ПараметрыОтбора);
	
	МассивИтоговый = Новый Массив;
	
	Для Каждого Строка Из СтрокиКЗагрузке Цикл
		МассивИтоговый.Добавить(Строка.Ссылка);			
	КонецЦикла;	
		
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("МассивИтоговый", МассивИтоговый);
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция СнятьВыбратьВсе(ВыбратьВсе = Истина)

	Для Каждого СтрокаНастройки Из ТаблицаНастроекДокументов Цикл
		СтрокаНастройки.Загружать = ВыбратьВсе;	
	КонецЦикла;

КонецФункции // СнятьВыбратьВсе()

#КонецОбласти