
#Область ПрограммныйИнтерфейс

Процедура ЗаписьВЖурналРегистрации(ИмяСобытия, Уровень = Неопределено, ОбъектМетаданных = Неопределено, 
	Данные = Неопределено, Комментарий = "") Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыЗаписиЖР = Новый Структура();
	
	
	Если ТипЗнч(Уровень) = Тип("УровеньЖурналаРегистрации") Тогда
		ПараметрыЗаписиЖР.Вставить("Уровень", Уровень);
	Иначе
		ПараметрыЗаписиЖР.Вставить("Уровень", УровеньЖурналаРегистрации.Примечание);
	КонецЕсли;
	
	Если Данные <> Неопределено Тогда
		
		Если SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(Данные) Тогда
			ПараметрыЗаписиЖР.Вставить("Данные", SUI_ИнтеграцияВКонфигурацию.СсылкаПоИдентификаторуSimple(Данные));
		Иначе
			ПараметрыЗаписиЖР.Вставить("Данные", Данные);
		КонецЕсли;
		
	Иначе
		ПараметрыЗаписиЖР.Вставить("Данные", Неопределено);
	КонецЕсли;
	
	Если ТипЗнч(ОбъектМетаданных) = Тип("ОбъектМетаданных") Тогда
		ПараметрыЗаписиЖР.Вставить("ОбъектМетаданных", ОбъектМетаданных);
	Иначе 
		ПараметрыЗаписиЖР.Вставить("ОбъектМетаданных", Неопределено);
	КонецЕсли;
	
	Если ПараметрыЗаписиЖР.ОбъектМетаданных = Неопределено И ПараметрыЗаписиЖР.Данные <> Неопределено Тогда
		
		Попытка      
			ПараметрыЗаписиЖР.ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(Данные));  
		Исключение
			ПараметрыЗаписиЖР.ОбъектМетаданных = Неопределено;
		КонецПопытки; 
		
	КонецЕсли; 
	
	Если Комментарий = Неопределено Тогда
		ПараметрыЗаписиЖР.Вставить("Комментарий", "");
	Иначе
		
		ТипЗначенияКомментарий = ТипЗнч(Комментарий);
		
		Если ТипЗначенияКомментарий = Тип("ИнформацияОбОшибке") Тогда
			ПараметрыЗаписиЖР.Уровень = УровеньЖурналаРегистрации.Ошибка;
			ПараметрыЗаписиЖР.Вставить("Комментарий", ОбработкаОшибок.ПодробноеПредставлениеОшибки(Комментарий));
		ИначеЕсли ТипЗначенияКомментарий = Тип("Строка") Или ТипЗначенияКомментарий = Тип("Число") Или
			ТипЗначенияКомментарий = Тип("Булево") Или ТипЗначенияКомментарий = Тип("Дата") Тогда
			ПараметрыЗаписиЖР.Вставить("Комментарий", Комментарий);
		Иначе
			
			Попытка
				ПараметрыЗаписиЖР.Вставить("Комментарий", SUI_ОбщегоНазначения.ЗначениеВСтрокуXML(Комментарий));
			Исключение
				ПараметрыЗаписиЖР.Вставить("Комментарий", НСтр("ru = 'Комментарий отсутствует.
				|Не удалось определить комментарий для записи в журнал регистрации.'"));
			КонецПопытки;
			
		КонецЕсли; 
		
	КонецЕсли;
	     
	Попытка
		ЗаписьЖурналаРегистрации(SUI_ЖурналРегистрацииКлиентСервер.ИмяСобытия(ИмяСобытия), ПараметрыЗаписиЖР.Уровень, 
			ПараметрыЗаписиЖР.ОбъектМетаданных, ПараметрыЗаписиЖР.Данные, ПараметрыЗаписиЖР.Комментарий);
	Исключение
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти
