
#Область ПрограммныйИнтерфейс

Функция УстановитьХранениеЛогов(КоличествоДней) Экспорт
	
	ПараметрКоличествоДней = ОбщегоНазначения.ОписаниеТипаЧисло(2, , ДопустимыйЗнак.Неотрицательный).ПривестиЗначение(КоличествоДней);
	Константы.SUI_ХранениеЛоговHTTPЗапросовВДнях.Установить(ПараметрКоличествоДней);
	Возврат ПараметрКоличествоДней;
	
КонецФункции

Процедура ИспользованиеЛогирования(Знач Используется) Экспорт
	
	Используется = SUI_ОбщегоНазначенияКлиентСервер.ОписаниеТипаБулево().ПривестиЗначение(Используется);
	
	Константы.SUI_ЛогированиеHTTPЗапросов.Установить(Используется);
	
КонецПроцедуры

Функция ВыгрузитьЛогированиеHTTPЗапросовВФайл(ПараметрыВыгрузки) Экспорт
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("SUI_ЛогированиеHTTPЗапросов.ВыгрузитьЛогированиеHTTPЗапросовВФайл", 
		ПараметрыВыгрузки, ДлительныеОперации.ПараметрыВыполненияВФоне());
	
КонецФункции

Функция HTTPМетодПоСтроке(HTTPМетодСтрокой) Экспорт
	Возврат SUI_ОбщегоНазначенияПереопределяемый.ПредопределенныйЭлемент("Перечисление.SUI_HTTPМетоды." + HTTPМетодСтрокой);
КонецФункции

Функция ПреобразованиеДанныхJSON(Свойство, Значение, ДополнительныеПараметры, Отказ) Экспорт
	Возврат SUI_ОбщегоНазначения.ПреобразованиеДанныхJSON(Свойство, Значение, ДополнительныеПараметры, Отказ);
КонецФункции

#КонецОбласти
