
#Область ПрограммныйИнтерфейс

Функция УстановитьХранениеЛогов(КоличествоДней) Экспорт
	
	ПараметрКоличествоДней = ОбщегоНазначения.ОписаниеТипаЧисло(2, , ДопустимыйЗнак.Неотрицательный).ПривестиЗначение(КоличествоДней);
	Константы.SUI_ХранениеЛоговHTTPЗапросовВДнях.Установить(ПараметрКоличествоДней);
	Возврат ПараметрКоличествоДней;
	
КонецФункции

Процедура ИспользованиеЛогирования(Знач Используется) Экспорт
	
	Используется = SUI_ОбщегоНазначенияКлиентСервер.ОписаниеТипаБулево().ПривестиЗначение(Используется);
	
	Константы.SUI_ЛогированиеHTTPЗапросов.Установить(Используется);
	
КонецПроцедуры

Функция ВыгрузитьЛогированиеHTTPЗапросовВФайл(ПараметрыВыгрузки) Экспорт
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("SUI_ЛогированиеHTTPЗапросов.ВыгрузитьЛогированиеHTTPЗапросовВФайл", 
		ПараметрыВыгрузки, ДлительныеОперации.ПараметрыВыполненияВФоне());
	
КонецФункции

Функция HTTPМетодПоСтроке(HTTPМетодСтрокой) Экспорт
	Возврат SUI_ОбщегоНазначенияПереопределяемый.ПредопределенныйЭлемент("Перечисление.SUI_HTTPМетоды." + HTTPМетодСтрокой);
КонецФункции

Функция ПреобразованиеДанныхJSON(Свойство, Значение, ДополнительныеПараметры, Отказ) Экспорт
	Возврат SUI_ОбщегоНазначения.ПреобразованиеДанныхJSON(Свойство, Значение, ДополнительныеПараметры, Отказ);
КонецФункции

Функция ЛогированиеДоступно(ОтносительныйАдрес) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("SUI_ЛогированиеHTTPЗапросов") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("SUI_ОнлайнОбмен") Тогда
		
		// Проверить относительный URL
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Процедура ЗаписатьСообщениеЛогирования(СообщениеЛогирования) Экспорт
	
	Запись = РегистрыСведений.SUI_ЛогированиеHTTPЗапросов.СоздатьМенеджерЗаписи();
		
	Запись.Период = ТекущаяДатаСеанса();
	Запись.SID = Строка(Новый УникальныйИдентификатор());
	ЗаполнитьЗначенияСвойств(Запись, СообщениеЛогирования);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запись.МеткаВремени = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Запись.НомерСеанса = НомерСеансаИнформационнойБазы();
	Запись.ИмяПользователя = ИмяПользователя();
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	Если ЗначениеЗаполнено(ТекущийПользователь) Тогда
		Запись.ИдентификаторПользователя = Строка(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			ТекущийПользователь, "ИдентификаторПользователяИБ"));
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Запись.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти
