
#Область ПрограммныйИнтерфейс

// Открыть журнал регистрации.
// 
// Параметры:
//  ПараметрыОткрытия - Структура - см. SUI_ЖурналРегистрацииВызовСервера.ПараметрыОткрытияЖурналаРегистрации
//  Форма - Форма - Форма владелец
//  ОповещениеОЗавершении - ОписаниеОповещения - Выполняемое оповещение при завершении
//@skip-check doc-comment-complex-type-with-link
Процедура ОткрытьЖурналРегистрации(Знач ПараметрыОткрытия = Неопределено, Форма = Неопределено, ОповещениеОЗавершении = Неопределено) Экспорт 
	
	Если ПараметрыОткрытия = Неопределено Тогда
		ПараметрыОткрытия = SUI_ЖурналРегистрацииВызовСервера.ПараметрыОткрытияЖурналаРегистрации();
	КонецЕсли;
	
	ОткрытьФорму("Обработка.ЖурналРегистрации.Форма", ПараметрыОткрытия, 
		Форма, ?(Форма = Неопределено, Неопределено, Форма.УникальныйИдентификатор), , , ОповещениеОЗавершении);
		
КонецПроцедуры
	
#КонецОбласти
