
#Область ОбработчикиСобытийФормы

//@skip-check unknown-form-parameter-access
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("ВСписке") Тогда
		
		ЗначениеОтбора = Новый СписокЗначений();

		ТипЗначения = ТипЗнч(Параметры.ВСписке);
		
		Если ТипЗначения = Тип("Массив") Или ТипЗначения = Тип("ФиксированныйМассив") Тогда
			ЗначениеОтбора.ЗагрузитьЗначения(Параметры.ВСписке);
		ИначеЕсли ТипЗначения = Тип("СписокЗначений") Тогда
			ЗначениеОтбора = Параметры.ВСписке;
		Иначе
			ЗначениеОтбора.Добавить(Параметры.ВСписке);
		КонецЕсли;
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	    ЭлементОтбора.Использование = Истина;
	    ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	    ЭлементОтбора.ПравоеЗначение = ЗначениеОтбора;
    
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
