
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыгрузитьНастройки(Команда)
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ВыгрузитьНастройкиВыборЗавершение", ЭтотОбъект);
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ВыгрузкаНастроек", Истина);
		
	ОткрытьФорму("Справочник.SUI_НастройкиДокументов.Форма.ФормаВыбораНастроекИзФайла", ПараметрыОткрытия,,,,, ОповещениеОЗавершении);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройки(Команда)
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗагрузитьНастройкиИзФайлаЗавершение", ЭтотОбъект);
	
	SUI_НастройкиДокументовКлиент.ЗагрузитьНастройки(ОповещениеОЗавершении);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПредопределенной(Команда)
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаполнитьПредопределеннойНастройкойПослеВыбора", 
		ЭтотОбъект, Новый Структура("Форма", ЭтотОбъект));
		
	НастройкКД = Новый НастройкиКомпоновкиДанных;

	//ЭлементОтбора = НастройкКД.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//   ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	//ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	//ЭлементОтбора.Использование = Истина;
	//ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	//ЭлементОтбора.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.SUI_ПредопределенныеНастройкиПодсистемы.Розница23");
	
	ПараметрыВыбора = Новый Структура;
    ПараметрыВыбора.Вставить("ФиксированныеНастройки", НастройкКД);
	
	ОткрытьФорму("Перечисление.SUI_ПредопределенныеНастройкиПодсистемы.ФормаВыбора", ПараметрыВыбора,,,,,ОповещениеОЗавершении);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьПредопределеннойНастройкойПослеВыбора(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		НастройкиИзМакета = ПолучитьОбщийМакетВыбранногоТипа(Результат);
		
		Если НастройкиИзМакета = Неопределено Тогда
			Возврат;	
		КонецЕсли;
		
		РезультатЗагрузки = SUI_НастройкиДокументовВызовСервера.ПолучитьСписокНастроекИзФайлаПредопределенная(НастройкиИзМакета, Истина);
		
		Если Не РезультатЗагрузки.Свойство("АдресНастроек") Тогда
			
			Если РезультатЗагрузки.Свойство("Ошибка") Тогда
				ПоказатьПредупреждение(, СтрШаблон(НСтр("ru = 'ОШИБКА!
				|
				|%1'"), РезультатЗагрузки.Ошибка));
			Иначе
				ПоказатьПредупреждение(, СтрШаблон(НСтр("ru = 'ОШИБКА!
				|
				|Во время загрузки настроек документов %1 возникла ошибка.'"), SUI_SimpleКлиентСервер.Представление()));
			КонецЕсли;
			Возврат;
		КонецЕсли;
		  
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ВыбраныНастройкиИзФайлаЗавершение", ЭтотОбъект);
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("АдресНастроек", РезультатЗагрузки.АдресНастроек);
		ПараметрыОткрытия.Вставить("ПерезаписыватьСуществующие", Истина);
		 
		ОткрытьФорму("Справочник.SUI_НастройкиДокументов.Форма.ФормаВыбораНастроекИзФайла", ПараметрыОткрытия,,,,, ОповещениеОЗавершении);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОбщийМакетВыбранногоТипа(Результат)
	
	НастройкиИзМакета = Неопределено;
	
	Если Результат = ПредопределенноеЗначение("Перечисление.SUI_ПредопределенныеНастройкиПодсистемы.УправлениеТорговлей11") Тогда
		НастройкиИзМакета = ПолучитьСтрокуИзДвоичныхДанных(ПолучитьОбщийМакет("SUI_ПредопределенныеУправлениеТорговлей11Документы"));  
	ИначеЕсли Результат = ПредопределенноеЗначение("Перечисление.SUI_ПредопределенныеНастройкиПодсистемы.УправлениеНашейФирмой") Тогда
		НастройкиИзМакета = ПолучитьСтрокуИзДвоичныхДанных(ПолучитьОбщийМакет("SUI_ПредопределенныеУправлениеНашейФирмойДокументы"));
	ИначеЕсли Результат = ПредопределенноеЗначение("Перечисление.SUI_ПредопределенныеНастройкиПодсистемы.Розница30") Тогда
		НастройкиИзМакета = ПолучитьСтрокуИзДвоичныхДанных(ПолучитьОбщийМакет("SUI_ПредопределенныеРозница30Документы"));
	ИначеЕсли Результат = ПредопределенноеЗначение("Перечисление.SUI_ПредопределенныеНастройкиПодсистемы.ЕРП") Тогда
		НастройкиИзМакета = ПолучитьСтрокуИзДвоичныхДанных(ПолучитьОбщийМакет("SUI_ПредопределенныеЕРПДокументы"));
	ИначеЕсли Результат = ПредопределенноеЗначение("Перечисление.SUI_ПредопределенныеНастройкиПодсистемы.КомплекснаяАвтоматизация") Тогда
		НастройкиИзМакета = ПолучитьСтрокуИзДвоичныхДанных(ПолучитьОбщийМакет("SUI_ПредопределенныеКАДокументы"));
	ИначеЕсли Результат = ПредопределенноеЗначение("Перечисление.SUI_ПредопределенныеНастройкиПодсистемы.Бухгалтерия") Тогда
		НастройкиИзМакета = ПолучитьСтрокуИзДвоичныхДанных(ПолучитьОбщийМакет("SUI_ПредопределенныеБухгалтерияДокументы"));
	ИначеЕсли Результат = ПредопределенноеЗначение("Перечисление.SUI_ПредопределенныеНастройкиПодсистемы.Розница23") Тогда
		НастройкиИзМакета = ПолучитьСтрокуИзДвоичныхДанных(ПолучитьОбщийМакет("SUI_ПредопределенныеРозница23Документы"));
	КонецЕсли; 
	
	Возврат НастройкиИзМакета;
	
КонецФункции 

&НаКлиенте
Процедура ЗагрузитьНастройкиИзФайлаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено И Результат.Свойство("АдресНастроек") Тогда
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ВыбраныНастройкиИзФайлаЗавершение", ЭтотОбъект);
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("АдресНастроек", Результат.АдресНастроек);
		ПараметрыОткрытия.Вставить("ПерезаписыватьСуществующие", Результат.ПерезаписыватьСуществующие);
		 
		ОткрытьФорму("Справочник.SUI_НастройкиДокументов.Форма.ФормаВыбораНастроекИзФайла", ПараметрыОткрытия,,,,, ОповещениеОЗавершении);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбраныНастройкиИзФайлаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗагрузитьНастройкиЗавершение", ЭтотОбъект);
	
		SUI_НастройкиДокументовКлиент.ЗаписатьВыбранныеНастройкиЗавершение(ОповещениеОЗавершении, Результат);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
		
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьНастройкиВыборЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		SUI_НастройкиДокументовКлиент.ВыгрузитьНастройки(,Результат.МассивИтоговый);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
