
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыгрузитьНастройки(Команда)
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("ОбластьНастроек", "Настройки документов");
	ПараметрыОткрытия.Вставить("РежимВыгрузки", Истина);
	ОткрытьФорму("Обработка.SUI_ИмпортЭкспортНастроек.Форма", ПараметрыОткрытия, ЭтотОбъект, 
		УникальныйИдентификатор, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройки(Команда)
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("ОбластьНастроек", "Настройки документов");
	ПараметрыОткрытия.Вставить("РежимВыгрузки", Ложь);
	ОткрытьФорму("Обработка.SUI_ИмпортЭкспортНастроек.Форма", ПараметрыОткрытия, ЭтотОбъект, 
		УникальныйИдентификатор, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗагрузитьНастройкиИзФайлаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено И Результат.Свойство("АдресНастроек") Тогда
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ВыбраныНастройкиИзФайлаЗавершение", ЭтотОбъект);
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("АдресНастроек", Результат.АдресНастроек);
		ПараметрыОткрытия.Вставить("ПерезаписыватьСуществующие", Результат.ПерезаписыватьСуществующие);
		 
		ОткрытьФорму("Справочник.SUI_НастройкиДокументов.Форма.ФормаВыбораНастроекИзФайла", ПараметрыОткрытия,,,,, ОповещениеОЗавершении);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбраныНастройкиИзФайлаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗагрузитьНастройкиЗавершение", ЭтотОбъект);
	
		SUI_НастройкиДокументовКлиент.ЗаписатьВыбранныеНастройкиЗавершение(ОповещениеОЗавершении, Результат);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
		
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьНастройкиВыборЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		SUI_НастройкиДокументовКлиент.ВыгрузитьНастройки(,Результат.МассивИтоговый);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
