
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//TODO: Врем. выкл.
	ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Функционал отключен'"), , , , Отказ);
	Возврат;
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Версия = SUI_СтроковыеФункцииКлиентСервер.ОбработатьСтрокуВерсии(Объект.Версия);
	Иначе
		ЗагрузитьПрисоединенныйФайлВОбъектФормы();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ПрисоединенныйФайл.Пустая() И Не ЭтоАдресВременногоХранилища(ЗагруженныйФайлАдрес) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не загружен файл конфигурации'"), , , , Отказ);
		Возврат;
	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(ЗагруженныйФайлАдрес) Тогда
		
		ЗагруженныйФайл = Новый Структура();
		ЗагруженныйФайл.Вставить("Ссылка", ПрисоединенныйФайл);
		ЗагруженныйФайл.Вставить("ПутьКФайлу", ПрисоединенныйФайлИмя);
		ЗагруженныйФайл.Вставить("ДвоичныеДанные", ПолучитьИзВременногоХранилища(ЗагруженныйФайлАдрес));
		
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ЗагруженныйФайл", ЗагруженныйФайл);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ЗаписатьОбъектПрисоединенныйФайлПослеЗаписи();

	ЗагрузитьПрисоединенныйФайлВОбъектФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ЭтоАдресВременногоХранилища(ЗагруженныйФайлАдрес) Тогда
		УдалитьИзВременногоХранилища(ЗагруженныйФайлАдрес);
	КонецЕсли;
	
	ЗагруженныйФайлАдрес = "";
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВерсияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ВерсияИДатаПриНачалеВыбора(СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаВерсииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ВерсияИДатаПриНачалеВыбора(СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрисоединенныйФайлИмяНажатие(Элемент, СтандартнаяОбработка)
	
	Если Не ПрисоединенныйФайл.Пустая() И Не ЭтоАдресВременногоХранилища(ЗагруженныйФайлАдрес) Тогда
		
		СтандартнаяОбработка = Ложь;
	
		Оповещение = Новый ОписаниеОповещения("ПрисоединенныйФайлОбъектСсылкаНажатиеЗавершение", ЭтотОбъект);
		
		ПараметрыФормы = Новый Структура("Ключ", ПрисоединенныйФайл);
		ОткрытьФорму("Справочник.SUI_ПрисоединенныеФайлыОбщие.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект, УникальныйИдентификатор, , ,
			Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПрикрепитьФайл(Команда)
	
	ПараметрыЗагрузкиФайла = ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла();
	ПараметрыЗагрузкиФайла.Диалог.ПроверятьСуществованиеФайла = Истина;
	ПараметрыЗагрузкиФайла.ИдентификаторФормы = УникальныйИдентификатор;
	
	Оповещение = Новый ОписаниеОповещения("ПрикрепитьФайлЗавершение", ЭтотОбъект);
	
	ФайловаяСистемаКлиент.ЗагрузитьФайл(Оповещение, ПараметрыЗагрузкиФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаименование(Команда)
	
	ЗаполнитьНаименованиеИзВерсииИДаты();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВерсияИДатаПриНачалеВыбора(СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыРедактированияВерсии = Новый Структура();
	ПараметрыРедактированияВерсии.Вставить("Версия", Объект.Версия);
	ПараметрыРедактированияВерсии.Вставить("Дата", Объект.ДатаВерсии);

	Оповещение = Новый ОписаниеОповещения("РедактированиеВерсииИДатыВерсииЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("ОбщаяФорма.SUI_РедактированиеВерсии", ПараметрыРедактированияВерсии, ЭтотОбъект, 
		УникальныйИдентификатор, , , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеВерсииИДатыВерсииЗавершение(РезультатРедактирования, ДополнительныеПараметры) Экспорт
	
	Если РезультатРедактирования = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Версия = РезультатРедактирования.Версия;
	Объект.ДатаВерсии = РезультатРедактирования.Дата;
	
	Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
		
		ЗаполнитьНаименованиеИзВерсииИДаты();

	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаименованиеИзВерсииИДаты()
	
	Объект.Наименование = Объект.Версия;
		
	Если ЗначениеЗаполнено(Объект.ДатаВерсии) Тогда
		Объект.Наименование = Объект.Наименование + " от " + Строка(Объект.ДатаВерсии);
	КонецЕсли;
	
	Модифицированность = Истина;
		
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьФайлЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗагруженныйФайлАдрес = Результат.Хранение;
	ПрисоединенныйФайлИмя = Результат.Имя;

	Модифицированность = Истина;

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПрисоединенныйФайлВОбъектФормы()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	SUI_ПрисоединенныеФайлыОбщие.Ссылка,
		|	SUI_ПрисоединенныеФайлыОбщие.Наименование
		|ИЗ
		|	Справочник.SUI_ПрисоединенныеФайлыОбщие КАК SUI_ПрисоединенныеФайлыОбщие
		|ГДЕ
		|	SUI_ПрисоединенныеФайлыОбщие.ВладелецФайла = &ВладелецФайла";
	
	Запрос.УстановитьПараметр("ВладелецФайла", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		ПрисоединенныйФайл = Неопределено;
		ПрисоединенныйФайлИмя = "";
		
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		ПрисоединенныйФайл = Выборка.Ссылка;
		ПрисоединенныйФайлИмя = Выборка.Наименование;
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПрисоединенныйФайлОбъектСсылкаНажатиеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ЗагрузитьПрисоединенныйФайлВОбъектФормы();
	
КонецПроцедуры

#КонецОбласти
