
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьНастройки(ТаблицаИнтеграции = Неопределено, Используется = Неопределено) Экспорт
	
	СхемаНастройки = ПолучитьМакет("ДополнительныеНастройкиТаблиц");
	
	Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных();
	SUI_КомпоновкаДанныхСервер.ИнициализироватьКомпоновщикНастроек(Компоновщик, СхемаНастройки);
	
	Если ТаблицаИнтеграции <> Неопределено Тогда
		
		ТипЗначения = ТипЗнч(ТаблицаИнтеграции);
		
		Если ТипЗначения = Тип("Массив") Или ТипЗначения = Тип("ФиксированныйМассив") Или ТипЗначения = Тип("СписокЗначений") Тогда
			SUI_КомпоновкаДанныхКлиентСервер.УстановитьПараметр(Компоновщик, "ТаблицаИнтеграции", ТаблицаИнтеграции);
		ИначеЕсли ТипЗначения = Тип("ПеречислениеСсылка.SUI_ТаблицыИнтеграции") Тогда
			SUI_КомпоновкаДанныхКлиентСервер.УстановитьПараметр(Компоновщик, "ТаблицаИнтеграции", 
				ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТаблицаИнтеграции));
		КонецЕсли;
		
	КонецЕсли;
	
	Если Используется <> Неопределено Тогда
		SUI_КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(Компоновщик, "Используется", Используется);
	КонецЕсли;
	
	ПараметрыРезультата = SUI_КомпоновкаДанныхСервер.ПараметрыРезультатСхемыКомпоновкиДанных();
	ПараметрыРезультата.СхемаКомпоновкиДанных 					= СхемаНастройки;
	ПараметрыРезультата.НастройкиКомпоновкиДанных 				= Компоновщик.ПолучитьНастройки();
	ПараметрыРезультата.ВозможностьИспользованияВнешнихФункций 	= Истина;
	ПараметрыРезультата.ВыполнятьВПривилегированномРежиме 		= Истина;
	
	Возврат SUI_КомпоновкаДанныхСервер.ВыгрузитьРезультатСхемыКомпоновкиДанных(ПараметрыРезультата);
	
КонецФункции

Процедура СохранитьНастройки(Настройки, ПерезаписатьВсе = Ложь, ЗаписьВыполнена = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаИнтеграции
		|ИЗ
		|	РегистрСведений.SUI_ДополнительныеНастройкиТаблицИнтеграции
		|ГДЕ
		|	ВЫБОР
		|		КОГДА &ОтборТаблицыИнтеграции
		|			ТОГДА ТаблицаИнтеграции В (&ТаблицыИнтеграции)
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|ДЛЯ ИЗМЕНЕНИЯ
		|	РегистрСведений.SUI_ДополнительныеНастройкиТаблицИнтеграции";
	
	Запрос.УстановитьПараметр("ТаблицыИнтеграции", Новый Массив());
	
	Если Не ПерезаписатьВсе Тогда
		
		Для Каждого ЭлементНастройки Из Настройки Цикл
			Запрос.Параметры.ТаблицыИнтеграции.Добавить(ЭлементНастройки.Ключ);
		КонецЦикла;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ОтборТаблицыИнтеграции", Запрос.Параметры.ТаблицыИнтеграции.Количество() > 0);
	
	НачатьТранзакцию();
	
	Попытка
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если ПерезаписатьВсе И Не РезультатЗапроса.Пустой() Тогда
			НаборЗаписей = СоздатьНаборЗаписей();
			НаборЗаписей.Записать(Истина);
		КонецЕсли;
		
		ОписаниеТипаСтруктура = Новый ОписаниеТипов("Структура");
		
		Для Каждого ЭлементНастройки Из Настройки Цикл
			
			НаборЗаписей = СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ТаблицаИнтеграции.Установить(ЭлементНастройки.Ключ);
			
			Данные = ОписаниеТипаСтруктура.ПривестиЗначение(ЭлементНастройки.Значение);
			
			Если ЗначениеЗаполнено(Данные) Тогда
				
				Запись = НаборЗаписей.Добавить();
				Запись.ТаблицаИнтеграции = ЭлементНастройки.Ключ;
				Запись.ДанныеНастройки = Новый ХранилищеЗначения(Данные, Новый СжатиеДанных(9));
				
				ЗаписьВыполнена = Истина;
				
			КонецЕсли;
			
			НаборЗаписей.Записать(Истина);
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#Область УстаревшиеПроцедурыИФункции

// Устарела.
//
Функция ПолучитьДополнительныеНастройки(ТаблицаИнтеграции = Неопределено) Экспорт
	
	ДополнительныеНастройки = Новый Соответствие();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДополнительныеНастройки.ТаблицаИнтеграции КАК ТаблицаИнтеграции,
		|	ДополнительныеНастройки.ДанныеНастройки КАК ДополнительныеНастройки
		|ИЗ
		|	РегистрСведений.SUI_ДополнительныеНастройкиТаблицИнтеграции КАК ДополнительныеНастройки
		|ГДЕ
		|	ВЫБОР
		|		КОГДА &ТаблицаИнтеграции = НЕОПРЕДЕЛЕНО
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ДополнительныеНастройки.ТаблицаИнтеграции = &ТаблицаИнтеграции
		|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("ТаблицаИнтеграции", ТаблицаИнтеграции);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда

		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ДополнительныеНастройки.Вставить(Выборка.ТаблицаИнтеграции, Выборка.ДополнительныеНастройки.Получить());
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ДополнительныеНастройки;
	
КонецФункции

// Устарела.
//
Процедура СохранитьДополнительныеНастройки(ДополнительныеНастройки, ПерезаписатьВсе = Ложь) Экспорт
	
	ТаблицаНастройки = Новый ТаблицаЗначений();
	ТаблицаНастройки.Колонки.Добавить("ТаблицаИнтеграции", Новый ОписаниеТипов("ПеречислениеСсылка.SUI_ТаблицыИнтеграции"));
	ТаблицаНастройки.Колонки.Добавить("ДанныеНастройки", Новый ОписаниеТипов("ХранилищеЗначения"));
	
	ТипыСоответствие = SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.МассивЗначений(
		Тип("Соответствие"), 
		Тип("ФиксированноеСоответствие"));
	
	ОписаниеТипаСоответствие = Новый ОписаниеТипов(ТипыСоответствие);
	
	Для Каждого ДополнительнаяНастройка Из ОписаниеТипаСоответствие.ПривестиЗначение(ДополнительныеНастройки) Цикл
		
		Если ТаблицыИнтеграцииДополнительныхНастроек().Найти(ДополнительнаяНастройка.Ключ) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаНастройки = ТаблицаНастройки.Добавить();
		СтрокаНастройки.ТаблицаИнтеграции = ДополнительнаяНастройка.Ключ;
		СтрокаНастройки.ДанныеНастройки = Новый ХранилищеЗначения(ДополнительнаяНастройка.Значение, Новый СжатиеДанных(9));
		
	КонецЦикла;
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.SUI_ДополнительныеНастройкиТаблицИнтеграции");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
		Если Не ПерезаписатьВсе Тогда
			ЭлементБлокировки.ИсточникДанных = ТаблицаНастройки;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ТаблицаИнтеграции", "ТаблицаИнтеграции");
		КонецЕсли;
		Блокировка.Заблокировать();
		
		Если ПерезаписатьВсе Тогда
			
			НаборЗаписей = СоздатьНаборЗаписей();
			НаборЗаписей.Загрузить(ТаблицаНастройки);
			НаборЗаписей.Записать(Истина);
			
		Иначе
			
			Для Каждого СтрокаТаблицы Из ТаблицаНастройки Цикл
				
				НаборЗаписей = СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.ТаблицаИнтеграции.Установить(СтрокаТаблицы.ТаблицаИнтеграции);
				ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), СтрокаТаблицы);
				НаборЗаписей.Записать(Истина);
				
			КонецЦикла;
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ТаблицыИнтеграцииДополнительныхНастроек() Экспорт
	
	Таблицы = Новый Массив();
	
	Таблицы.Добавить(Перечисления.SUI_ТаблицыИнтеграции.СерииНоменклатуры);
	Таблицы.Добавить(Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыНоменклатуры);
	Таблицы.Добавить(Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыУпаковок);
	
	Возврат Новый ФиксированныйМассив(Таблицы);
		
КонецФункции

Функция ПолучитьДополнительныеНастройкиИзХранилища(Хранилище) Экспорт
	
	ОписаниеТипаСтруктура = Новый ОписаниеТипов("Структура");
	ДополнительныеНастройки = ОписаниеТипаСтруктура.ПривестиЗначение(Хранилище.Получить());
	Возврат ?(ЗначениеЗаполнено(ДополнительныеНастройки), ДополнительныеНастройки, Неопределено);
	
КонецФункции

#КонецОбласти

#КонецЕсли
