
#Область ПрограммныйИнтерфейс

Функция ПараметрыОткрытияКонструктора() Экспорт
	
	ПараметрыОткрытия = Новый Структура();
	
	ПараметрыОткрытия.Вставить("Данные", ДанныеКонструктора());
	ПараметрыОткрытия.Вставить("ОтображатьНастройкиРезультатаЗапроса", Истина);
	ПараметрыОткрытия.Вставить("ОписаниеЗапроса", "");
	ПараметрыОткрытия.Вставить("ОписаниеВременныхТаблиц", Новый Соответствие());
	ПараметрыОткрытия.Вставить("ОписаниеПараметров", Новый Соответствие());
	
	Возврат ПараметрыОткрытия;
	
КонецФункции

Процедура ДобавитьКолонкуОписанияВременнойТаблицы(ПараметрыОткрытияКонструктора, ИмяВременнойТаблицы, 
	ИмяКолонки, Знач ТипКолонки, Описание) Экспорт

	Если ТипЗнч(ТипКолонки) = Тип("Тип") Тогда
		ТипКолонки = Новый ОписаниеТипов(SUI_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТипКолонки));
	КонецЕсли;

	Если ТипЗнч(ТипКолонки) <> Тип("ОписаниеТипов") Тогда
		ТипКолонки = Новый ОписаниеТипов("Произвольный");
	КонецЕсли;
	
	ОписаниеВТ = ПараметрыОткрытияКонструктора.ОписаниеВременныхТаблиц.Получить(ИмяВременнойТаблицы);
	Если ОписаниеВТ = Неопределено Тогда
		ОписаниеВТ = Новый Соответствие();
	КонецЕсли;
	
	ОписаниеКолонки = Новый Структура("Тип, Описание", ТипКолонки, Описание);
	ОписаниеВТ.Вставить(ИмяКолонки, ОписаниеКолонки);
	
	ПараметрыОткрытияКонструктора.ОписаниеВременныхТаблиц.Вставить(ИмяВременнойТаблицы, ОписаниеВТ);
	
КонецПроцедуры

// Добавить описание параметра.
// 
// Параметры:
//  ПараметрыОткрытияКонструктора - Структура - см. SUI_КонструкторЗапросаКлиентСервер.ПараметрыОткрытияКонструктора
//  ИмяПараметра - Строка - Имя параметра
//  ТипПараметра - Строка - Тип параметра
//  Описание - Строка - Описание
Процедура ДобавитьОписаниеПараметра(ПараметрыОткрытияКонструктора, ИмяПараметра, Знач ТипПараметра, Описание) Экспорт

	Если ТипЗнч(ТипПараметра) <> Тип("Тип") Тогда
		ТипПараметра = Тип("Неопределено");
	КонецЕсли;
	
	ОписаниеПараметра = Новый Структура("Тип, Описание", ТипПараметра, Описание);
	ПараметрыОткрытияКонструктора.ОписаниеПараметров.Вставить(ИмяПараметра, ОписаниеПараметра);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Данные конструктора.
// 
// Возвращаемое значение:
//  Структура - Данные конструктора:
// * ТекстЗапроса - Строка - 
// * ВыполнятьВПакетномРежиме - Булево - 
// * ПакетыРезультата - Массив из Число - 
Функция ДанныеКонструктора() Экспорт
	
	ДанныеКонструктора = Новый Структура();
	
	ДанныеКонструктора.Вставить("ТекстЗапроса", "");
	ДанныеКонструктора.Вставить("ВыполнятьВПакетномРежиме", Ложь);
	ДанныеКонструктора.Вставить("ПакетыРезультата", Новый Массив());
	
	Возврат ДанныеКонструктора;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
