
#Область ОписаниеПеременных

&НаКлиенте
Перем МассивСтраницы;
&НаКлиенте
Перем ВопросПриЗакрытии;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Мастер настроек %1'"), SUI_SimpleКлиентСервер.Представление());
	
	Элементы.ЗаголовокМастера.Заголовок = Заголовок;
	
	ДанныеQRКода = SUI_ГенерацияШтрихкода.ДанныеQRКода(SUI_SimpleКлиентСервер.АдресAPKМобильногоПриложения(), 0, 130);
	QRКодДляСкачиванияПриложения = ПоместитьВоВременноеХранилище(ДанныеQRКода, УникальныйИдентификатор);
	
	Если SUI_ИнтеграцияВКонфигурациюВызовСервера.ИспользуетсяВариантОбменаОнлайн() Тогда
		ИспользуемыйВариантОбмена = Перечисления.SUI_ВариантОбмена.Онлайн;
	ИначеЕсли SUI_ИнтеграцияВКонфигурациюВызовСервера.ИспользуетсяВариантОбменаОфлайн() Тогда
		ИспользуемыйВариантОбмена = Перечисления.SUI_ВариантОбмена.Офлайн;           
	КонецЕсли;
	
	АдресПубликацииИБ = АдресПубликацииИБНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МассивСтраницы = Новый Массив();
	Для Каждого ЭлементСтраница Из Элементы.ШагиМастера.ПодчиненныеЭлементы Цикл
		МассивСтраницы.Добавить(ЭлементСтраница);
	КонецЦикла;
	
	ВопросПриЗакрытии = SUI_SimpleВызовСервера.ЗапускатьМастерНастроекПриНачалеРаботыСистемы();
	
	ПриСменеСтраницы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

	Если Отказ Или ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;

	Если ВопросПриЗакрытии Тогда
		Отказ = Истина;
		Оповещение = Новый ОписаниеОповещения("ПослеОтветаПередЗакрытием", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Вы не завершили все этапы мастера настроек.
		|Запустить мастер настроек при следующем запуске системы?'"), РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)

	Если ЭтоАдресВременногоХранилища(QRКодДляСкачиванияПриложения) Тогда
		УдалитьИзВременногоХранилища(QRКодДляСкачиванияПриложения);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Шаг1_МобильноеПриложение_ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(SUI_SimpleКлиентСервер.АдресAPKМобильногоПриложения());
КонецПроцедуры

&НаКлиенте
Процедура ИспользуемыйВариантОбменаПриИзменении(Элемент)
	ПодключитьОбработчикОжидания("ИспользуемыйВариантОбменаПриИзмененииПродолжить", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура АдресПубликацииИБНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПодключитьОбработчикОжидания("АдресПубликацииБазыНачалоВыбораПродолжение", 0.2, Истина);
КонецПроцедуры

&НаКлиенте
Процедура АдресПубликацииИБПриИзменении(Элемент)
	ПодключитьОбработчикОжидания("АдресПубликацииИБПриИзмененииПродолжить", 2, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылкиПоказатьПример(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Обработка.SUI_МастерНастроек.Форма.ФормаОтображенияПримера", 
		Новый Структура("НаименованиеПримера", НавигационнаяСсылкаФорматированнойСтроки), ЭтотОбъект, УникальныйИдентификатор);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ШагиВперед(Команда)
	СменитьСтраницу();
КонецПроцедуры

&НаКлиенте
Процедура ШагиНазад(Команда)
	СменитьСтраницу(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиПодсистемы(Команда)
	ОткрытьФорму("Обработка.SUI_НастройкаМетаданных.Форма", , ЭтотОбъект, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиДокументов(Команда)
	ОткрытьФорму("Справочник.SUI_НастройкиДокументов.Форма.ФормаСписка", , ЭтотОбъект, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ТестСвязиПубликацииИБ(Команда)
	ОчиститьСообщения();
	SUI_SimpleКлиент.ВыполнитьПроверкуСвязиПубликацииИБ(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьQRКодПодключения(Команда)
	ОткрытьФорму("ОбщаяФорма.SUI_QRКодДляПодключенияМобильногоПриложения", , ЭтотОбъект, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗапросыАвторизацииМУ(Команда)
	ОткрытьФорму("РегистрСведений.SUI_ЗапросыАвторизацииМобильныхУстройств.Форма.ФормаСписка", , 
		ЭтотОбъект, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокМобильныхУстройств(Команда)
	ОткрытьФорму("ПланОбмена.SUI_МобильныеУстройства.ФормаСписка", , ЭтотОбъект, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура SUI_СоздаватьШтрихкодыИзТСДПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиМобильныхУстройств(Команда)
	
	ОткрытьФорму("Справочник.SUI_НастройкиМобильныхУстройств.ФормаСписка", , ЭтотОбъект, УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СменитьСтраницу(Вперед = Истина)
	
	Если Вперед Тогда
		НоваяТекущаяСтраница = СледующаяСтраница();
	Иначе
		НоваяТекущаяСтраница = ПредыдущаяСтраница();
	КонецЕсли;

	Если НоваяТекущаяСтраница = Неопределено Тогда
		Если Вперед Тогда
			SUI_SimpleВызовСервера.ЗапускатьМастерНастроекПриНачалеРаботыСистемы(Ложь);
			ВопросПриЗакрытии = Ложь;
			Закрыть();
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Элементы.ШагиМастера.ТекущаяСтраница = НоваяТекущаяСтраница;

	ПриСменеСтраницы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриСменеСтраницы()
	
	Элементы.ФормаШагиВперед.Заголовок = НСтр("ru = 'Вперед'");
	Элементы.ФормаШагиВперед.КнопкаПоУмолчанию = Ложь;
	Элементы.ФормаШагиВперед.Отображение = ОтображениеКнопки.КартинкаИТекст;
	
	Если ПредыдущаяСтраница() = Неопределено Тогда
		Элементы.ФормаШагиНазад.Видимость = Ложь;
		Элементы.КоманднаяПанельКнопки.Подсказка = НСтр("ru = 'Для продолжения нажмите кнопку Вперед'");
	Иначе
		
		Элементы.ФормаШагиНазад.Видимость = Истина;
		
		Если СледующаяСтраница() = Неопределено Тогда
			Элементы.ФормаШагиВперед.Заголовок = НСтр("ru = 'Завершить'");
			Элементы.ФормаШагиВперед.КнопкаПоУмолчанию = Истина;
			Элементы.ФормаШагиВперед.Отображение = ОтображениеКнопки.Текст;
			Элементы.КоманднаяПанельКнопки.Подсказка = НСтр("ru = 'Для продолжения нажмите кнопку Завешить или вернитесь к предыдущему шагу по кнопке Назад'");
		Иначе
			Элементы.КоманднаяПанельКнопки.Подсказка = НСтр("ru = 'Для продолжения нажмите кнопку Вперед или вернитесь к предыдущему шагу по кнопке Назад'");
		КонецЕсли;
		
	КонецЕсли;
	
	ВыбранОнлайнОбмен = ИспользуемыйВариантОбмена = ПредопределенноеЗначение("Перечисление.SUI_ВариантОбмена.Онлайн");
	
	Если Элементы.ШагиМастера.ТекущаяСтраница = Элементы.Шаг3_ДополнительныеНастройки Тогда
		
		Элементы.Шаг3_ДополнительныеНастройки_Онлайн.Видимость = ВыбранОнлайнОбмен;
		Элементы.Шаг3_ДополнительныеНастройки_Офлайн.Видимость = Не ВыбранОнлайнОбмен;
		
		Если ВыбранОнлайнОбмен Тогда
			Элементы.Шаг3_Описание.Заголовок = НСтр("ru = 'На этапе дополнительных настроек необходимо заполнить адрес публикации информационной базы
			|и подключить мобильных устройств, отсканировав QR-код подключения в мобильном приложении Simple.'");
		Иначе
			Элементы.Шаг3_Описание.Заголовок = СтроковыеФункцииКлиент.ФорматированнаяСтрока(НСтр("ru='На этапе дополнительных настроек необходимо создать мобильные устройства приложения Simple.
			|Для этого откройте список мобильных устройств и добавьте нового,
			|заполнив обзательные реквизиты такие как Наименование и IP адрес как на <a href = ""ПримерЗаполненияМобильногоУстройства"">примере</a>.
			|Также заполните список настроек документов для созданного мобильного устройства.'"));
		КонецЕсли;
		
	КонецЕсли;
	
	Если Элементы.ШагиМастера.ТекущаяСтраница = Элементы.ШагЗавершение Тогда
		
		ДетальноеОписание = НСтр("ru = '1. Вкладка ""Документы обмена"" для выгрузки/загрузки данных по выбранным пользователям или документам и записи полученных данных в базу;
		|
		|2. Окно с информацией по выбранной строке во вкладке обмена с активными ссылками для просмотра и редактирования данных по документу;'");
		
		Если ВыбранОнлайнОбмен Тогда
			ДетальноеОписание = ДетальноеОписание + Символы.ПС + Символы.ПС + НСтр("ru = '3. Вкладка ""Мобильные устройства"" для работы с пользователями устройств, участвующих в обмене 
																	  |(авторизация нового мобильного устройства, просмотр и редактирование пользователя, создание задания на выполнение полной выгрузки НСИ);
																	  |
																	  |<a href = ""ПримерФормаРабочегоМестаОнлайн"">Пример рабочего места</a>'");
		Иначе
			ДетальноеОписание = ДетальноеОписание + Символы.ПС + Символы.ПС + НСтр("ru = '3. Вкладка ""Мобильные устройства"" для работы с пользователями устройств, участвующих в обмене 
																	  |(добавление нового мобильного устройства, просмотр и редактирование пользователя, создание задания на выполнение полной выгрузки НСИ);
																	  |
																	  |<a href = ""ПримерФормаРабочегоМестаОфлайн"">Пример рабочего места</a>'");
		КонецЕсли;
		
		Элементы.ШагЗавершение_ДетальноеОписание.Заголовок = СтроковыеФункцииКлиент.ФорматированнаяСтрока(ДетальноеОписание);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СледующаяСтраница()
	
	ИндексТекущейСтраницы = МассивСтраницы.Найти(Элементы.ШагиМастера.ТекущаяСтраница) + 1;
	Если ИндексТекущейСтраницы > МассивСтраницы.ВГраница() Тогда
		Возврат Неопределено;
	Иначе
		Возврат МассивСтраницы.Получить(ИндексТекущейСтраницы);
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ПредыдущаяСтраница()
	
	ИндексТекущейСтраницы = МассивСтраницы.Найти(Элементы.ШагиМастера.ТекущаяСтраница) - 1;
	Если ИндексТекущейСтраницы < 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат МассивСтраницы.Получить(ИндексТекущейСтраницы);
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ИспользуемыйВариантОбменаПриИзмененииПродолжить() Экспорт
	ИспользуемыйВариантОбменаПриИзмененииНаСервере(ИспользуемыйВариантОбмена);
	ОбновитьИнтерфейс();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИспользуемыйВариантОбменаПриИзмененииНаСервере(ВариантОбмена)
	Константы.SUI_ИспользуемыйВариантОбмена.Установить(ВариантОбмена); 	
КонецПроцедуры

&НаКлиенте
Процедура АдресПубликацииБазыНачалоВыбораПродолжение()
	
	ТекстПредупреждения = "";
	Если ОбщегоНазначенияКлиент.КлиентПодключенЧерезВебСервер() Тогда
		
		ПараметрыСоединения = СтроковыеФункцииКлиентСервер.ПараметрыИзСтроки(СтрокаСоединенияИнформационнойБазы());
		Если ПараметрыСоединения.Свойство("WS") Тогда
			АдресПубликацииИБ = ПараметрыСоединения.WS;
			АдресПубликацииИБПриИзмененииПродолжить();
		Иначе
			АдресПубликацииИБ = "";
			ТекстПредупреждения = НСтр("ru = 'Не удалось автоматически заполнить адрес публикации информационной базы.'");
		КонецЕсли;

	Иначе
		ТекстПредупреждения = НСтр("ru = 'Не удалось автоматически заполнить адрес публикации информационной базы, т.к. клиентское приложение не подключено через веб-сервер.'");
	КонецЕсли;
	
	Если Не ПустаяСтрока(ТекстПредупреждения) Тогда
		ПоказатьПредупреждение(, ТекстПредупреждения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АдресПубликацииИБПриИзмененииПродолжить() Экспорт
	АдресПубликацииИБНаСервере(АдресПубликацииИБ);
КонецПроцедуры

&НаСервереБезКонтекста
Функция АдресПубликацииИБНаСервере(АдресПубликации = Неопределено) Экспорт
	
	Если АдресПубликации = Неопределено Тогда
		Возврат Константы.SUI_АдресПубликацииБазы.Получить();
	Иначе
		Константы.SUI_АдресПубликацииБазы.Установить(АдресПубликации);
		Возврат АдресПубликации;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПослеОтветаПередЗакрытием(Ответ, Контекст) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		SUI_SimpleВызовСервера.ЗапускатьМастерНастроекПриНачалеРаботыСистемы(Ложь);
		ВопросПриЗакрытии = Ложь;
		Закрыть();
	ИначеЕсли Ответ = КодВозвратаДиалога.Да Тогда
		SUI_SimpleВызовСервера.ЗапускатьМастерНастроекПриНачалеРаботыСистемы(Истина);
		ВопросПриЗакрытии = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизита(Элемент, ОбновлятьИнтерфейс = Истина)
	
	ИмяКонстанты = ПриИзмененииРеквизитаСервер(Элемент.Имя);
	ОбновитьПовторноИспользуемыеЗначения();
	
	Если ОбновлятьИнтерфейс Тогда
		ОбновитьИнтерфейс = Истина;
		ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 2, Истина);
	КонецЕсли;
	
//	Если ИмяКонстанты <> "" Тогда
//		Оповестить("Запись_НаборКонстант", Новый Структура, ИмяКонстанты);
//	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнтерфейсПрограммы()
	
	ОбщегоНазначенияКлиент.ОбновитьИнтерфейсПрограммы();
	
КонецПроцедуры

&НаСервере
Функция ПриИзмененииРеквизитаСервер(ИмяЭлемента)
	
	РеквизитПутьКДанным = Элементы[ИмяЭлемента].ПутьКДанным;
	ИмяКонстанты = СохранитьЗначениеРеквизита(РеквизитПутьКДанным);
	Возврат ИмяКонстанты;
	
КонецФункции

&НаСервере
Функция СохранитьЗначениеРеквизита(РеквизитПутьКДанным)
	
	// Сохранение значений реквизитов, не связанных с константами напрямую (в отношении один-к-одному).
	
	Если РеквизитПутьКДанным = "" Тогда
		Возврат "";
	КонецЕсли;
	
	ЧастиИмени = СтрРазделить(РеквизитПутьКДанным, ".");
	
	Если ЧастиИмени.Количество() = 2 Тогда
		КонстантаИмя = ЧастиИмени[1];
		КонстантаЗначение = НаборКонстант[КонстантаИмя];
	ИначеЕсли ЧастиИмени.Количество() = 1 И НРег(Лев(РеквизитПутьКДанным, 9)) = НРег("Константа") Тогда
		КонстантаИмя = Сред(РеквизитПутьКДанным, 10);
		КонстантаЗначение = ЭтотОбъект[РеквизитПутьКДанным];
	Иначе
		Возврат "";
	КонецЕсли;
	
	Если Константы[КонстантаИмя].Получить() <> КонстантаЗначение Тогда
		Константы[КонстантаИмя].Установить(КонстантаЗначение);
	КонецЕсли;
	
	Возврат КонстантаИмя;
	
КонецФункции

#КонецОбласти
