
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КоличествоПовторовПриАварийномЗавершении = Параметры.КоличествоПовторовПриАварийномЗавершении;
	ИнтервалПовторовПриАварийномЗавершении = Параметры.ИнтервалПовторовПриАварийномЗавершении;
	
	Элементы.НадписьЗаголовок.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
		Элементы.НадписьЗаголовок.Заголовок, 
		Параметры.ПредставлениеРегламентногоЗадания);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ВыполнитьСохранениеПередЗакрытием", ЭтотОбъект);
	SUI_ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПодготовитьПараметрыЗакрытия()
	
	ПараметрыЗакрытия = Новый Структура();
	ПараметрыЗакрытия.Вставить("КоличествоПовторовПриАварийномЗавершении", КоличествоПовторовПриАварийномЗавершении);
	ПараметрыЗакрытия.Вставить("ИнтервалПовторовПриАварийномЗавершении", ИнтервалПовторовПриАварийномЗавершении);
	
	Возврат ПараметрыЗакрытия;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьСохранениеПередЗакрытием(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Модифицированность = Ложь;
	
	Закрыть(ПодготовитьПараметрыЗакрытия());
	
КонецПроцедуры

#КонецОбласти
