
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НаборКонстант.SUI_РазмерПакетаДанных < Константы.SUI_РазмерПакетаДанных.МинимальныйРазмер() Тогда
		
		Если НаборКонстант.SUI_РазмерПакетаДанных <> 0 Тогда
			Модифицированность = Истина;
		КонецЕсли;
		
		НаборКонстант.SUI_РазмерПакетаДанных = Константы.SUI_РазмерПакетаДанных.МинимальныйРазмер();
		
	ИначеЕсли НаборКонстант.SUI_РазмерПакетаДанных > Константы.SUI_РазмерПакетаДанных.МаксимальныйРазмер() Тогда
		Модифицированность = Истина;
		НаборКонстант.SUI_РазмерПакетаДанных = Константы.SUI_РазмерПакетаДанных.МаксимальныйРазмер();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
