
#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиСобытийФормы

Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Если Отказ Тогда
		Возврат
	КонецЕсли;
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Обработка.ПроверкаИПодборПродукцииИСМП.Форма.ПроверкаИПодбор" Или
		ИмяФормы = "Обработка.ПроверкаИПодборТабачнойПродукцииМОТП.Форма.ПроверкаИПодбор" Или
		ИмяФормы = "Обработка.ПроверкаИПодборАлкогольнойПродукцииЕГАИС.Форма.ПроверкаИПодбор" Тогда
		
		ДобавитьКнопкуЗагрузкиШтрихкодовМаркировки(Форма);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьКнопкуЗагрузкиШтрихкодовМаркировки(Форма)
	
	Если SUI_ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ПроверяемыйДокумент") И 
		ЗначениеЗаполнено(Форма.ПроверяемыйДокумент) Тогда
		
		ГруппаРазмещения = Форма.Элементы.Найти("ГруппаМаркированнаяКоманднаяПанель");
		
		Если ГруппаРазмещения = Неопределено Или ГруппаРазмещения.Вид <> ВидГруппыФормы.КоманднаяПанель Тогда
			ГруппаРазмещения = Форма.КоманднаяПанель;
		КонецЕсли;
		
		Команда	= Форма.Команды.Добавить("SUI_ЗагрузитьШтрихкодыМаркировки");
		Команда.Действие = "Подключаемый_ВыполнитьПереопределяемуюКоманду";
		Команда.Заголовок = СтрШаблон(НСтр("ru = '%1: Загрузить штрихкоды маркировки'"), SUI_SimpleКлиентСервер.Представление());
		Команда.Подсказка = СтрШаблон(НСтр("ru = 'Загрузить штрихкоды маркировки из подсистемы %1'"), SUI_SimpleКлиентСервер.Представление());
		Команда.ИзменяетСохраняемыеДанные = Истина;
		Команда.Картинка = БиблиотекаКартинок.SUI_ПодсистемаSimple;
		Команда.Отображение = ОтображениеКнопки.Авто;
		
		Кнопка = Форма.Элементы.Добавить(Команда.Имя, Тип("КнопкаФормы"), ГруппаРазмещения);
		Кнопка.ИмяКоманды = Команда.Имя;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
