
#Область ПрограммныйИнтерфейс

Процедура ДобавитьЗаданиеПостобработкиДокумента_ПроверкаОбработанныхДанных(ПараметрыСозданияЗадания, ДанныеДокумента) Экспорт
	
	ПараметрыПроцедуры = Новый Массив();
	ПараметрыПроцедуры.Добавить(ДанныеДокумента);
	
	SUI_ОчередьЗаданийКлиентСервер.ДобавитьОбработчикВПараметрыСозданияЗадания(
		ПараметрыСозданияЗадания, 
		"SUI_ДокументыОбменаПереопределяемый.ЗаданиеПостобработкиДокумента_ПроверкаОбработанныхДанных",
		ПараметрыПроцедуры);
	
КонецПроцедуры

Функция ДокументНуждаетсяВОбработке(Знач Документ) Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("ВсегоЗаданийОчереди", 			0);
	Результат.Вставить("ОткрытыхЗаданийВОчереди", 		0);
	Результат.Вставить("ВыполняющихсяЗаданийВОчереди", 	0);
	Результат.Вставить("ЗаданийВОчередиСОшибкой", 		0);
	Результат.Вставить("НеОбработанныхСообщенийОбмена", 0);
	
	Если SUI_ОбщегоНазначенияПереопределяемый.ЭтоСсылкаДокумента(Документ) Тогда
		Документ = SUI_ИнтеграцияВКонфигурацию.ИдентификаторSimpleПоСсылке(Документ, Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОчередьЗаданий.Статус,
		|	СУММА(1) КАК КоличествоЗаданий
		|ИЗ
		|	РегистрСведений.SUI_ОчередьЗаданий КАК ОчередьЗаданий
		|ГДЕ
		|	ОчередьЗаданий.ИдентификаторДокумента = &ИдентификаторДокумента
		|	И ОчередьЗаданий.Статус В (&СтатусыОбработкиОчереди)
		|СГРУППИРОВАТЬ ПО
		|	ОчередьЗаданий.Статус
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(СообщенияОбменаДанными.ID) КАК КоличествоСообщений
		|ИЗ
		|	РегистрСведений.SUI_СообщенияОбменаДанными КАК СообщенияОбменаДанными
		|ГДЕ
		|	СообщенияОбменаДанными.Получатель = &ЭтотУзел
		|	И СообщенияОбменаДанными.Ключи ПОДОБНО ""%"" + &ИдентификаторДокумента + ""%""";
	
	Если SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(Документ) Тогда
		Запрос.УстановитьПараметр("ИдентификаторДокумента", Документ);
	Иначе
		ОбщегоНазначенияКлиентСервер.Проверить(Ложь, 
			НСтр("ru = 'Не передан параметр 1'"),
			"SUI_ДокументыОбменаПереопределяемый.ДокументНуждаетсяВОбработке");
	КонецЕсли;
	
	СтатусыОбработкиОчереди = Новый Массив();
	СтатусыОбработкиОчереди.Добавить(Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Открыто);
	СтатусыОбработкиОчереди.Добавить(Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Выполняется);
	СтатусыОбработкиОчереди.Добавить(Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.ОшибкаОбработки);
	
	Запрос.УстановитьПараметр("СтатусыОбработкиОчереди", СтатусыОбработкиОчереди);
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена.SUI_МобильныеУстройства.ЭтотУзел());
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Не РезультатыЗапроса[0].Пустой() Тогда
		
		Выборка = РезультатыЗапроса[0].Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.Статус = Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Открыто Тогда
				Результат.ОткрытыхЗаданийВОчереди = Выборка.КоличествоЗаданий;
			ИначеЕсли Выборка.Статус = Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Выполняется Тогда
				Результат.ВыполняющихсяЗаданийВОчереди = Выборка.КоличествоЗаданий;
			ИначеЕсли Выборка.Статус = Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.ОшибкаОбработки Тогда
				Результат.ЗаданийВОчередиСОшибкой = Выборка.КоличествоЗаданий;
			Иначе
				Продолжить;
			КонецЕсли;
			
			Результат.ВсегоЗаданийОчереди = Результат.ВсегоЗаданийОчереди + Выборка.КоличествоЗаданий;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Не РезультатыЗапроса[1].Пустой() Тогда
		
		Выборка = РезультатыЗапроса[1].Выбрать();
		Выборка.Следующий();
		Результат.НеОбработанныхСообщенийОбмена = Выборка.КоличествоСообщений;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаданиеПостобработкиДокумента_ПроверкаОбработанныхДанных(ДанныеДокумента) Экспорт
	
	Результат = ДокументНуждаетсяВОбработке(ДанныеДокумента.id_doc);
	
	Если Результат.ВсегоЗаданийОчереди > 0 Или Результат.НеОбработанныхСообщенийОбмена > 0 Тогда
		
		Сообщения = Новый Массив();
		
		Если Результат.ОткрытыхЗаданийВОчереди > 0 Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Открытых заданий по документу в очереди заданий: %1'"), 
				Результат.ОткрытыхЗаданийВОчереди);
			Сообщения.Добавить(ТекстСообщения);
		КонецЕсли;
		
		Если Результат.ВыполняющихсяЗаданийВОчереди > 0 Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Выполняющихся заданий по документу в очереди заданий: %1'"), 
				Результат.ВыполняющихсяЗаданийВОчереди);
			Сообщения.Добавить(ТекстСообщения);
		КонецЕсли;
		
		Если Результат.ЗаданийВОчередиСОшибкой > 0 Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Заданий с ошибкой по документу в очереди заданий: %1'"), 
				Результат.ЗаданийВОчередиСОшибкой);
			Сообщения.Добавить(ТекстСообщения);
		КонецЕсли;
		
		Если Результат.НеОбработанныхСообщенийОбмена > 0 Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Не обработано входящих сообщений по документу: %1'"), 
				Результат.НеОбработанныхСообщенийОбмена);
			Сообщения.Добавить(ТекстСообщения);
		КонецЕсли;
		
		Для индекс = 0 По Сообщения.ВГраница() Цикл
			ОбщегоНазначения.СообщитьПользователю(Сообщения[индекс]);
		КонецЦикла;
		
		РегистрыСведений.SUI_ОчередьЗаданий.ОтправитьСлужебноеСообщениеОтложитьТекущееЗадание();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
