
#Область ПрограммныйИнтерфейс

Процедура ДобавитьЗаданиеПостобработкиДокумента_ПроверкаОбработанныхДанных(ПараметрыСозданияЗадания, ДанныеДокумента) Экспорт
	
	ПараметрыПроцедуры = Новый Массив();
	ПараметрыПроцедуры.Добавить(ДанныеДокумента);
	
	SUI_ОчередьЗаданийКлиентСервер.ДобавитьОбработчикВПараметрыСозданияЗадания(
		ПараметрыСозданияЗадания, 
		"SUI_ДокументыОбменаПереопределяемый.ЗаданиеПостобработкиДокумента_ПроверкаОбработанныхДанных",
		ПараметрыПроцедуры);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаданиеПостобработкиДокумента_ПроверкаОбработанныхДанных(ДанныеДокумента) Экспорт
	
	Результат = SUI_ДокументыОбмена.ДокументНуждаетсяВОбработке(ДанныеДокумента.id_doc);
	
	Если Результат.ЕстьАктивныеЗадания Или Результат.ЕстьОшибкаОбработки Тогда
		РегистрыСведений.SUI_ОчередьЗаданий.ОтправитьСлужебноеСообщениеОтложитьТекущееЗадание();
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СообщенияОбменаДанными.Отправитель
		|ИЗ
		|	РегистрСведений.SUI_СообщенияОбменаДанными КАК СообщенияОбменаДанными
		|ГДЕ
		|	СообщенияОбменаДанными.Отправитель В
		|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			ПересчетТоваров.МобильноеУстройство
		|		ИЗ
		|			РегистрСведений.SUI_docs_tbl_goods_delta КАК ПересчетТоваров
		|		ГДЕ
		|			ПересчетТоваров.sid_doc = &ИдентификаторДокументаОбмена)";
	
	Запрос.УстановитьПараметр("ИдентификаторДокументаОбмена", ДанныеДокумента.sid);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		РегистрыСведений.SUI_ОчередьЗаданий.ОтправитьСлужебноеСообщениеОтложитьТекущееЗадание();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
