#Область ПрограммныйИнтерфейс

// Параметры функции КомпоновкаДанныхСервер.ВыгрузитьРезультатСКД
// 
// Параметры:
//  СхемаКомпоновкиДанных - СхемаКомпоновкиДанных - Схема компоновки данных
//  
// Возвращаемое значение:
//  Структура - Структура со свойствами:
//  *СхемаКомпоновкиДанных - Строка - адрес во временном хранилище
//								или полное имя макета, например, Документ.РеализацияТоваровУслуг.ДанныеШаблонаСообщений.
//						- СхемаКомпоновкиДанных - собственно схема компоновки данных.
//  *НастройкиКомпоновкиДанных - Строка - адрес во временном хранилище настроек компоновки или имя варианта настроек компоновки.
//						- НастройкиКомпоновкиДанных - собственно настройки компоновки.
//						- Неопределено - будут применены настройки по умолчанию. 
//  *ПараметрыКомпоновки - Структура - значения параметров компоновки
//  *ОжидаемыеКолонки - ТаблицаЗначений - если колонки, описанные в макете, отключаются по ФО, то
//					в полученной после использования компоновки таблице(дереве) значений они будут отсутствовать,
//					если этот параметр передан, то функция дополнит полученную таблицу(дерево) значений недостающими
//					колонками.
//  *ВыполнятьВПривилегированномРежиме - Булево - значение по умолчанию Ложь.
//  *ТипРезультата - Строка - возможные значения: ""ТаблицаЗначений"", "ДеревоЗначений"", значение по умолчанию ""ТаблицаЗначений"".
//  *ВнешниеНаборыДанных - Структура, Неопределено - внешние наборы компоновки данных,
//									если передана структура, то ключ - наименование внешнего набора,
//									значение - таблица значений внешнего набора.
//  *ВозможностьИспользованияВнешнихФункций - Булево - Указывает возможность использования функции
//														общих модулей конфигурации в выражениях компоновки данных, значение
//														по умолчанию - Истина.
//
//@skip-check doc-comment-parameter-section
Функция ПараметрыРезультатСхемыКомпоновкиДанных(СхемаКомпоновкиДанных = Неопределено, НастройкиКомпоновкиДанных = Неопределено) Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("СхемаКомпоновкиДанных", ?(СхемаКомпоновкиДанных = Неопределено, "", СхемаКомпоновкиДанных));
	Результат.Вставить("НастройкиКомпоновкиДанных", НастройкиКомпоновкиДанных);
	Результат.Вставить("ОжидаемыеКолонки", Новый ТаблицаЗначений);
	Результат.Вставить("ВыполнятьВПривилегированномРежиме", Ложь);
	Результат.Вставить("ВнешниеНаборыДанных", Неопределено);
	Результат.Вставить("ВозможностьИспользованияВнешнихФункций", Истина);
	Результат.Вставить("ТипРезультата", "ТаблицаЗначений");
	
	//@skip-check constructor-function-return-section
	Возврат Результат;
	
КонецФункции

// Возвращает пустую схему СКД
//
// Параметры:
//  ИмяИсточника - Строка - имя источника данных новой схемы компоновки (необязательное по умолчанию "ИсточникДанных1")
//  ТипИсточника - Строка - тип источника данных новой схему компоновки данных (необязательное по умолчанию "Local").
//
// Возвращаемое значение:
//  СхемаКомпоновкиДанных - пустая схема компоновки данных.
//
Функция ПустаяСхема(ИмяИсточника = "ИсточникДанных1", ТипИсточника = "Local") Экспорт
	
	НоваяСхема = Новый СхемаКомпоновкиДанных;

	ИсточникДанных = НоваяСхема.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя = ИмяИсточника;
	ИсточникДанных.ТипИсточникаДанных = ТипИсточника;
	
	Возврат НоваяСхема;
	
КонецФункции

// Возвращает схему СКД с набором данных типа НаборДанныхЗапросСхемыКомпоновкиДанных
//
// Параметры:
// 	Запрос - Запрос, Строка - Запрос набора.
//  ИмяНабора - Строка - имя нового набора (необязательное по умолчанию "НаборДанных1")
//  ИмяИсточника - Строка - имя источника данных новой схемы компоновки (необязательное по умолчанию "ИсточникДанных1")
//  ИмяОбъекта - Строка - имя внешнего источника данных (необязательное по умолчанию равно имени набора данных).
//  ТипИсточника - Строка - тип источника данных новой схему компоновки данных (необязательное по умолчанию "Local").
//  ДобавитьГруппировку - Булево - Добавить группировку компоновки данных
//
// Возвращаемое значение:
//  СхемаКомпоновкиДанных - пустая схема компоновки данных.
//
//@skip-check method-too-many-params
Функция СхемаНаборДанныхЗапрос(Запрос, ИмяНабора = "НаборДанных1", ИмяИсточника = "ИсточникДанных1", ИмяОбъекта = "", 
	ТипИсточника = "Local", ДобавитьГруппировку = Истина) Экспорт
	
	НоваяСхема = ПустаяСхема(ИмяИсточника, ТипИсточника);

	ДобавитьНаборДанныхЗапрос(НоваяСхема, Запрос, ИмяНабора, ИмяИсточника, ИмяОбъекта);
	
	Если ДобавитьГруппировку Тогда
		ДобавитьГруппировкуКомпоновкиДанных(НоваяСхема);
	КонецЕсли;
	
	Возврат НоваяСхема;
	
КонецФункции

// Возвращается независимую копию исходной схемы компоновки данных
//
// Параметры:
//  ИсходнаяСхема - СхемаКомпоновкиДанных - схема, которую требуется скопировать.
//
// Возвращаемое значение:
//  СхемаКомпоновкиДанных - новая схема компоновки данных с настройками, идентичными исходной схеме.
//
Функция СкопироватьСхемуКомпоновкиДанных(ИсходнаяСхема) Экспорт
	
	Если ТипЗнч(ИсходнаяСхема) = Тип("СхемаКомпоновкиДанных") Тогда
		
		СхемаКомпоновкиДанных = СериализаторXDTO.ПрочитатьXDTO(СериализаторXDTO.ЗаписатьXDTO(ИсходнаяСхема));
		
	Иначе
		
		СхемаКомпоновкиДанных = Новый СхемаКомпоновкиДанных;
		
	КонецЕсли;
	
	Возврат СхемаКомпоновкиДанных;
	
КонецФункции

Функция ВыгрузитьРезультатСхемыКомпоновкиДанных(Параметры, АдресВременногоХранилища = "") Экспорт
	
	Если Параметры.ВыполнятьВПривилегированномРежиме Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	СхемаКомпоновкиДанных = СхемаКомпоновкиДанныхПоПараметру(Параметры.СхемаКомпоновкиДанных);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,
		НастройкиКомпоновкиДанныхПоПараметру(СхемаКомпоновкиДанных, Параметры.НастройкиКомпоновкиДанных),,,
		Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	Если Параметры.ВнешниеНаборыДанных = Неопределено Тогда
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,,,Параметры.ВозможностьИспользованияВнешнихФункций);
	Иначе
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,
			Параметры.ВнешниеНаборыДанных,,
			Параметры.ВозможностьИспользованияВнешнихФункций);
	КонецЕсли;
	
	Если Параметры.ТипРезультата = "ТаблицаЗначений" Тогда
		РезультирующаяТаблица = Новый ТаблицаЗначений;
	ИначеЕсли Параметры.ТипРезультата = "ДеревоЗначений" Тогда
		РезультирующаяТаблица = Новый ДеревоЗначений;
	Иначе
		ТекстИсключения = НСтр("ru = 'Неизвестный тип результата %ТипРезультата%'");
		ТекстИсключения = СтрЗаменить(ТекстИсключения, "%ТипРезультата%", Параметры.ТипРезультата);
	КонецЕсли;
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(РезультирующаяТаблица);	
	РезультирующаяТаблица = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Если Параметры.ВыполнятьВПривилегированномРежиме Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Если Параметры.Свойство("ОжидаемыеКолонки") И ТипЗнч(Параметры.ОжидаемыеКолонки) = Тип("ТаблицаЗначений") Тогда
		
		Для Каждого Колонка Из Параметры.ОжидаемыеКолонки.Колонки Цикл
			
			Если РезультирующаяТаблица.Колонки.Найти(Колонка.Имя) = Неопределено Тогда
				РезультирующаяТаблица.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения, Колонка.Заголовок);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;

	Если ЭтоАдресВременногоХранилища(АдресВременногоХранилища) Тогда
		ПоместитьВоВременноеХранилище(РезультирующаяТаблица, АдресВременногоХранилища);
		Возврат АдресВременногоХранилища;
	Иначе
		Возврат РезультирующаяТаблица;
	КонецЕсли;
	
КонецФункции

// Добавляет новый набор данных заданного типа и возвращает ссылку на него
//
// Параметры:
//  СхемаНабор - СхемаКомпоновкиДанных -
//  			- НаборыДанныхСхемыКомпоновкиДанных -
//  			- НаборДанныхОбъединениеСхемыКомпоновкиДанных - схема или набор компоновки данных, в которой необходимо создать новый набор.
//  ТипНабора - Тип - Тип нового набора (необязательное по умолчанию "НаборДанныхЗапросСхемыКомпоновкиДанных")
//  					Тип("НаборДанныхЗапросСхемыКомпоновкиДанных")
//  					Тип("НаборДанныхОбъектСхемыКомпоновкиДанных").
//  ИмяНабора - Строка - имя нового набора (необязательное по умолчанию "НаборДанных1")
//  ИмяИсточника - Строка - имя источника данных новой схемы компоновки (необязательное по умолчанию "ИсточникДанных1")
//  ИмяОбъекта - Строка - имя внешнего источника данных (необязательное по умолчанию равно имени набора данных).
//
// Возвращаемое значение:
//  НаборДанныхЗапросСхемыКомпоновкиДанных, НаборДанныхОбъединениеСхемыКомпоновкиДанных, НаборДанныхОбъектСхемыКомпоновкиДанных - новый набор данных заданного типа.
//
//@skip-check method-too-many-params
Функция ДобавитьПустойНаборДанных(СхемаНабор, ТипНабора = Неопределено, ИмяНабора = "НаборДанных1", ИмяИсточника = "ИсточникДанных1", ИмяОбъекта = "") Экспорт
	
	Если ТипНабора = Неопределено Тогда
		ТипНабора = Тип("НаборДанныхЗапросСхемыКомпоновкиДанных");
	КонецЕсли;
	
	Если ТипЗнч(СхемаНабор) = Тип("СхемаКомпоновкиДанных") Тогда
		
		НаборыДанных = СхемаНабор.НаборыДанных;
		
	ИначеЕсли ТипЗнч(СхемаНабор) = Тип("НаборыДанныхСхемыКомпоновкиДанных") Тогда
		
		НаборыДанных = СхемаНабор;
		
	ИначеЕсли ТипЗнч(СхемаНабор) = Тип("НаборДанныхОбъединениеСхемыКомпоновкиДанных") Тогда
		
		НаборыДанных = СхемаНабор.Элементы;
		
	КонецЕсли;
	
	НовыйНабор = НаборыДанных.Добавить(ТипНабора);
	
	НовыйНабор.Имя = ИмяНабора;
	Если Не ТипНабора = Тип("НаборДанныхОбъединениеСхемыКомпоновкиДанных")
		И ЗначениеЗаполнено(ИмяИсточника) Тогда
		
		НовыйНабор.ИсточникДанных = ИмяИсточника;
		
	КонецЕсли;
	
	Если ТипНабора = Тип("НаборДанныхОбъектСхемыКомпоновкиДанных") Тогда
		НовыйНабор.ИмяОбъекта = ?(ЗначениеЗаполнено(ИмяОбъекта), ИмяОбъекта, ИмяНабора);
	КонецЕсли;
		
	Возврат НовыйНабор;
	
КонецФункции

// Добавляет новый набор данных заданного типа и возвращает ссылку на него
//
// Параметры:
//  СхемаНабор - СхемаКомпоновкиДанных -
//  			- НаборыДанныхСхемыКомпоновкиДанных -
//  			- НаборДанныхОбъединениеСхемыКомпоновкиДанных - схема или набор компоновки данных, в которой необходимо создать новый набор.
//  Запрос - Запрос, Строка - Запрос набора.
//  ИмяНабора - Строка - имя нового набора (необязательное по умолчанию "НаборДанных1")
//  ИмяИсточника - Строка - имя источника данных новой схемы компоновки (необязательное по умолчанию "ИсточникДанных1")
//  ИмяОбъекта - Строка - имя внешнего источника данных (необязательное по умолчанию равно имени набора данных).
//
// Возвращаемое значение:
//  НаборДанныхЗапросСхемыКомпоновкиДанных, НаборДанныхОбъединениеСхемыКомпоновкиДанных, НаборДанныхОбъектСхемыКомпоновкиДанных - новый набор данных заданного типа.
//
//@skip-check method-too-many-params
Функция ДобавитьНаборДанныхЗапрос(СхемаНабор, Запрос, ИмяНабора = "НаборДанных1", ИмяИсточника = "ИсточникДанных1", ИмяОбъекта = "") Экспорт
	
	НаборДанных = ДобавитьПустойНаборДанных(СхемаНабор, , ИмяНабора, ИмяИсточника, ИмяОбъекта);
	
	Если ТипЗнч(Запрос) = Тип("Запрос") Тогда
		НаборДанных.Запрос = Запрос.Текст;
	ИначеЕсли ТипЗнч(Запрос) = Тип("Строка") Тогда
		НаборДанных.Запрос = Запрос;
	КонецЕсли;

	Возврат НаборДанных;
	
КонецФункции

Функция ДобавитьГруппировкуКомпоновкиДанных(СхемаКомпоновкиДанных) Экспорт
	
	ГруппировкаКомпоновкиДанных = СхемаКомпоновкиДанных.НастройкиПоУмолчанию.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	
	ГруппировкаКомпоновкиДанных.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	ГруппировкаКомпоновкиДанных.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
	ГруппировкаКомпоновкиДанных.Использование = Истина;
    
	Возврат ГруппировкаКомпоновкиДанных;
	
КонецФункции

//@skip-check method-too-many-params
//@skip-check doc-comment-parameter-section
Процедура ДобавитьПолеВыбораСхемыКомпоновкиДанных(СхемаКомпоновкиДанных, ИмяПоля, ПутьКДанным = Неопределено, 
	ТипЗначенияПоля = Неопределено, ЗаголовокПоля = Неопределено, ИмяНабораДанных = Неопределено) Экспорт
	
	Если СхемаКомпоновкиДанных.НаборыДанных.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИмяНабораДанных) Тогда
		
		НаборДанных = СхемаКомпоновкиДанных.НаборыДанных.Найти(ИмяНабораДанных);
		
		Если НаборДанных = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
	Иначе
		НаборДанных = СхемаКомпоновкиДанных.НаборыДанных[0];
	КонецЕсли;

	ПолеСКД = НаборДанных.Поля.Найти(ИмяПоля);
	
	Если ПолеСКД = Неопределено Тогда
		ПолеСКД = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	КонецЕсли;
	
	ПолеСКД.Поле = ИмяПоля;
	ПолеСКД.ПутьКДанным = ?(ЗначениеЗаполнено(ПутьКДанным), ПутьКДанным, ИмяПоля);
	
	Если ТипЗнч(ТипЗначенияПоля) = Тип("ОписаниеТипов") Тогда
		ПолеСКД.ТипЗначения = ТипЗначенияПоля;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗаголовокПоля) Тогда
		ПолеСКД.Заголовок = ЗаголовокПоля;
	КонецЕсли;

	ВыбранноеПоле = СхемаКомпоновкиДанных.ВариантыНастроек[0].Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных(ПолеСКД.ПутьКДанным);
	ВыбранноеПоле.Использование = Истина;
	
КонецПроцедуры

// Добавляет или перезаполняет свойства параметра в схеме компоновки данных
// 
// Параметры:
//	СхемаКомпоновкиДанных - СхемаКомпоновкиДанных - схема, в которую нужно добавить параметры или найти и перезаполнить свойства.
//	ИмяПараметра - Строка - имя параметра.
//	ТипЗначения - Тип, Неопределено - тип значений параметра.
//	Значение - Произвольный, Неопределено - значение по умолчанию.
//	ИспользованиеВсегда - Булево - Истина, тогда параметры будет использоваться всегда. Ложь - автоматическое управление платформой.
//	ПерезаполнитьСуществующий - Булево - Истина, перед добавлением будет осуществляться поиск параметра с заданным именем.
//		Внимание, операция ресурсоемкая и следует включать только если нельзя проверить уникальность параметров иначе.
//
// Возвращаемое значение:
//	ПараметрКомпоновкиДанных - созданный или перезаполненный параметр.
// 
//@skip-check method-too-many-params
Функция ДобавитьПараметр(СхемаКомпоновкиДанных, ИмяПараметра, ТипЗначения = Неопределено, Значение = Неопределено, ИспользованиеВсегда = Истина, ПерезаполнитьСуществующий = Ложь) Экспорт
	
	Перем Параметр;
	
	Если Не ПерезаполнитьСуществующий Тогда
		Параметр = СхемаКомпоновкиДанных.Параметры.Добавить();
	Иначе
		
		Параметр = СхемаКомпоновкиДанных.Параметры.Найти(ИмяПараметра);
		ПараметрСуществует = Параметр <> Неопределено;
		
		Если Не ПараметрСуществует Тогда
			Параметр = СхемаКомпоновкиДанных.Параметры.Добавить();
		КонецЕсли;
		
	КонецЕсли;
	
	Параметр.Имя = ИмяПараметра;
	Если ТипЗначения <> Неопределено Тогда
		Параметр.ТипЗначения = ТипЗначения;
	КонецЕсли;
	
	Если Значение <> Неопределено Тогда
		Параметр.Значение = Значение;
	КонецЕсли;
	
	Параметр.Использование = ?(ИспользованиеВсегда,
								ИспользованиеПараметраКомпоновкиДанных.Всегда,
								ИспользованиеПараметраКомпоновкиДанных.Авто);
	
	Возврат Параметр;
	
КонецФункции

Процедура ИнициализироватьКомпоновщикНастроек(КомпоновщикНастроек, Знач СхемаКомпоновкиДанных, 
	Знач НастройкиКомпоновки = Неопределено, СпособВосстановленияНастроек = Неопределено) Экспорт
	
	СхемаКомпоновкиДанных = СхемаКомпоновкиДанныхПоПараметру(СхемаКомпоновкиДанных);
	
	URLСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор());
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(URLСхемы);
	КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
	
	НастройкиКомпоновки = НастройкиКомпоновкиДанныхПоПараметру(СхемаКомпоновкиДанных, НастройкиКомпоновки); 
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКомпоновки);
	
	Если ТипЗнч(СпособВосстановленияНастроек) = Тип("СпособВосстановленияНастроекКомпоновкиДанных") Тогда
		КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроек);
	Иначе
		КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	КонецЕсли;
	
КонецПроцедуры

Функция СхемаКомпоновкиДанныхПоПараметру(Знач СхемаКомпоновкиДанных) Экспорт
	
	ТипЗначенияСхемы = ТипЗнч(СхемаКомпоновкиДанных);
	
	Если ТипЗначенияСхемы = Тип("ХранилищеЗначения") Тогда
		СхемаКомпоновкиДанных = СхемаКомпоновкиДанных.Получить();
		ТипЗначенияСхемы = ТипЗнч(СхемаКомпоновкиДанных);
	КонецЕсли;
	
	Если ТипЗначенияСхемы = Тип("Строка") Тогда
		
		Если ЭтоАдресВременногоХранилища(СхемаКомпоновкиДанных) Тогда
			
			СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(СхемаКомпоновкиДанных);
			
			Если ТипЗнч(СхемаКомпоновкиДанных) <> Тип("СхемаКомпоновкиДанных") Тогда
				ТекстИсключения = НСтр("ru = 'По переданному адресу временного хранилища не удалось получить схему компоновки данных.'");
				ВызватьИсключение ТекстИсключения;
			КонецЕсли;
			
			Возврат СхемаКомпоновкиДанных;
		
		Иначе
			ТекстИсключения = СтрШаблон(НСтр("ru = 'Неподдерживаемый тип параметра ""%1""'"), "СхемаКомпоновки");
			ВызватьИсключение ТекстИсключения;
		КонецЕсли;
		
	ИначеЕсли ТипЗначенияСхемы = Тип("СхемаКомпоновкиДанных") Тогда
		Возврат СхемаКомпоновкиДанных;
	Иначе
		ТекстИсключения = СтрШаблон(НСтр("ru = 'Неподдерживаемый тип параметра ""%1""'"), "СхемаКомпоновки");
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
КонецФункции

Функция НастройкиКомпоновкиДанныхПоПараметру(СхемаКомпоновкиДанных, Знач НастройкиКомпоновкиДанныхи) Экспорт
	
	ТипЗначенияНастроек = ТипЗнч(НастройкиКомпоновкиДанныхи);
	
	Если ТипЗначенияНастроек = Тип("ХранилищеЗначения") Тогда
		НастройкиКомпоновкиДанныхи = НастройкиКомпоновкиДанныхи.Получить();
		ТипЗначенияНастроек = ТипЗнч(НастройкиКомпоновкиДанныхи);
	КонецЕсли;
	
	Если ТипЗначенияНастроек = Тип("Строка") Тогда
		
		Если ЭтоАдресВременногоХранилища(НастройкиКомпоновкиДанныхи) Тогда
			
			НастройкиКомпоновкиДанныхи = ПолучитьИзВременногоХранилища(НастройкиКомпоновкиДанныхи);
			
			Если ТипЗнч(НастройкиКомпоновкиДанныхи) <> Тип("НастройкиКомпоновкиДанных") Тогда
				ТекстИсключения = НСтр("ru = 'По переданному адресу временного хранилища не удалось получить настройки компоновки данных.'");
				ВызватьИсключение ТекстИсключения;
			КонецЕсли;
			
			Возврат НастройкиКомпоновкиДанныхи;
			
		ИначеЕсли Не ПустаяСтрока(НастройкиКомпоновкиДанныхи) Тогда
			
			Возврат СхемаКомпоновкиДанных.ВариантыНастроек[НастройкиКомпоновкиДанныхи].Настройки;
			
		Иначе
			Возврат СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
		КонецЕсли;
		
	ИначеЕсли ТипЗначенияНастроек = Тип("НастройкиКомпоновкиДанных") Тогда		
		
		Возврат НастройкиКомпоновкиДанныхи;
		
	Иначе 
		
		Возврат СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
		
	КонецЕсли;
	
КонецФункции

// Добавляет отбор для сравнения со списком значений, выгруженных из указанной колонки таблицы.
// 
// Параметры:
//	ЭлементНастроекКомпоновки - КомпоновщикНастроекКомпоновкиДанных, НастройкиКомпоновкиДанных - элемент структуры компоновки данных
//	ТаблицаДанных - ТаблицаЗначений - таблица с данными
//	ИмяКолонки - Строка - имя колонки, со значениями которой будут сравнение в отборе.
//
Процедура ДобавитьОтборПоКолонкеТаблицыЗначений(ЭлементНастроекКомпоновки, ТаблицаДанных, ИмяКолонки) Экспорт
	
	Перем МассивЗначенийОтбора, СписокЗначений;
	
	МассивЗначенийОтбора = ТаблицаДанных.ВыгрузитьКолонку(ИмяКолонки);
	МассивЗначенийОтбора = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивЗначенийОтбора);
	
	Если Не (МассивЗначенийОтбора.Количество() = 1 
		И ТипЗнч(МассивЗначенийОтбора[0]) = Тип("Null")) Тогда
		СписокЗначений = Новый СписокЗначений;
		СписокЗначений.ЗагрузитьЗначения(МассивЗначенийОтбора);
		
		SUI_КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(ЭлементНастроекКомпоновки,
			ИмяКолонки,
			СписокЗначений,
			ВидСравненияКомпоновкиДанных.ВСписке);
	КонецЕсли;

КонецПроцедуры

// Создает новую связь наборов данных в переданной схеме.
// Возвращает объект созданной связи.
//
// Параметры:
// 	СхемаКомпоновкиДанных - СхемаКомпоновкиДанных - схема, в которую нужно добавить связь.
// 	НаборДанныхИсточник - Строка -
//							- НаборДанныхОбъединениеСхемыКомпоновкиДанных -
//							- НаборДанныхЗапросСхемыКомпоновкиДанных -
//							- НаборДанныхОбъектСхемыКомпоновкиДанных - имя набора данных, от которого будет осуществляться связь.
// 	НаборДанныхПриемник - Строка -
//							- НаборДанныхОбъединениеСхемыКомпоновкиДанных -
//							- НаборДанныхЗапросСхемыКомпоновкиДанных -
//							- НаборДанныхОбъектСхемыКомпоновкиДанных - имя набора данных, к которому будет осуществляться связь.
// 	ВыражениеИсточник - Строка - выражение, по которому будет определяться значение связи источника.
// 	ВыражениеПриемник - Строка - выражение, по которому будет определяться значение связи приемника.
// 	Параметр - Строка - имя параметра, в который будет помещено значение связи источника.
// 	РазрешенСписокПараметров - Булево - возможность использования в качестве значения параметра список значений.
//
// Возвращаемое значение:
// 	СвязьНаборовДанныхСхемыКомпоновкиДанных - добавленная связь.
//
Функция ДобавитьСвязьНаборовДанных(СхемаКомпоновкиДанных, НаборДанныхИсточник, НаборДанныхПриемник, ВыражениеИсточник, ВыражениеПриемник, Параметр = Неопределено, РазрешенСписокПараметров = Ложь) Экспорт
	
	Перем НоваяСвязь;
	
	Если ТипЗнч(НаборДанныхИсточник) = Тип("Строка") Тогда
		ИмяНабораДанныхИсточника = НаборДанныхИсточник;
	ИначеЕсли ТипЗнч(НаборДанныхИсточник) = Тип("НаборДанныхЗапросСхемыКомпоновкиДанных")
		Или ТипЗнч(НаборДанныхИсточник) = Тип("НаборДанныхОбъектСхемыКомпоновкиДанных")
		Или ТипЗнч(НаборДанныхИсточник) = Тип("НаборДанныхОбъединениеСхемыКомпоновкиДанных") Тогда
		ИмяНабораДанныхИсточника = НаборДанныхИсточник.Имя;
	Иначе 
		ВызватьИсключение НСтр("ru= 'Некорректный тип параметра 2'") ;
	КонецЕсли;
	
	Если ТипЗнч(НаборДанныхПриемник) = Тип("Строка") Тогда
		ИмяНабораДанныхПриемника = НаборДанныхПриемник;
	ИначеЕсли ТипЗнч(НаборДанныхПриемник) = Тип("НаборДанныхЗапросСхемыКомпоновкиДанных")
		Или ТипЗнч(НаборДанныхПриемник) = Тип("НаборДанныхОбъектСхемыКомпоновкиДанных")
		Или ТипЗнч(НаборДанныхПриемник) = Тип("НаборДанныхОбъединениеСхемыКомпоновкиДанных") Тогда
		ИмяНабораДанныхПриемника = НаборДанныхПриемник.Имя;
	Иначе 
		ВызватьИсключение НСтр("ru= 'Некорректный тип параметра 3'") ;
	КонецЕсли;
	
	НоваяСвязь = СхемаКомпоновкиДанных.СвязиНаборовДанных.Добавить();
	НоваяСвязь.НаборДанныхИсточник = ИмяНабораДанныхИсточника;
	НоваяСвязь.НаборДанныхПриемник = ИмяНабораДанныхПриемника;
	НоваяСвязь.ВыражениеИсточник = ВыражениеИсточник;
	НоваяСвязь.ВыражениеПриемник = ВыражениеПриемник;
	Если ЗначениеЗаполнено(Параметр) Тогда
		НоваяСвязь.Параметр = Параметр;
		НоваяСвязь.РазрешенСписокПараметров = РазрешенСписокПараметров;
	КонецЕсли;
	
	Возврат НоваяСвязь;
	
КонецФункции

// Получить выражения элементов отбора.
// 
// Параметры:
//  НастройкиКомпоновкиДанных - НастройкиКомпоновкиДанных - Настройки компоновки данныхи
//  Параметры - Структура, Неопределено - Структура параметров
//  ИмяТаблицы - Строка - Используемое имя таблицы
// 
// Возвращаемое значение:
//  Структура - Структура выражений элементов отбора
//		* Выражения - Массив - Массив выражений
//		* Параметры - Структура - Структура параметров
//@skip-check doc-comment-field-in-description-suggestion
Функция ПолучитьВыраженияЭлементовОтбора(НастройкиКомпоновкиДанных, Параметры = Неопределено, ИмяТаблицы = "") Экспорт
	
	Если ТипЗнч(НастройкиКомпоновкиДанных) <> Тип("НастройкиКомпоновкиДанных") Тогда
		ВызватьИсключение НСтр("ru = 'Не переданы настройки компоновки данных'");	
	КонецЕсли;
	
	СтруктураВыражений = Новый Структура("Выражения, Параметры", Новый Массив(), Параметры);
	
	Если ТипЗнч(СтруктураВыражений.Параметры) <> Тип("Структура") Тогда
		СтруктураВыражений.Параметры = Новый Структура();
	КонецЕсли;

	Для Индекс = 0 По НастройкиКомпоновкиДанных.Отбор.Элементы.Количество() - 1 Цикл
		
		Выражение = СформироватьВыражениеЭлементаОтбора(НастройкиКомпоновкиДанных.Отбор.Элементы[Индекс], СтруктураВыражений.Параметры, ИмяТаблицы);
		
		Если Не ЗначениеЗаполнено(Выражение) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Индекс = 0 Тогда
			СтруктураВыражений.Выражения.Добавить(Выражение);	
		Иначе
			СтруктураВыражений.Выражения.Добавить("И " + Выражение);
		КонецЕсли;

	КонецЦикла;
	
	Возврат СтруктураВыражений;
	
КонецФункции

// Получает и возвращает макет компоновки данных для схемы компоновки
//
// Параметры:
//  СхемаКомпоновки - СхемаКомпоновкиДанных - для которой получается макет компоновки
//  Настройки - НастройкиКомпоновкиДанных - применяются к схеме.
//
// Возвращаемое значение:
//	МакетКомпоновкиДанных - макет, скомпилированный из схемы и настроек.
//
Функция ПолучитьМакетКомпоновки(СхемаКомпоновки, Настройки) Экспорт

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;

	Возврат КомпоновщикМакета.Выполнить(СхемаКомпоновки, Настройки,,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

КонецФункции

// Получает и возвращает запрос из переданного макета компоновки данных
//
// Параметры:
//  Макет - МакетКомпоновкиДанных - макет, из которого требуется получить запрос.
//  ИмяНабораДанных - Строка - имя набора данных из макета, для которого получается запрос.
//
// Возвращаемое значение:
//	Строка - запрос, сформированный на основании макета компоновки.
//
Функция ПолучитьЗапросИзМакетаКомпоновки(Макет, ИмяНабораДанных) Экспорт

	Запрос = Новый Запрос(Макет.НаборыДанных[ИмяНабораДанных].Запрос);

	Для Каждого Параметр Из Макет.ЗначенияПараметров Цикл
		Запрос.УстановитьПараметр(Параметр.Имя, Параметр.Значение);
	КонецЦикла;

	Возврат Запрос;

КонецФункции

// Добавляет выбранное поле компоновки данных.
//
// Параметры:
//   Куда - КомпоновщикНастроекКомпоновкиДанных
//        - НастройкиКомпоновкиДанных
//        - ВыбранныеПоляКомпоновкиДанных -
//       Коллекция в которую требуется добавить выбранное поле.
//   ИмяИлиПолеКД - Строка
//                - ПолеКомпоновкиДанных - имя поля.
//   Заголовок    - Строка - представление поля.
//
// Возвращаемое значение:
//   ВыбранноеПолеКомпоновкиДанных - добавленное выбранное поле.
//
Функция ДобавитьВыбранноеПоле(Куда, ИмяИлиПолеКД, Заголовок = "") Экспорт
	
	Если ТипЗнч(Куда) = Тип("КомпоновщикНастроекКомпоновкиДанных") Тогда
		ВыбранныеПоляКД = Куда.Настройки.Выбор;
	ИначеЕсли ТипЗнч(Куда) = Тип("НастройкиКомпоновкиДанных") Тогда
		ВыбранныеПоляКД = Куда.Выбор;
	Иначе
		ВыбранныеПоляКД = Куда;
	КонецЕсли;
	
	Если ТипЗнч(ИмяИлиПолеКД) = Тип("Строка") Тогда
		ПолеКД = Новый ПолеКомпоновкиДанных(ИмяИлиПолеКД);
	Иначе
		ПолеКД = ИмяИлиПолеКД;
	КонецЕсли;
	
	ВыбранноеПолеКД = ВыбранныеПоляКД.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПолеКД.Поле = ПолеКД;
	Если Заголовок <> "" Тогда
		ВыбранноеПолеКД.Заголовок = Заголовок;
	КонецЕсли;
	
	Возврат ВыбранноеПолеКД;
	
КонецФункции

Функция ДобавитьВычисляемоеПоле(Схема, ПутьКДанным, Выражение, Заголовок = "") Экспорт
	
	ВычисляемоеПоле = Схема.ВычисляемыеПоля.Добавить();
	ВычисляемоеПоле.ПутьКДанным = ПутьКДанным;
	ВычисляемоеПоле.Выражение = Выражение;
	ВычисляемоеПоле.Заголовок = ?(ПустаяСтрока(Заголовок), ВычисляемоеПоле.ПутьКДанным, Заголовок);
	
	Возврат ВычисляемоеПоле;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СкопироватьНастройкиОтбораСхемыКомпоновкиДанных(Источник, Приемник)
	
	Для Каждого ЭлементОтбора Из Источник Цикл
		 
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			ЗаполнитьЗначенияСвойств(Приемник.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")), ЭлементОтбора);
		Иначе
			НоваяГруппа = Приемник.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ЗаполнитьЗначенияСвойств(НоваяГруппа, ЭлементОтбора);
			СкопироватьНастройкиОтбораСхемыКомпоновкиДанных(ЭлементОтбора.Элементы, НоваяГруппа.Элементы);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

// Сформировать выражение элемента отбора.
// 
// Параметры:
//  ЭлементОтбора - ЭлементОтбораКомпоновкиДанных, ГруппаЭлементовОтбораКомпоновкиДанных - Элемент отбора
//  Параметры - Структура - Параметры
//  ИмяТаблицы - Строка - Имя таблицы
//  ДобавитьОперациюСравнения - Строка - Добавить операцию сравнения
// 
// Возвращаемое значение:
//  Строка - Выражение элемента отбора
Функция СформироватьВыражениеЭлементаОтбора(ЭлементОтбора, Параметры, ИмяТаблицы, ДобавитьОперациюСравнения = "")
	
	ВыражениеЭлементаОтбора = "";
	
	Если ТипЗнч(ЭлементОтбора) <> Тип("ЭлементОтбораКомпоновкиДанных") И
		ТипЗнч(ЭлементОтбора) <> Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
		Возврат "ИСТИНА";
	КонецЕсли;
	
	Если Не ЭлементОтбора.Использование Тогда
		Возврат "ИСТИНА";	
	КонецЕсли;
	
	Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
	
		Если ЭлементОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ Или
			ЭлементОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаНе Тогда
			ВыражениеОбъединенияВГруппе = Символы.ПС + " И ";
		ИначеЕсли ЭлементОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли Тогда
			ВыражениеОбъединенияВГруппе = Символы.ПС + " ИЛИ ";
		КонецЕсли;
		
		Если ЭлементОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаНе Тогда			
			ВыражениеЭлементаОтбора = ДобавитьОперациюСравнения + "НЕ (";		
		Иначе
			ВыражениеЭлементаОтбора = ДобавитьОперациюСравнения + "(";		
		КонецЕсли;
		
		Для Каждого ЭлементВГруппе Из ЭлементОтбора.Элементы Цикл			
		
			Если ЭлементОтбора.Элементы.Индекс(ЭлементВГруппе) > 0 Тогда								
				ВыражениеЭлементаОтбора = ВыражениеЭлементаОтбора + ВыражениеОбъединенияВГруппе + СформироватьВыражениеЭлементаОтбора(ЭлементВГруппе, Параметры, ИмяТаблицы, ВыражениеОбъединенияВГруппе);
			Иначе
				ВыражениеЭлементаОтбора = ВыражениеЭлементаОтбора + СформироватьВыражениеЭлементаОтбора(ЭлементВГруппе, Параметры, ИмяТаблицы);
			КонецЕсли;	
			
		КонецЦикла;
		
		ВыражениеЭлементаОтбора = ВыражениеЭлементаОтбора + ")";
		
	Иначе
		
		Если ЗначениеЗаполнено(ИмяТаблицы) И Прав(ИмяТаблицы, 1) <> "." Тогда
			ИмяТаблицы = ИмяТаблицы + ".";
		КонецЕсли;
		
		ИмяПараметра = "П" + Формат(Параметры.Количество() + 1, "ЧДЦ=0; ЧГ=0");
		
		Если ТипЗнч(ЭлементОтбора.ПравоеЗначение) = Тип("СтандартнаяДатаНачала") Тогда
			ПравоеЗначение = Дата(ЭлементОтбора.ПравоеЗначение);
		Иначе
			ПравоеЗначение = ЭлементОтбора.ПравоеЗначение;
		КонецЕсли;
		
		Если ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше Тогда
			ВыражениеЭлементаОтбора = ИмяТаблицы + Строка(ЭлементОтбора.ЛевоеЗначение) + " > &" + ИмяПараметра;
			Параметры.Вставить(ИмяПараметра, ПравоеЗначение);
		ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно Тогда
			ВыражениеЭлементаОтбора = ИмяТаблицы + Строка(ЭлементОтбора.ЛевоеЗначение) + " >= &" + ИмяПараметра;
			Параметры.Вставить(ИмяПараметра, ПравоеЗначение);
		ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Или
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
			ВыражениеЭлементаОтбора = ИмяТаблицы + Строка(ЭлементОтбора.ЛевоеЗначение) + " В ИЕРАРХИИ (&" + ИмяПараметра + ") ";
			Параметры.Вставить(ИмяПараметра, ПравоеЗначение);
		ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке Тогда
			ВыражениеЭлементаОтбора = ИмяТаблицы + Строка(ЭлементОтбора.ЛевоеЗначение) + " В (&" + ИмяПараметра + ") ";
			Параметры.Вставить(ИмяПараметра, ПравоеЗначение);		
		ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда    
			ВыражениеЭлементаОтбора = " НЕ (" + ИмяТаблицы + Строка(ЭлементОтбора.ЛевоеЗначение) + " ЕСТЬ NULL 
				|ИЛИ " + ИмяТаблицы + Строка(ЭлементОтбора.ЛевоеЗначение) + " = 0 
				|ИЛИ " + ИмяТаблицы + Строка(ЭлементОтбора.ЛевоеЗначение) + " = " + Символ(34) + Символ(34) + " 
				|ИЛИ " + ИмяТаблицы + Строка(ЭлементОтбора.ЛевоеЗначение) + " = ДАТАВРЕМЯ(1, 1, 1))";		
		ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда    
			ВыражениеЭлементаОтбора = " (" + ИмяТаблицы + Строка(ЭлементОтбора.ЛевоеЗначение) + " ЕСТЬ NULL 
				|ИЛИ " + ИмяТаблицы + Строка(ЭлементОтбора.ЛевоеЗначение) + " = 0 
				|ИЛИ " + ИмяТаблицы + Строка(ЭлементОтбора.ЛевоеЗначение) + " = " + Символ(34) + Символ(34) + " 
				|ИЛИ " + ИмяТаблицы + Строка(ЭлементОтбора.ЛевоеЗначение) + " = ДАТАВРЕМЯ(1, 1, 1))";
		ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше Тогда
			ВыражениеЭлементаОтбора = ИмяТаблицы + Строка(ЭлементОтбора.ЛевоеЗначение) + " < &" + ИмяПараметра;
			Параметры.Вставить(ИмяПараметра, ПравоеЗначение);
		ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно Тогда
			ВыражениеЭлементаОтбора = ИмяТаблицы + Строка(ЭлементОтбора.ЛевоеЗначение) + " <= &" + ИмяПараметра;
			Параметры.Вставить(ИмяПараметра, ПравоеЗначение);
		ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НачинаетсяС Тогда
			ВыражениеЭлементаОтбора = ИмяТаблицы + Строка(ЭлементОтбора.ЛевоеЗначение) + " ПОДОБНО &" + ИмяПараметра;
			Параметры.Вставить(ИмяПараметра, ПравоеЗначение + "%");
		ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеНачинаетсяС Тогда
			ВыражениеЭлементаОтбора = ИмяТаблицы + Строка(ЭлементОтбора.ЛевоеЗначение) + " НЕ ПОДОБНО &" + ИмяПараметра;
			Параметры.Вставить(ИмяПараметра, ПравоеЗначение + "%");		
		ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Или
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
			ВыражениеЭлементаОтбора = "НЕ " + ИмяТаблицы + Строка(ЭлементОтбора.ЛевоеЗначение) + " В ИЕРАРХИИ (&" + ИмяПараметра + ")";
			Параметры.Вставить(ИмяПараметра, ПравоеЗначение);
		ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке Тогда
			ВыражениеЭлементаОтбора = "НЕ " + ИмяТаблицы + Строка(ЭлементОтбора.ЛевоеЗначение) + " В (&" + ИмяПараметра + ")";
			Параметры.Вставить(ИмяПараметра, ПравоеЗначение);
		ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Подобно Тогда
			ВыражениеЭлементаОтбора = ИмяТаблицы + Строка(ЭлементОтбора.ЛевоеЗначение) + " ПОДОБНО &" + ИмяПараметра;
			Параметры.Вставить(ИмяПараметра, "%" + ПравоеЗначение + "%");
		ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеПодобно Тогда
			ВыражениеЭлементаОтбора = ИмяТаблицы + Строка(ЭлементОтбора.ЛевоеЗначение) + " НЕ ПОДОБНО &" + ИмяПараметра;
			Параметры.Вставить(ИмяПараметра, "%" + ПравоеЗначение + "%");		
		ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно Тогда
			Если ТипЗнч(ПравоеЗначение) = Тип("Строка") Тогда
				ВыражениеЭлементаОтбора = "НЕ " + ИмяТаблицы + Строка(ЭлементОтбора.ЛевоеЗначение) + " ПОДОБНО &" + ИмяПараметра;	
			Иначе 
				ВыражениеЭлементаОтбора = ИмяТаблицы + Строка(ЭлементОтбора.ЛевоеЗначение) + " <> &" + ИмяПараметра;	
			КонецЕсли;
			Параметры.Вставить(ИмяПараметра, ПравоеЗначение);		
		ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеСодержит Тогда
			ВыражениеЭлементаОтбора = "НЕ " + ИмяТаблицы + Строка(ЭлементОтбора.ЛевоеЗначение) + " ПОДОБНО &" + ИмяПараметра;
			Параметры.Вставить(ИмяПараметра, "%" + ПравоеЗначение + "%");
		ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно Тогда
			ВыражениеЭлементаОтбора = ИмяТаблицы + Строка(ЭлементОтбора.ЛевоеЗначение) + " = &" + ИмяПараметра;
			Параметры.Вставить(ИмяПараметра, ПравоеЗначение);
		ИначеЕсли ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит Тогда
			ВыражениеЭлементаОтбора = ИмяТаблицы + Строка(ЭлементОтбора.ЛевоеЗначение) + " ПОДОБНО &" + ИмяПараметра;
			Параметры.Вставить(ИмяПараметра, "%" + ПравоеЗначение + "%");
		Иначе
			ВызватьИсключение НСтр("ru = 'Не удалось привести отбор компоновки данных к строковому типу'");
		КонецЕсли;
	
	КонецЕсли;

	Возврат ВыражениеЭлементаОтбора;
	
КонецФункции

#КонецОбласти