
#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьПараметрыСтартаСеанса(ПараметрыСтартаСеанса) Экспорт
	
	ТекущиеСведенияОРасширении = СведенияОРасширении(Ложь);
	
	ПараметрыСтартаСеанса.Вставить("ИдентификаторРасширения", ТекущиеСведенияОРасширении.УникальныйИдентификатор);
	ПараметрыСтартаСеанса.Вставить("ВерсияРасширения", ТекущиеСведенияОРасширении.Версия);
	ПараметрыСтартаСеанса.Вставить("ВерсияДанных", ТекущаяВерсияДанных());
	
	ПараметрыСтартаСеанса.Вставить("УстановкаПредварительныхВерсий", 
		ПолучитьФункциональнуюОпцию("SUI_УстановкаПредварительныхВерсий"));
	
	ПараметрыСтартаСеанса.Вставить("ПроверкаОбновленийПриСтарте", 
		ПолучитьФункциональнуюОпцию("SUI_ПроверкаОбновленийПриСтарте"));
	
КонецПроцедуры

Функция ТекущаяВерсияКонфигурации(ВызыватьИсключение = Истина) Экспорт
	Возврат SUI_ОбновлениеSimple.ТекущаяВерсияКонфигурации(ВызыватьИсключение);
КонецФункции

Функция ТекущаяВерсияДанных() Экспорт
	Возврат SUI_ОбновлениеSimple.ВерсияДанных();
КонецФункции

Функция СведенияОРасширении(ВызыватьИсключение = Истина) Экспорт
	Возврат SUI_ОбновлениеSimple.СведенияОРасширении(ВызыватьИсключение);
КонецФункции

Функция УстановкаПредварительныхВерсий() Экспорт
	Возврат ПолучитьФункциональнуюОпцию("SUI_УстановкаПредварительныхВерсий");
КонецФункции

Функция ПолучитьСписокОбновленийИзРепозитория(Таймаут) Экспорт
	Возврат SUI_ОбновлениеSimpleКлиентСервер.ПолучитьСписокОбновленийИзРепозитория(Таймаут);
КонецФункции

Функция ЗагрузитьФайлОбновленияИзРепозитория(ОписаниеОбновления, Таймаут) Экспорт
	Возврат SUI_ОбновлениеSimpleКлиентСервер.ЗагрузитьФайлОбновленияИзРепозитория(ОписаниеОбновления, Таймаут);
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ДанныеJSON(Строка) Экспорт
	Возврат SUI_ОбновлениеSimpleКлиентСервер.ДанныеJSON(Строка);
КонецФункции

Функция СтрокаJSON(Строка) Экспорт
	Возврат SUI_ОбновлениеSimpleКлиентСервер.СтрокаJSON(Строка);
КонецФункции

#КонецОбласти
