#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура СоздатьЗапись(МобильноеУстройство, ИдентификаторЗапроса, КодыМаркировкиКЗапросу) Экспорт
	
	ИдентификаторФоновогоЗадания = Новый УникальныйИдентификатор;
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.МобильноеУстройство = МобильноеУстройство;
	МенеджерЗаписи.УникальныйИдентификатор = ИдентификаторЗапроса;
	МенеджерЗаписи.ДанныеДляЗапроса = Новый ХранилищеЗначения(КодыМаркировкиКЗапросу);
	МенеджерЗаписи.ДатаЗаписи = ТекущаяДатаСеанса();
	МенеджерЗаписи.ИдентификаторФоновогоЗадания = ИдентификаторФоновогоЗадания;

	МенеджерЗаписи.Записать();

	ВыполнитьОбработкуСоставовКодовМаркировокВФоне(МобильноеУстройство, КодыМаркировкиКЗапросу, ИдентификаторЗапроса,
		ИдентификаторФоновогоЗадания);
		

КонецПроцедуры

Функция ДанныеПоЗапросуСоставаКМ(ИдентификаторЗапроса, МобильноеУстройство) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	SUI_ДанныеКодовМаркировки.Результат,
	|	SUI_ДанныеКодовМаркировки.Выполнено,
	|	SUI_ДанныеКодовМаркировки.ИдентификаторФоновогоЗадания,
	|	SUI_ДанныеКодовМаркировки.ТекстОшибки
	|ИЗ
	|	РегистрСведений.SUI_ДанныеКодовМаркировки КАК SUI_ДанныеКодовМаркировки
	|ГДЕ
	|	SUI_ДанныеКодовМаркировки.МобильноеУстройство = &МобильноеУстройство
	|	И SUI_ДанныеКодовМаркировки.УникальныйИдентификатор = &УникальныйИдентификатор";

	Запрос.УстановитьПараметр("МобильноеУстройство", МобильноеУстройство);
	Запрос.УстановитьПараметр("УникальныйИдентификатор", ИдентификаторЗапроса);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда

		Результат = Новый Структура;

		Результат.Вставить("Результат", ВыборкаДетальныеЗаписи.Результат.Получить());
		Результат.Вставить("Выполнено", ВыборкаДетальныеЗаписи.Выполнено);
		Результат.Вставить("ИдентификаторФоновогоЗадания", ВыборкаДетальныеЗаписи.ИдентификаторФоновогоЗадания);
		Результат.Вставить("ТекстОшибки", ВыборкаДетальныеЗаписи.ТекстОшибки);

		Возврат Результат;

	Иначе

		Возврат Неопределено;

	КонецЕсли;

КонецФункции

Процедура ВыполнитьОбработкуСоставовКодовМаркировокВФоне(МобильноеУстройство, КодыМаркировкиКЗапросу,
	ИдентификаторЗапроса, ИдентификаторФоновогоЗадания) Экспорт

	ПараметрыВыполнения = Новый Массив;

	ПараметрыВыполнения.Добавить(МобильноеУстройство);
	ПараметрыВыполнения.Добавить(КодыМаркировкиКЗапросу);
	ПараметрыВыполнения.Добавить(ИдентификаторЗапроса);

	УстановитьПривилегированныйРежим(Истина);
	
	ФоновыеЗадания.Выполнить("SUI_ДанныеКодовМаркировки.ОбработатьСоставКодовМаркировокВФоне",
		ПараметрыВыполнения, ИдентификаторФоновогоЗадания);
		
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

#КонецОбласти

#КонецЕсли