
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура СоздатьЗапись(МобильноеУстройство, ИдентификаторЗапроса, ДанныеДляЗапроса, ИдентификаторФоновогоЗадания) Экспорт
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.МобильноеУстройство = МобильноеУстройство;
	МенеджерЗаписи.УникальныйИдентификатор = ИдентификаторЗапроса;
	МенеджерЗаписи.ДанныеДляЗапроса = Новый ХранилищеЗначения(ДанныеДляЗапроса);
	МенеджерЗаписи.ДатаЗаписи = ТекущаяДатаСеанса();
	МенеджерЗаписи.ИдентификаторФоновогоЗадания = ИдентификаторФоновогоЗадания;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
