#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СоздатьЗапись(МобильноеУстройство, КодыМаркировкиКЗапросу) Экспорт
	
	КлючФоновогоЗадания = Новый УникальныйИдентификатор;
	ИдентификаторЗапроса = Новый УникальныйИдентификатор;
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.МобильноеУстройство = МобильноеУстройство;
	МенеджерЗаписи.УникальныйИдентификатор = ИдентификаторЗапроса;
	МенеджерЗаписи.ДанныеДляЗапроса = Новый ХранилищеЗначения(КодыМаркировкиКЗапросу);
	МенеджерЗаписи.ДатаЗаписи = ТекущаяДатаСеанса();
	МенеджерЗаписи.КлючФоновогоЗадания = КлючФоновогоЗадания;

	МенеджерЗаписи.Записать();

	ВыполнитьОбработкуСоставовКодовМаркировокВФоне(МобильноеУстройство, ИдентификаторЗапроса, КлючФоновогоЗадания);	
	
	Возврат ИдентификаторЗапроса;
	
КонецФункции

Функция ДанныеПоЗапросуСоставаКМ(ИдентификаторЗапроса, МобильноеУстройство) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторЗапроса) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	SUI_ДанныеКодовМаркировки.Результат,
	|	SUI_ДанныеКодовМаркировки.Выполнено,
	|	SUI_ДанныеКодовМаркировки.КлючФоновогоЗадания,
	|	SUI_ДанныеКодовМаркировки.ТекстОшибки
	|ИЗ
	|	РегистрСведений.SUI_ДанныеКодовМаркировки КАК SUI_ДанныеКодовМаркировки
	|ГДЕ
	|	SUI_ДанныеКодовМаркировки.МобильноеУстройство = &МобильноеУстройство
	|	И SUI_ДанныеКодовМаркировки.УникальныйИдентификатор = &УникальныйИдентификатор";

	Запрос.УстановитьПараметр("МобильноеУстройство", МобильноеУстройство);
	Запрос.УстановитьПараметр("УникальныйИдентификатор", ИдентификаторЗапроса);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда

		Результат = Новый Структура;

		Результат.Вставить("Результат", ВыборкаДетальныеЗаписи.Результат.Получить());
		Результат.Вставить("Выполнено", ВыборкаДетальныеЗаписи.Выполнено);
		Результат.Вставить("КлючФоновогоЗадания", ВыборкаДетальныеЗаписи.КлючФоновогоЗадания);
		Результат.Вставить("ТекстОшибки", ВыборкаДетальныеЗаписи.ТекстОшибки);

		Возврат Результат;

	Иначе

		Возврат Неопределено;

	КонецЕсли;

КонецФункции

Процедура ВыполнитьОбработкуСоставовКодовМаркировокВФоне(МобильноеУстройство, ИдентификаторЗапроса, КлючФоновогоЗадания) Экспорт

	ПараметрыВыполнения = Новый Массив;

	ПараметрыВыполнения.Добавить(МобильноеУстройство);
	ПараметрыВыполнения.Добавить(ИдентификаторЗапроса);

	УстановитьПривилегированныйРежим(Истина);
	
	ФоновыеЗадания.Выполнить("SUI_ДанныеКодовМаркировки.ОбработатьСоставКодовМаркировокВФоне",
		ПараметрыВыполнения, КлючФоновогоЗадания);
		
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

Процедура УдалениеЗаписиРегистра(МобильноеУстройство, ИдентификаторЗапроса) Экспорт
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.МобильноеУстройство = МобильноеУстройство;
	Запись.УникальныйИдентификатор = ИдентификаторЗапроса;
	
	Запись.Удалить();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли