
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НаборКонстант.SUI_СрокХраненияРезультатовОбработкиВходящихСообщенийОбмена > Константы.SUI_СрокХраненияРезультатовОбработкиВходящихСообщенийОбмена.МаксимальныйСрокХранения() Тогда
		Модифицированность = Истина;
		НаборКонстант.SUI_СрокХраненияРезультатовОбработкиВходящихСообщенийОбмена = Константы.SUI_СрокХраненияРезультатовОбработкиВходящихСообщенийОбмена.МаксимальныйСрокХранения();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
