
#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьШаблоныКодовМаркировки() Экспорт
	
	Шаблоны = Новый Структура(); 
	
	ИменаКолонокРазделителейВМакете = ДоступныеИменаКолонокРазделителейВМакетаШаблоновКМ();

	Алфавит = ДопустимыеСимволыВКодеМаркировки();
	
	Макет = ПолучитьОбщийМакет("SUI_ШаблоныКодовМаркировки"); 
	
	ВысотаТаблицы = Макет.ВысотаТаблицы;
	ШиринаТаблицы = Макет.ШиринаТаблицы;
	
	Для НомерСтроки = 2 По ВысотаТаблицы Цикл  
		
		ШаблонИмениОбласти = "R" + Формат(НомерСтроки, "ЧН=0; ЧГ=0");
		
		КлючШаблона = СокрЛП(Макет.Область(ШаблонИмениОбласти + "C1").Текст);
		
		Если ПустаяСтрока(КлючШаблона) Тогда
			Прервать;
		КонецЕсли; 
		
		Попытка
			ТипШтрихкода = ПредопределенноеЗначение("Перечисление.ТипыШтрихкодов." + СокрЛП(Макет.Область(ШаблонИмениОбласти + "C2").Текст));
		Исключение
			ТипШтрихкода = Неопределено;	
		КонецПопытки;
		
		Попытка
			ВидУпаковки = ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС." + СокрЛП(Макет.Область(ШаблонИмениОбласти + "C3").Текст));
		Исключение
			ВидУпаковки = Неопределено;	
		КонецПопытки;
		
		ШаблонКодаБезСкобки = Новый Структура("ДлинаКода, ДлинаПолногоКода, СтруктураКода", 0, 0, Новый Структура());
		ШаблонКодаСоСкобкой = Новый Структура("ДлинаКода, ДлинаПолногоКода, СтруктураКода", 0, 0, Новый Структура());
		
		ШаблонКода = Новый Массив();
		ШаблонКодаПолный = Новый Массив();
		
		Позиция = 1;
		ПозицияСоСкобкой = 1;
		
		Для НомерКолонки = 4 По ШиринаТаблицы Цикл
			
			ИмяКолонки = СокрЛП(Макет.Область("R1C" + Строка(НомерКолонки)).Текст);
			
			Если ИменаКолонокРазделителейВМакете.Найти(ИмяКолонки) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			СчитатьДлинуКодаGTINСерия = (ИмяКолонки = "Разделитель1" Или ИмяКолонки = "Разделитель2");
			
			Разделитель = СокрЛП(Макет.Область(ШаблонИмениОбласти + "C" + Строка(НомерКолонки)).Текст); 
			НомерКолонки = НомерКолонки + 1;
			
			РазделительИмя = СокрЛП(Макет.Область(ШаблонИмениОбласти + "C" + Строка(НомерКолонки)).Текст);
			НомерКолонки = НомерКолонки + 1;
			
			РазделительДлина = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(СокрЛП(Макет.Область(ШаблонИмениОбласти + "C" + Строка(НомерКолонки)).Текст));
			НомерКолонки = НомерКолонки + 1;
			
			РазделительАлфавит = СокрЛП(Макет.Область(ШаблонИмениОбласти + "C" + Строка(НомерКолонки)).Текст);
			
			Если ЗначениеЗаполнено(РазделительИмя) И 
				ЗначениеЗаполнено(РазделительДлина) И 
				ЗначениеЗаполнено(РазделительАлфавит) И
				Алфавит.Свойство(РазделительАлфавит) Тогда 
				
				Если ИмяКолонки = "Разделитель1" Или ИмяКолонки = "Разделитель2" Тогда
					ШаблонКода.Добавить(РазделительИмя);
				КонецЕсли;
				
				ШаблонКодаПолный.Добавить(РазделительИмя);
				
				Позиция = Позиция + СтрДлина(Разделитель); 
				
				Если ЗначениеЗаполнено(Разделитель) Тогда
					ПозицияСоСкобкой = ПозицияСоСкобкой + СтрДлина(Разделитель) + 2;
				КонецЕсли;
				
				ШаблонКодаБезСкобки.СтруктураКода.Вставить(РазделительИмя, Новый Структура());
				
				ШаблонКодаБезСкобки.СтруктураКода[РазделительИмя].Вставить("Разделитель", 	Разделитель);
				ШаблонКодаБезСкобки.СтруктураКода[РазделительИмя].Вставить("Длина", 		РазделительДлина);
				ШаблонКодаБезСкобки.СтруктураКода[РазделительИмя].Вставить("Алфавит", 		Алфавит[РазделительАлфавит]);
				ШаблонКодаБезСкобки.СтруктураКода[РазделительИмя].Вставить("Позиция", 		Позиция);
				
				ШаблонКодаСоСкобкой.СтруктураКода.Вставить(РазделительИмя, Новый Структура()); 
				
				ШаблонКодаСоСкобкой.СтруктураКода[РазделительИмя].Вставить("Разделитель", 	?(ЗначениеЗаполнено(Разделитель), "(" + Разделитель + ")", ""));
				ШаблонКодаСоСкобкой.СтруктураКода[РазделительИмя].Вставить("Длина", 		РазделительДлина);
				ШаблонКодаСоСкобкой.СтруктураКода[РазделительИмя].Вставить("Алфавит", 		Алфавит[РазделительАлфавит]);
				ШаблонКодаСоСкобкой.СтруктураКода[РазделительИмя].Вставить("Позиция", 		ПозицияСоСкобкой);
								
				ШаблонКодаБезСкобки.ДлинаПолногоКода = ШаблонКодаБезСкобки.ДлинаПолногоКода + СтрДлина(Разделитель) + РазделительДлина;
				
				Если СчитатьДлинуКодаGTINСерия Тогда
					ШаблонКодаБезСкобки.ДлинаКода = ШаблонКодаБезСкобки.ДлинаКода + СтрДлина(Разделитель) + РазделительДлина;
				КонецЕсли;
				
				ШаблонКодаСоСкобкой.ДлинаПолногоКода = ШаблонКодаСоСкобкой.ДлинаПолногоКода + СтрДлина(Разделитель) + РазделительДлина;
				
				Если ЗначениеЗаполнено(Разделитель) Тогда
					ШаблонКодаСоСкобкой.ДлинаПолногоКода = ШаблонКодаСоСкобкой.ДлинаПолногоКода + 2;
				КонецЕсли;
				
				Если СчитатьДлинуКодаGTINСерия Тогда  
					
					ШаблонКодаСоСкобкой.ДлинаКода = ШаблонКодаСоСкобкой.ДлинаКода + СтрДлина(Разделитель) + РазделительДлина;
					
					Если ЗначениеЗаполнено(Разделитель) Тогда
						ШаблонКодаСоСкобкой.ДлинаКода = ШаблонКодаСоСкобкой.ДлинаКода + 2;
					КонецЕсли;
					
				КонецЕсли; 
				
				Позиция = Позиция + РазделительДлина; 
				ПозицияСоСкобкой = ПозицияСоСкобкой + РазделительДлина;

			КонецЕсли;	
			
		КонецЦикла; 
		
		Если ШаблонКодаБезСкобки.СтруктураКода.Количество() > 0 И ШаблонКодаСоСкобкой.СтруктураКода.Количество() > 0 Тогда
			//@skip-check structure-consructor-too-many-keys
			Шаблоны.Вставить(КлючШаблона, Новый Структура(
				"ШаблонКода, ШаблонКодаПолный, БезСкобки, СоСкобкой, ТипШтрихкода, ВидУпаковки", 
				СтрСоединить(ШаблонКода, "+"), СтрСоединить(ШаблонКодаПолный, "+"), ШаблонКодаБезСкобки, ШаблонКодаСоСкобкой, ТипШтрихкода, ВидУпаковки)
			);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Новый ФиксированнаяСтруктура(Шаблоны);
	
КонецФункции

Функция ДопустимыеСимволыВКодеМаркировки() Экспорт
	
	Алфавит = Новый Структура;
	
	Алфавит.Вставить("БуквыЦифры",          "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789");
	Алфавит.Вставить("БуквыЦифрыЗнаки",     "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789!”""%&’'()*+,-./_:;=<>?");
	Алфавит.Вставить("БуквыЦифрыЗнакиМРЦ",  "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789!""%&'*+-./_,:;=<>?");
	Алфавит.Вставить("Цифры",               "0123456789");
	Алфавит.Вставить("БуквыПрописныеЦифры", "ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789");
	
	Возврат Новый ФиксированнаяСтруктура(Алфавит);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДоступныеИменаКолонокРазделителейВМакетаШаблоновКМ()

	ИменаКолонок = Новый Массив();
	
	ИменаКолонок.Добавить("Разделитель1");
	ИменаКолонок.Добавить("Разделитель2");
	ИменаКолонок.Добавить("Разделитель3");
	ИменаКолонок.Добавить("Разделитель4");
	
	Возврат Новый ФиксированныйМассив(ИменаКолонок);
	
КонецФункции

#КонецОбласти
