
#Область ПрограммныйИнтерфейс

// Выполнить запрос конструктора запроса.
// 
// Параметры:
//  ДанныеКонструктора - Структура - Данные конструктора см. SUI_КонструкторЗапросаКлиентСервер.ДанныеКонструктора
//  Параметры - Структура - Параметры запроса
//  ВыполнятьВПривилегированномРежиме - Булево - Выполнять в привилегированном режиме
// 
// Возвращаемое значение:
//  Структура - Выполнить запрос конструктора запроса
Функция ВыполнитьЗапросКонструктораЗапроса(Знач ДанныеКонструктора, Параметры, ВыполнятьВПривилегированномРежиме = Истина) Экспорт
	
	Результат = Новый Структура();
	
	ОбщегоНазначенияКлиентСервер.Проверить(
		ЗначениеЗаполнено(ДанныеКонструктора.ТекстЗапроса),
		НСтр("ru = 'Не заполнен текст запроса для выполнения запроса'"));
	
	Запрос = Новый Запрос(ДанныеКонструктора.ТекстЗапроса);
	
	Для Каждого Параметр Из Параметры Цикл
		Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	Если ВыполнятьВПривилегированномРежиме Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Если ДанныеКонструктора.ВыполнятьВПакетномРежиме Тогда
		РезультатыЗапроса = Запрос.ВыполнитьПакет();
	Иначе
		РезультатыЗапроса = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Запрос.Выполнить());
		ДанныеКонструктора.ПакетыРезультата.Очистить();
		ДанныеКонструктора.ПакетыРезультата.Добавить(0);
	КонецЕсли;
	
	Для Каждого ИндексРезультата Из ДанныеКонструктора.ПакетыРезультата Цикл
		
		Если ТипЗнч(ИндексРезультата) <> Тип("Число") Тогда
			Продолжить;
		КонецЕсли;
		
		ТекущийИндекс = SUI_ОбщегоНазначения.ОписаниеТипаЧисло(2, 0, ДопустимыйЗнак.Неотрицательный).ПривестиЗначение(ИндексРезультата);
		
		Если ТекущийИндекс = 0 И  ИндексРезультата >= 1 Тогда
			Продолжить;
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.Проверить(
			РезультатыЗапроса.ВГраница() >= ТекущийИндекс,
			СтрШаблон(НСтр("ru = 'Отсутствуют результаты пакета запроса по индексу ""%1""'"), ТекущийИндекс));
		
		Если Не РезультатыЗапроса[ТекущийИндекс].Пустой() Тогда
			
			ИменаКолонок = SUI_ОбщегоНазначения.ПолучитьИменаКолонокРезультатаЗапроса(РезультатыЗапроса[ТекущийИндекс]);
			
			Выборка = РезультатыЗапроса[ТекущийИндекс].Выбрать();
	
			СтрокиВыборки = Новый Массив();
			
			Пока Выборка.Следующий() Цикл
				
				СтрокаВыборки = Новый Структура(ИменаКолонок);
				ЗаполнитьЗначенияСвойств(СтрокаВыборки, Выборка);
				СтрокиВыборки.Добавить(СтрокаВыборки);
				
			КонецЦикла;
			
			Результат.Вставить("package_" + Строка(ТекущийИндекс), СтрокиВыборки);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ВыполнятьВПривилегированномРежиме Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
