
#Область ПрограммныйИнтерфейс

Процедура ОткрытьРегламентныеЗадания(ОповещениеЗавершения = Неопределено, Владелец = Неопределено, 
	Уникальность = Неопределено, Окно = Неопределено, НавигационнаяСсылка = Неопределено) Экспорт
	
	ОткрытьФорму("Обработка.SUI_РегламентныеЗадания.Форма", , Владелец, Уникальность, Окно, 
		НавигационнаяСсылка, ОповещениеЗавершения);
	
КонецПроцедуры

// Запустить регламентное задание вручную.
// 
// Параметры:
//  ПараметрыЗапуска - Структура - Параметры запуска см. SUI_РегламентныеЗаданияКлиентСервер.ПараметрыОкнаЗапускаРегламентногоЗадания
//  Форма - ФормаКлиентскогоПриложения - Форма владелец
//  ОповещениеОЗавершении - ОписаниеОповещения, Неопределено - Оповещение о завершении
Процедура ЗапуститьРегламентноеЗаданиеВручную(ПараметрыЗапуска, Форма, ОповещениеОЗавершении = Неопределено) Экспорт
	
	ОткрытьФорму("Обработка.SUI_РегламентныеЗадания.Форма.ЗапускРегламентногоЗадания", ПараметрыЗапуска, Форма, 
		Форма.УникальныйИдентификатор, , , ОповещениеОЗавершении);
	
КонецПроцедуры

Процедура Подключаемый_ЗапуститьРегламентноеЗадание(Команда, Форма, ОповещениеОЗавершении = Неопределено) Экспорт
	
	Если СтрНачинаетсяС(Команда.Имя, "РЗ_") Тогда
		Ключ = СтрЗаменить(Команда.Имя, "РЗ_", "");
	Иначе
		Возврат;
	КонецЕсли;
	
	ПараметрыЗапуска = SUI_РегламентныеЗаданияКлиентСервер.ПараметрыОкнаЗапускаРегламентногоЗадания(Ключ);
	ПараметрыЗапуска.ОжидатьЗавершения = Истина;
	
	ЗапуститьРегламентноеЗаданиеВручную(ПараметрыЗапуска, Форма, ОповещениеОЗавершении);
	
КонецПроцедуры

#КонецОбласти
