
#Область ПрограммныйИнтерфейс

Процедура ОткрытьРегламентныеЗадания(ОповещениеЗавершения = Неопределено, Владелец = Неопределено, Уникальность = Неопределено,
	Окно = Неопределено, НавигационнаяСсылка = Неопределено) Экспорт
	
	ОткрытьФорму("Обработка.SUI_РегламентныеЗадания.Форма", , Владелец, Уникальность, Окно, НавигационнаяСсылка, ОповещениеЗавершения);
	
КонецПроцедуры

Функция ПараметрыЗапускаРегламентногоЗадания(КлючРегламентногоЗадания) Экспорт
	
	Параметры = SUI_РегламентныеЗаданияКлиентСервер.ПараметрыЗапускаРегламентногоЗадания(КлючРегламентногоЗадания);
	
	Параметры.Вставить("ОжидатьЗавершения", 			Истина);
	Параметры.Вставить("ЗакрытьПриУспешномЗавершении", 	Истина);
	Параметры.Вставить("ЗакрытьПриОшибке", 				Ложь);
	
	Возврат Параметры;
	
КонецФункции

Процедура ЗапуститьРегламентноеЗаданиеВручную(ОповещениеОЗавершении, ПараметрыЗапуска) Экспорт
	
	Контекст = Новый Структура();
	Контекст.Вставить("ОповещениеОЗавершении", ОповещениеОЗавершении);
	Контекст.Вставить("ПараметрыЗапуска", ПараметрыЗапуска);
	
	ФормаВладелец = ?(ТипЗнч(ОповещениеОЗавершении.Модуль) = Тип("ФормаКлиентскогоПриложения"), 
		ОповещениеОЗавершении.Модуль, Неопределено);
	
	Оповещение = Новый ОписаниеОповещения("ЗапуститьРегламентноеЗаданиеВручнуюЗавершение", 
		SUI_РегламентныеЗаданияКлиент, Контекст);
	
	ОткрытьФорму("Обработка.SUI_РегламентныеЗадания.Форма.ФормаВыполненияРегламентногоЗадания", 
		ПараметрыЗапуска, 
		ФормаВладелец, 
		?(ФормаВладелец = Неопределено, Неопределено, ФормаВладелец.УникальныйИдентификатор), , ,
		Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция РезультатЗапускаРегламентногоЗаданияВручную() Экспорт
	
	ПараметрыЗакрытия = Новый Структура();
	ПараметрыЗакрытия.Вставить("ЗаданиеЗапущено", Ложь);
	ПараметрыЗакрытия.Вставить("ЗаданиеВыполнено", Ложь);
	
	Возврат ПараметрыЗакрытия;
	
КонецФункции

Процедура ЗапуститьРегламентноеЗаданиеВручнуюЗавершение(Результат, Контекст) Экспорт
	
	Если Результат = Неопределено Тогда
		Результат = РезультатЗапускаРегламентногоЗаданияВручную();
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(Контекст.ОповещениеОЗавершении, Результат);
	
КонецПроцедуры

#КонецОбласти
