
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ПустаяСтрока(Параметры.КраткоеПредставлениеОшибки) И ПустаяСтрока(Параметры.ПодробноеПредставлениеОшибки) Тогда
		ТекстСообщения = НСтр("ru = 'Отсутствуют данные для отображения ошибки!'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		Возврат;
	КонецЕсли;
	
	Если Не ПустаяСтрока(Параметры.Заголовок) Тогда
		Заголовок = СтрШаблон(НСтр("ru = 'Ошибка: %1'"), Параметры.Заголовок);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОтобразитьОшибкуНаФорме();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказатьПодробныйТекстОшибки(Команда)
	
	ОтобразитьОшибкуНаФорме(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОтобразитьОшибкуНаФорме(ПервыйЗапуск = Истина)
	
	Если ПервыйЗапуск Тогда
		
		Если ПустаяСтрока(Параметры.КраткоеПредставлениеОшибки) Тогда
			Элементы.ФормаПоказатьПодробныйТекстОшибки.Пометка = Истина;
		Иначе
			Элементы.ФормаПоказатьПодробныйТекстОшибки.Пометка = Ложь;
		КонецЕсли;
		
	Иначе
		
		Если Элементы.ФормаПоказатьПодробныйТекстОшибки.Пометка И Не ПустаяСтрока(Параметры.КраткоеПредставлениеОшибки) Тогда
			Элементы.ФормаПоказатьПодробныйТекстОшибки.Пометка = Ложь;
		ИначеЕсли Не Элементы.ФормаПоказатьПодробныйТекстОшибки.Пометка И Не ПустаяСтрока(Параметры.ПодробноеПредставлениеОшибки) Тогда
			Элементы.ФормаПоказатьПодробныйТекстОшибки.Пометка = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Элементы.ФормаПоказатьПодробныйТекстОшибки.Пометка Тогда
		ПредставлениеОшибки = Параметры.ПодробноеПредставлениеОшибки;
	Иначе
		ПредставлениеОшибки = Параметры.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	Если Элементы.ФормаПоказатьПодробныйТекстОшибки.Пометка И Не ПустаяСтрока(Параметры.КраткоеПредставлениеОшибки) Тогда
		Элементы.ФормаПоказатьПодробныйТекстОшибки.Заголовок = НСтр("ru = 'Показать кратко'");
	ИначеЕсли Не Элементы.ФормаПоказатьПодробныйТекстОшибки.Пометка И Не ПустаяСтрока(Параметры.ПодробноеПредставлениеОшибки) Тогда
		Элементы.ФормаПоказатьПодробныйТекстОшибки.Заголовок = НСтр("ru = 'Показать подробно'");
	Иначе
		Элементы.ФормаПоказатьПодробныйТекстОшибки.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
