
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПользователиТСД, ПараметрыВыполненияКоманды)
	
	Если ПользователиТСД.Количество() = 0 Тогда
		SUI_ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Отсутствуют данные для печати.'"));
		Возврат;
	КонецЕсли;
	
	ТабличныйДокумент = СформироватьПечатнуюФормуНаСервере(ПользователиТСД);
	
	Если ТабличныйДокумент <> Неопределено Тогда
		ТабличныйДокумент.Показать(НСтр("ru = 'QR коды авторизации пользователей ТСД'"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СформироватьПечатнуюФормуНаСервере(ПользователиТСД)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	SUI_ПользователиТСД.Наименование,
		|	SUI_ПользователиТСД.Логин,
		|	SUI_ПользователиТСД.Пароль
		|ИЗ
		|	Справочник.SUI_ПользователиТСД КАК SUI_ПользователиТСД
		|ГДЕ
		|	SUI_ПользователиТСД.Ссылка В (&ПользователиТСД)";
	
	Запрос.УстановитьПараметр("ПользователиТСД", ПользователиТСД);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	ДокументРезультат.АвтоМасштаб			= Истина;
	ДокументРезультат.ТолькоПросмотр 		= Истина;
	ДокументРезультат.ОриентацияСтраницы 	= ОриентацияСтраницы.Портрет;
	ДокументРезультат.ОтображатьСетку 		= Ложь;
	ДокументРезультат.ОтображатьЗаголовки 	= Ложь;
	
	ДокументРезультат.КлючПараметровПечати = "ПараметрыПечати_SUI_QRКодАвторизацииПользователей";
	
	Макет = Справочники.SUI_ПользователиТСД.ПолучитьМакет("QRКодАвторизации");
	
	ПечатнаяФормаСформирована = Ложь;

	Пока Выборка.Следующий() Цикл
		
		ДанныеАвторизации = Новый Структура("login,password", Выборка.Логин, Выборка.Пароль);
		ДанныеАвторизацииJSON = SUI_ОбщегоНазначенияКлиентСервер.ДанныеВСтрокуJSON(ДанныеАвторизации);
		ИзображениеQRКода = SUI_ГенерацияШтрихкода.ДанныеQRКода(ДанныеАвторизацииJSON, 0, 190);
		
		Если ИзображениеQRКода = Неопределено Тогда
			SUI_ОбщегоНазначения.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Для пользователя ""%1"" не удалось сформировать QR код авторизации.'"), Выборка.Наименование));
			Продолжить;
		КонецЕсли;
		
		ОбластьСтрока = Макет.ПолучитьОбласть("ОбластьСтрока");
		ОбластьСтрока.Параметры.Заполнить(Выборка);
	    ОбластьСтрока.Рисунки.QRКод.Картинка = Новый Картинка(ИзображениеQRКода);
		
		ДокументРезультат.Вывести(ОбластьСтрока);
		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
		
		ПечатнаяФормаСформирована = Истина;
		
	КонецЦикла;

	Возврат ?(Не ПечатнаяФормаСформирована, Неопределено, ДокументРезультат);
	
КонецФункции

#КонецОбласти
