
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Сохранить признак открывать мастер настроек при запуске.
// 
// Параметры:
//  Значение - Булево - Признак открывать мастер настроек при запуске.
Процедура СохранитьПризнакОткрыватьМастерНастроекПриЗапуске(Значение) Экспорт
	
	ОписаниеТипаБулево = Новый ОписаниеТипов("Булево");
	SUI_ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
		КлючОбщейНастройкиОткрыватьМастерНастроекПриЗапуске(), 
		ОписаниеТипаБулево.ПривестиЗначение(Значение));
	
КонецПроцедуры

// Получить признак открывать мастер настроек при запуске.
// 
// Возвращаемое значение:
//  Булево - Признак открывать мастер настроек при запуске.
Функция ПолучитьПризнакОткрыватьМастерНастроекПриЗапуске(УстановитьПоУмолчаниюПриОтсутствии = Ложь) Экспорт
	
	Результат = SUI_ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		КлючОбщейНастройкиОткрыватьМастерНастроекПриЗапуске());
	
	Если Результат = Неопределено И УстановитьПоУмолчаниюПриОтсутствии Тогда
		СохранитьПризнакОткрыватьМастерНастроекПриЗапуске(Истина);
		Результат = Истина;
	Иначе
		ОписаниеТипаБулево = Новый ОписаниеТипов("Булево");
		Результат = ОписаниеТипаБулево.ПривестиЗначение(Результат);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция КлючОбщейНастройкиОткрыватьМастерНастроекПриЗапуске() Экспорт
	
	Возврат "ОткрыватьМастерНастроекПриЗапуске";
	
КонецФункции

#КонецОбласти

#КонецЕсли
