
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьСписокРегламентныхЗаданийПродолжить();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаРегламентныеЗадания

&НаКлиенте
Процедура ТаблицаРегламентныеЗаданияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьРегламентноеЗадание();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьСписокРегламентныхЗаданий(Команда)
	ОбновитьСписокРегламентныхЗаданийНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура КомандаОткрытьРегламентноеЗадание(Команда)
	ОткрытьРегламентноеЗадание();
КонецПроцедуры

&НаКлиенте
Процедура ВключитьРегламентноеЗадание(Команда)
	
	ТекущиеДанные = Элементы.ТаблицаРегламентныеЗадания.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Использование Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ВключитьРегламентноеЗаданиеПослеПодтверждения", ЭтотОбъект, ТекущиеДанные.Ключ);
	
	ПоказатьВопрос(Оповещение, СтрШаблон(НСтр("ru = 'Включить регламентное задание %1?'"), ТекущиеДанные.Наименование), 
		РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

&НаКлиенте
Процедура ВыключитьРегламентноеЗадание(Команда)
	
	ТекущиеДанные = Элементы.ТаблицаРегламентныеЗадания.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТекущиеДанные.Использование Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ВыключитьРегламентноеЗаданиеПослеПодтверждения", ЭтотОбъект, ТекущиеДанные.Ключ);
	
	ПоказатьВопрос(Оповещение, СтрШаблон(НСтр("ru = 'Выключить регламентное задание %1?'"), ТекущиеДанные.Наименование), 
		РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьРегламентноеЗадание(Команда)
	
	ТекущиеДанные = Элементы.ТаблицаРегламентныеЗадания.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ВыполнитьРегламентноеЗаданиеПослеПодтверждения", ЭтотОбъект, ТекущиеДанные.Ключ);
	
	ПоказатьВопрос(Оповещение, СтрШаблон(НСтр("ru = 'Запустить выполнение регламентного задания %1?'"), ТекущиеДанные.Наименование), 
		РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

&НаКлиенте
Процедура ОстановитьВыполнениеРегламентногоЗадания(Команда)
	ТекущиеДанные = Элементы.ТаблицаРегламентныеЗадания.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ОстановитьВыполнениеРегламентногоЗаданияПослеПодтверждения", ЭтотОбъект, ТекущиеДанные.Ключ);
	
	ПоказатьВопрос(Оповещение, СтрШаблон(НСтр("ru = 'Остановить выполнение регламентного задания %1?'"), ТекущиеДанные.Наименование), 
		РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьРегламентноеЗадание(Команда)

	Если КлючиРегламентныхЗаданийКСозданию.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ПараметрыВыбора = Новый Структура("ВСписке", КлючиРегламентныхЗаданийКСозданию.ВыгрузитьЗначения());
	ФормаВыбора = ОткрытьФорму("Перечисление.SUI_КлючиРегламентыхЗаданий.ФормаВыбора", ПараметрыВыбора);
	ФормаВыбора.ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("СоздатьРегламентноеЗаданиеПослеВыбораКлюча", ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура КомандаУдалитьРегламентноеЗадание(Команда)
	
	ТекущиеДанные = Элементы.ТаблицаРегламентныеЗадания.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("УдалитьРегламентноеЗаданиеПослеПодтверждения", ЭтотОбъект, ТекущиеДанные.Ключ);
	
	ПоказатьВопрос(Оповещение, СтрШаблон(НСтр("ru = 'Удалить регламентное задание %1?'"), ТекущиеДанные.Наименование), 
		РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьСписокРегламентныхЗаданийПродолжить()
	ПодключитьОбработчикОжидания("ОбновитьСписокРегламентныхЗаданийНаКлиенте", 0.2, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокРегламентныхЗаданийНаКлиенте()
	
	Элементы.ГруппаСтраницаРегламентныеЗадания.Доступность = Ложь;
	
	ДлительнаяОперация = ПолучитьРегламентныеЗаданияНаСервере();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	ПараметрыОжидания.Заголовок = НСтр("ru = 'Получение списка регламентных заданий'");
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбновитьСписокРегламентныхЗаданийНаКлиентеЗавершение", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

&НаСервере
Функция ПолучитьРегламентныеЗаданияНаСервере()

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	Возврат ДлительныеОперации.ВыполнитьВФоне("SUI_РегламентныеЗадания.ПолучитьИнформациюОРегламентныхЗаданиях", 
		Неопределено, ПараметрыВыполнения);
		
КонецФункции

&НаКлиенте
Процедура ОбновитьСписокРегламентныхЗаданийНаКлиентеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда

		Если Результат.Сообщения <> Неопределено Тогда
			
			Для индекс = 0 По Результат.Сообщения.ВГраница() Цикл
				Результат.Сообщения[индекс].Сообщить();
			КонецЦикла;
			
		КонецЕсли;
	
		Если Результат.Статус = "Ошибка" Тогда
			ПоказатьПредупреждение(, Результат.КраткоеПредставлениеОшибки);
			ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
		ИначеЕсли Результат.Статус = "Выполнено" Тогда
			ЗагрузитьРезультатТаблицыРегламентныхЗаданийНаСервере(Результат.АдресРезультата);
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.ГруппаСтраницаРегламентныеЗадания.Доступность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьРезультатТаблицыРегламентныхЗаданийНаСервере(АдресРезультата)

	КлючиРегламентныхЗаданийКСозданию.Очистить();
	ТаблицаРегламентныеЗадания.Очистить();
	
	ТаблицаИсточник = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Если ТипЗнч(ТаблицаИсточник) <> Тип("ТаблицаЗначений") Тогда
		Возврат;
	КонецЕсли;
	
	КлючиРегламентныхЗаданийКСозданию.ЗагрузитьЗначения(
		ТаблицаИсточник.Скопировать(Новый Структура("Существует", Ложь), "Ключ").ВыгрузитьКолонку("Ключ"));
		
	ТаблицаРегламентныеЗадания.Загрузить(ТаблицаИсточник.Скопировать(Новый Структура("Существует", Истина)));

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРегламентноеЗадание()
	
	ТекущиеДанные = Элементы.ТаблицаРегламентныеЗадания.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("КлючРегламентногоЗадания", ТекущиеДанные.Ключ);
	
	Оповещение = Новый ОписаниеОповещения("ОткрытьРегламентноеЗаданиеЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Обработка.SUI_РегламентныеЗадания.Форма.ФормаРегламентногоЗадания", ПараметрыОткрытия, 
		ЭтотОбъект, УникальныйИдентификатор, , , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРегламентноеЗаданиеЗавершение(ДанныеБылиИзменены, ДополнительныеПараметры) Экспорт

	ОписаниеТипаБулево = Новый ОписаниеТипов("Булево");
	Если ОписаниеТипаБулево.ПривестиЗначение(ДанныеБылиИзменены) Тогда
		ОбновитьСписокРегламентныхЗаданийПродолжить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьРегламентноеЗаданиеПослеПодтверждения(Ответ, КлючРегламентногоЗадания) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ИспользованиеРегламентногоЗаданияНаСервере(КлючРегламентногоЗадания, Истина);
	
	ОбновитьСписокРегламентныхЗаданийПродолжить();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыключитьРегламентноеЗаданиеПослеПодтверждения(Ответ, КлючРегламентногоЗадания) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ИспользованиеРегламентногоЗаданияНаСервере(КлючРегламентногоЗадания, Ложь);
	
	ОбновитьСписокРегламентныхЗаданийПродолжить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИспользованиеРегламентногоЗаданияНаСервере(КлючРегламентногоЗадания, Значение)
	SUI_РегламентныеЗадания.ИспользованиеРегламентногоЗадания(КлючРегламентногоЗадания, Значение);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьРегламентноеЗаданиеПослеПодтверждения(Ответ, КлючРегламентногоЗадания) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ВыполнитьРегламентноеЗаданиеЗавершение", ЭтотОбъект);
		
		ПараметрыЗапуска = SUI_РегламентныеЗаданияКлиент.ПараметрыЗапускаРегламентногоЗадания(КлючРегламентногоЗадания);
		ПараметрыЗапуска.ОжидатьЗавершения = Ложь;
		ПараметрыЗапуска.ЗакрытьПриУспешномЗавершении = Ложь;
		ПараметрыЗапуска.ИгнорироватьИспользование = Истина;
		
		SUI_РегламентныеЗаданияКлиент.ЗапуститьРегламентноеЗаданиеВручную(ОповещениеОЗавершении, ПараметрыЗапуска);
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьРегламентноеЗаданиеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.ЗаданиеЗапущено Или Результат.ЗаданиеВыполнено Тогда
		ОбновитьСписокРегламентныхЗаданийПродолжить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОстановитьВыполнениеРегламентногоЗаданияПослеПодтверждения(Ответ, КлючРегламентногоЗадания) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = ВыполнитьОстановкуРегламентногоЗаданияНаСервере(КлючРегламентногоЗадания, УникальныйИдентификатор);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Заголовок = НСтр("ru = 'Остановка регламентного задания'");

	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОстановитьВыполнениеРегламентногоЗаданияЗавершение", ЭтотОбъект);
    	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВыполнитьОстановкуРегламентногоЗаданияНаСервере(КлючРегламентногоЗадания, ИдентификаторФормы)
	
	ПараметрыПроцедуры = Новый Структура();
	ПараметрыПроцедуры.Вставить("КлючРегламентногоЗадания", КлючРегламентногоЗадания);
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторФормы);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("SUI_РегламентныеЗадания.ОстановитьРегламентноеЗадание", 
		ПараметрыПроцедуры, ПараметрыВыполненияВФоне);
	
КонецФункции

&НаКлиенте
Процедура ОстановитьВыполнениеРегламентногоЗаданияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		
		Если ЗначениеЗаполнено(Результат.КраткоеПредставлениеОшибки) Тогда
			ПоказатьПредупреждение(, Результат.КраткоеПредставлениеОшибки);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Результат.ПодробноеПредставлениеОшибки) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Результат.Сообщения) Тогда
		
		Для индекс = 0 По Результат.Сообщения.ВГраница() Цикл
			Результат.Сообщения[индекс].Сообщить();
		КонецЦикла;
		
	КонецЕсли;

	ОбновитьСписокРегламентныхЗаданийПродолжить();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРегламентноеЗаданиеПослеВыбораКлюча(КлючРегламентногоЗадания, ДополнительныеПараметры) Экспорт

	Если КлючРегламентногоЗадания = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Оповещение = Новый ОписаниеОповещения("СоздатьРегламентноеЗаданиеПослеПодтверждения", ЭтотОбъект, КлючРегламентногоЗадания);
	
	ПоказатьВопрос(Оповещение, СтрШаблон(НСтр("ru = 'Создать регламентное задание %1?'"), КлючРегламентногоЗадания), 
		РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

&НаКлиенте
Процедура СоздатьРегламентноеЗаданиеПослеПодтверждения(Ответ, КлючРегламентногоЗадания) Экспорт

	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;

	СоздатьРегламентноеЗаданиеНаСервере(КлючРегламентногоЗадания);
	ОбновитьСписокРегламентныхЗаданийПродолжить();

КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьРегламентноеЗаданиеНаСервере(КлючРегламентногоЗадания)
	SUI_РегламентныеЗадания.СоздатьРегламентноеЗаданиеПоКлючу(КлючРегламентногоЗадания, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьРегламентноеЗаданиеПослеПодтверждения(Ответ, КлючРегламентногоЗадания) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьРегламентноеЗаданиеНаСервере(КлючРегламентногоЗадания);
	
	ОбновитьСписокРегламентныхЗаданийПродолжить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьРегламентноеЗаданиеНаСервере(КлючРегламентногоЗадания)
	SUI_РегламентныеЗадания.УдалитьРегламентноеЗадание(КлючРегламентногоЗадания);
КонецПроцедуры

#КонецОбласти
