
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоГруппа Тогда

		ПустаяВерсия = СтрНачинаетсяС(SUI_СтроковыеФункцииКлиентСервер.ОбработатьСтрокуВерсии(Версия), 
			SUI_ОбщегоНазначенияКлиентСервер.ПустаяВерсия());
			
		Если ПустаяВерсия Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Поле ""Версия"" не заполнено'"), , "Версия", "Объект", Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

//@skip-check data-exchange-load
Процедура ПередЗаписью(Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Если Не ЭтоГруппа Тогда

		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	SUI_НастройкиКонфигурацийПриложений.Ссылка
			|ИЗ
			|	Справочник.SUI_НастройкиКонфигурацийПриложений КАК SUI_НастройкиКонфигурацийПриложений
			|ГДЕ
			|	SUI_НастройкиКонфигурацийПриложений.Ссылка <> &Ссылка
			|	И SUI_НастройкиКонфигурацийПриложений.Версия = &Версия";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("Версия", Версия);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Версия ""%1"" уже принадлежит настройке конфигурации ""%2""'"), Версия, Выборка.Ссылка);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Версия", "Объект", Отказ);
			
		КонецЕсли;
		
		Если ДополнительныеСвойства.Свойство("ЗагруженныйФайл") Тогда
			
			Если ДополнительныеСвойства.ЗагруженныйФайл.Ссылка.Пустая() Тогда
				ПрисоединенныйФайлОбъект = Справочники.SUI_ПрисоединенныеФайлыОбщие.СоздатьЭлемент();
			Иначе
				ПрисоединенныйФайлОбъект = ДополнительныеСвойства.ЗагруженныйФайл.Ссылка.ПолучитьОбъект();
				ПрисоединенныйФайлОбъект.Заблокировать();
			КонецЕсли;
			
			СтруктураЗаполнения = Справочники.SUI_ПрисоединенныеФайлыОбщие.СтруктураЗаполнения();
			СтруктураЗаполнения.ВладелецФайла = Ссылка;
			СтруктураЗаполнения.Наименование = ДополнительныеСвойства.ЗагруженныйФайл.ПутьКФайлу;
			СтруктураЗаполнения.ПутьКФайлу = ДополнительныеСвойства.ЗагруженныйФайл.ПутьКФайлу;
			СтруктураЗаполнения.ДвоичныеДанные = ДополнительныеСвойства.ЗагруженныйФайл.ДвоичныеДанные;
			
			ПрисоединенныйФайлОбъект.Заполнить(СтруктураЗаполнения);
			ПрисоединенныйФайлОбъект.ДополнительныеСвойства.Вставить("НаименованиеИзПутиКФайлу");
			
			ДополнительныеСвойства.Вставить("ПрисоединенныйФайлОбъект", ПрисоединенныйФайлОбъект);
			
		КонецЕсли;
		
		Если ЭтоНовый() Тогда
			ДополнительныеСвойства.Вставить("ЭтоНовый");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

//@skip-check data-exchange-load
Процедура ПриЗаписи(Отказ)
	
	//TODO: Врем. выкл.
	ВызватьИсключение НСтр("ru = 'Функционал отключен'");
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ПрисоединенныйФайлОбъект") Тогда
		
		Если ДополнительныеСвойства.Свойство("ЭтоНовый") Тогда
			ДополнительныеСвойства.ПрисоединенныйФайлОбъект.ДополнительныеСвойства.Вставить("ОтключитьПроверкуВладельцаФайла");
		КонецЕсли;
		
		ДополнительныеСвойства.ПрисоединенныйФайлОбъект.ПометкаУдаления = ПометкаУдаления;
		
		Если Не ДополнительныеСвойства.ПрисоединенныйФайлОбъект.ПроверитьЗаполнение() Тогда
			
			Если ДополнительныеСвойства.ПрисоединенныйФайлОбъект.Заблокирован() Тогда
				ДополнительныеСвойства.ПрисоединенныйФайлОбъект.Разблокировать();
			КонецЕсли;
			
			Отказ = Истина;
			
		КонецЕсли;
		
		Если ДополнительныеСвойства.ПрисоединенныйФайлОбъект.ДополнительныеСвойства.Свойство("ОтключитьПроверкуВладельцаФайла") Тогда
			ДополнительныеСвойства.ПрисоединенныйФайлОбъект.ДополнительныеСвойства.Удалить("ОтключитьПроверкуВладельцаФайла");
		КонецЕсли;
	
	ИначеЕсли Не ДополнительныеСвойства.Свойство("ЭтоНовый") Тогда
		
		ПрисоединенныйФайлСсылка = Справочники.SUI_ПрисоединенныеФайлыОбщие.НайтиПоРеквизиту("ВладелецФайла", Ссылка);
		Если Не ПрисоединенныйФайлСсылка.Пустая() Тогда
			
			ПрисоединенныйФайлОбъект = ПрисоединенныйФайлСсылка.ПолучитьОбъект();
			ПрисоединенныйФайлОбъект.Заблокировать();
			ПрисоединенныйФайлОбъект.ПометкаУдаления = ПометкаУдаления;
			ПрисоединенныйФайлОбъект.Записать();
			ПрисоединенныйФайлОбъект.Разблокировать();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

//@skip-check data-exchange-load
Процедура ПередУдалением(Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	SUI_ПрисоединенныеФайлыОбщие.Ссылка
		|ИЗ
		|	Справочник.SUI_ПрисоединенныеФайлыОбщие КАК SUI_ПрисоединенныеФайлыОбщие
		|ГДЕ
		|	SUI_ПрисоединенныеФайлыОбщие.ВладелецФайла = &ВладелецФайла";
	
	Запрос.УстановитьПараметр("ВладелецФайла", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.SUI_ПрисоединенныеФайлыОбщие");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Ссылка", "Ссылка");
			Блокировка.Заблокировать();
			
			Выборка = РезультатЗапроса.Выбрать();
		
			Пока Выборка.Следующий() Цикл

				ПрисоединенныйФайлОбъект = Выборка.Ссылка.ПолучитьОбъект();
				ПрисоединенныйФайлОбъект.Удалить();

			КонецЦикла;
		
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаписатьОбъектПрисоединенныйФайлПослеЗаписи() Экспорт
	
	Если ДополнительныеСвойства.Свойство("ПрисоединенныйФайлОбъект") Тогда
	
		ДополнительныеСвойства.ПрисоединенныйФайлОбъект.ВладелецФайла = Ссылка;
		ДополнительныеСвойства.ПрисоединенныйФайлОбъект.Записать();
		
		Если ДополнительныеСвойства.ПрисоединенныйФайлОбъект.Заблокирован() Тогда
			ДополнительныеСвойства.ПрисоединенныйФайлОбъект.Разблокировать();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
