
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаОтсутствияСеанса = ТекущаяДатаСеанса() - SUI_МобильныеУстройстваСервер.СрокДействительностиСеансаВСекундах();
	SUI_КомпоновкаДанныхКлиентСервер.УстановитьПараметр(Список.КомпоновщикНастроек, "ДатаОтсутствияСеанса", ДатаОтсутствияСеанса);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "SUI_СозданЗапросПолнойВыгрузки" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
