#Область ОбработчикиСобытий

Функция СоставКодовМаркировокПолучитьV2(Запрос)

	ДанныеЗапроса = SUI_HTTPСервис.ОбработатьЗапрос(Запрос);

	Если ДанныеЗапроса.РезультатОтвет = Неопределено Тогда

		Попытка
			
			ИдентификаторЗапроса = ДанныеЗапроса.Параметры.Получить("request_id");
			
			Если ИдентификаторЗапроса = Неопределено Тогда
				
				Штрихкоды = SUI_ОбщегоНазначенияКлиентСервер.ДанныеИзСтрокиJSON(ДанныеЗапроса.Тело, Ложь);
				
				SUI_ОбщегоНазначенияКлиентСервер.Проверить(ТипЗнч(Штрихкоды) = Тип("Массив"),
					НСтр("ru = 'Не передан список штрихкодов к запросу состава кодов маркировки'"));
				
				Результат = SUI_ОбменДаннымиСервер.СоздатьЗапросСоставаКодовМаркировок(
					ДанныеЗапроса.МобильноеУстройство.Ссылка, Штрихкоды);
				
			Иначе
				
				Результат = SUI_ОбменДаннымиСервер.ПолучитьРезультатЗапросаСоставаКодовМаркировок(
					ДанныеЗапроса.МобильноеУстройство.Ссылка, ИдентификаторЗапроса);
				
			КонецЕсли;
			
		Исключение
			Результат = SUI_HTTPСервис.ОбработатьИсключительнуюОшибку("Данные кодов маркировки", ДанныеЗапроса,
				ИнформацияОбОшибке());
		КонецПопытки;

	Иначе
		Результат = ДанныеЗапроса.РезультатОтвет;
	КонецЕсли;

	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логировать HTTP запрос
	Если ДанныеЗапроса.ЕстьБазовыеПраваБСП Тогда
		SUI_HTTPСервис.ВыполнитьЛогирование(Запрос, Ответ, ДанныеЗапроса.МобильноеУстройство.ОтключитьЛогирование);
	КонецЕсли;

	Возврат Ответ;

КонецФункции

#КонецОбласти