#Область ОбработчикиСобытий

Функция СоставКодовМаркировокПолучитьV2(Запрос)

	ДанныеЗапроса = SUI_HTTPСервис.ОбработатьЗапрос(Запрос);

	Если ДанныеЗапроса.РезультатОтвет = Неопределено Тогда

		Попытка
			Результат = SUI_ОбменДаннымиСервер.ДанныеПолученныеПоКодамМаркировки(ДанныеЗапроса);
		Исключение
			Результат = ОбработатьИсключительнуюОшибку("", ДанныеЗапроса, ИнформацияОбОшибке());
		КонецПопытки;

	Иначе
		Результат = ДанныеЗапроса.РезультатОтвет;
	КонецЕсли;

	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логировать HTTP запрос
	Если ДанныеЗапроса.ЕстьБазовыеПраваБСП Тогда
		ВыполнитьЛогирование(Запрос, Ответ, ДанныеЗапроса.МобильноеУстройство.ОтключитьЛогирование);
	КонецЕсли;

	Возврат Ответ;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбработатьИсключительнуюОшибку(КонтекстОшибки, ДанныеЗапроса, Ошибка)

	SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(
		SUI_HTTPСервисКлиентСервер.ИмяСобытия(КонтекстОшибки), УровеньЖурналаРегистрации.Ошибка,
		Метаданные.HTTPСервисы.SUI_Exchange, ДанныеЗапроса.МобильноеУстройство.Ссылка, Ошибка);

	Возврат SUI_HTTPСервис.РезультатОшибка(Ошибка, 500);

КонецФункции

Процедура ВыполнитьЛогирование(Запрос, Ответ, ОтключитьЛогирование = Ложь)

	Если ОтключитьЛогирование Тогда
		Возврат;
	КонецЕсли;

	ПараметрыДобавленияЗаписиЛогирования = SUI_ЛогированиеHTTPЗапросовКлиентСервер.ПараметрыДобавленияЗаписиЛогирования(
		Запрос, Ответ);

	SUI_ЛогированиеHTTPЗапросовКлиентСервер.ДобавитьЗаписьЛогирования(ПараметрыДобавленияЗаписиЛогирования);

КонецПроцедуры

#КонецОбласти