#Область ОбработчикиСобытий

Функция СоставКодовМаркировокПолучитьV2(Запрос)

	ДанныеЗапроса = SUI_HTTPСервис.ОбработатьЗапрос(Запрос);

	Если ДанныеЗапроса.РезультатОтвет = Неопределено Тогда

		Попытка
			Результат = SUI_ОбменДаннымиСервер.ДанныеПолученныеПоКодамМаркировки(ДанныеЗапроса);
		Исключение
			Результат = SUI_HTTPСервис.ОбработатьИсключительнуюОшибку("", ДанныеЗапроса, ИнформацияОбОшибке());
		КонецПопытки;

	Иначе
		Результат = ДанныеЗапроса.РезультатОтвет;
	КонецЕсли;

	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логировать HTTP запрос
	Если ДанныеЗапроса.ЕстьБазовыеПраваБСП Тогда
		SUI_HTTPСервис.ВыполнитьЛогирование(Запрос, Ответ, ДанныеЗапроса.МобильноеУстройство.ОтключитьЛогирование);
	КонецЕсли;

	Возврат Ответ;

КонецФункции

#КонецОбласти