
#Область ПрограммныйИнтерфейс

Функция ПараметрыСозданияЗадания() Экспорт 

	Параметры = Новый Структура();
	
	Параметры.Вставить("Наименование", 	"");
	Параметры.Вставить("ВнеОчереди", 	Ложь);
	Параметры.Вставить("Обработчики",	Новый Массив());
	Параметры.Вставить("ПроцедураЗавершения", ""); 
	Параметры.Вставить("ИдентификаторДокумента", "");
	Параметры.Вставить("ПараметрыПроцедурыЗавершения");
	
	Возврат Параметры;
	
КонецФункции

Функция СтруктураОбработчикаЗадания() Экспорт 
	Возврат Новый Структура("ИмяМетода, Параметры", "", Новый Массив());
КонецФункции

Процедура ДобавитьОбработчикВПараметрыСозданияЗадания(ПараметрыСозданияЗадания, ИмяМетода, Параметры) Экспорт 
	
	ОбработчикЗадания 			= СтруктураОбработчикаЗадания();
	ОбработчикЗадания.ИмяМетода = ИмяМетода;
	ОбработчикЗадания.Параметры = Параметры;
	
	ПараметрыСозданияЗадания.Обработчики.Добавить(ОбработчикЗадания);
	
КонецПроцедуры

Функция ПараметрыОткрытияЖурналаРегистрации(Сеанс = Неопределено, Уровень = Неопределено, 
	НачальнаяДата = Неопределено, КонечнаяДата = Неопределено) Экспорт 
	
	Возврат SUI_ЖурналРегистрацииВызовСервера.ПараметрыОткрытияЖурналаРегистрации(ИмяСобытия(),
		НачальнаяДата, КонечнаяДата, Уровень, Сеанс);

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ИмяСобытия(ВложенноеСобытие = "") Экспорт 
	Возврат НСтр("ru = 'Очередь заданий'") + ?(ЗначениеЗаполнено(ВложенноеСобытие), ". " + ВложенноеСобытие, "");
КонецФункции

Функция КлючиРегламентныхЗаданий() Экспорт
	
	Ключи = Новый Структура();
	Ключи.Вставить("ОбработатьОчередь", "Simpled08d2299d0d4f8699f158f0ef6232eaa");
	Ключи.Вставить("ОчиститьОчередь", "Simplef1ef92024fecb30d6dffcd8ce43b4b9d");
	
	Возврат Новый ФиксированнаяСтруктура(Ключи);
	
КонецФункции

#КонецОбласти
