
#Область ПрограммныйИнтерфейс

// Выполнить запрос к репозиторию.
// 
// Параметры:
//  ПутьВРепозитории - Строка - Путь в репозитории
//  Таймаут - Число - Таймаут
//  ПопыткаПеренаправления - Число - Попытка перенаправления
// 
// Возвращаемое значение:
//  HTTPОтвет - Выполнить запрос к репозиторию
Функция ВыполнитьЗапросКРепозиторию(ПутьВРепозитории, Таймаут = 15, ПопыткаПеренаправления = 0) Экспорт
	
	КоличествоПопытокПеренаправлений = 1;
	
	Попытка
		
		СтруктураАдреса = ОбщегоНазначенияКлиентСервер.СтруктураURI(ПутьВРепозитории);
		
		Если ПустаяСтрока(СтруктураАдреса.Схема) Или ПустаяСтрока(СтруктураАдреса.Хост) Тогда
			
			ОбщегоНазначенияКлиентСервер.Проверить(ПопыткаПеренаправления < КоличествоПопытокПеренаправлений,
				СтрШаблон(НСтр("ru = 'Не правильно указан адрес перенаправления %1'"), ПутьВРепозитории));
			
			СтруктураАдреса = ОбщегоНазначенияКлиентСервер.СтруктураURI(АдресРепозитория() + ПутьВРепозитории);
			
		КонецЕсли;
		
		ЗащищенноеСоединение = ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение();
		Соединение = Новый HTTPСоединение(СтруктураАдреса.Хост, СтруктураАдреса.Порт, , , , Таймаут, ЗащищенноеСоединение);
		HTTPЗапрос = Новый HTTPЗапрос(СтруктураАдреса.ПутьНаСервере);
		РезультатЗапроса = Соединение.Получить(HTTPЗапрос);
		
		Если РезультатЗапроса.КодСостояния >= 300 И РезультатЗапроса.КодСостояния < 400 Тогда
			
			АдресПеренаправления = РезультатЗапроса.Заголовки.Получить("Location");
			
			ОбщегоНазначенияКлиентСервер.Проверить(Не ПустаяСтрока(АдресПеренаправления),
				СтрШаблон(НСтр("ru = 'Код состояния: %1
				|Не задан адрес перенаправления.'"), 
				РезультатЗапроса.КодСостояния));
			
			ОбщегоНазначенияКлиентСервер.Проверить(ПопыткаПеренаправления <= КоличествоПопытокПеренаправлений,
				СтрШаблон(НСтр("ru = 'Код состояния: %1
				|Адрес перенаправления: %2
				|Превышено количество попыток перенаправлений (%3).'"), 
				РезультатЗапроса.КодСостояния, АдресПеренаправления, КоличествоПопытокПеренаправлений));
			
			ПопыткаПеренаправления = ПопыткаПеренаправления + 1;
			
			РезультатЗапроса = ВыполнитьЗапросКРепозиторию(АдресПеренаправления, Таймаут, ПопыткаПеренаправления);
			
		Иначе
			ОбщегоНазначенияКлиентСервер.Проверить(РезультатЗапроса.КодСостояния = 200,
				СтрШаблон(НСтр("ru = 'Код состояния: %1
				|Содержимое: %2'"), РезультатЗапроса.КодСостояния, РезультатЗапроса.ПолучитьТелоКакСтроку()),
				"SUI_РепозиторийРасширенияКлиентСервер.ВыполнитьЗапросКРепозиторию");
		КонецЕсли;
		
	Исключение
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Хост: %1
			|Порт: %2
			|Путь: %3
			|%4'"), 
			СтруктураАдреса.Хост, СтруктураАдреса.Порт, СтруктураАдреса.ПутьНаСервере,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Возврат РезультатЗапроса;
	
КонецФункции

// Записать ошибку обращения к репозиторию.
// 
// Параметры:
//  Ошибка - ИнформацияОбОшибке - Ошибка
//  ИмяСобытия - Строка - Имя события
Процедура ЗаписатьОшибкуОбращенияКРепозиторию(Ошибка, ИмяСобытия) Экспорт
	
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(ИмяСобытия), , 
		Метаданные.ОбщиеМодули.SUI_ОбновлениеSimpleКлиентСервер, , Ошибка);
	#Иначе
	Событие = SUI_ЖурналРегистрацииКлиентСервер.ИмяСобытия(ИмяСобытия());
	Комментарий = ОбработкаОшибок.ПодробноеПредставлениеОшибки(Ошибка);
	ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации(Событие, "Ошибка", Комментарий, , Истина);
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ИмяСобытия(ВложенноеСобытие = "") Экспорт
	
	Возврат НСтр("ru = 'Репозиторий расширения'") + ?(ПустаяСтрока(ВложенноеСобытие), "", ". " + ВложенноеСобытие);
	
КонецФункции

Функция ДанныеJSON(Строка, ПрочитатьВСоответствие = Истина) Экспорт
	
	#Если ВебКлиент Тогда
		
		РезультатЧтения = SUI_РепозиторийРасширенияВызовСервера.ДанныеJSON(Строка, ПрочитатьВСоответствие);
		
	#Иначе
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Строка);
		РезультатЧтения = ПрочитатьJSON(ЧтениеJSON, ПрочитатьВСоответствие);
			
	#КонецЕсли

	Возврат РезультатЧтения;
	
КонецФункции

Функция СтрокаJSON(Данные) Экспорт
	
	#Если ВебКлиент Тогда
		
		ДанныеСтрокойJSON = SUI_РепозиторийРасширенияВызовСервера.СтрокаJSON(Данные);
		
	#Иначе
		
		ЗаписьJSON = Новый ЗаписьJSON();
		ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(, Символы.Таб));
		ЗаписатьJSON(ЗаписьJSON, Данные);
		
		ДанныеСтрокойJSON = ЗаписьJSON.Закрыть();
		
	#КонецЕсли
	
	Возврат ДанныеСтрокойJSON;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВладелецРепозитория()
	
	Возврат "simple-kit";
	
КонецФункции

Функция ИмяРепозитория()
	
	Возврат "simple-1C";
	
КонецФункции

Функция АдресРепозитория()
	
	Возврат "https://api.github.com/repos/" + ВладелецРепозитория() + "/" + ИмяРепозитория();
	
КонецФункции

#КонецОбласти
