
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Значение < Константы.SUI_РазмерПакетаДанных.МинимальныйРазмер() Тогда
		Значение = Константы.SUI_РазмерПакетаДанных.МинимальныйРазмер();
	ИначеЕсли Значение > Константы.SUI_РазмерПакетаДанных.МаксимальныйРазмер() Тогда
		Значение = Константы.SUI_РазмерПакетаДанных.МаксимальныйРазмер();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
