
//@skip-check module-structure-event-regions
#Область ОбработчикиСобытий

Функция ДанныеПолучить(Запрос)
	
	Перем ДанныеЗапроса;
	
	Попытка
		
		ПараметрыОбработкиВходящегоЗапроса = SUI_HTTPСервисКлиентСервер.ПараметрыОбработкиВходящегоЗапроса();
		ПараметрыОбработкиВходящегоЗапроса.ПрочитатьПараметрыИзТела = Истина;
		ДанныеЗапроса = SUI_HTTPСервис.ОбработатьВходящийЗапрос(Запрос, ПараметрыОбработкиВходящегоЗапроса);
		
		Если ДанныеЗапроса.РезультатОтвет <> Неопределено Тогда
			Результат = ДанныеЗапроса.РезультатОтвет;
		Иначе
			
			ТипПолучаемыхДанных = НРег(ОбщегоНазначения.ОписаниеТипаСтрока(9).ПривестиЗначение(
				ДанныеЗапроса.Параметры.Получить("type")));
			
			Результат = SUI_ОбменДаннымиСервер.ПолучитьДанные(ДанныеЗапроса.МобильноеУстройство, 
				ТипПолучаемыхДанных <> "documents", ТипПолучаемыхДанных <> "nsi");
			
		КонецЕсли;
		
	Исключение
		Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Получение данных'"), ДанныеЗапроса, ИнформацияОбОшибке());
	КонецПопытки;
	
	// Установка заголовков проверки обновления приложения
	SUI_HTTPСервис.УстановитьЗаголовкиОтветаПроверкиОбновления(Результат, ДанныеЗапроса);
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логирование HTTP запросов
	SUI_ЛогированиеHTTPЗапросов.Записать(Запрос, Ответ, ДанныеЗапроса);
	
	Возврат Ответ;
	
КонецФункции

Функция ОбновитьДокументы(Запрос)

	Перем ДанныеЗапроса;
	
	Попытка
		
		ДанныеЗапроса = SUI_HTTPСервис.ОбработатьВходящийЗапрос(Запрос);
		
		Если ДанныеЗапроса.РезультатОтвет <> Неопределено Тогда
			Результат = ДанныеЗапроса.РезультатОтвет;
		Иначе
			
			Результат = СоздатьВходящиеСообщение(ДанныеЗапроса.МобильноеУстройство,
				"SUI_ОбменДаннымиСервер.ЗагрузитьДанныеДокументов", 
				SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.МассивЗначений(ДанныеЗапроса.МобильноеУстройство, ДанныеЗапроса.Тело));
			
		КонецЕсли;
		
	Исключение
		Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Обновить документы'"), ДанныеЗапроса, ИнформацияОбОшибке());
	КонецПопытки;
	
	// Установка заголовков проверки обновления приложения
	SUI_HTTPСервис.УстановитьЗаголовкиОтветаПроверкиОбновления(Результат, ДанныеЗапроса);
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логирование HTTP запросов
	SUI_ЛогированиеHTTPЗапросов.Записать(Запрос, Ответ, ДанныеЗапроса);
	
	Возврат Ответ;
	
КонецФункции

Функция ЦеныНоменклатурыПолучить(Запрос)
	
	Перем ДанныеЗапроса;
	
	Попытка
		
		ПараметрыОбработкиВходящегоЗапроса = SUI_HTTPСервисКлиентСервер.ПараметрыОбработкиВходящегоЗапроса();
		ПараметрыОбработкиВходящегоЗапроса.ПрочитатьПараметрыИзТела = Истина;
		ДанныеЗапроса = SUI_HTTPСервис.ОбработатьВходящийЗапрос(Запрос, ПараметрыОбработкиВходящегоЗапроса);
		
		Если ДанныеЗапроса.РезультатОтвет <> Неопределено Тогда
			Результат = ДанныеЗапроса.РезультатОтвет;
		Иначе

			Параметры = Новый Структура();
			Параметры.Вставить("Номенклатура", 		ДанныеЗапроса.Параметры.Получить("id_good"));
			Параметры.Вставить("Характеристика", 	ДанныеЗапроса.Параметры.Получить("id_property"));
			Параметры.Вставить("Упаковка", 			ДанныеЗапроса.Параметры.Получить("id_unit"));
			Параметры.Вставить("ВидЦены", 			ДанныеЗапроса.Параметры.Получить("id_price_type"));
			
			Результат = SUI_ОбменДаннымиСервер.ПолучитьЦеныНоменклатуры(Параметры);

		КонецЕсли;
		
	Исключение
		Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Цены номенклатуры'"), ДанныеЗапроса, ИнформацияОбОшибке());
	КонецПопытки;
	
	// Установка заголовков проверки обновления приложения
	SUI_HTTPСервис.УстановитьЗаголовкиОтветаПроверкиОбновления(Результат, ДанныеЗапроса);
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логирование HTTP запросов
	SUI_ЛогированиеHTTPЗапросов.Записать(Запрос, Ответ, ДанныеЗапроса);
	
	Возврат Ответ;
	
КонецФункции

Функция ТоварыВЯчейкахПолучить(Запрос)

	Перем ДанныеЗапроса;
	
	Попытка
		
		ПараметрыОбработкиВходящегоЗапроса = SUI_HTTPСервисКлиентСервер.ПараметрыОбработкиВходящегоЗапроса();
		ПараметрыОбработкиВходящегоЗапроса.ПрочитатьПараметрыИзТела = Истина;
		ДанныеЗапроса = SUI_HTTPСервис.ОбработатьВходящийЗапрос(Запрос, ПараметрыОбработкиВходящегоЗапроса);
		
		Если ДанныеЗапроса.РезультатОтвет <> Неопределено Тогда
			Результат = ДанныеЗапроса.РезультатОтвет;
		Иначе

			Параметры = Новый Структура();
			Параметры.Вставить("Номенклатура", 	ДанныеЗапроса.Параметры.Получить("id_good"));
			Параметры.Вставить("Ячейка", 		ДанныеЗапроса.Параметры.Получить("id_cell"));
			
			Результат = SUI_ОбменДаннымиСервер.ПолучитьОстаткиНоменклатурыВЯчейке(Параметры);

		КонецЕсли;
		
	Исключение
		Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Товары в ячейках'"), ДанныеЗапроса, ИнформацияОбОшибке());
	КонецПопытки;
	
	// Установка заголовков проверки обновления приложения
	SUI_HTTPСервис.УстановитьЗаголовкиОтветаПроверкиОбновления(Результат, ДанныеЗапроса);
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логирование HTTP запросов
	SUI_ЛогированиеHTTPЗапросов.Записать(Запрос, Ответ, ДанныеЗапроса);
	
	Возврат Ответ;
	
КонецФункции

Функция ТоварыНаСкладахПолучить(Запрос)

	Перем ДанныеЗапроса;
	
	Попытка
		
		ПараметрыОбработкиВходящегоЗапроса = SUI_HTTPСервисКлиентСервер.ПараметрыОбработкиВходящегоЗапроса();
		ПараметрыОбработкиВходящегоЗапроса.ПрочитатьПараметрыИзТела = Истина;
		ДанныеЗапроса = SUI_HTTPСервис.ОбработатьВходящийЗапрос(Запрос, ПараметрыОбработкиВходящегоЗапроса);
		
		Если ДанныеЗапроса.РезультатОтвет <> Неопределено Тогда
			Результат = ДанныеЗапроса.РезультатОтвет;
		Иначе

			Параметры = Новый Структура();
			Параметры.Вставить("Номенклатура", 	ДанныеЗапроса.Параметры.Получить("id_good"));
			Параметры.Вставить("Склад", 		ДанныеЗапроса.Параметры.Получить("id_warehouse"));
			
			Результат = SUI_ОбменДаннымиСервер.ПолучитьОстаткиНоменклатурыНаСкладах(Параметры);

		КонецЕсли;
		
	Исключение
		Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Товары на складах'"), ДанныеЗапроса, ИнформацияОбОшибке());
	КонецПопытки;
	
	// Установка заголовков проверки обновления приложения
	SUI_HTTPСервис.УстановитьЗаголовкиОтветаПроверкиОбновления(Результат, ДанныеЗапроса);
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логирование HTTP запросов
	SUI_ЛогированиеHTTPЗапросов.Записать(Запрос, Ответ, ДанныеЗапроса);
	
	Возврат Ответ;
	
КонецФункции

Функция ТестСвязиПолучитьОтвет(Запрос) 
	
	Результат = SUI_HTTPСервис.РезультатУспех(Новый Структура("result", Истина));
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логирование HTTP запросов
	SUI_ЛогированиеHTTPЗапросов.Записать(Запрос, Ответ);
	
	Возврат Ответ;
	
КонецФункции

Функция РегистрацияИзмененийМобильногоУстройстваСбросить(Запрос)  
	
	Перем ДанныеЗапроса;
	
	Попытка
		
		ДанныеЗапроса = SUI_HTTPСервис.ОбработатьВходящийЗапрос(Запрос);
		
		Если ДанныеЗапроса.РезультатОтвет <> Неопределено Тогда
			Результат = ДанныеЗапроса.РезультатОтвет;
		Иначе
			SUI_МобильныеУстройстваСервер.ВыполнитьПолнуюВыгрузку(ДанныеЗапроса.МобильноеУстройство);
			Результат = SUI_HTTPСервис.РезультатУспех(Новый Структура("message", 
	 			НСтр("ru = 'Состояние полной выгрузки для мобильного устройство изменено. Ожидайте загрузки данных.'")));
		КонецЕсли;
		
	Исключение
		Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Запрос полной выгрузки'"), ДанныеЗапроса, ИнформацияОбОшибке());
	КонецПопытки;
	
	// Установка заголовков проверки обновления приложения
	SUI_HTTPСервис.УстановитьЗаголовкиОтветаПроверкиОбновления(Результат, ДанныеЗапроса);
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логирование HTTP запросов
	SUI_ЛогированиеHTTPЗапросов.Записать(Запрос, Ответ, ДанныеЗапроса);
	
	Возврат Ответ;
	
КонецФункции

Функция СообщенияСоздать(Запрос)
	
	Перем ДанныеЗапроса;
	
	Попытка
		
		ДанныеЗапроса = SUI_HTTPСервис.ОбработатьВходящийЗапрос(Запрос);
		
		Если ДанныеЗапроса.РезультатОтвет <> Неопределено Тогда
			Результат = ДанныеЗапроса.РезультатОтвет;
		Иначе

			ДанныеСообщения = SUI_ОбщегоНазначенияКлиентСервер.ДанныеИзСтрокиJSON(ДанныеЗапроса.Тело, Ложь);
    		
    		ТекстСообщения = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеСообщения, "text", "", Тип("Строка"));
    		
    		ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(ТекстСообщения),
				НСтр("ru = 'Передано пустое сообщение'"));
			
			SUI_СообщенияМобильныхУстройств.ОтправитьСообщениеГлавномуУзлу(ДанныеЗапроса.МобильноеУстройство, ТекстСообщения);
 
 			Результат = SUI_HTTPСервис.РезультатУспех(Новый Структура("result", Истина), 201);

		КонецЕсли;
		
	Исключение
		Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Сообщения'"), ДанныеЗапроса, ИнформацияОбОшибке());
	КонецПопытки;
	
	// Установка заголовков проверки обновления приложения
	SUI_HTTPСервис.УстановитьЗаголовкиОтветаПроверкиОбновления(Результат, ДанныеЗапроса);
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логирование HTTP запросов
	SUI_ЛогированиеHTTPЗапросов.Записать(Запрос, Ответ, ДанныеЗапроса);
	
	Возврат Ответ;
	
КонецФункции

Функция ШаблоныЭтикетокПолучить(Запрос)
	
	Перем ДанныеЗапроса;
	
	Попытка
		
		ДанныеЗапроса = SUI_HTTPСервис.ОбработатьВходящийЗапрос(Запрос);
		
		Если ДанныеЗапроса.РезультатОтвет <> Неопределено Тогда
			Результат = ДанныеЗапроса.РезультатОтвет;
		Иначе
 			Результат = SUI_ОбменДаннымиСервер.ПолучитьШаблоныЭтикеток();
		КонецЕсли;
		
	Исключение
		Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Шаблоны этикеток'"), ДанныеЗапроса, ИнформацияОбОшибке());
	КонецПопытки;
	
	// Установка заголовков проверки обновления приложения
	SUI_HTTPСервис.УстановитьЗаголовкиОтветаПроверкиОбновления(Результат, ДанныеЗапроса);
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логирование HTTP запросов
	SUI_ЛогированиеHTTPЗапросов.Записать(Запрос, Ответ, ДанныеЗапроса);
	
	Возврат Ответ;
		
КонецФункции

Функция ШтрихкодыНоменклатурыСоздатьШтрихкодыНоменклатуры(Запрос)
	
	Перем ДанныеЗапроса;
	
	Попытка
		
		ДанныеЗапроса = SUI_HTTPСервис.ОбработатьВходящийЗапрос(Запрос);
		
		Если ДанныеЗапроса.РезультатОтвет <> Неопределено Тогда
			Результат = ДанныеЗапроса.РезультатОтвет;
		Иначе
			ДанныеШтрихкодов = SUI_ОбщегоНазначенияКлиентСервер.ДанныеИзСтрокиJSON(ДанныеЗапроса.Тело, Ложь, , ,
				"ВосстановлениеДанныхJSON_СоздатьШтрихкодыНоменклатуры", SUI_ОбменДаннымиСервер);
			Результат = SUI_ОбменДаннымиСервер.СоздатьШтрихкодыНоменклатуры(ДанныеЗапроса.МобильноеУстройство, ДанныеШтрихкодов);
		КонецЕсли;
		
	Исключение
		Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Штрихкоды номенклатуры'"), ДанныеЗапроса, ИнформацияОбОшибке());
	КонецПопытки;
	
	// Установка заголовков проверки обновления приложения
	SUI_HTTPСервис.УстановитьЗаголовкиОтветаПроверкиОбновления(Результат, ДанныеЗапроса);
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логирование HTTP запросов
	SUI_ЛогированиеHTTPЗапросов.Записать(Запрос, Ответ, ДанныеЗапроса);
	
	Возврат Ответ;
	
КонецФункции

Функция ПользовательскийЗапросВыполнить(Запрос)
	
	Перем ДанныеЗапроса;
	
	Попытка
		
		ДанныеЗапроса = SUI_HTTPСервис.ОбработатьВходящийЗапрос(Запрос);
		
		Если ДанныеЗапроса.РезультатОтвет <> Неопределено Тогда
			Результат = ДанныеЗапроса.РезультатОтвет;
		Иначе
			НастройкиЗапроса = SUI_ОбщегоНазначенияКлиентСервер.ДанныеИзСтрокиJSON(ДанныеЗапроса.Тело, Ложь, , ,
				"ВосстановлениеДанныхJSON_НастройкиПользовательскогоЗапроса", SUI_ОбменДаннымиСервер);
			Результат = SUI_ОбменДаннымиСервер.ВыполнитьПользовательскийЗапрос(ДанныеЗапроса.МобильноеУстройство, НастройкиЗапроса);
		КонецЕсли;
		
	Исключение
		Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Пользовательский запрос'"), ДанныеЗапроса, ИнформацияОбОшибке());
	КонецПопытки;
	
	// Установка заголовков проверки обновления приложения
	SUI_HTTPСервис.УстановитьЗаголовкиОтветаПроверкиОбновления(Результат, ДанныеЗапроса);
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логирование HTTP запросов
	SUI_ЛогированиеHTTPЗапросов.Записать(Запрос, Ответ, ДанныеЗапроса);
	
	Возврат Ответ;
	
КонецФункции

Функция ПеремещениеЗапасовСоздать(Запрос)
	
	Перем ДанныеЗапроса;
	
	Попытка
		ПараметрыОбработкиВходящегоЗапроса = SUI_HTTPСервисКлиентСервер.ПараметрыОбработкиВходящегоЗапроса();
		ПараметрыОбработкиВходящегоЗапроса.ПрочитатьПараметрыИзТела = Истина;
		ДанныеЗапроса = SUI_HTTPСервис.ОбработатьВходящийЗапрос(Запрос, ПараметрыОбработкиВходящегоЗапроса);
		
		Если ДанныеЗапроса.РезультатОтвет <> Неопределено Тогда
			Результат = ДанныеЗапроса.РезультатОтвет;
		Иначе
			
			ОшибкиПередачиПараметров = Новый Массив();
			
			Параметры = Новый Структура();
			Параметры.Вставить("Отправитель", 	ДанныеЗапроса.Параметры.Получить("id_sender"));
			Параметры.Вставить("Получатель", 	ДанныеЗапроса.Параметры.Получить("id_recipient"));
			
			Если ОшибкиПередачиПараметров.Количество() > 0 Тогда
				Результат = SUI_HTTPСервис.РезультатОшибка(ОшибкиПередачиПараметров, 400);
			Иначе
				Результат = SUI_ОбменДаннымиСервер.СоздатьДокументПеремещенияЗапасов(ДанныеЗапроса.МобильноеУстройство, Параметры);
			КонецЕсли;
			
		КонецЕсли;
		
	Исключение
		Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Перемещение запасов. Создать'"), ДанныеЗапроса, ИнформацияОбОшибке());
	КонецПопытки;
	
	// Установка заголовков проверки обновления приложения
	SUI_HTTPСервис.УстановитьЗаголовкиОтветаПроверкиОбновления(Результат, ДанныеЗапроса);
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логирование HTTP запросов
	SUI_ЛогированиеHTTPЗапросов.Записать(Запрос, Ответ, ДанныеЗапроса);
	
	Возврат Ответ;
	
КонецФункции

Функция ОстаткиИЦеныПолучить(Запрос)
	
	Перем ДанныеЗапроса;
	
	Попытка
		ПараметрыОбработкиВходящегоЗапроса = SUI_HTTPСервисКлиентСервер.ПараметрыОбработкиВходящегоЗапроса();
		ПараметрыОбработкиВходящегоЗапроса.ПрочитатьПараметрыИзТела = Истина;
		ПараметрыОбработкиВходящегоЗапроса.ВосстанавливатьСсылкиИдентификаторов = Ложь;
		ДанныеЗапроса = SUI_HTTPСервис.ОбработатьВходящийЗапрос(Запрос, ПараметрыОбработкиВходящегоЗапроса);
		
		Если ДанныеЗапроса.РезультатОтвет <> Неопределено Тогда
			Результат = ДанныеЗапроса.РезультатОтвет;
		Иначе
			
			Параметры = Новый Структура();
			Параметры.Вставить("Номенклатура", 		ДанныеЗапроса.Параметры.Получить("id_good"));
			Параметры.Вставить("Характеристика", 	ДанныеЗапроса.Параметры.Получить("id_property"));
			
			Если Параметры.Номенклатура = Неопределено Тогда
				Результат = SUI_HTTPСервис.РезультатОшибка(
					НСтр("ru = 'Не передано значение параметра ""id_good"".'"), 400);
			Иначе
				SUI_ИнтеграцияВКонфигурацию.ВосстановитьСсылкиИдентификаторовSimple(Параметры, , Истина);
				Результат = SUI_ОбменДаннымиСервер.ПолучитьОстаткиИЦены(ДанныеЗапроса.МобильноеУстройство, Параметры);
			КонецЕсли;
				
		КонецЕсли;
		
	Исключение
		Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Остатки и цены'"), ДанныеЗапроса, ИнформацияОбОшибке());
	КонецПопытки;
	
	// Установка заголовков проверки обновления приложения
	SUI_HTTPСервис.УстановитьЗаголовкиОтветаПроверкиОбновления(Результат, ДанныеЗапроса);
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логирование HTTP запросов
	SUI_ЛогированиеHTTPЗапросов.Записать(Запрос, Ответ, ДанныеЗапроса);
	
	Возврат Ответ;
	
КонецФункции

Функция ОбновленияКонфигурацийПриложенийПолучить(Запрос)
	
	Перем ДанныеЗапроса;
	
	Попытка
		
		ПараметрыОбработкиВходящегоЗапроса = SUI_HTTPСервисКлиентСервер.ПараметрыОбработкиВходящегоЗапроса();
		ПараметрыОбработкиВходящегоЗапроса.ВосстанавливатьСсылкиИдентификаторов = Ложь;
		ДанныеЗапроса = SUI_HTTPСервис.ОбработатьВходящийЗапрос(Запрос, ПараметрыОбработкиВходящегоЗапроса);
		
		Если ДанныеЗапроса.РезультатОтвет <> Неопределено Тогда
			Результат = ДанныеЗапроса.РезультатОтвет;
		Иначе
			Результат = SUI_ОбменДаннымиСервер.ПолучитьОбновленияКонфигурацийПриложений(ДанныеЗапроса.ВерсияПриложения, 
				ДанныеЗапроса.ИспользованиеТестовыхВерсийПриложений);
		КонецЕсли;
		
	Исключение
		Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Получение обновлений'"), ДанныеЗапроса, ИнформацияОбОшибке());
	КонецПопытки;
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логирование HTTP запросов
	SUI_ЛогированиеHTTPЗапросов.Записать(Запрос, Ответ, ДанныеЗапроса);
	
	Возврат Ответ;
	
КонецФункции

Функция СообщенияОбменаРезультатПолучить(Запрос)
	
	Перем ДанныеЗапроса;
	
	Попытка
		
		ПараметрыОбработкиВходящегоЗапроса = SUI_HTTPСервисКлиентСервер.ПараметрыОбработкиВходящегоЗапроса();
		ПараметрыОбработкиВходящегоЗапроса.ПрочитатьПараметрыИзТела = Ложь;
		ДанныеЗапроса = SUI_HTTPСервис.ОбработатьВходящийЗапрос(Запрос, ПараметрыОбработкиВходящегоЗапроса);
		
		Если ДанныеЗапроса.РезультатОтвет <> Неопределено Тогда
			Результат = ДанныеЗапроса.РезультатОтвет;
		Иначе
			
			ИдентификаторСообщения = ОбщегоНазначения.ОписаниеТипаСтрока(0).ПривестиЗначение(
				ДанныеЗапроса.Параметры.Получить("messageID"));
			
			ОбщегоНазначенияКлиентСервер.Проверить(Не ПустаяСтрока(ИдентификаторСообщения),
				НСтр("ru = 'Не передан ID сообщения обмена данными'"));
			
			РезультатОбработкиСообщения = РегистрыСведений.SUI_РезультатыОбработкиВходящихСообщенийОбменаДанными.ПолучитьРезультат(ИдентификаторСообщения);
			
			Если РезультатОбработкиСообщения = Неопределено Тогда
				ТекстОшибки = СтрШаблон(НСтр("ru = 'Результат обработки сообщения обмена данными по ID ""%1"" не найден'"), ИдентификаторСообщения);
				Результат = SUI_HTTPСервис.РезультатОшибка(ТекстОшибки, 404);
			Иначе
				Результат = SUI_HTTPСервис.РезультатУспех(РезультатОбработкиСообщения);
			КонецЕсли;
			
		КонецЕсли;
		
	Исключение
		Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Получение обновлений'"), ДанныеЗапроса, ИнформацияОбОшибке());
	КонецПопытки;
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логирование HTTP запросов
	SUI_ЛогированиеHTTPЗапросов.Записать(Запрос, Ответ, ДанныеЗапроса);
	
	Возврат Ответ;
	
КонецФункции

#Область ГрупповойПересчет

Функция ГрупповойПересчетДокументаПолучить(Запрос)
	
	Перем ДанныеЗапроса;
	
	Попытка
		
		ПараметрыОбработкиВходящегоЗапроса = SUI_HTTPСервисКлиентСервер.ПараметрыОбработкиВходящегоЗапроса();
		ПараметрыОбработкиВходящегоЗапроса.ПрочитатьПараметрыИзТела = Истина;
		ПараметрыОбработкиВходящегоЗапроса.ВосстанавливатьСсылкиИдентификаторов = Ложь;
		ДанныеЗапроса = SUI_HTTPСервис.ОбработатьВходящийЗапрос(Запрос, ПараметрыОбработкиВходящегоЗапроса);
		
		Если ДанныеЗапроса.РезультатОтвет <> Неопределено Тогда
			Результат = ДанныеЗапроса.РезультатОтвет;
		Иначе
			
			ИдентификаторДокумента = ОбщегоНазначения.ОписаниеТипаСтрока(36).ПривестиЗначение(ДанныеЗапроса.Параметры.Получить("id_doc"));
			
			ОбщегоНазначенияКлиентСервер.Проверить(СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ИдентификаторДокумента),
				НСтр("ru = 'Не передан идентификатор документа обмена'"));
			
			Результат = SUI_ОбменДаннымиСервер.ГрупповойПересчетПолучить(ДанныеЗапроса.МобильноеУстройство, 
				Новый УникальныйИдентификатор(ИдентификаторДокумента));

		КонецЕсли;
		
	Исключение
		Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Групповой пересчет. Получить'"), ДанныеЗапроса, ИнформацияОбОшибке());
	КонецПопытки;
	
	// Установка заголовков проверки обновления приложения
	SUI_HTTPСервис.УстановитьЗаголовкиОтветаПроверкиОбновления(Результат, ДанныеЗапроса);
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логирование HTTP запросов
	SUI_ЛогированиеHTTPЗапросов.Записать(Запрос, Ответ, ДанныеЗапроса);
	
	Возврат Ответ;
	
КонецФункции

Функция ГрупповойПересчетДокументаЗаписать(Запрос)
	
	Перем ДанныеЗапроса;
	
	Попытка
		
		ПараметрыОбработкиВходящегоЗапроса = SUI_HTTPСервисКлиентСервер.ПараметрыОбработкиВходящегоЗапроса();
		ПараметрыОбработкиВходящегоЗапроса.ВосстанавливатьСсылкиИдентификаторов = Ложь;
		ДанныеЗапроса = SUI_HTTPСервис.ОбработатьВходящийЗапрос(Запрос, ПараметрыОбработкиВходящегоЗапроса);
		
		Если ДанныеЗапроса.РезультатОтвет <> Неопределено Тогда
			Результат = ДанныеЗапроса.РезультатОтвет;
		Иначе
			
			Результат = SUI_ОбменДаннымиСервер.ГрупповойПересчетЗагрузить(ДанныеЗапроса.МобильноеУстройство, ДанныеЗапроса.Тело, Ложь);
			
		КонецЕсли;
		
	Исключение
		Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Групповой пересчет. Записать'"), ДанныеЗапроса, ИнформацияОбОшибке());
	КонецПопытки;
	
	// Установка заголовков проверки обновления приложения
	SUI_HTTPСервис.УстановитьЗаголовкиОтветаПроверкиОбновления(Результат, ДанныеЗапроса);
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логирование HTTP запросов
	SUI_ЛогированиеHTTPЗапросов.Записать(Запрос, Ответ, ДанныеЗапроса);
	
	Возврат Ответ;
	
КонецФункции

Функция ГрупповойПересчетДокументаПерезаписать(Запрос)
	
	Перем ДанныеЗапроса;
	
	Попытка
		
		ПараметрыОбработкиВходящегоЗапроса = SUI_HTTPСервисКлиентСервер.ПараметрыОбработкиВходящегоЗапроса();
		ПараметрыОбработкиВходящегоЗапроса.ВосстанавливатьСсылкиИдентификаторов = Ложь;
		ДанныеЗапроса = SUI_HTTPСервис.ОбработатьВходящийЗапрос(Запрос, ПараметрыОбработкиВходящегоЗапроса);
		
		Если ДанныеЗапроса.РезультатОтвет <> Неопределено Тогда
			Результат = ДанныеЗапроса.РезультатОтвет;
		Иначе
			
			Результат = SUI_ОбменДаннымиСервер.ГрупповойПересчетЗагрузить(ДанныеЗапроса.МобильноеУстройство, ДанныеЗапроса.Тело, Истина);
			
		КонецЕсли;
		
	Исключение
		Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Групповой пересчет. Перезаписать'"), ДанныеЗапроса, ИнформацияОбОшибке());
	КонецПопытки;
	
	// Установка заголовков проверки обновления приложения
	SUI_HTTPСервис.УстановитьЗаголовкиОтветаПроверкиОбновления(Результат, ДанныеЗапроса);
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логирование HTTP запросов
	SUI_ЛогированиеHTTPЗапросов.Записать(Запрос, Ответ, ДанныеЗапроса);
	
	Возврат Ответ;
	
КонецФункции

Функция ГрупповойПересчетДокументаЗавершить(Запрос)
	
	Перем ДанныеЗапроса;
	
	Попытка
		
		ПараметрыОбработкиВходящегоЗапроса = SUI_HTTPСервисКлиентСервер.ПараметрыОбработкиВходящегоЗапроса();
		ПараметрыОбработкиВходящегоЗапроса.ВосстанавливатьСсылкиИдентификаторов = Ложь;
		ДанныеЗапроса = SUI_HTTPСервис.ОбработатьВходящийЗапрос(Запрос, ПараметрыОбработкиВходящегоЗапроса);
		
		Если ДанныеЗапроса.РезультатОтвет <> Неопределено Тогда
			Результат = ДанныеЗапроса.РезультатОтвет;
		Иначе
			
			ИдентификаторДокумента = ОбщегоНазначения.ОписаниеТипаСтрока(36).ПривестиЗначение(ДанныеЗапроса.Параметры.Получить("id_doc"));
			
			ОбщегоНазначенияКлиентСервер.Проверить(СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ИдентификаторДокумента),
				НСтр("ru = 'Не передан идентификатор документа обмена'"));
			
			Результат = SUI_ОбменДаннымиСервер.ГрупповойПересчетЗавершить(ДанныеЗапроса.МобильноеУстройство, ИдентификаторДокумента);

		КонецЕсли;
		
	Исключение
		Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Групповой пересчет. Завершить'"), ДанныеЗапроса, ИнформацияОбОшибке());
	КонецПопытки;
	
	// Установка заголовков проверки обновления приложения
	SUI_HTTPСервис.УстановитьЗаголовкиОтветаПроверкиОбновления(Результат, ДанныеЗапроса);
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логирование HTTP запросов
	SUI_ЛогированиеHTTPЗапросов.Записать(Запрос, Ответ, ДанныеЗапроса);
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#Область УстаревшиеПроцедурыИФункции

// Устарела. см. ГрупповойПересчетДокументаЗаписать
//
Функция СтрокиПересчетаДокументаПерезаписать(Запрос)
	
	// TODO:  Перенаправление на новый HTTP метод
	Возврат ГрупповойПересчетДокументаПерезаписать(Запрос);

КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбработатьИсключительнуюОшибку(КонтекстОшибки, ДанныеЗапроса, Ошибка, КодСостояния = 500)
	
	SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(
		SUI_HTTPСервисКлиентСервер.ИмяСобытия(КонтекстОшибки),
		УровеньЖурналаРегистрации.Ошибка,
		Метаданные.HTTPСервисы.SUI_Exchange,
		SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗапроса, "МобильноеУстройство"),
		Ошибка);
	
	Возврат SUI_HTTPСервис.РезультатОшибка(Ошибка, КодСостояния);
		
КонецФункции

Функция СоздатьВходящиеСообщение(МобильноеУстройство, ИмяМетода, ПараметрыМетода, ДополнительныеПараметры = Неопределено)
	
	Результат = Новый Структура();
	Результат.Вставить("approved", 	Истина);
	Результат.Вставить("messageID", SUI_СообщенияОбменаДанными.СоздатьВходящиеСообщение(
		МобильноеУстройство, ИмяМетода, ПараметрыМетода, ДополнительныеПараметры));
	
	Возврат SUI_HTTPСервис.РезультатУспех(Результат);
	
КонецФункции

#КонецОбласти
