
#Область ОбработчикиСобытий

Функция ДанныеПолучить(Запрос)
	
	ПараметрыОбработкиЗапроса = SUI_HTTPСервис.ПараметрыОбработкиЗапроса();
	ДанныеЗапроса = SUI_HTTPСервис.ОбработатьЗапрос(Запрос, ПараметрыОбработкиЗапроса);
	
	Если ДанныеЗапроса.РезультатОтвет = Неопределено Тогда
		
		Попытка
			Результат = SUI_ОбменДаннымиСервер.ПолучитьДанные(ДанныеЗапроса.МобильноеУстройство.Ссылка);
		Исключение
			Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Получение данных'"), ДанныеЗапроса, ИнформацияОбОшибке());
		КонецПопытки;
		
	Иначе
		Результат = ДанныеЗапроса.РезультатОтвет;
	КонецЕсли;
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логировать HTTP запрос
	Если ДанныеЗапроса.ЕстьБазовыеПраваБСП Тогда
		ВыполнитьЛогирование(Запрос, Ответ, ДанныеЗапроса.МобильноеУстройство.ОтключитьЛогирование);
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция ДокументыСоздать(Запрос)
	
	ПараметрыОбработкиЗапроса = SUI_HTTPСервис.ПараметрыОбработкиЗапроса();
	ПараметрыОбработкиЗапроса.ПрочитатьПараметрыИзТела = Истина;
	ДанныеЗапроса = SUI_HTTPСервис.ОбработатьЗапрос(Запрос, ПараметрыОбработкиЗапроса);
	
	Если ДанныеЗапроса.РезультатОтвет = Неопределено Тогда
		
		Попытка
			
			НастройкаДокумента = ДанныеЗапроса.Параметры.Получить("id_doc_type");
			
			ОбщегоНазначенияКлиентСервер.Проверить(НастройкаДокумента <> Неопределено,
				НСтр("ru = 'Не передан идентификатор настройки документа обмена.'"));
			
			ОписаниеТипаНастройкаДокумента = Новый ОписаниеТипов("СправочникСсылка.SUI_НастройкиДокументов");
			НастройкаДокумента = ОписаниеТипаНастройкаДокумента.ПривестиЗначение(НастройкаДокумента);
			
			ОбщегоНазначенияКлиентСервер.Проверить(ОбщегоНазначения.СсылкаСуществует(НастройкаДокумента),
				НСтр("ru = 'По переданному идентификатору настройка документа не существует.'"));
			
			Результат = SUI_ОбменДаннымиСервер.СоздатьДокумент(ДанныеЗапроса.МобильноеУстройство.Ссылка, НастройкаДокумента);
			
		Исключение
			Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Создать документы'"), ДанныеЗапроса, ИнформацияОбОшибке());
		КонецПопытки;
		
	Иначе
		Результат = ДанныеЗапроса.РезультатОтвет;
	КонецЕсли;
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логировать HTTP запрос
	Если ДанныеЗапроса.ЕстьБазовыеПраваБСП Тогда
		ВыполнитьЛогирование(Запрос, Ответ, ДанныеЗапроса.МобильноеУстройство.ОтключитьЛогирование);
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция ОбновитьДокументы(Запрос)
	
	ДанныеЗапроса = SUI_HTTPСервис.ОбработатьЗапрос(Запрос);
	
	Если ДанныеЗапроса.РезультатОтвет = Неопределено Тогда
		
		Попытка
			
			ПараметрыМетода = SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.МассивЗначений(
				ДанныеЗапроса.МобильноеУстройство.Ссылка, 
				SUI_СообщенияОбменаДанными.СжатьСтроку(ДанныеЗапроса.Тело));
			
			ДополнительныеПараметры = SUI_СообщенияОбменаДанными.ДополнительныеПараметрыСообщенияОперации();
			ДополнительныеПараметры.ВТранзакции = Истина;
			
			Результат = СоздатьВходящиеСообщениеОперации(ДанныеЗапроса.МобильноеУстройство.Ссылка,
				"SUI_ОбменДаннымиСервер.ЗагрузитьДанныеДокументов", ПараметрыМетода, ДополнительныеПараметры);
			
		Исключение
			Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Обновить документы'"), ДанныеЗапроса, ИнформацияОбОшибке());
		КонецПопытки;
		
	Иначе
		Результат = ДанныеЗапроса.РезультатОтвет;
	КонецЕсли;
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логировать HTTP запрос
	Если ДанныеЗапроса.ЕстьБазовыеПраваБСП Тогда
		ВыполнитьЛогирование(Запрос, Ответ, ДанныеЗапроса.МобильноеУстройство.ОтключитьЛогирование);
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция ЦеныНоменклатурыПолучить(Запрос)
	
	ПараметрыОбработкиЗапроса = SUI_HTTPСервис.ПараметрыОбработкиЗапроса();
	ПараметрыОбработкиЗапроса.ПрочитатьПараметрыИзТела = Истина;
	ДанныеЗапроса = SUI_HTTPСервис.ОбработатьЗапрос(Запрос, ПараметрыОбработкиЗапроса);
	
	Если ДанныеЗапроса.РезультатОтвет = Неопределено Тогда
		
		Попытка
			
			Параметры = Новый Структура();
			Параметры.Вставить("Номенклатура", 		ДанныеЗапроса.Параметры.Получить("id_good"));
			Параметры.Вставить("Характеристика", 	ДанныеЗапроса.Параметры.Получить("id_property"));
			Параметры.Вставить("Упаковка", 			ДанныеЗапроса.Параметры.Получить("id_unit"));
			Параметры.Вставить("ВидЦены", 			ДанныеЗапроса.Параметры.Получить("id_price_type"));
			
			Результат = SUI_ОбменДаннымиСервер.ПолучитьЦеныНоменклатуры(Параметры);
			
		Исключение
			Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Цены номенклатуры'"), ДанныеЗапроса, ИнформацияОбОшибке());
		КонецПопытки;
		
	Иначе
		Результат = ДанныеЗапроса.РезультатОтвет;
	КонецЕсли;
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логировать HTTP запрос
	Если ДанныеЗапроса.ЕстьБазовыеПраваБСП Тогда
		ВыполнитьЛогирование(Запрос, Ответ, ДанныеЗапроса.МобильноеУстройство.ОтключитьЛогирование);
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция ТоварыВЯчейкахПолучить(Запрос)
	
	ПараметрыОбработкиЗапроса = SUI_HTTPСервис.ПараметрыОбработкиЗапроса();
	ПараметрыОбработкиЗапроса.ПрочитатьПараметрыИзТела = Истина;
	ДанныеЗапроса = SUI_HTTPСервис.ОбработатьЗапрос(Запрос, ПараметрыОбработкиЗапроса);
	
	Если ДанныеЗапроса.РезультатОтвет = Неопределено Тогда
		
		Попытка
			
			Параметры = Новый Структура();
			Параметры.Вставить("Номенклатура", 	ДанныеЗапроса.Параметры.Получить("id_good"));
			Параметры.Вставить("Ячейка", 		ДанныеЗапроса.Параметры.Получить("id_cell"));
			
			Результат = SUI_ОбменДаннымиСервер.ПолучитьОстаткиНоменклатурыВЯчейке(Параметры);
			
		Исключение
			Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Товары в ячейках'"), ДанныеЗапроса, ИнформацияОбОшибке());
		КонецПопытки;
		
	Иначе
		Результат = ДанныеЗапроса.РезультатОтвет;
	КонецЕсли;
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логировать HTTP запрос
	Если ДанныеЗапроса.ЕстьБазовыеПраваБСП Тогда
		ВыполнитьЛогирование(Запрос, Ответ, ДанныеЗапроса.МобильноеУстройство.ОтключитьЛогирование);
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция ТоварыНаСкладахПолучить(Запрос)
	
	ПараметрыОбработкиЗапроса = SUI_HTTPСервис.ПараметрыОбработкиЗапроса();
	ПараметрыОбработкиЗапроса.ПрочитатьПараметрыИзТела = Истина;
	ДанныеЗапроса = SUI_HTTPСервис.ОбработатьЗапрос(Запрос, ПараметрыОбработкиЗапроса);
	
	Если ДанныеЗапроса.РезультатОтвет = Неопределено Тогда
		
		Попытка
			
			Параметры = Новый Структура();
			Параметры.Вставить("Номенклатура", 	ДанныеЗапроса.Параметры.Получить("id_good"));
			Параметры.Вставить("Склад", 		ДанныеЗапроса.Параметры.Получить("id_warehouse"));
			
			Результат = SUI_ОбменДаннымиСервер.ПолучитьОстаткиНоменклатурыНаСкладах(Параметры);
			
		Исключение
			Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Товары на складах'"), ДанныеЗапроса, ИнформацияОбОшибке());
		КонецПопытки;
		
	Иначе
		Результат = ДанныеЗапроса.РезультатОтвет;
	КонецЕсли;
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логировать HTTP запрос
	Если ДанныеЗапроса.ЕстьБазовыеПраваБСП Тогда
		ВыполнитьЛогирование(Запрос, Ответ, ДанныеЗапроса.МобильноеУстройство.ОтключитьЛогирование);
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция ТестСвязиПолучитьОтвет(Запрос) 
	
	ДанныеЗапроса = SUI_HTTPСервис.ОбработатьЗапрос(Запрос);
	
	Результат = SUI_HTTPСервис.РезультатУспех(Новый Структура("result", Истина));
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логировать HTTP запрос
	Если ДанныеЗапроса.ЕстьБазовыеПраваБСП Тогда
		ВыполнитьЛогирование(Запрос, Ответ, ДанныеЗапроса.МобильноеУстройство.ОтключитьЛогирование);
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция РегистрацияИзмененийМобильногоУстройстваСбросить(Запрос)  
	
	ДанныеЗапроса = SUI_HTTPСервис.ОбработатьЗапрос(Запрос);
	
	Если ДанныеЗапроса.РезультатОтвет = Неопределено Тогда
		
		Попытка
			
			SUI_МобильныеУстройстваСервер.ВыполнитьПолнуюВыгрузку(ДанныеЗапроса.МобильноеУстройство.Ссылка);
			
			ТекстСообщения = НСтр("ru = 'Состояние полной выгрузки для мобильного устройство изменено.
			|Ожидайте загрузки данных.'");
			
			Результат = SUI_HTTPСервис.РезультатУспех(Новый Структура("message", ТекстСообщения));
			
		Исключение
			Результат = ОбработатьИсключительнуюОшибку(
				НСтр("ru = 'Запрос полной выгрузки'"), ДанныеЗапроса, ИнформацияОбОшибке());
		КонецПопытки;
		
	Иначе
		Результат = ДанныеЗапроса.РезультатОтвет;
	КонецЕсли;
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логировать HTTP запрос
	Если ДанныеЗапроса.ЕстьБазовыеПраваБСП Тогда
		ВыполнитьЛогирование(Запрос, Ответ, ДанныеЗапроса.МобильноеУстройство.ОтключитьЛогирование);
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция СообщенияСоздать(Запрос)
	
	ДанныеЗапроса = SUI_HTTPСервис.ОбработатьЗапрос(Запрос);
	
	Если ДанныеЗапроса.РезультатОтвет = Неопределено Тогда
		
		Попытка
			
			ДанныеСообщения = SUI_ОбщегоНазначенияКлиентСервер.ДанныеИзСтрокиJSON(ДанныеЗапроса.Тело, Ложь);
    		
    		ТекстСообщения = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеСообщения, "text", "", Тип("Строка"));
    		
    		ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(ТекстСообщения), 
    			НСтр("ru = 'Передано пустое сообщение.'"));
			
			SUI_СообщенияМобильныхУстройств.ОтправитьСообщениеГлавномуУзлу(
				ДанныеЗапроса.МобильноеУстройство.Ссылка, ТекстСообщения);
 
 			Результат = SUI_HTTPСервис.РезультатУспех(Новый Структура("result", Истина), 201);
			
		Исключение
			Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Сообщения'"), ДанныеЗапроса, ИнформацияОбОшибке());
		КонецПопытки;
		
	Иначе
		Результат = ДанныеЗапроса.РезультатОтвет;
	КонецЕсли;
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логировать HTTP запрос
	Если ДанныеЗапроса.ЕстьБазовыеПраваБСП Тогда
		ВыполнитьЛогирование(Запрос, Ответ, ДанныеЗапроса.МобильноеУстройство.ОтключитьЛогирование);
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция ШаблоныЭтикетокПолучить(Запрос)
	
	ДанныеЗапроса = SUI_HTTPСервис.ОбработатьЗапрос(Запрос);
	
	Если ДанныеЗапроса.РезультатОтвет = Неопределено Тогда
		
		Попытка
			Результат = SUI_ОбменДаннымиСервер.ПолучитьШаблоныЭтикеток();
		Исключение
			Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Шаблоны этикеток'"), ДанныеЗапроса, ИнформацияОбОшибке());
		КонецПопытки;
		
	Иначе
		Результат = ДанныеЗапроса.РезультатОтвет;
	КонецЕсли;
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логировать HTTP запрос
	Если ДанныеЗапроса.ЕстьБазовыеПраваБСП Тогда
		ВыполнитьЛогирование(Запрос, Ответ, ДанныеЗапроса.МобильноеУстройство.ОтключитьЛогирование);
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция ШтрихкодыНоменклатурыСоздатьШтрихкодыНоменклатуры(Запрос)
	
	ДанныеЗапроса = SUI_HTTPСервис.ОбработатьЗапрос(Запрос);
	
	Если ДанныеЗапроса.РезультатОтвет = Неопределено Тогда
		
		Попытка
			
			ДанныеШтрихкодов = SUI_ОбщегоНазначенияКлиентСервер.ДанныеИзСтрокиJSON(ДанныеЗапроса.Тело, Ложь, , ,
				"ВосстановлениеДанныхJSON_СоздатьШтрихкодыНоменклатуры", SUI_ОбменДаннымиСервер);
			
			Результат = SUI_ОбменДаннымиСервер.СоздатьШтрихкодыНоменклатуры(
				ДанныеЗапроса.МобильноеУстройство.Ссылка, ДанныеШтрихкодов);
			
		Исключение
			Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Штрихкоды номенклатуры'"), 
				ДанныеЗапроса, ИнформацияОбОшибке());
		КонецПопытки;
		
	Иначе
		Результат = ДанныеЗапроса.РезультатОтвет;
	КонецЕсли;
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логировать HTTP запрос
	Если ДанныеЗапроса.ЕстьБазовыеПраваБСП Тогда
		ВыполнитьЛогирование(Запрос, Ответ, ДанныеЗапроса.МобильноеУстройство.ОтключитьЛогирование);
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция ПользовательскийЗапросВыполнить(Запрос)
	
	ДанныеЗапроса = SUI_HTTPСервис.ОбработатьЗапрос(Запрос);
	
	Если ДанныеЗапроса.РезультатОтвет = Неопределено Тогда
		
		Попытка
			
			НастройкиЗапроса = SUI_ОбщегоНазначенияКлиентСервер.ДанныеИзСтрокиJSON(ДанныеЗапроса.Тело, Ложь, , ,
				"ВосстановлениеДанныхJSON_НастройкиПользовательскогоЗапроса", SUI_ОбменДаннымиСервер);
			
			Результат = SUI_ОбменДаннымиСервер.ВыполнитьПользовательскийЗапрос(
				ДанныеЗапроса.МобильноеУстройство.Ссылка, НастройкиЗапроса);
			
		Исключение
			Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Пользовательский запрос'"), 
				ДанныеЗапроса, ИнформацияОбОшибке());
		КонецПопытки;
		
	Иначе
		Результат = ДанныеЗапроса.РезультатОтвет;
	КонецЕсли;
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логировать HTTP запрос
	Если ДанныеЗапроса.ЕстьБазовыеПраваБСП Тогда
		ВыполнитьЛогирование(Запрос, Ответ, ДанныеЗапроса.МобильноеУстройство.ОтключитьЛогирование);
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция ПеремещениеЗапасовСоздать(Запрос)
	
	ПараметрыОбработкиЗапроса = SUI_HTTPСервис.ПараметрыОбработкиЗапроса();
	ПараметрыОбработкиЗапроса.ПрочитатьПараметрыИзТела = Истина;
	ДанныеЗапроса = SUI_HTTPСервис.ОбработатьЗапрос(Запрос, ПараметрыОбработкиЗапроса);
	
	Если ДанныеЗапроса.РезультатОтвет = Неопределено Тогда
		
		Попытка
			
			Параметры = Новый Структура();
			Параметры.Вставить("Отправитель", 	ДанныеЗапроса.Параметры.Получить("id_sender"));
			Параметры.Вставить("Получатель", 	ДанныеЗапроса.Параметры.Получить("id_recipient"));
			
			Результат = SUI_ОбменДаннымиСервер.СоздатьДокументПеремещенияЗапасов(
				ДанныеЗапроса.МобильноеУстройство.Ссылка, Параметры);
			
		Исключение
			Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Перемещение запасов. Создать'"), 
				ДанныеЗапроса, ИнформацияОбОшибке());
		КонецПопытки;
		
	Иначе
		Результат = ДанныеЗапроса.РезультатОтвет;
	КонецЕсли;
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логировать HTTP запрос
	Если ДанныеЗапроса.ЕстьБазовыеПраваБСП Тогда
		ВыполнитьЛогирование(Запрос, Ответ, ДанныеЗапроса.МобильноеУстройство.ОтключитьЛогирование);
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция ОстаткиИЦеныПолучить(Запрос)
	
	ПараметрыОбработкиЗапроса = SUI_HTTPСервис.ПараметрыОбработкиЗапроса();
	ПараметрыОбработкиЗапроса.ПрочитатьПараметрыИзТела = Истина;
	ПараметрыОбработкиЗапроса.ВосстанавливатьСсылкиИдентификаторов = Ложь;
	ДанныеЗапроса = SUI_HTTPСервис.ОбработатьЗапрос(Запрос, ПараметрыОбработкиЗапроса);
	
	Если ДанныеЗапроса.РезультатОтвет = Неопределено Тогда
		
		Попытка
			
			Параметры = Новый Структура();
			Параметры.Вставить("Номенклатура", 		ДанныеЗапроса.Параметры.Получить("id_good"));
			Параметры.Вставить("Характеристика", 	ДанныеЗапроса.Параметры.Получить("id_property"));
			
			Если Параметры.Номенклатура = Неопределено Тогда
				Результат = SUI_HTTPСервис.РезультатОшибка(
					НСтр("ru = 'Не передано значение параметра ""id_good"".'"), 400);
			Иначе
				
				SUI_ИнтеграцияВКонфигурацию.ВосстановитьСсылкиИдентификаторовSimple(Параметры, , Истина);
				
				Результат = SUI_ОбменДаннымиСервер.ПолучитьОстаткиИЦены(
					ДанныеЗапроса.МобильноеУстройство.Ссылка, Параметры);
				
			КонецЕсли;
			
		Исключение
			Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Остатки и цены'"), 
				ДанныеЗапроса, ИнформацияОбОшибке());
		КонецПопытки;
		
	Иначе
		Результат = ДанныеЗапроса.РезультатОтвет;
	КонецЕсли;
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логировать HTTP запрос
	Если ДанныеЗапроса.ЕстьБазовыеПраваБСП Тогда
		ВыполнитьЛогирование(Запрос, Ответ, ДанныеЗапроса.МобильноеУстройство.ОтключитьЛогирование);
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция ОбновленияКонфигурацийПриложенийПолучить(Запрос)
	
	ПараметрыОбработкиЗапроса = SUI_HTTPСервис.ПараметрыОбработкиЗапроса();
	ПараметрыОбработкиЗапроса.ВосстанавливатьСсылкиИдентификаторов = Ложь;
	ДанныеЗапроса = SUI_HTTPСервис.ОбработатьЗапрос(Запрос, ПараметрыОбработкиЗапроса);
	
	Если ДанныеЗапроса.РезультатОтвет = Неопределено Тогда
		
		Попытка
			
			//TODO: artem - 24.12.2024 - Врем.откл.
			ВызватьИсключение НСтр("ru = 'Временно отключено.'");
			
//			Результат = SUI_ОбменДаннымиСервер.ПолучитьОбновленияКонфигурацийПриложений(
//				ДанныеЗапроса.МобильноеУстройство.ВерсияПриложения, 
//				ДанныеЗапроса.ИспользованиеТестовыхВерсийПриложений);
			
		Исключение
			Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Получение обновлений'"), 
				ДанныеЗапроса, ИнформацияОбОшибке());
		КонецПопытки;
		
	Иначе
		Результат = ДанныеЗапроса.РезультатОтвет;
	КонецЕсли;
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логировать HTTP запрос
	Если ДанныеЗапроса.ЕстьБазовыеПраваБСП Тогда
		ВыполнитьЛогирование(Запрос, Ответ, ДанныеЗапроса.МобильноеУстройство.ОтключитьЛогирование);
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция СообщенияОбменаРезультатПолучить(Запрос)
	
	ПараметрыОбработкиЗапроса = SUI_HTTPСервис.ПараметрыОбработкиЗапроса();
	ПараметрыОбработкиЗапроса.ПрочитатьПараметрыИзТела = Истина;
	ПараметрыОбработкиЗапроса.ВосстанавливатьСсылкиИдентификаторов = Ложь;
	ДанныеЗапроса = SUI_HTTPСервис.ОбработатьЗапрос(Запрос, ПараметрыОбработкиЗапроса);
	
	Если ДанныеЗапроса.РезультатОтвет = Неопределено Тогда
		
		Попытка
			
			ИдентификаторСообщения = ОбщегоНазначения.ОписаниеТипаСтрока(0)
				.ПривестиЗначение(ДанныеЗапроса.Параметры.Получить("messageID"));
			
			ОбщегоНазначенияКлиентСервер.Проверить(Не ПустаяСтрока(ИдентификаторСообщения),
				НСтр("ru = 'Не передан ID сообщения обмена данными'"));
			
			РезультатОбработкиСообщения = РегистрыСведений.SUI_РезультатыОбработкиВходящихСообщенийОбменаДанными
				.ПолучитьРезультат(ИдентификаторСообщения);
			
			Если РезультатОбработкиСообщения = Неопределено Тогда
				
				ТекстОшибки = СтрШаблон(
					НСтр("ru = 'Результат обработки сообщения обмена данными по ID ""%1"" не найден'"), 
					ИдентификаторСообщения);
				
				Результат = SUI_HTTPСервис.РезультатОшибка(ТекстОшибки, 404);
				
			Иначе
				Результат = SUI_HTTPСервис.РезультатУспех(РезультатОбработкиСообщения);
			КонецЕсли;
			
		Исключение
			Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Сообщения обмена'"), 
				ДанныеЗапроса, ИнформацияОбОшибке());
		КонецПопытки;
		
	Иначе
		Результат = ДанныеЗапроса.РезультатОтвет;
	КонецЕсли;
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логировать HTTP запрос
	Если ДанныеЗапроса.ЕстьБазовыеПраваБСП Тогда
		ВыполнитьЛогирование(Запрос, Ответ, ДанныеЗапроса.МобильноеУстройство.ОтключитьЛогирование);
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

#Область ГрупповойПересчет

Функция ГрупповойПересчетДокументаПолучить(Запрос)
	
	ПараметрыОбработкиЗапроса = SUI_HTTPСервис.ПараметрыОбработкиЗапроса();
	ПараметрыОбработкиЗапроса.ПрочитатьПараметрыИзТела = Истина;
	ПараметрыОбработкиЗапроса.ВосстанавливатьСсылкиИдентификаторов = Ложь;
	ДанныеЗапроса = SUI_HTTPСервис.ОбработатьЗапрос(Запрос, ПараметрыОбработкиЗапроса);
	
	Если ДанныеЗапроса.РезультатОтвет = Неопределено Тогда
		
		Попытка
			
			ИдентификаторДокумента = ОбщегоНазначения.ОписаниеТипаСтрока(69)
				.ПривестиЗначение(ДанныеЗапроса.Параметры.Получить("id_doc"));
			
			Результат = SUI_ОбменДаннымиСервер.ПолучитьДанныеГрупповогоПересчетаДокумента(
				ДанныеЗапроса.МобильноеУстройство.Ссылка, ИдентификаторДокумента);
			
		Исключение
			Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Групповой пересчет. Получить'"), 
				ДанныеЗапроса, ИнформацияОбОшибке());
		КонецПопытки;
		
	Иначе
		Результат = ДанныеЗапроса.РезультатОтвет;
	КонецЕсли;
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логировать HTTP запрос
	Если ДанныеЗапроса.ЕстьБазовыеПраваБСП Тогда
		ВыполнитьЛогирование(Запрос, Ответ, ДанныеЗапроса.МобильноеУстройство.ОтключитьЛогирование);
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция ГрупповойПересчетДокументаЗаписать(Запрос)
	
	ПараметрыОбработкиЗапроса = SUI_HTTPСервис.ПараметрыОбработкиЗапроса();
	ПараметрыОбработкиЗапроса.ВосстанавливатьСсылкиИдентификаторов = Ложь;
	ДанныеЗапроса = SUI_HTTPСервис.ОбработатьЗапрос(Запрос, ПараметрыОбработкиЗапроса);
	
	Если ДанныеЗапроса.РезультатОтвет = Неопределено Тогда
		
		Попытка
			
			ИдентификаторДокумента = ОбщегоНазначения.ОписаниеТипаСтрока(69)
				.ПривестиЗначение(ДанныеЗапроса.Параметры.Получить("id_doc"));

			СтрокиДокумента = SUI_ОбщегоНазначенияКлиентСервер.ДанныеИзСтрокиJSON(ДанныеЗапроса.Тело, Ложь, , ,
				"ВосстановлениеДанныхJSON_ПересчетТоваровДокумента", SUI_ОбменДаннымиСервер);

			Результат = SUI_ОбменДаннымиСервер.ЗагрузитьДанныеГрупповогоПересчетаДокумента(
				ДанныеЗапроса.МобильноеУстройство.Ссылка, ИдентификаторДокумента, СтрокиДокумента);
			
		Исключение
			Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Групповой пересчет. Записать'"), 
				ДанныеЗапроса, ИнформацияОбОшибке());
		КонецПопытки;
		
	Иначе
		Результат = ДанныеЗапроса.РезультатОтвет;
	КонецЕсли;
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логировать HTTP запрос
	Если ДанныеЗапроса.ЕстьБазовыеПраваБСП Тогда
		ВыполнитьЛогирование(Запрос, Ответ, ДанныеЗапроса.МобильноеУстройство.ОтключитьЛогирование);
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция ГрупповойПересчетДокументаПерезаписать(Запрос)
	
	ПараметрыОбработкиЗапроса = SUI_HTTPСервис.ПараметрыОбработкиЗапроса();
	ПараметрыОбработкиЗапроса.ВосстанавливатьСсылкиИдентификаторов = Ложь;
	ДанныеЗапроса = SUI_HTTPСервис.ОбработатьЗапрос(Запрос, ПараметрыОбработкиЗапроса);
	
	Если ДанныеЗапроса.РезультатОтвет = Неопределено Тогда
		
		Попытка
			
			ИдентификаторДокумента = ОбщегоНазначения.ОписаниеТипаСтрока(69)
				.ПривестиЗначение(ДанныеЗапроса.Параметры.Получить("id_doc"));

			СтрокиДокумента = SUI_ОбщегоНазначенияКлиентСервер.ДанныеИзСтрокиJSON(ДанныеЗапроса.Тело, Ложь, , ,
				"ВосстановлениеДанныхJSON_ПересчетТоваровДокумента", SUI_ОбменДаннымиСервер);

			Результат = SUI_ОбменДаннымиСервер.ЗагрузитьДанныеГрупповогоПересчетаДокумента(
				ДанныеЗапроса.МобильноеУстройство.Ссылка, ИдентификаторДокумента, СтрокиДокумента, Истина);
			
		Исключение
			Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Групповой пересчет. Перезаписать'"), 
				ДанныеЗапроса, ИнформацияОбОшибке());
		КонецПопытки;
		
	Иначе
		Результат = ДанныеЗапроса.РезультатОтвет;
	КонецЕсли;
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логировать HTTP запрос
	Если ДанныеЗапроса.ЕстьБазовыеПраваБСП Тогда
		ВыполнитьЛогирование(Запрос, Ответ, ДанныеЗапроса.МобильноеУстройство.ОтключитьЛогирование);
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

Функция ГрупповойПересчетДокументаЗавершить(Запрос)
	
	ПараметрыОбработкиЗапроса = SUI_HTTPСервис.ПараметрыОбработкиЗапроса();
	ПараметрыОбработкиЗапроса.ВосстанавливатьСсылкиИдентификаторов = Ложь;
	ДанныеЗапроса = SUI_HTTPСервис.ОбработатьЗапрос(Запрос, ПараметрыОбработкиЗапроса);
	
	Если ДанныеЗапроса.РезультатОтвет = Неопределено Тогда
		
		Попытка
			
			ИдентификаторДокумента = ОбщегоНазначения.ОписаниеТипаСтрока(69)
				.ПривестиЗначение(ДанныеЗапроса.Параметры.Получить("id_doc"));
			
			Результат = SUI_ОбменДаннымиСервер.ЗавершитьГрупповойПересчетДокумента(
				ДанныеЗапроса.МобильноеУстройство.Ссылка, ИдентификаторДокумента);
			
		Исключение
			Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Групповой пересчет. Завершить'"), 
				ДанныеЗапроса, ИнформацияОбОшибке());
		КонецПопытки;
		
	Иначе
		Результат = ДанныеЗапроса.РезультатОтвет;
	КонецЕсли;
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логировать HTTP запрос
	Если ДанныеЗапроса.ЕстьБазовыеПраваБСП Тогда
		ВыполнитьЛогирование(Запрос, Ответ, ДанныеЗапроса.МобильноеУстройство.ОтключитьЛогирование);
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#Область УстаревшиеПроцедурыИФункции

// Устарела. см. ГрупповойПересчетДокументаЗаписать
//
Функция СтрокиПересчетаДокументаПерезаписать(Запрос)
	
	// TODO:  Перенаправление на новый HTTP метод
	Возврат ГрупповойПересчетДокументаПерезаписать(Запрос);

КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбработатьИсключительнуюОшибку(КонтекстОшибки, ДанныеЗапроса, Ошибка)
	
	SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(
		SUI_HTTPСервисКлиентСервер.ИмяСобытия(КонтекстОшибки),
		УровеньЖурналаРегистрации.Ошибка,
		Метаданные.HTTPСервисы.SUI_Exchange,
		ДанныеЗапроса.МобильноеУстройство.Ссылка,
		Ошибка);
	
	Возврат SUI_HTTPСервис.РезультатОшибка(Ошибка, 500);
		
КонецФункции

Функция СоздатьВходящиеСообщениеОперации(МобильноеУстройство, ИмяМетода, ПараметрыМетода, ДополнительныеПараметры = Неопределено)
	
	ИдентификаторСообщения = SUI_СообщенияОбменаДанными.СоздатьСообщениеОперации(
		МобильноеУстройство, 
		ПланыОбмена.SUI_МобильныеУстройства.ЭтотУзел(), 
		ИмяМетода, 
		ПараметрыМетода,
		ДополнительныеПараметры);
	
	Результат = Новый Структура();
	Результат.Вставить("approved", 	Истина);
	Результат.Вставить("messageID", ИдентификаторСообщения);
	
	Возврат SUI_HTTPСервис.РезультатУспех(Результат);
		
КонецФункции

Процедура ВыполнитьЛогирование(Запрос, Ответ, ОтключитьЛогирование = Ложь)
	
	Если ОтключитьЛогирование Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыДобавленияЗаписиЛогирования = SUI_ЛогированиеHTTPЗапросовКлиентСервер.ПараметрыДобавленияЗаписиЛогирования(
		Запрос, Ответ);
	
	SUI_ЛогированиеHTTPЗапросовКлиентСервер.ДобавитьЗаписьЛогирования(ПараметрыДобавленияЗаписиЛогирования);
	
КонецПроцедуры

#КонецОбласти
