
//@skip-check module-structure-event-regions
#Область ОбработчикиСобытий

Функция ДанныеПолучить(Запрос)
	
	Перем ДанныеЗапроса;
	
	Попытка
		
		ПараметрыОбработкиВходящегоЗапроса = SUI_HTTPСервисКлиентСервер.ПараметрыОбработкиВходящегоЗапроса();
		ПараметрыОбработкиВходящегоЗапроса.ПрочитатьПараметрыИзТела = Истина;
		ДанныеЗапроса = SUI_HTTPСервис.ОбработатьВходящийЗапрос(Запрос, ПараметрыОбработкиВходящегоЗапроса);
		
		Если ДанныеЗапроса.РезультатОтвет <> Неопределено Тогда
			Результат = ДанныеЗапроса.РезультатОтвет;
		Иначе
			
			ТипПолучаемыхДанных = НРег(ОбщегоНазначения.ОписаниеТипаСтрока(9).ПривестиЗначение(
				ДанныеЗапроса.Параметры.Получить("type")));
			
			Результат = SUI_ОбменДаннымиСервер.ПолучитьДанные(ДанныеЗапроса.МобильноеУстройство, 
				ТипПолучаемыхДанных <> "documents", ТипПолучаемыхДанных <> "nsi");
			
		КонецЕсли;
		
	Исключение
		Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Получение данных'"), ДанныеЗапроса, ИнформацияОбОшибке());
	КонецПопытки;
	
	// Установка заголовков проверки обновления приложения
	SUI_HTTPСервис.УстановитьЗаголовкиОтветаПроверкиОбновления(Результат, ДанныеЗапроса);
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логирование HTTP запросов
	ВыполнитьЛогирование(Запрос, Ответ, ДанныеЗапроса.ОтключитьЛогирование);
	
	Возврат Ответ;
	
КонецФункции

Функция ДокументыСоздать(Запрос)
	
	Перем ДанныеЗапроса;
	
	Попытка
		
		ПараметрыОбработкиВходящегоЗапроса = SUI_HTTPСервисКлиентСервер.ПараметрыОбработкиВходящегоЗапроса();
		ПараметрыОбработкиВходящегоЗапроса.ПрочитатьПараметрыИзТела = Истина;
		ДанныеЗапроса = SUI_HTTPСервис.ОбработатьВходящийЗапрос(Запрос, ПараметрыОбработкиВходящегоЗапроса);
		
		Если ДанныеЗапроса.РезультатОтвет <> Неопределено Тогда
			Результат = ДанныеЗапроса.РезультатОтвет;
		Иначе
			
			НастройкаДокумента = ДанныеЗапроса.Параметры.Получить("id_doc_type");
			
			ОбщегоНазначенияКлиентСервер.Проверить(НастройкаДокумента <> Неопределено,
				НСтр("ru = 'Не передан идентификатор настройки документа обмена'"));
			
			ОписаниеТипаНастройкаДокумента = Новый ОписаниеТипов("СправочникСсылка.SUI_НастройкиДокументов");
			НастройкаДокумента = ОписаниеТипаНастройкаДокумента.ПривестиЗначение(НастройкаДокумента);
			
			ОбщегоНазначенияКлиентСервер.Проверить(ОбщегоНазначения.СсылкаСуществует(НастройкаДокумента),
				НСтр("ru = 'По переданному идентификатору настройка документа не существует'"));
			
			Результат = SUI_ОбменДаннымиСервер.СоздатьДокумент(ДанныеЗапроса.МобильноеУстройство, НастройкаДокумента);
			
		КонецЕсли;
		
	Исключение
		Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Создать документы'"), ДанныеЗапроса, ИнформацияОбОшибке());
	КонецПопытки;
	
	// Установка заголовков проверки обновления приложения
	SUI_HTTPСервис.УстановитьЗаголовкиОтветаПроверкиОбновления(Результат, ДанныеЗапроса);
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логирование HTTP запросов
	ВыполнитьЛогирование(Запрос, Ответ, ДанныеЗапроса.ОтключитьЛогирование);
	
	Возврат Ответ;
	
КонецФункции

Функция ОбновитьДокументы(Запрос)

	Перем ДанныеЗапроса;
	
	Попытка
		
		ПараметрыОбработкиВходящегоЗапроса = SUI_HTTPСервисКлиентСервер.ПараметрыОбработкиВходящегоЗапроса();
		ПараметрыОбработкиВходящегоЗапроса.ВосстанавливатьСсылкиИдентификаторов = Ложь;
		ДанныеЗапроса = SUI_HTTPСервис.ОбработатьВходящийЗапрос(Запрос, ПараметрыОбработкиВходящегоЗапроса);
		
		Если ДанныеЗапроса.РезультатОтвет <> Неопределено Тогда
			Результат = ДанныеЗапроса.РезультатОтвет;
		Иначе
			
			ИдентификаторДокумента = SUI_ОбщегоНазначенияКлиентСервер.ЗначениеСоответствия(
				ДанныеЗапроса.Параметры, "id_doc", "", Тип("Строка"));
			
			ОбщегоНазначенияКлиентСервер.Проверить(Не ПустаяСтрока(ИдентификаторДокумента),
				НСтр("ru = 'Не передан параметр ""id_doc""'"));
			
			ПараметрыМетода = SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.МассивЗначений(
				ДанныеЗапроса.МобильноеУстройство, SUI_СообщенияОбменаДанными.СжатьСтроку(ДанныеЗапроса.Тело));
			
			ДополнительныеПараметры = SUI_СообщенияОбменаДанными.ДополнительныеПараметрыСообщенияОперации();
			ДополнительныеПараметры.ВТранзакции = Истина;
			ДополнительныеПараметры.Ключи.Добавить(ИдентификаторДокумента);
			
			Результат = СоздатьВходящиеСообщениеОперации(ДанныеЗапроса.МобильноеУстройство,
				"SUI_ОбменДаннымиСервер.ЗагрузитьДанныеДокументов", ПараметрыМетода, ДополнительныеПараметры);
			
		КонецЕсли;
		
	Исключение
		Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Обновить документы'"), ДанныеЗапроса, ИнформацияОбОшибке());
	КонецПопытки;
	
	// Установка заголовков проверки обновления приложения
	SUI_HTTPСервис.УстановитьЗаголовкиОтветаПроверкиОбновления(Результат, ДанныеЗапроса);
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логирование HTTP запросов
	ВыполнитьЛогирование(Запрос, Ответ, ДанныеЗапроса.ОтключитьЛогирование);
	
	Возврат Ответ;
	
КонецФункции

Функция ЦеныНоменклатурыПолучить(Запрос)
	
	Перем ДанныеЗапроса;
	
	Попытка
		
		ПараметрыОбработкиВходящегоЗапроса = SUI_HTTPСервисКлиентСервер.ПараметрыОбработкиВходящегоЗапроса();
		ПараметрыОбработкиВходящегоЗапроса.ПрочитатьПараметрыИзТела = Истина;
		ДанныеЗапроса = SUI_HTTPСервис.ОбработатьВходящийЗапрос(Запрос, ПараметрыОбработкиВходящегоЗапроса);
		
		Если ДанныеЗапроса.РезультатОтвет <> Неопределено Тогда
			Результат = ДанныеЗапроса.РезультатОтвет;
		Иначе

			Параметры = Новый Структура();
			Параметры.Вставить("Номенклатура", 		ДанныеЗапроса.Параметры.Получить("id_good"));
			Параметры.Вставить("Характеристика", 	ДанныеЗапроса.Параметры.Получить("id_property"));
			Параметры.Вставить("Упаковка", 			ДанныеЗапроса.Параметры.Получить("id_unit"));
			Параметры.Вставить("ВидЦены", 			ДанныеЗапроса.Параметры.Получить("id_price_type"));
			
			Результат = SUI_ОбменДаннымиСервер.ПолучитьЦеныНоменклатуры(Параметры);

		КонецЕсли;
		
	Исключение
		Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Цены номенклатуры'"), ДанныеЗапроса, ИнформацияОбОшибке());
	КонецПопытки;
	
	// Установка заголовков проверки обновления приложения
	SUI_HTTPСервис.УстановитьЗаголовкиОтветаПроверкиОбновления(Результат, ДанныеЗапроса);
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логирование HTTP запросов
	ВыполнитьЛогирование(Запрос, Ответ, ДанныеЗапроса.ОтключитьЛогирование);
	
	Возврат Ответ;
	
КонецФункции

Функция ТоварыВЯчейкахПолучить(Запрос)

	Перем ДанныеЗапроса;
	
	Попытка
		
		ПараметрыОбработкиВходящегоЗапроса = SUI_HTTPСервисКлиентСервер.ПараметрыОбработкиВходящегоЗапроса();
		ПараметрыОбработкиВходящегоЗапроса.ПрочитатьПараметрыИзТела = Истина;
		ДанныеЗапроса = SUI_HTTPСервис.ОбработатьВходящийЗапрос(Запрос, ПараметрыОбработкиВходящегоЗапроса);
		
		Если ДанныеЗапроса.РезультатОтвет <> Неопределено Тогда
			Результат = ДанныеЗапроса.РезультатОтвет;
		Иначе

			Параметры = Новый Структура();
			//Параметры.Вставить("Номенклатура", 	ДанныеЗапроса.Параметры.Получить("id_good"));
			Параметры.Вставить("Ячейка", 		ДанныеЗапроса.Параметры.Получить("id_cell"));
			
			// RS. Кучик
			Параметры.Вставить("Номенклатура", ДанныеЗапроса.Параметры.Получить("id_good"));
			Параметры.Вставить("Склад", ДанныеЗапроса.Параметры.Получить("id_warehouse"));
			
			// Документ отбора/размещения будет использоваться для получения склада
			Параметры.Вставить("Документ", ДанныеЗапроса.Параметры.Получить("id_doc"));
			//~RS
			
			Результат = SUI_ОбменДаннымиСервер.ПолучитьОстаткиНоменклатурыВЯчейке(Параметры);

		КонецЕсли;
		
	Исключение
		Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Товары в ячейках'"), ДанныеЗапроса, ИнформацияОбОшибке());
	КонецПопытки;
	
	// Установка заголовков проверки обновления приложения
	SUI_HTTPСервис.УстановитьЗаголовкиОтветаПроверкиОбновления(Результат, ДанныеЗапроса);
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логирование HTTP запросов
	ВыполнитьЛогирование(Запрос, Ответ, ДанныеЗапроса.ОтключитьЛогирование);
	
	Возврат Ответ;
	
КонецФункции

Функция ТоварыНаСкладахПолучить(Запрос)

	Перем ДанныеЗапроса;
	
	Попытка
		
		ПараметрыОбработкиВходящегоЗапроса = SUI_HTTPСервисКлиентСервер.ПараметрыОбработкиВходящегоЗапроса();
		ПараметрыОбработкиВходящегоЗапроса.ПрочитатьПараметрыИзТела = Истина;
		ДанныеЗапроса = SUI_HTTPСервис.ОбработатьВходящийЗапрос(Запрос, ПараметрыОбработкиВходящегоЗапроса);
		
		Если ДанныеЗапроса.РезультатОтвет <> Неопределено Тогда
			Результат = ДанныеЗапроса.РезультатОтвет;
		Иначе

			Параметры = Новый Структура();
			Параметры.Вставить("Номенклатура", 	ДанныеЗапроса.Параметры.Получить("id_good"));
			Параметры.Вставить("Склад", 		ДанныеЗапроса.Параметры.Получить("id_warehouse"));
			
			Результат = SUI_ОбменДаннымиСервер.ПолучитьОстаткиНоменклатурыНаСкладах(Параметры);

		КонецЕсли;
		
	Исключение
		Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Товары на складах'"), ДанныеЗапроса, ИнформацияОбОшибке());
	КонецПопытки;
	
	// Установка заголовков проверки обновления приложения
	SUI_HTTPСервис.УстановитьЗаголовкиОтветаПроверкиОбновления(Результат, ДанныеЗапроса);
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логирование HTTP запросов
	ВыполнитьЛогирование(Запрос, Ответ, ДанныеЗапроса.ОтключитьЛогирование);
	
	Возврат Ответ;
	
КонецФункции

Функция ТестСвязиПолучитьОтвет(Запрос) 
	
	ОтключитьЛогирование = Ложь;
	
	Попытка
		
		ИдентификаторУстройства = SUI_HTTPСервисКлиентСервер.ПолучитьИдентификаторУстройства(Запрос.Заголовки);
		
		Если Не ПустаяСтрока(ИдентификаторУстройства) Тогда
			
			УстановитьПривилегированныйРежим(Истина);
			МобильноеУстройство = ПланыОбмена.SUI_МобильныеУстройства.НайтиПоКоду(ИдентификаторУстройства);
			Если Не МобильноеУстройство.Пустая() Тогда
				ОтключитьЛогирование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(МобильноеУстройство, "ОтключитьЛогирование");
			КонецЕсли;
			УстановитьПривилегированныйРежим(Ложь);
			
		КонецЕсли;
		
	Исключение
		ОтключитьЛогирование = Ложь;
	КонецПопытки;
	
	Результат = SUI_HTTPСервис.РезультатУспех(Новый Структура("result", Истина));
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логирование HTTP запросов
	ВыполнитьЛогирование(Запрос, Ответ, ОтключитьЛогирование);
	
	Возврат Ответ;
	
КонецФункции

Функция РегистрацияИзмененийМобильногоУстройстваСбросить(Запрос)  
	
	Перем ДанныеЗапроса;
	
	Попытка
		
		ДанныеЗапроса = SUI_HTTPСервис.ОбработатьВходящийЗапрос(Запрос);
		
		Если ДанныеЗапроса.РезультатОтвет <> Неопределено Тогда
			Результат = ДанныеЗапроса.РезультатОтвет;
		Иначе
			SUI_МобильныеУстройстваСервер.ВыполнитьПолнуюВыгрузку(ДанныеЗапроса.МобильноеУстройство);
			Результат = SUI_HTTPСервис.РезультатУспех(Новый Структура("message", 
	 			НСтр("ru = 'Состояние полной выгрузки для мобильного устройство изменено. Ожидайте загрузки данных.'")));
		КонецЕсли;
		
	Исключение
		Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Запрос полной выгрузки'"), ДанныеЗапроса, ИнформацияОбОшибке());
	КонецПопытки;
	
	// Установка заголовков проверки обновления приложения
	SUI_HTTPСервис.УстановитьЗаголовкиОтветаПроверкиОбновления(Результат, ДанныеЗапроса);
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логирование HTTP запросов
	ВыполнитьЛогирование(Запрос, Ответ, ДанныеЗапроса.ОтключитьЛогирование);
	
	Возврат Ответ;
	
КонецФункции

Функция СообщенияСоздать(Запрос)
	
	Перем ДанныеЗапроса;
	
	Попытка
		
		ДанныеЗапроса = SUI_HTTPСервис.ОбработатьВходящийЗапрос(Запрос);
		
		Если ДанныеЗапроса.РезультатОтвет <> Неопределено Тогда
			Результат = ДанныеЗапроса.РезультатОтвет;
		Иначе

			ДанныеСообщения = SUI_ОбщегоНазначенияКлиентСервер.ДанныеИзСтрокиJSON(ДанныеЗапроса.Тело, Ложь);
    		
    		ТекстСообщения = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеСообщения, "text", "", Тип("Строка"));
    		
    		ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(ТекстСообщения),
				НСтр("ru = 'Передано пустое сообщение'"));
			
			SUI_СообщенияМобильныхУстройств.ОтправитьСообщениеГлавномуУзлу(ДанныеЗапроса.МобильноеУстройство, ТекстСообщения);
 
 			Результат = SUI_HTTPСервис.РезультатУспех(Новый Структура("result", Истина), 201);

		КонецЕсли;
		
	Исключение
		Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Сообщения'"), ДанныеЗапроса, ИнформацияОбОшибке());
	КонецПопытки;
	
	// Установка заголовков проверки обновления приложения
	SUI_HTTPСервис.УстановитьЗаголовкиОтветаПроверкиОбновления(Результат, ДанныеЗапроса);
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логирование HTTP запросов
	ВыполнитьЛогирование(Запрос, Ответ, ДанныеЗапроса.ОтключитьЛогирование);
	
	Возврат Ответ;
	
КонецФункции

Функция ШаблоныЭтикетокПолучить(Запрос)
	
	Перем ДанныеЗапроса;
	
	Попытка
		
		ДанныеЗапроса = SUI_HTTPСервис.ОбработатьВходящийЗапрос(Запрос);
		
		Если ДанныеЗапроса.РезультатОтвет <> Неопределено Тогда
			Результат = ДанныеЗапроса.РезультатОтвет;
		Иначе
 			Результат = SUI_ОбменДаннымиСервер.ПолучитьШаблоныЭтикеток();
		КонецЕсли;
		
	Исключение
		Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Шаблоны этикеток'"), ДанныеЗапроса, ИнформацияОбОшибке());
	КонецПопытки;
	
	// Установка заголовков проверки обновления приложения
	SUI_HTTPСервис.УстановитьЗаголовкиОтветаПроверкиОбновления(Результат, ДанныеЗапроса);
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логирование HTTP запросов
	ВыполнитьЛогирование(Запрос, Ответ, ДанныеЗапроса.ОтключитьЛогирование);
	
	Возврат Ответ;
		
КонецФункции

Функция ШтрихкодыНоменклатурыСоздатьШтрихкодыНоменклатуры(Запрос)
	
	Перем ДанныеЗапроса;
	
	Попытка
		
		ДанныеЗапроса = SUI_HTTPСервис.ОбработатьВходящийЗапрос(Запрос);
		
		Если ДанныеЗапроса.РезультатОтвет <> Неопределено Тогда
			Результат = ДанныеЗапроса.РезультатОтвет;
		Иначе
			ДанныеШтрихкодов = SUI_ОбщегоНазначенияКлиентСервер.ДанныеИзСтрокиJSON(ДанныеЗапроса.Тело, Ложь, , ,
				"ВосстановлениеДанныхJSON_СоздатьШтрихкодыНоменклатуры", SUI_ОбменДаннымиСервер);
			Результат = SUI_ОбменДаннымиСервер.СоздатьШтрихкодыНоменклатуры(ДанныеЗапроса.МобильноеУстройство, ДанныеШтрихкодов);
		КонецЕсли;
		
	Исключение
		Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Штрихкоды номенклатуры'"), ДанныеЗапроса, ИнформацияОбОшибке());
	КонецПопытки;
	
	// Установка заголовков проверки обновления приложения
	SUI_HTTPСервис.УстановитьЗаголовкиОтветаПроверкиОбновления(Результат, ДанныеЗапроса);
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логирование HTTP запросов
	ВыполнитьЛогирование(Запрос, Ответ, ДанныеЗапроса.ОтключитьЛогирование);
	
	Возврат Ответ;
	
КонецФункции

Функция ПользовательскийЗапросВыполнить(Запрос)
	
	Перем ДанныеЗапроса;
	
	Попытка
		
		ДанныеЗапроса = SUI_HTTPСервис.ОбработатьВходящийЗапрос(Запрос);
		
		Если ДанныеЗапроса.РезультатОтвет <> Неопределено Тогда
			Результат = ДанныеЗапроса.РезультатОтвет;
		Иначе
			НастройкиЗапроса = SUI_ОбщегоНазначенияКлиентСервер.ДанныеИзСтрокиJSON(ДанныеЗапроса.Тело, Ложь, , ,
				"ВосстановлениеДанныхJSON_НастройкиПользовательскогоЗапроса", SUI_ОбменДаннымиСервер);
			Результат = SUI_ОбменДаннымиСервер.ВыполнитьПользовательскийЗапрос(ДанныеЗапроса.МобильноеУстройство, НастройкиЗапроса);
		КонецЕсли;
		
	Исключение
		Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Пользовательский запрос'"), ДанныеЗапроса, ИнформацияОбОшибке());
	КонецПопытки;
	
	// Установка заголовков проверки обновления приложения
	SUI_HTTPСервис.УстановитьЗаголовкиОтветаПроверкиОбновления(Результат, ДанныеЗапроса);
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логирование HTTP запросов
	ВыполнитьЛогирование(Запрос, Ответ, ДанныеЗапроса.ОтключитьЛогирование);
	
	Возврат Ответ;
	
КонецФункции

Функция ПеремещениеЗапасовСоздать(Запрос)
	
	Перем ДанныеЗапроса;
	
	Попытка
		ПараметрыОбработкиВходящегоЗапроса = SUI_HTTPСервисКлиентСервер.ПараметрыОбработкиВходящегоЗапроса();
		ПараметрыОбработкиВходящегоЗапроса.ПрочитатьПараметрыИзТела = Истина;
		ДанныеЗапроса = SUI_HTTPСервис.ОбработатьВходящийЗапрос(Запрос, ПараметрыОбработкиВходящегоЗапроса);
		
		Если ДанныеЗапроса.РезультатОтвет <> Неопределено Тогда
			Результат = ДанныеЗапроса.РезультатОтвет;
		Иначе
			
			ОшибкиПередачиПараметров = Новый Массив();
			
			Параметры = Новый Структура();
			Параметры.Вставить("Отправитель", 	ДанныеЗапроса.Параметры.Получить("id_sender"));
			Параметры.Вставить("Получатель", 	ДанныеЗапроса.Параметры.Получить("id_recipient"));
			
			Если ОшибкиПередачиПараметров.Количество() > 0 Тогда
				Результат = SUI_HTTPСервис.РезультатОшибка(ОшибкиПередачиПараметров, 400);
			Иначе
				Результат = SUI_ОбменДаннымиСервер.СоздатьДокументПеремещенияЗапасов(ДанныеЗапроса.МобильноеУстройство, Параметры);
			КонецЕсли;
			
		КонецЕсли;
		
	Исключение
		Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Перемещение запасов. Создать'"), ДанныеЗапроса, ИнформацияОбОшибке());
	КонецПопытки;
	
	// Установка заголовков проверки обновления приложения
	SUI_HTTPСервис.УстановитьЗаголовкиОтветаПроверкиОбновления(Результат, ДанныеЗапроса);
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логирование HTTP запросов
	ВыполнитьЛогирование(Запрос, Ответ, ДанныеЗапроса.ОтключитьЛогирование);
	
	Возврат Ответ;
	
КонецФункции

Функция ОстаткиИЦеныПолучить(Запрос)
	
	Перем ДанныеЗапроса;
	
	Попытка
		ПараметрыОбработкиВходящегоЗапроса = SUI_HTTPСервисКлиентСервер.ПараметрыОбработкиВходящегоЗапроса();
		ПараметрыОбработкиВходящегоЗапроса.ПрочитатьПараметрыИзТела = Истина;
		ПараметрыОбработкиВходящегоЗапроса.ВосстанавливатьСсылкиИдентификаторов = Ложь;
		ДанныеЗапроса = SUI_HTTPСервис.ОбработатьВходящийЗапрос(Запрос, ПараметрыОбработкиВходящегоЗапроса);
		
		Если ДанныеЗапроса.РезультатОтвет <> Неопределено Тогда
			Результат = ДанныеЗапроса.РезультатОтвет;
		Иначе
			
			Параметры = Новый Структура();
			Параметры.Вставить("Номенклатура", 		ДанныеЗапроса.Параметры.Получить("id_good"));
			Параметры.Вставить("Характеристика", 	ДанныеЗапроса.Параметры.Получить("id_property"));
			
			Если Параметры.Номенклатура = Неопределено Тогда
				Результат = SUI_HTTPСервис.РезультатОшибка(
					НСтр("ru = 'Не передано значение параметра ""id_good"".'"), 400);
			Иначе
				SUI_ИнтеграцияВКонфигурацию.ВосстановитьСсылкиИдентификаторовSimple(Параметры, , Истина);
				Результат = SUI_ОбменДаннымиСервер.ПолучитьОстаткиИЦены(ДанныеЗапроса.МобильноеУстройство, Параметры);
			КонецЕсли;
				
		КонецЕсли;
		
	Исключение
		Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Остатки и цены'"), ДанныеЗапроса, ИнформацияОбОшибке());
	КонецПопытки;
	
	// Установка заголовков проверки обновления приложения
	SUI_HTTPСервис.УстановитьЗаголовкиОтветаПроверкиОбновления(Результат, ДанныеЗапроса);
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логирование HTTP запросов
	ВыполнитьЛогирование(Запрос, Ответ, ДанныеЗапроса.ОтключитьЛогирование);
	
	Возврат Ответ;
	
КонецФункции

Функция ОбновленияКонфигурацийПриложенийПолучить(Запрос)
	
	Перем ДанныеЗапроса;
	
	Попытка
		
		ПараметрыОбработкиВходящегоЗапроса = SUI_HTTPСервисКлиентСервер.ПараметрыОбработкиВходящегоЗапроса();
		ПараметрыОбработкиВходящегоЗапроса.ВосстанавливатьСсылкиИдентификаторов = Ложь;
		ДанныеЗапроса = SUI_HTTPСервис.ОбработатьВходящийЗапрос(Запрос, ПараметрыОбработкиВходящегоЗапроса);
		
		Если ДанныеЗапроса.РезультатОтвет <> Неопределено Тогда
			Результат = ДанныеЗапроса.РезультатОтвет;
		Иначе
			Результат = SUI_ОбменДаннымиСервер.ПолучитьОбновленияКонфигурацийПриложений(ДанныеЗапроса.ВерсияПриложения, 
				ДанныеЗапроса.ИспользованиеТестовыхВерсийПриложений);
		КонецЕсли;
		
	Исключение
		Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Получение обновлений'"), ДанныеЗапроса, ИнформацияОбОшибке());
	КонецПопытки;
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логирование HTTP запросов
	ВыполнитьЛогирование(Запрос, Ответ, ДанныеЗапроса.ОтключитьЛогирование);
	
	Возврат Ответ;
	
КонецФункции

Функция СообщенияОбменаРезультатПолучить(Запрос)
	
	Перем ДанныеЗапроса;
	
	Попытка
		
		ПараметрыОбработкиВходящегоЗапроса = SUI_HTTPСервисКлиентСервер.ПараметрыОбработкиВходящегоЗапроса();
		ПараметрыОбработкиВходящегоЗапроса.ПрочитатьПараметрыИзТела = Истина;
		ПараметрыОбработкиВходящегоЗапроса.ВосстанавливатьСсылкиИдентификаторов = Ложь;
		ДанныеЗапроса = SUI_HTTPСервис.ОбработатьВходящийЗапрос(Запрос, ПараметрыОбработкиВходящегоЗапроса);
		
		Если ДанныеЗапроса.РезультатОтвет <> Неопределено Тогда
			Результат = ДанныеЗапроса.РезультатОтвет;
		Иначе
			
			ИдентификаторСообщения = ОбщегоНазначения.ОписаниеТипаСтрока(0).ПривестиЗначение(
				ДанныеЗапроса.Параметры.Получить("messageID"));
			
			ОбщегоНазначенияКлиентСервер.Проверить(Не ПустаяСтрока(ИдентификаторСообщения),
				НСтр("ru = 'Не передан ID сообщения обмена данными'"));
			
			РезультатОбработкиСообщения = РегистрыСведений.SUI_РезультатыОбработкиВходящихСообщенийОбменаДанными.ПолучитьРезультат(ИдентификаторСообщения);
			
			Если РезультатОбработкиСообщения = Неопределено Тогда
				ТекстОшибки = СтрШаблон(НСтр("ru = 'Результат обработки сообщения обмена данными по ID ""%1"" не найден'"), ИдентификаторСообщения);
				Результат = SUI_HTTPСервис.РезультатОшибка(ТекстОшибки, 404);
			Иначе
				Результат = SUI_HTTPСервис.РезультатУспех(РезультатОбработкиСообщения);
			КонецЕсли;
			
		КонецЕсли;
		
	Исключение
		Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Получение обновлений'"), ДанныеЗапроса, ИнформацияОбОшибке());
	КонецПопытки;
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логирование HTTP запросов
	ВыполнитьЛогирование(Запрос, Ответ, ДанныеЗапроса.ОтключитьЛогирование);
	
	Возврат Ответ;
	
КонецФункции

#Область ГрупповойПересчет

Функция ГрупповойПересчетДокументаПолучить(Запрос)
	
	Перем ДанныеЗапроса;
	
	Попытка
		
		ПараметрыОбработкиВходящегоЗапроса = SUI_HTTPСервисКлиентСервер.ПараметрыОбработкиВходящегоЗапроса();
		ПараметрыОбработкиВходящегоЗапроса.ПрочитатьПараметрыИзТела = Истина;
		ПараметрыОбработкиВходящегоЗапроса.ВосстанавливатьСсылкиИдентификаторов = Ложь;
		ДанныеЗапроса = SUI_HTTPСервис.ОбработатьВходящийЗапрос(Запрос, ПараметрыОбработкиВходящегоЗапроса);
		
		Если ДанныеЗапроса.РезультатОтвет <> Неопределено Тогда
			Результат = ДанныеЗапроса.РезультатОтвет;
		Иначе
			
			ИдентификаторДокумента = ОбщегоНазначения.ОписаниеТипаСтрока(69).ПривестиЗначение(
				ДанныеЗапроса.Параметры.Получить("id_doc"));
			Результат = SUI_ОбменДаннымиСервер.ПолучитьДанныеГрупповогоПересчетаДокумента(
				ДанныеЗапроса.МобильноеУстройство, ИдентификаторДокумента);

		КонецЕсли;
		
	Исключение
		Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Групповой пересчет. Получить'"), ДанныеЗапроса, ИнформацияОбОшибке());
	КонецПопытки;
	
	// Установка заголовков проверки обновления приложения
	SUI_HTTPСервис.УстановитьЗаголовкиОтветаПроверкиОбновления(Результат, ДанныеЗапроса);
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логирование HTTP запросов
	ВыполнитьЛогирование(Запрос, Ответ, ДанныеЗапроса.ОтключитьЛогирование);
	
	Возврат Ответ;
	
КонецФункции

Функция ГрупповойПересчетДокументаЗаписать(Запрос)
	
	Перем ДанныеЗапроса;
	
	Попытка
		
		ПараметрыОбработкиВходящегоЗапроса = SUI_HTTPСервисКлиентСервер.ПараметрыОбработкиВходящегоЗапроса();
		ПараметрыОбработкиВходящегоЗапроса.ВосстанавливатьСсылкиИдентификаторов = Ложь;
		ДанныеЗапроса = SUI_HTTPСервис.ОбработатьВходящийЗапрос(Запрос, ПараметрыОбработкиВходящегоЗапроса);
		
		Если ДанныеЗапроса.РезультатОтвет <> Неопределено Тогда
			Результат = ДанныеЗапроса.РезультатОтвет;
		Иначе
			
			ИдентификаторДокумента = ДанныеЗапроса.Параметры.Получить("id_doc");
			
			ОбщегоНазначенияКлиентСервер.Проверить(
				SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(ИдентификаторДокумента),
				НСтр("ru = 'Не передан идентификатор документа!'"));
			
			ДополнительныеПараметрыВосстановления = Новый Структура();
			ДополнительныеПараметрыВосстановления.Вставить("ИдентификаторДокумента", ИдентификаторДокумента);
			
			СтрокиДокумента = SUI_ОбщегоНазначенияКлиентСервер.ДанныеИзСтрокиJSON(ДанныеЗапроса.Тело, Ложь, , ,
				"ВосстановлениеДанныхJSON_ПересчетТоваровДокумента", SUI_ОбменДаннымиСервер,
				ДополнительныеПараметрыВосстановления);
			
			ПараметрыЗагрузкиГрупповогоПересчета = SUI_ОбменДаннымиСервер.ПараметрыЗагрузкиГрупповогоПересчета(
				ДанныеЗапроса.МобильноеУстройство, СтрокиДокумента);
			ПараметрыЗагрузкиГрупповогоПересчета.ЗагрузкаЧерезHTTPСервис = Истина;
			ПараметрыЗагрузкиГрупповогоПересчета.ИдентификаторДокумента = ИдентификаторДокумента;
			
			Результат = SUI_ОбменДаннымиСервер.ЗагрузитьДанныеГрупповогоПересчетаДокумента(
				ПараметрыЗагрузкиГрупповогоПересчета);

		КонецЕсли;
		
	Исключение
		Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Групповой пересчет. Записать'"), ДанныеЗапроса, ИнформацияОбОшибке());
	КонецПопытки;
	
	// Установка заголовков проверки обновления приложения
	SUI_HTTPСервис.УстановитьЗаголовкиОтветаПроверкиОбновления(Результат, ДанныеЗапроса);
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логирование HTTP запросов
	ВыполнитьЛогирование(Запрос, Ответ, ДанныеЗапроса.ОтключитьЛогирование);
	
	Возврат Ответ;
	
КонецФункции

Функция ГрупповойПересчетДокументаПерезаписать(Запрос)
	
	Перем ДанныеЗапроса;
	
	Попытка
		
		ПараметрыОбработкиВходящегоЗапроса = SUI_HTTPСервисКлиентСервер.ПараметрыОбработкиВходящегоЗапроса();
		ПараметрыОбработкиВходящегоЗапроса.ВосстанавливатьСсылкиИдентификаторов = Ложь;
		ДанныеЗапроса = SUI_HTTPСервис.ОбработатьВходящийЗапрос(Запрос, ПараметрыОбработкиВходящегоЗапроса);
		
		Если ДанныеЗапроса.РезультатОтвет <> Неопределено Тогда
			Результат = ДанныеЗапроса.РезультатОтвет;
		Иначе
			
			ИдентификаторДокумента = ДанныеЗапроса.Параметры.Получить("id_doc");
			
			ОбщегоНазначенияКлиентСервер.Проверить(
				SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(ИдентификаторДокумента),
				НСтр("ru = 'Не передан идентификатор документа!'"));
			
			ДополнительныеПараметрыВосстановления = Новый Структура();
			ДополнительныеПараметрыВосстановления.Вставить("МобильноеУстройство", ДанныеЗапроса.МобильноеУстройство);
			ДополнительныеПараметрыВосстановления.Вставить("ИдентификаторДокумента", ИдентификаторДокумента);
			
			СтрокиДокумента = SUI_ОбщегоНазначенияКлиентСервер.ДанныеИзСтрокиJSON(ДанныеЗапроса.Тело, Ложь, , ,
				"ВосстановлениеДанныхJSON_ПересчетТоваровДокумента", SUI_ОбменДаннымиСервер,
				ДополнительныеПараметрыВосстановления);
			
			ПараметрыЗагрузкиГрупповогоПересчета = SUI_ОбменДаннымиСервер.ПараметрыЗагрузкиГрупповогоПересчета(
				ДанныеЗапроса.МобильноеУстройство, СтрокиДокумента);
			ПараметрыЗагрузкиГрупповогоПересчета.ИдентификаторДокумента = ИдентификаторДокумента;
			ПараметрыЗагрузкиГрупповогоПересчета.ЗагрузкаЧерезHTTPСервис = Истина;
			ПараметрыЗагрузкиГрупповогоПересчета.Перезаписать = Истина;
			
			Результат = SUI_ОбменДаннымиСервер.ЗагрузитьДанныеГрупповогоПересчетаДокумента(
				ПараметрыЗагрузкиГрупповогоПересчета);

		КонецЕсли;
		
	Исключение
		Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Групповой пересчет. Перезаписать'"), ДанныеЗапроса, ИнформацияОбОшибке());
	КонецПопытки;
	
	// Установка заголовков проверки обновления приложения
	SUI_HTTPСервис.УстановитьЗаголовкиОтветаПроверкиОбновления(Результат, ДанныеЗапроса);
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логирование HTTP запросов
	ВыполнитьЛогирование(Запрос, Ответ, ДанныеЗапроса.ОтключитьЛогирование);
	
	Возврат Ответ;
	
КонецФункции

Функция ГрупповойПересчетДокументаЗавершить(Запрос)
	
	Перем ДанныеЗапроса;
	
	Попытка
		
		ПараметрыОбработкиВходящегоЗапроса = SUI_HTTPСервисКлиентСервер.ПараметрыОбработкиВходящегоЗапроса();
		ПараметрыОбработкиВходящегоЗапроса.ВосстанавливатьСсылкиИдентификаторов = Ложь;
		ДанныеЗапроса = SUI_HTTPСервис.ОбработатьВходящийЗапрос(Запрос, ПараметрыОбработкиВходящегоЗапроса);
		
		Если ДанныеЗапроса.РезультатОтвет <> Неопределено Тогда
			Результат = ДанныеЗапроса.РезультатОтвет;
		Иначе
			
			ИдентификаторДокумента = ОбщегоНазначения.ОписаниеТипаСтрока(69).ПривестиЗначение(ДанныеЗапроса.Параметры.Получить("id_doc"));

			Результат = SUI_ОбменДаннымиСервер.ЗавершитьГрупповойПересчетДокумента(ДанныеЗапроса.МобильноеУстройство, ИдентификаторДокумента);

		КонецЕсли;
		
	Исключение
		Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Групповой пересчет. Завершить'"), ДанныеЗапроса, ИнформацияОбОшибке());
	КонецПопытки;
	
	// Установка заголовков проверки обновления приложения
	SUI_HTTPСервис.УстановитьЗаголовкиОтветаПроверкиОбновления(Результат, ДанныеЗапроса);
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логирование HTTP запросов
	ВыполнитьЛогирование(Запрос, Ответ, ДанныеЗапроса.ОтключитьЛогирование);
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#Область МодификацияПодКлиента

Функция ЯчейкиТовараПолучить(Запрос)
	
	Перем ДанныеЗапроса;
	
	Попытка
		
		ПараметрыОбработкиВходящегоЗапроса = SUI_HTTPСервисКлиентСервер.ПараметрыОбработкиВходящегоЗапроса();
		ПараметрыОбработкиВходящегоЗапроса.ПрочитатьПараметрыИзТела = Истина;
		ДанныеЗапроса = SUI_HTTPСервис.ОбработатьВходящийЗапрос(Запрос, ПараметрыОбработкиВходящегоЗапроса);
		
		Если ДанныеЗапроса.РезультатОтвет <> Неопределено Тогда
			Результат = ДанныеЗапроса.РезультатОтвет;
		Иначе

			Параметры = Новый Структура();
			Параметры.Вставить("Документ", 		ДанныеЗапроса.Параметры.Получить("id_doc"));
			Параметры.Вставить("Номенклатура", 	ДанныеЗапроса.Параметры.Получить("id_good"));
			
			Результат = SUI_ОбменДаннымиСервер.ПолучитьЯчейкиТовара(Параметры.Документ, Параметры.Номенклатура);

		КонецЕсли;
		
	Исключение
		Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Ячейки товара'"), ДанныеЗапроса, ИнформацияОбОшибке());
	КонецПопытки;
	
	// Установка заголовков проверки обновления приложения
	SUI_HTTPСервис.УстановитьЗаголовкиОтветаПроверкиОбновления(Результат, ДанныеЗапроса);
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логирование HTTP запросов
	ВыполнитьЛогирование(Запрос, Ответ, ДанныеЗапроса.ОтключитьЛогирование);
	
	Возврат Ответ;
	
КонецФункции

Функция ПеремещениМеждуЯчейкамиPOST(Запрос)
	
	Перем ДанныеЗапроса;
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		
		ПараметрыОбработкиВходящегоЗапроса = SUI_HTTPСервисКлиентСервер.ПараметрыОбработкиВходящегоЗапроса();
		ПараметрыОбработкиВходящегоЗапроса.ПрочитатьПараметрыИзТела = Истина;
		ДанныеЗапроса = SUI_HTTPСервис.ОбработатьВходящийЗапрос(Запрос, ПараметрыОбработкиВходящегоЗапроса);
		
		Если ДанныеЗапроса.РезультатОтвет <> Неопределено Тогда
			Результат = ДанныеЗапроса.РезультатОтвет;
		Иначе
			
			Ячейка = ДанныеЗапроса.Параметры.Получить("id_cell");
			ЯчейкаВерныйТип = (ТипЗнч(Ячейка) = Тип("СправочникСсылка.СкладскиеЯчейки"));
			
			Склад = ДанныеЗапроса.Параметры.Получить("id_warehouse");
			СкладВерныйТип = (ТипЗнч(Склад) = Тип("СправочникСсылка.Склады"));
			
			ПользовательУТ = Справочники.Пользователи.ПустаяСсылка();
			ПользовательТСД = ДанныеЗапроса.Параметры.Получить("user_name");
			
			Если ТипЗнч(ПользовательТСД) = Тип("Строка") И ЗначениеЗаполнено(ПользовательТСД) Тогда 
				
				УчетнаяЗапись = ПользователиИнформационнойБазы.НайтиПоИмени(ПользовательТСД);
				
				Если НЕ УчетнаяЗапись = Неопределено Тогда 
					ПользовательУТ = Справочники.Пользователи.НайтиПоРеквизиту("ИдентификаторПользователяИБ", УчетнаяЗапись.УникальныйИдентификатор);
				КонецЕсли;
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Ячейка) Тогда
				
				Если ЯчейкаВерныйТип Тогда 
					
					Если ЗначениеЗаполнено(Склад) И СкладВерныйТип Тогда
						
						БлокироватьЯчейку = (ДанныеЗапроса.Параметры.Получить("block") = "1"); 
						
						Результат = SUI_ОбменДаннымиСервер.ПеремещениеМеждуЯчейкамиЗаблокироватьЯчейку(ДанныеЗапроса.ИдентификаторУстройства, 
							Склад, Ячейка, БлокироватьЯчейку, ПользовательУТ);
						
					Иначе
						Результат = SUI_HTTPСервис.РезультатОшибка("Склад не найден по идентификатору");	
					КонецЕсли;
					
				Иначе
					Результат = SUI_HTTPСервис.РезультатОшибка("Ячейка не найдена по идентификатору");	
				КонецЕсли;
				
			Иначе

				ДокументОтбораРазмещения = ДанныеЗапроса.Параметры.Получить("id_doc"); 
				ДокументОтбораРазмещенияВерныйТип = (ТипЗнч(ДокументОтбораРазмещения) = Тип("ДокументСсылка.ОтборРазмещениеТоваров"));
				
				ТаблицаТоваров = ДанныеЗапроса.Параметры.Получить("RS_adr_docs_table");
				
				Если ТаблицаТоваров = Неопределено Тогда 

					ДополнительноеДействие = ДанныеЗапроса.Параметры.Получить("action"); 
					
					Если ДополнительноеДействие = Неопределено Тогда
						Результат = SUI_HTTPСервис.РезультатОшибка("Неизвестный вид операции");
					ИначеЕсли ДополнительноеДействие = "unblock_cells" Тогда

						Если ЗначениеЗаполнено(ДокументОтбораРазмещения) И ДокументОтбораРазмещенияВерныйТип Тогда 
							Результат = SUI_ОбменДаннымиСервер.ПеремещениеМеждуЯчейкамиРазблокироватьЯчейки(ДокументОтбораРазмещения);
						Иначе
							Результат = SUI_HTTPСервис.РезультатОшибка("Документ не найден по идентификатору");
						КонецЕсли;
						
					ИначеЕсли ДополнительноеДействие = "get_doc_type" Тогда
						
						ЗначениеКонстанты = Константы.SUI_НастройкаДокументаПеремещенияМеждуЯчейками.Получить();
						 
						Если ЗначениеЗаполнено(ЗначениеКонстанты) Тогда
							Результат = SUI_HTTPСервис.РезультатУспех(Новый Структура("doc_type", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗначениеКонстанты, "Наименование")));
						Иначе
							Результат = SUI_HTTPСервис.РезультатОшибка("Не задана настройка документа для перемещения товару между ячейками");
						КонецЕсли;				
						
					Иначе
						Результат = SUI_HTTPСервис.РезультатОшибка("Неизвестный вид операции");
					КонецЕсли;
					
				Иначе
					
					Если ЗначениеЗаполнено(ДокументОтбораРазмещения) Тогда
						Результат = SUI_HTTPСервис.РезультатОшибка("Неизвестный вид операции");			
					Иначе
						
						Если ЗначениеЗаполнено(Склад) И СкладВерныйТип Тогда
							
							Результат = SUI_ОбменДаннымиСервер.ПеремещениеМеждуЯчейкамиСоздатьДокумент(ДанныеЗапроса.МобильноеУстройство, 
								ДанныеЗапроса.ИдентификаторУстройства, Склад, ТаблицаТоваров, ПользовательУТ);
							
						Иначе
							Результат = SUI_HTTPСервис.РезультатОшибка("Склад не найден по идентификатору");
						КонецЕсли;
						
					КонецЕсли;	
					
				КонецЕсли;					
				
			КонецЕсли;

		КонецЕсли;
		
	Исключение
		Результат = ОбработатьИсключительнуюОшибку(НСтр("ru = 'Перемещение между ячейками'"), ДанныеЗапроса, ИнформацияОбОшибке());
	КонецПопытки;
	
	// Установка заголовков проверки обновления приложения
	SUI_HTTPСервис.УстановитьЗаголовкиОтветаПроверкиОбновления(Результат, ДанныеЗапроса);
	
	Ответ = SUI_HTTPСервис.СформироватьHTTPОтвет(Результат, Запрос.Заголовки);
	
	// Логирование HTTP запросов
	ВыполнитьЛогирование(Запрос, Ответ, ДанныеЗапроса.ОтключитьЛогирование);
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#Область УстаревшиеПроцедурыИФункции

// Устарела. см. ГрупповойПересчетДокументаЗаписать
//
Функция СтрокиПересчетаДокументаПерезаписать(Запрос)
	
	// TODO:  Перенаправление на новый HTTP метод
	Возврат ГрупповойПересчетДокументаПерезаписать(Запрос);

КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбработатьИсключительнуюОшибку(КонтекстОшибки, ДанныеЗапроса, Ошибка)
	
	SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(
		SUI_HTTPСервисКлиентСервер.ИмяСобытия(КонтекстОшибки),
		УровеньЖурналаРегистрации.Ошибка,
		Метаданные.HTTPСервисы.SUI_Exchange,
		SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗапроса, "МобильноеУстройство"),
		Ошибка);
	
	Возврат SUI_HTTPСервис.РезультатОшибка(Ошибка, 500);
		
КонецФункции

Функция СоздатьВходящиеСообщениеОперации(МобильноеУстройство, ИмяМетода, ПараметрыМетода, ДополнительныеПараметры = Неопределено)
	
	ИдентификаторСообщения = SUI_СообщенияОбменаДанными.СоздатьСообщениеОперации(
		МобильноеУстройство, 
		ПланыОбмена.SUI_МобильныеУстройства.ЭтотУзел(), 
		ИмяМетода, 
		ПараметрыМетода,
		ДополнительныеПараметры);
	
	Результат = Новый Структура();
	Результат.Вставить("approved", 	Истина);
	Результат.Вставить("messageID", ИдентификаторСообщения);
	
	Возврат SUI_HTTPСервис.РезультатУспех(Результат);
		
КонецФункции

Процедура ВыполнитьЛогирование(Запрос, Ответ, ОтключитьЛогирование = Ложь)
	
	Если ОтключитьЛогирование Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыДобавленияЗаписиЛогирования = SUI_ЛогированиеHTTPЗапросовКлиентСервер.ПараметрыДобавленияЗаписиЛогирования(
		Запрос, Ответ);
	
	SUI_ЛогированиеHTTPЗапросовКлиентСервер.ДобавитьЗаписьЛогирования(ПараметрыДобавленияЗаписиЛогирования);
	
КонецПроцедуры

#КонецОбласти
