
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Создать задание.
// 
// Параметры:
//  ПараметрыЗадания - Структура - Параметры задания см. SUI_ОчередьЗаданийКлиентСервер.ПараметрыСозданияЗадания
// 
// Возвращаемое значение:
//  УникальныйИдентификатор - Идентификатор созданного задния очереди
Функция СоздатьЗадание(ПараметрыЗадания) Экспорт
	
	ОбщегоНазначенияКлиентСервер.Проверить(
		ТипЗнч(ПараметрыЗадания.Обработчики) = Тип("Массив") И ПараметрыЗадания.Обработчики.Количество() > 0,
		НСтр("ru = 'Отсутствуют обработчики задания очереди'"),
		"РегистрыСведений.SUI_ОчередьЗаданий.СоздатьЗадание");
	
	Для индекс = 0 По ПараметрыЗадания.Обработчики.ВГраница() Цикл
		
		ОбщегоНазначенияКлиентСервер.Проверить(
			(ТипЗнч(ПараметрыЗадания.Обработчики[индекс].ИмяМетода) = Тип("Строка") И 
			Не ПустаяСтрока(ПараметрыЗадания.Обработчики[индекс].ИмяМетода)),
			НСтр("ru = 'Не заполнено имя метода обработчика задания очереди'"),
			"РегистрыСведений.SUI_ОчередьЗаданий.СоздатьЗадание");
		
		Если ПараметрыЗадания.Обработчики[индекс].Параметры <> Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.Проверить(
				(ТипЗнч(ПараметрыЗадания.Обработчики[индекс].Параметры) = Тип("Массив") И 
				ПараметрыЗадания.Обработчики[индекс].Параметры.Количество() > 0),
				СтрШаблон(НСтр("ru = 'Не заполнены параметры метода ""%1"" обработчика задания очереди'"), ПараметрыЗадания.Обработчики[индекс].ИмяМетода),
				"РегистрыСведений.SUI_ОчередьЗаданий.СоздатьЗадание");
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ПустаяСтрока(ПараметрыЗадания.ПроцедураЗавершения) Тогда
		
		ОбработчикЗавершения = SUI_ОчередьЗаданийКлиентСервер.СтруктураОбработчикаЗадания();
		ОбработчикЗавершения.ИмяМетода = ПараметрыЗадания.ПроцедураЗавершения;
		ОбработчикЗавершения.Параметры = ПараметрыЗадания.ПараметрыПроцедурыЗавершения;
		
	КонецЕсли;
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Идентификатор 			= Новый УникальныйИдентификатор();
	МенеджерЗаписи.Хеш 						= НРег(ОбщегоНазначения.КонтрольнаяСуммаСтрокой(ПараметрыЗадания.Обработчики));
	МенеджерЗаписи.Наименование 			= ПараметрыЗадания.Наименование; 
	МенеджерЗаписи.Обработчики 				= Новый ХранилищеЗначения(ПараметрыЗадания.Обработчики, Новый СжатиеДанных(9));
	МенеджерЗаписи.ОбработчикЗавершения 	= Новый ХранилищеЗначения(ОбработчикЗавершения, Новый СжатиеДанных(9));
	МенеджерЗаписи.ВнеОчереди 				= ПараметрыЗадания.ВнеОчереди;
	МенеджерЗаписи.ИдентификаторДокумента	= ПараметрыЗадания.ИдентификаторДокумента;
	МенеджерЗаписи.Статус 					= Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Открыто;
	МенеджерЗаписи.Создано 					= ТекущаяДатаСеанса();
	МенеджерЗаписи.СозданоМеткаВремени 		= ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	МенеджерЗаписи.Записать(Истина);
	
	Если МенеджерЗаписи.ВнеОчереди Тогда
		
		ПараметрыПроцедуры = SUI_РегламентныеЗаданияКлиентСервер.ПараметрыЗапускаРегламентногоЗадания(
			Перечисления.SUI_КлючиРегламентыхЗаданий.ОбработкаОчередиЗаданий);
		ПараметрыПроцедуры.ИгнорироватьОшибкиВыполнения = Истина;
		SUI_РегламентныеЗадания.ЗапуститьРегламентноеЗаданиеВручную(ПараметрыПроцедуры, Неопределено);
		
	КонецЕсли;
	
	Возврат МенеджерЗаписи.Идентификатор;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ОтправитьСлужебноеСообщениеОтложитьТекущееЗадание() Экспорт
	
	СлужебноеСообщениеОчередиОтложитьВыполнениеЗадания().Сообщить();
	
КонецПроцедуры

Процедура НачатьОчисткуОчередиЗаданий() Экспорт
	
	ДатаНачала 			= Новый СтандартнаяДатаНачала;
	ДатаНачала.Вариант 	= ВариантСтандартнойДатыНачала.НачалоПрошлогоДня;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачальнаяДата", ДатаНачала.Дата);
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ОчередьЗаданий.Идентификатор,
		|	ОчередьЗаданий.Хеш
		|ИЗ
		|	РегистрСведений.SUI_ОчередьЗаданий КАК ОчередьЗаданий
		|ГДЕ
		|	ОчередьЗаданий.Создано < &НачальнаяДата";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Пока Не РезультатЗапроса.Пустой() Цикл
		
		НачатьТранзакцию();
			
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.SUI_ОчередьЗаданий");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Идентификатор", "Идентификатор");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Хеш", "Хеш");
			Блокировка.Заблокировать();
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				НаборЗаписей = СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Идентификатор.Установить(Выборка.Идентификатор);
				НаборЗаписей.Отбор.Хеш.Установить(Выборка.Хеш);
				НаборЗаписей.Записать(Истина);
				
			КонецЦикла;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			Ошибка = ИнформацияОбОшибке();
			SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(SUI_ОчередьЗаданийКлиентСервер.ИмяСобытия(), , , , Ошибка);
			ВызватьИсключение(НСтр("ru = 'Ошибка удаления устаревших заданий очереди!'"), , , , Ошибка);
		КонецПопытки;
		
		//@skip-check query-in-loop
		РезультатЗапроса = Запрос.Выполнить();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура НачатьОбработкуОчередиЗаданий() Экспорт
	
	РезультатЗапроса = ПолучитьЗаданияКОбработкеОчереди();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ИнформационнаяБазаФайловая 	= ОбщегоНазначения.ИнформационнаяБазаФайловая();
	КоличествоЗаданийВПотоке 	= 1;
	ОжидатьЗавершения 			= Неопределено;
	ВыполненныеЗадания			= Новый Массив();
	
	Если Не ИнформационнаяБазаФайловая Тогда
		КоличествоЗаданийВПотоке = ПолучитьКоличествоЗаданийВПотокеОбработки();
		ОжидатьЗавершения = ?(ПолучитьСкоростьКлиентскогоСоединения() = СкоростьКлиентскогоСоединения.Низкая, 4, 0.8);
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	НомерТекущейПорции = 1;
	ПорцияЗаданий = Новый Массив();
	
	Пока Выборка.Следующий() Цикл
		
		ДанныеЗадания = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Выборка);
		
		Если Выборка.ПорядокОбхода < 0 Тогда // К закрытию
			ЗакрытьЗаданиеОчереди(ДанныеЗадания);
		ИначеЕсли Выборка.ПорядокОбхода = 0 Или Выборка.ПорядокОбхода = 1 Тогда // К проверке выполнения
			
			РезультатОбработки = ОбработатьЗапущенноеЗадание(ДанныеЗадания);
			
			Если Не РезультатОбработки.Выполняется И ВыполненныеЗадания.Найти(ДанныеЗадания.Хеш) = Неопределено Тогда
				ВыполненныеЗадания.Добавить(ДанныеЗадания.Хеш);
			КонецЕсли;
			
		ИначеЕсли Выборка.ПорядокОбхода = 2 Или Выборка.ПорядокОбхода = 3 Тогда // К запуску
			ПорцияЗаданий.Добавить(ДанныеЗадания);
		КонецЕсли;
		
		Если ПорцияЗаданий.Количество() = КоличествоЗаданийВПотоке Тогда
			
			ЗапуститьПорциюЗаданийОчереди(ПорцияЗаданий, НомерТекущейПорции, ОжидатьЗавершения);
			
			НомерТекущейПорции = НомерТекущейПорции + 1;
			ПорцияЗаданий = Новый Массив();
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ПорцияЗаданий.Количество() > 0 Тогда
		ЗапуститьПорциюЗаданийОчереди(ПорцияЗаданий, НомерТекущейПорции, ОжидатьЗавершения);
	КонецЕсли;
	
	// Перезапуск обработки очереди
	Выборка.Сбросить();
	Отбор = Новый Структура();
	Отбор.Вставить("ПорядокОбхода", 4);
	
	Если ВыполненныеЗадания.Количество() > 0 И Выборка.НайтиСледующий(Отбор) Тогда
		
		Для индекс = 0 По ВыполненныеЗадания.ВГраница() Цикл
			
			Выборка.Сбросить();
			Отбор.Вставить("Хеш", ВыполненныеЗадания[индекс]);
			Если Выборка.НайтиСледующий(Отбор) Тогда
				//@skip-check query-in-loop
				НачатьОбработкуОчередиЗаданий();
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗапуститьОбработчикиЗадания(Идентификатор, Хеш, Обработчики) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекущийСеанс = ПолучитьТекущийСеансИнформационнойБазы();
	ТекущееФоновоеЗадание = ТекущийСеанс.ПолучитьФоновоеЗадание();
	
	РезультатВыполнения = ПолучитьНовыйРезультатВыполнения();
	РезультатВыполнения.Статус = Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Выполняется;
	РезультатВыполнения.Вставить("НомерСеансаЗадания", ТекущийСеанс.НомерСеанса);
	
	Если ТекущееФоновоеЗадание <> Неопределено И 
		ТекущееФоновоеЗадание.Ключ = СформироватьКлючФоновогоЗадания(Идентификатор) Тогда
		ЗаполнитьРезультатВыполненияПоФоновомуЗаданию(ТекущееФоновоеЗадание, РезультатВыполнения);
	КонецЕсли;
	
	ОбновитьЗаписьЗаданияОчередиПоРезультатуВыполнения(Идентификатор, Хеш, РезультатВыполнения);
	
	Для Индекс = 0 По Обработчики.ВГраница() Цикл
		
		Попытка
			ОбщегоНазначения.ВыполнитьМетодКонфигурации(
				Обработчики[Индекс].ИмяМетода, Обработчики[Индекс].Параметры);
		Исключение
			Ошибка = ИнформацияОбОшибке();
			ТекстОшибки = НСтр("ru = 'Ошибка выполнения метода ""%1"" задания очереди!'");
			ТекстОшибки = СтрШаблон(ТекстОшибки, Обработчики[Индекс].ИмяМетода);
			SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(SUI_ОчередьЗаданийКлиентСервер.ИмяСобытия(), , , 
				Строка(Идентификатор), Ошибка);
			ВызватьИсключение(ТекстОшибки, , , , Ошибка);
		КонецПопытки;
		
		СообщенияПользователю = ПолучитьСообщенияПользователю(Ложь);
		СообщениеОтложитьВыполнениеЗадания = СлужебноеСообщениеОчередиОтложитьВыполнениеЗадания();
		
		Если ПроверитьНаличиеСлужебногоСообщения(СообщенияПользователю, СообщениеОтложитьВыполнениеЗадания) Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыполнитьОбработчикЗавершения(ПараметрыЗавершения, АдресРезультата) Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("Статус", ПараметрыЗавершения.РезультатЗавершения.Статус);
	Результат.Вставить("КраткоеПредставлениеОшибки", ПараметрыЗавершения.РезультатЗавершения.КраткоеПредставлениеОшибки);
	Результат.Вставить("ПодробноеПредставлениеОшибки", ПараметрыЗавершения.РезультатЗавершения.ПодробноеПредставлениеОшибки);
	
	ДополнительныеПараметрыМетода = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ПараметрыЗавершения, "ОбработчикЗавершения.Параметры");
	
	ПараметрыМетода = Новый Массив();
	ПараметрыМетода.Добавить(Результат);
	ПараметрыМетода.Добавить(ДополнительныеПараметрыМетода);
	
	Идентификатор = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗавершения, "Идентификатор");
	
	Попытка
		ОбщегоНазначения.ВыполнитьМетодКонфигурации(ПараметрыЗавершения.ОбработчикЗавершения.ИмяМетода, ПараметрыМетода);
	Исключение
		Ошибка = ИнформацияОбОшибке();
		ТекстОшибки = НСтр("ru = 'Ошибка выполнения метода ""%1"" обработчика завершения задания очереди!'");
		ТекстОшибки = СтрШаблон(ТекстОшибки, ПараметрыЗавершения.ОбработчикЗавершения.ИмяМетода);
		ТекстОшибкиЖР = СтрШаблон("%1
		|%2", ТекстОшибки, ОбработкаОшибок.ПодробноеПредставлениеОшибки(Ошибка));
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(SUI_ОчередьЗаданийКлиентСервер.ИмяСобытия(), 
			УровеньЖурналаРегистрации.Ошибка, , Строка(Идентификатор), ТекстОшибкиЖР);
		ВызватьИсключение(ТекстОшибки, , , , Ошибка);
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьСлужебноеСообщениеОчереди(Ключ, Сообщение = "")
	
	Сообщение = Новый СообщениеПользователю();
	Сообщение.ИдентификаторНазначения = Новый УникальныйИдентификатор("1deebda3-c484-4e49-8ca6-01c184d1bab8");
	Сообщение.Поле = СтрШаблон("SimpleСлужебноеСообщение_%1", Ключ);
	Сообщение.Текст = Сообщение;
	
	Возврат Сообщение;
	
КонецФункции

Функция СлужебноеСообщениеОчередиОтложитьВыполнениеЗадания()
	
	Возврат СформироватьСлужебноеСообщениеОчереди("ОтложитьВыполнениеЗадания", НСтр("ru = 'Выполнение задания отложено.'"));
	
КонецФункции

Функция ПроверитьНаличиеСлужебногоСообщения(Сообщения, СлужебноеСообщение)
	
	Результат = Ложь;
	
	Для Каждого Сообщение Из Сообщения Цикл
		
		Если Сообщение.ИдентификаторНазначения = СлужебноеСообщение.ИдентификаторНазначения И
			Сообщение.Поле = СлужебноеСообщение.Поле Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьКоличествоЗаданийВПотокеОбработки()
	
	КоличествоЗаданийВПотоке = Константы.SUI_КоличествоЗаданийВПотокеОчередиЗаданий.Получить();
	Возврат ?(КоличествоЗаданийВПотоке = 0, 1, КоличествоЗаданийВПотоке);
	
КонецФункции

Функция ПолучитьЗаданияКОбработкеОчереди()
	
	СтатусыКОбработкеОчереди = SUI_ОбщегоНазначенияКлиентСервер.МассивЗначений(
		Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Выполняется,
		Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Открыто);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПустойУникальныйИдентификатор", ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор());
	Запрос.УстановитьПараметр("Статусы", СтатусыКОбработкеОчереди);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	SUI_ОчередьЗаданий.Идентификатор КАК Идентификатор,
		|	SUI_ОчередьЗаданий.Хеш КАК Хеш,
		|	SUI_ОчередьЗаданий.Наименование КАК Наименование,
		|	SUI_ОчередьЗаданий.Статус КАК Статус,
		|	ВЫБОР
		|		КОГДА SUI_ОчередьЗаданий.ОбновленоМеткаВремени > 0
		|			ТОГДА SUI_ОчередьЗаданий.ОбновленоМеткаВремени
		|		ИНАЧЕ SUI_ОчередьЗаданий.СозданоМеткаВремени
		|	КОНЕЦ КАК МеткаВремени,
		|	ВЫБОР
		|		КОГДА SUI_ОчередьЗаданий.ИдентификаторЗадания <> &ПустойУникальныйИдентификатор
		|		И SUI_ОчередьЗаданий.Статус = ЗНАЧЕНИЕ(Перечисление.SUI_СтатусыОбработкиОчередиЗаданий.Выполняется)
		|			ТОГДА ВЫБОР
		|				КОГДА SUI_ОчередьЗаданий.ВнеОчереди
		|					ТОГДА 0
		|				ИНАЧЕ 1
		|			КОНЕЦ
		|		КОГДА SUI_ОчередьЗаданий.Статус = ЗНАЧЕНИЕ(Перечисление.SUI_СтатусыОбработкиОчередиЗаданий.Открыто)
		|			ТОГДА ВЫБОР
		|				КОГДА SUI_ОчередьЗаданий.ВнеОчереди
		|					ТОГДА 2
		|				ИНАЧЕ 3
		|			КОНЕЦ
		|		ИНАЧЕ -1
		|	КОНЕЦ КАК ПорядокОбхода,
		|	SUI_ОчередьЗаданий.ИдентификаторЗадания КАК ИдентификаторЗадания,
		|	SUI_ОчередьЗаданий.Обработчики КАК Обработчики,
		|	SUI_ОчередьЗаданий.ОбработчикЗавершения КАК ОбработчикЗавершения
		|ПОМЕСТИТЬ втЗадания
		|ИЗ
		|	РегистрСведений.SUI_ОчередьЗаданий КАК SUI_ОчередьЗаданий
		|ГДЕ
		|	SUI_ОчередьЗаданий.Статус В (&Статусы)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втЗадания.Идентификатор КАК Идентификатор,
		|	втЗадания.Хеш КАК Хеш,
		|	втЗадания.Наименование КАК Наименование,
		|	втЗадания.ПорядокОбхода КАК ПорядокОбхода,
		|	втЗадания.ИдентификаторЗадания КАК ИдентификаторЗадания,
		|	втЗадания.Статус КАК Статус,
		|	втЗадания.ОбработчикЗавершения КАК ОбработчикЗавершения,
		|	втЗадания.МеткаВремени КАК МеткаВремени
		|ПОМЕСТИТЬ втЗаданияВРаботе
		|ИЗ
		|	втЗадания КАК втЗадания
		|ГДЕ
		|	втЗадания.ПорядокОбхода В (0, 1)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	втЗадания.Идентификатор КАК Идентификатор,
		|	втЗадания.Хеш КАК Хеш,
		|	4 КАК ПорядокОбхода
		|ПОМЕСТИТЬ втЗаданияОтложить
		|ИЗ
		|	втЗадания КАК втЗадания
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЗаданияВРаботе КАК втЗаданияВРаботе
		|		ПО втЗадания.Хеш = втЗаданияВРаботе.Хеш
		|ГДЕ
		|	втЗадания.ПорядокОбхода > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаданияКОбработке.Хеш КАК Хеш,
		|	ЗаданияКОбработке.ПорядокОбхода КАК ПорядокОбхода,
		|	МИНИМУМ(втЗадания.МеткаВремени) КАК МеткаВремени
		|ПОМЕСТИТЬ втЗаданияКОбработке
		|ИЗ
		|	(ВЫБРАТЬ
		|		втЗадания.Хеш КАК Хеш,
		|		МИНИМУМ(втЗадания.ПорядокОбхода) КАК ПорядокОбхода
		|	ИЗ
		|		втЗадания КАК втЗадания
		|	ГДЕ
		|		втЗадания.ПорядокОбхода <> -1
		|		И НЕ втЗадания.Хеш В
		|			(ВЫБРАТЬ
		|				втЗаданияВРаботе.Хеш
		|			ИЗ
		|				втЗаданияВРаботе)
		|	СГРУППИРОВАТЬ ПО
		|		втЗадания.Хеш) КАК ЗаданияКОбработке
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЗадания КАК втЗадания
		|		ПО ЗаданияКОбработке.Хеш = втЗадания.Хеш
		|		И ЗаданияКОбработке.ПорядокОбхода = втЗадания.ПорядокОбхода
		|СГРУППИРОВАТЬ ПО
		|	ЗаданияКОбработке.Хеш,
		|	ЗаданияКОбработке.ПорядокОбхода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втЗаданияВРаботе.Идентификатор КАК Идентификатор,
		|	втЗаданияВРаботе.Хеш КАК Хеш,
		|	втЗаданияВРаботе.Наименование КАК Наименование,
		|	втЗаданияВРаботе.ПорядокОбхода КАК ПорядокОбхода,
		|	втЗаданияВРаботе.ИдентификаторЗадания КАК ИдентификаторЗадания,
		|	втЗаданияВРаботе.Статус КАК Статус,
		|	НЕОПРЕДЕЛЕНО КАК Обработчики,
		|	втЗаданияВРаботе.ОбработчикЗавершения КАК ОбработчикЗавершения,
		|	втЗаданияВРаботе.МеткаВремени КАК МеткаВремени
		|ИЗ
		|	втЗаданияВРаботе КАК втЗаданияВРаботе
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	втЗадания.Идентификатор,
		|	втЗадания.Хеш,
		|	втЗадания.Наименование,
		|	ЕСТЬNULL(втЗаданияОтложить.ПорядокОбхода, ЕСТЬNULL(втЗаданияКОбработке.ПорядокОбхода, -1)),
		|	&ПустойУникальныйИдентификатор,
		|	втЗадания.Статус,
		|	втЗадания.Обработчики,
		|	втЗадания.ОбработчикЗавершения,
		|	втЗадания.МеткаВремени
		|ИЗ
		|	втЗадания КАК втЗадания
		|		ЛЕВОЕ СОЕДИНЕНИЕ втЗаданияОтложить КАК втЗаданияОтложить
		|		ПО втЗадания.Хеш = втЗаданияОтложить.Хеш
		|		И втЗадания.Идентификатор = втЗаданияОтложить.Идентификатор
		|		ЛЕВОЕ СОЕДИНЕНИЕ втЗаданияКОбработке КАК втЗаданияКОбработке
		|		ПО втЗадания.Хеш = втЗаданияКОбработке.Хеш
		|		И втЗадания.ПорядокОбхода = втЗаданияКОбработке.ПорядокОбхода
		|		И втЗадания.МеткаВремени = втЗаданияКОбработке.МеткаВремени
		|ГДЕ
		|	НЕ втЗадания.ПорядокОбхода В (0, 1)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПорядокОбхода,
		|	МеткаВремени";
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция ОбновитьЗаписьЗаданияОчередиПоРезультатуВыполнения(Идентификатор, Хеш, Результат)
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Идентификатор = Идентификатор;
	МенеджерЗаписи.Хеш = Хеш;
	
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		
		Если (Результат.Статус = Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Выполнено Или
			Результат.Статус = Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.ОшибкаОбработки) И
			Результат.Статус <> МенеджерЗаписи.Статус Тогда
			
			РезультатЗавершения = Новый Структура();
			РезультатЗавершения.Вставить("Статус", Результат.Статус);
			РезультатЗавершения.Вставить("ИнформацияОбОшибке", Результат.ИнформацияОбОшибке);
			
		Иначе
			РезультатЗавершения = Неопределено;
		КонецЕсли;
		
		МенеджерЗаписи.Статус = Результат.Статус;
		МенеджерЗаписи.ИдентификаторЗадания = Результат.ИдентификаторЗадания;
		
		Если Результат.ИнформацияОбОшибке = Неопределено Тогда
			МенеджерЗаписи.КраткоеОписаниеРезультата = "";
		Иначе
			МенеджерЗаписи.КраткоеОписаниеРезультата = ОбработкаОшибок.КраткоеПредставлениеОшибки(Результат.ИнформацияОбОшибке);
		КонецЕсли;
		
		Если МенеджерЗаписи.Статус = Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Выполняется И
			Результат.Свойство("НомерСеансаЗадания") Тогда
			МенеджерЗаписи.НомерСеансаЗадания = Результат.НомерСеансаЗадания;
		КонецЕсли;
		
		МенеджерЗаписи.Сеанс = НомерСеансаИнформационнойБазы();
		МенеджерЗаписи.Обновлено = ТекущаяДатаСеанса();
		МенеджерЗаписи.ОбновленоМеткаВремени = ТекущаяУниверсальнаяДатаВМиллисекундах();
		
		Попытка
			ТекстОшибки = НСтр("ru = 'Не заполнен статус задания очереди!'");
			ОбщегоНазначенияКлиентСервер.Проверить(Не МенеджерЗаписи.Статус.Пустая(), ТекстОшибки);
			МенеджерЗаписи.Записать(Истина);
		Исключение
			Ошибка = ИнформацияОбОшибке();
			SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(SUI_ОчередьЗаданийКлиентСервер.ИмяСобытия(), , , 
				Строка(Идентификатор), Ошибка);
			ВызватьИсключение(НСтр("ru = 'Ошибка обновления записи задания очереди!'"), , , , Ошибка);
		КонецПопытки;
		
		Если РезультатЗавершения <> Неопределено Тогда
			ЗапуститьОбработчикЗавершения(МенеджерЗаписи.ОбработчикЗавершения.Получить(), РезультатЗавершения, 
				Идентификатор, МенеджерЗаписи.Наименование);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат МенеджерЗаписи.Идентификатор;
	
КонецФункции

Процедура ЗапуститьПорциюЗаданийОчереди(ПорцияЗаданий, НомерПорции, ОжидатьЗавершения = Неопределено)
	
	Для индекс = 0 По ПорцияЗаданий.ВГраница() Цикл
		
		Идентификатор = ПорцияЗаданий[индекс].Идентификатор;
		Хеш = ПорцияЗаданий[индекс].Хеш;
		Наименование = ПорцияЗаданий[индекс].Наименование;
		Обработчики = ПорцияЗаданий[индекс].Обработчики.Получить();
		
		РезультатВыполнения = ПолучитьНовыйРезультатВыполнения();
		
		// Запустить в основном потоке
		Если ОжидатьЗавершения = Неопределено Тогда
			
			Попытка
				
				ПолучитьСообщенияПользователю(Истина);
				
				SUI_ОчередьЗаданий.ЗапуститьОбработчикиЗадания(Идентификатор, Хеш, Обработчики);
				
				РезультатВыполнения.Сообщения = ПолучитьСообщенияПользователю(Истина);
				РезультатВыполнения.Статус = Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Выполнено;
				
			Исключение
				Ошибка = ИнформацияОбОшибке();
				РезультатВыполнения.ИнформацияОбОшибке = Ошибка;
				РезультатВыполнения.Статус = Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.ОшибкаОбработки;
			КонецПопытки;
			
		// Запустить в фоне
		Иначе
			
			УстановитьПривилегированныйРежим(Истина);
			
			Попытка
				
				ПараметрыОперации = Новый Массив();
				ПараметрыОперации.Добавить(Идентификатор);
				ПараметрыОперации.Добавить(Хеш);
				ПараметрыОперации.Добавить(Обработчики);
				
				ФоновоеЗадание = ФоновыеЗадания.Выполнить(
					"SUI_ОчередьЗаданий.ЗапуститьОбработчикиЗадания", 
					ПараметрыОперации, 
					СформироватьКлючФоновогоЗадания(Идентификатор), 
					СтрШаблон(НСтр("ru = 'Simple Очередь заданий: %1'"), Наименование));
				
			Исключение
				Ошибка = ИнформацияОбОшибке();
				SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(SUI_ОчередьЗаданийКлиентСервер.ИмяСобытия(), , , 
					Строка(Идентификатор), Ошибка);
				ВызватьИсключение(НСтр("ru = 'Ошибка запуска задания очереди в фоне!'"), , , , Ошибка);
			КонецПопытки;
			
			Если ОжидатьЗавершения > 0 И ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
				
				ФоновоеЗадание = ФоновоеЗадание.ОжидатьЗавершенияВыполнения(ОжидатьЗавершения);
				
				Если ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
					РезультатВыполнения = Неопределено;
				Иначе
					ЗаполнитьРезультатВыполненияПоФоновомуЗаданию(ФоновоеЗадание, РезультатВыполнения);
				КонецЕсли;
				
			КонецЕсли;
			
			УстановитьПривилегированныйРежим(Ложь);
			
		КонецЕсли;
		
		Если РезультатВыполнения <> Неопределено Тогда
			
			ОбработатьРезультатВыполнения(РезультатВыполнения);
			ОбновитьЗаписьЗаданияОчередиПоРезультатуВыполнения(Идентификатор, Хеш, РезультатВыполнения);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция СформироватьКлючФоновогоЗадания(Идентификатор)
	
	Возврат СтрШаблон("SimpleОчередьзаданий_%1", Идентификатор);
	
КонецФункции

Функция ПолучитьНовыйРезультатВыполнения()
	
	РезультатВыполнения = Новый Структура();
	РезультатВыполнения.Вставить("ИдентификаторЗадания");
	РезультатВыполнения.Вставить("ИнформацияОбОшибке");
	РезультатВыполнения.Вставить("Сообщения", Новый ФиксированныйМассив(Новый Массив()));
	РезультатВыполнения.Вставить("Статус", Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Выполняется);
	
	Возврат РезультатВыполнения;
	
КонецФункции

Процедура ЗаполнитьРезультатВыполненияПоФоновомуЗаданию(ФоновоеЗадание, РезультатВыполнения)
	
	Если ФоновоеЗадание = Неопределено Тогда
		
		РезультатВыполнения.ИдентификаторЗадания = Неопределено;
		РезультатВыполнения.Статус = Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Закрыто;
		
		Попытка
			ВызватьИсключение НСтр("ru = 'Не найдено фоновое задание!'");
		Исключение
			РезультатВыполнения.ИнформацияОбОшибке = ИнформацияОбОшибке();
		КонецПопытки;
		
	Иначе
		
		РезультатВыполнения.ИдентификаторЗадания = ФоновоеЗадание.УникальныйИдентификатор;
		
		Если ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
			
			//@skip-check bsl-legacy-check-expression-type
			РезультатВыполнения.Сообщения = ФоновоеЗадание.ПолучитьСообщенияПользователю(Ложь);
			РезультатВыполнения.Статус = Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Выполнено;
			
		ИначеЕсли ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
			
			РезультатВыполнения.ИнформацияОбОшибке = ФоновоеЗадание.ИнформацияОбОшибке;
			РезультатВыполнения.Статус = Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.ОшибкаОбработки;
			
		ИначеЕсли ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Отменено Тогда
			
			РезультатВыполнения.Статус = Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Закрыто;
			
			Попытка
				ВызватьИсключение НСтр("ru = 'Сеанс работы задания был завершен пользователем!'");
			Исключение
				РезультатВыполнения.ИнформацияОбОшибке = ИнформацияОбОшибке();
			КонецПопытки;
			
		Иначе
			РезультатВыполнения.Статус = Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Выполняется;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьРезультатВыполнения(РезультатВыполнения)
	
	СообщениеОтложитьВыполнениеЗадания = СлужебноеСообщениеОчередиОтложитьВыполнениеЗадания();
	
	Если ПроверитьНаличиеСлужебногоСообщения(РезультатВыполнения.Сообщения, СообщениеОтложитьВыполнениеЗадания) Тогда
		РезультатВыполнения.Статус = Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Открыто;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗакрытьЗаданиеОчереди(ДанныеЗадания)
	
	РезультатВыполнения = ПолучитьНовыйРезультатВыполнения();
	РезультатВыполнения.Статус = Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Закрыто;
	
	ОбновитьЗаписьЗаданияОчередиПоРезультатуВыполнения(ДанныеЗадания.Идентификатор, ДанныеЗадания.Хеш, РезультатВыполнения);
	
КонецПроцедуры

Функция ОбработатьЗапущенноеЗадание(ДанныеЗадания)
	
	РезультатОбработки = Новый Структура();
	РезультатОбработки.Вставить("Выполняется", Истина);
	
	Если Не ЗначениеЗаполнено(ДанныеЗадания.ИдентификаторЗадания) Тогда
		
		ЗакрытьЗаданиеОчереди(ДанныеЗадания);
		РезультатОбработки.Выполняется = Ложь;
		
	Иначе
		
		РезультатВыполнения = ПолучитьНовыйРезультатВыполнения();
		
		УстановитьПривилегированныйРежим(Истина);
		ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ДанныеЗадания.ИдентификаторЗадания);
		ЗаполнитьРезультатВыполненияПоФоновомуЗаданию(ФоновоеЗадание, РезультатВыполнения);
		УстановитьПривилегированныйРежим(Ложь);
		
		ОбработатьРезультатВыполнения(РезультатВыполнения);
		ОбновитьЗаписьЗаданияОчередиПоРезультатуВыполнения(ДанныеЗадания.Идентификатор, ДанныеЗадания.Хеш, РезультатВыполнения);
		
		Если РезультатВыполнения.Статус <> Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Выполняется Тогда
			РезультатОбработки.Выполняется = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат РезультатОбработки;
	
КонецФункции

Процедура ЗапуститьОбработчикЗавершения(ОбработчикЗавершения, Результат, Идентификатор, НаименованиеЗадания)
	
	ИмяМетодаОбработчикаЗавершения = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ОбработчикЗавершения, "ИмяМетода", "", Тип("Строка"));
	
	Если ПустаяСтрока(ИмяМетодаОбработчикаЗавершения) Тогда
		Возврат;
	КонецЕсли;
	
	РезультатЗавершения = Новый Структура();
	РезультатЗавершения.Вставить("Статус");
	РезультатЗавершения.Вставить("КраткоеПредставлениеОшибки", "");
	РезультатЗавершения.Вставить("ПодробноеПредставлениеОшибки", "");
	
	Если Результат.Статус = Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Выполнено Тогда
		РезультатЗавершения.Статус = "Выполнено";
	ИначеЕсли Результат.Статус = Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.ОшибкаОбработки Тогда
		
		РезультатЗавершения.Статус = "Ошибка";
		
		Если Результат.ИнформацияОбОшибке <> Неопределено Тогда
			РезультатЗавершения.КраткоеПредставлениеОшибки = 
				ОбработкаОшибок.КраткоеПредставлениеОшибки(Результат.ИнформацияОбОшибке);
			РезультатЗавершения.ПодробноеПредставлениеОшибки = 
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(Результат.ИнформацияОбОшибке);
		КонецЕсли;
		
	Иначе
		Возврат;
	КонецЕсли;
	
	// Процедура завершения задания
	ПараметрыПроцедурыЗавершения = Новый Структура();
	ПараметрыПроцедурыЗавершения.Вставить("ОбработчикЗавершения", ОбработчикЗавершения);
	ПараметрыПроцедурыЗавершения.Вставить("РезультатЗавершения", РезультатЗавершения);
	ПараметрыПроцедурыЗавершения.Вставить("Идентификатор", Идентификатор);
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияВФоне();
	ПараметрыВыполненияВФоне.НаименованиеФоновогоЗадания = СтрШаблон(
		НСтр("ru = 'Simple Завершение задания очереди: %1'"), НаименованиеЗадания);
	ПараметрыВыполненияВФоне.АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор());
	
	ДлительныеОперации.ВыполнитьВФоне("РегистрыСведений.SUI_ОчередьЗаданий.ВыполнитьОбработчикЗавершения", 
		ПараметрыПроцедурыЗавершения, ПараметрыВыполненияВФоне);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
