
#Область ПрограммныйИнтерфейс

Процедура ВыполнитьПолнуюВыгрузку(Форма, МобильноеУстройство, Оповещение = Неопределено, Знач ТекстВопроса = "") Экспорт
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПослеОтветаНаВопросВыполненияПолнойВыгрузки", 
		ЭтотОбъект, Новый Структура("Форма, МобильноеУстройство, ОповещениеОЗавершении", Форма, МобильноеУстройство, Оповещение));
	
	ТекстВопроса = ?(ЗначениеЗаполнено(ТекстВопроса), ТекстВопроса, 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Выполнить полную выгрузку на устройство ""%1""?'"), МобильноеУстройство));
		
	ПоказатьВопрос(ОповещениеОЗавершении, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
КонецПроцедуры

Процедура ПринятьЗапросАвторизации(ИдентификаторУстройства) Экспорт
	
	Если Не ЗначениеЗаполнено(SUI_МобильныеУстройстваВызовСервера.ПолучитьЗапросАвторизации(ИдентификаторУстройства)) Тогда
		SUI_ОбщегоНазначенияКлиент.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Запрос с идентификатором устройства %1 не найден.'"), ИдентификаторУстройства));
		Возврат;
	КонецЕсли;
	
	Если SUI_МобильныеУстройстваВызовСервера.МобильноеУстройствоСуществует(ИдентификаторУстройства) Тогда
		SUI_ОбщегоНазначенияКлиент.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Мобильное устройство с идентификатором %1 уже существует.'"), ИдентификаторУстройства));
		SUI_МобильныеУстройстваВызовСервера.УдалитьЗапросАвторизацииУстройства(ИдентификаторУстройства);
		Оповестить("SUI_ОтклоненЗапросАвторизации");
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПринятьЗапросАвторизацииПодтверждение", ЭтотОбъект, ИдентификаторУстройства);
	ПоказатьВопрос(Оповещение, СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Принять запрос авторизации мобильного устройства?
		| * Будет создано новое устройство с идентификатором %1.'"), ИдентификаторУстройства), РежимДиалогаВопрос.ДаНет);
			
КонецПроцедуры

Процедура ОтклонитьЗапросАвторизации(ИдентификаторУстройства) Экспорт
	
	Если Не ЗначениеЗаполнено(SUI_МобильныеУстройстваВызовСервера.ПолучитьЗапросАвторизации(ИдентификаторУстройства)) Тогда
		SUI_ОбщегоНазначенияКлиент.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Запрос с идентификатором устройства %1 не найден'"), ИдентификаторУстройства));
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ОтклонитьЗапросАвторизацииПодтверждение", ЭтотОбъект, ИдентификаторУстройства);
	ПоказатьВопрос(Оповещение, СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Отклонить запрос авторизации мобильного устройства с идентификатором %1?'"), ИдентификаторУстройства), 
		РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПослеОтветаНаВопросВыполненияПолнойВыгрузки(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		
		Если ТипЗнч(ДополнительныеПараметры.ОповещениеОЗавершении) = Тип("ОписаниеОповещения") Тогда
			ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеОЗавершении, 
				Новый Структура("ТекстСообщения", НСтр("ru = 'Полная выгрузка отменена пользователем'")));
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	SUI_МобильныеУстройстваВызовСервера.ВыполнитьПолнуюВыгрузку(ДополнительныеПараметры.МобильноеУстройство);
	
	SUI_ОбщегоНазначенияКлиент.СообщитьПользователю(
		НСтр("ru = 'Запрос полной выгрузки создан. Ожидайте формирования сообщений обмена.'"));
	
	Оповестить("SUI_СозданЗапросПолнойВыгрузки");
	
	Если ТипЗнч(ДополнительныеПараметры.ОповещениеОЗавершении) = Тип("ОписаниеОповещения") Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеОЗавершении, Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПринятьЗапросАвторизацииПодтверждение(Ответ, ИдентификаторУстройства) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	МобильноеУстройство = SUI_МобильныеУстройстваВызовСервера.ПринятьЗапросАвторизацииУстройства(ИдентификаторУстройства);
	
	Оповестить("SUI_ПринятЗапросАвторизации", МобильноеУстройство);
	
КонецПроцедуры

Процедура ОтклонитьЗапросАвторизацииПодтверждение(Ответ, ИдентификаторУстройства) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	SUI_МобильныеУстройстваВызовСервера.УдалитьЗапросАвторизацииУстройства(ИдентификаторУстройства);
	
	Оповестить("SUI_ОтклоненЗапросАвторизации");
		
КонецПроцедуры

#КонецОбласти
