
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Загрузить пересчет.
// 
// Параметры:
//  МобильноеУстройство - ПланОбменаСсылка.SUI_МобильныеУстройства - Мобильное устройство данных пересчета
//  ИдентификаторДокумента - Строка - Идентификатор документа пересчета
//  Данные - ТаблицаЗначений - Данные пересчета см. SUI_ДокументыОбмена.ТаблицаПересчетТоваровДокументаОбмена
//  Перезаписать - Булево - Записать данные пересчета очистив старые
// 
// Возвращаемое значение:
//  Структура - Загрузить пересчет:
// * ДанныеЗагружены - Булево - Признак загруженных данных
// * Ошибки - Массив из Строка - Массив ошибок возникших при загрузке
Функция ЗагрузитьПересчет(МобильноеУстройство, ИдентификаторДокумента, Данные, Перезаписать = Ложь) Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("ДанныеЗагружены", Ложь);
	Результат.Вставить("Ошибки", Новый Массив());
	
	Если Данные.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	ДокументыОбмена = ПолучитьДокументыОбменаПересчетаПоИдентификаторуДокумента(ИдентификаторДокумента);
	
	Если ДокументыОбмена.Документы.Количество() = 0 Тогда
		Результат.Ошибки = ДокументыОбмена.Ошибки;
	Иначе
		
		НачатьТранзакцию();
		
		Попытка
			
			Если Перезаписать Тогда
				
				Блокировка = Новый БлокировкаДанных;
				ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.SUI_docs_tbl_goods_delta");
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
				ЭлементБлокировки.ИсточникДанных = ДокументыОбмена.Документы;
				ЭлементБлокировки.ИспользоватьИзИсточникаДанных("sid_doc", "sid");
				ЭлементБлокировки.УстановитьЗначение("МобильноеУстройство", МобильноеУстройство);
				Блокировка.Заблокировать();
				
			КонецЕсли;
			
			Для Каждого СтрокаДокумент Из ДокументыОбмена.Документы Цикл
				
				ДатаЗаписи = ТекущаяДатаСеанса();
				
				Если Перезаписать Тогда
					
					НаборЗаписей = СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.sid_doc.Установить(СтрокаДокумент.sid);
					НаборЗаписей.Отбор.МобильноеУстройство.Установить(МобильноеУстройство);
					
					Для Каждого СтрокаДанных Из Данные Цикл
						
						Запись = НаборЗаписей.Добавить();
						ЗаполнитьЗначенияСвойств(Запись, СтрокаДанных);
						
						Запись.Период = ДатаЗаписи;
						Запись.sid = Новый УникальныйИдентификатор();
						Запись.sid_doc = СтрокаДокумент.sid;
						Запись.МобильноеУстройство = МобильноеУстройство;
						
					КонецЦикла;
					
					НаборЗаписей.ОбменДанными.Загрузка = Истина;
					НаборЗаписей.Записать(Истина);
					
				Иначе
					
					Для Каждого СтрокаДанных Из Данные Цикл
						
						Запись = СоздатьМенеджерЗаписи();
						ЗаполнитьЗначенияСвойств(Запись, СтрокаДанных);
						
						Запись.Период = ДатаЗаписи;
						Запись.sid = Новый УникальныйИдентификатор();
						Запись.sid_doc = СтрокаДокумент.sid;
						Запись.МобильноеУстройство = МобильноеУстройство;
						
						Запись.Записать(Истина);
						
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Результат.ДанныеЗагружены = Истина;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			Ошибка = ИнформацияОбОшибке();
			ТекстОшибки = НСтр("ru = 'Ошибка записи данных пересчета!'");
			ВызватьИсключение(ТекстОшибки, , , , Ошибка);
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДанныеПересчетаСтрок(МобильноеУстройство, ИдентификаторДокумента) Экспорт
	
	ДанныеПересчета = Новый Массив();
	
	ДокументыОбмена = ПолучитьДокументыОбменаПересчетаПоИдентификаторуДокумента(ИдентификаторДокумента);
	
	Если ДокументыОбмена.Документы.Количество() = 0 Тогда
		ВызватьИсключение СтрСоединить(ДокументыОбмена.Ошибки);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИдентификаторДокумента", ИдентификаторДокумента);
	Запрос.УстановитьПараметр("ИдентификаторыДокументовОбмена", ДокументыОбмена.Документы.ВыгрузитьКолонку("sid"));
	Запрос.УстановитьПараметр("МобильноеУстройство", МобильноеУстройство);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	&ИдентификаторДокумента КАК id_doc,
		|	ПересчетТоваров.id_good,
		|	ПересчетТоваров.id_properties,
		|	ПересчетТоваров.id_series,
		|	ПересчетТоваров.id_cell,
		|	ПересчетТоваров.id_unit,
		|	ПересчетТоваров.id_price,
		|	ПересчетТоваров.price,
		|	СУММА(ПересчетТоваров.d_qtty) КАК qtty,
		|	СУММА(ВЫБОР
		|		КОГДА НЕ МобильныеУстройства.Ссылка ЕСТЬ NULL
		|			ТОГДА ПересчетТоваров.d_qtty
		|		ИНАЧЕ 0
		|	КОНЕЦ) КАК d_qtty,
		|	ПересчетТоваров.use_series,
		|	ВЫБОР
		|		КОГДА ПересчетТоваров.ТипТаблицы = ЗНАЧЕНИЕ(Перечисление.SUI_ТипыТаблицДокументовОбмена.Отбор)
		|			ТОГДА ""out""
		|		КОГДА ПересчетТоваров.ТипТаблицы = ЗНАЧЕНИЕ(Перечисление.SUI_ТипыТаблицДокументовОбмена.Размещение)
		|			ТОГДА ""in""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК table_type
		|ИЗ
		|	РегистрСведений.SUI_docs_tbl_goods_delta КАК ПересчетТоваров
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланОбмена.SUI_МобильныеУстройства КАК МобильныеУстройства
		|		ПО ПересчетТоваров.МобильноеУстройство = МобильныеУстройства.Ссылка
		|		И МобильныеУстройства.Ссылка = &МобильноеУстройство
		|ГДЕ
		|	ПересчетТоваров.sid_doc В (&ИдентификаторыДокументовОбмена)
		|СГРУППИРОВАТЬ ПО
		|	ПересчетТоваров.id_good,
		|	ПересчетТоваров.id_properties,
		|	ПересчетТоваров.id_series,
		|	ПересчетТоваров.id_cell,
		|	ПересчетТоваров.id_unit,
		|	ПересчетТоваров.id_price,
		|	ПересчетТоваров.price,
		|	ПересчетТоваров.use_series,
		|	ВЫБОР
		|		КОГДА ПересчетТоваров.ТипТаблицы = ЗНАЧЕНИЕ(Перечисление.SUI_ТипыТаблицДокументовОбмена.Отбор)
		|			ТОГДА ""out""
		|		КОГДА ПересчетТоваров.ТипТаблицы = ЗНАЧЕНИЕ(Перечисление.SUI_ТипыТаблицДокументовОбмена.Размещение)
		|			ТОГДА ""in""
		|		ИНАЧЕ """"
		|	КОНЕЦ";
	
	РезультатЗапроса = Запрос.Выполнить();

	Если Не РезультатЗапроса.Пустой() Тогда
		
		ИменаКолонок = SUI_ОбщегоНазначения.ПолучитьИменаКолонокРезультатаЗапроса(РезультатЗапроса);
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ДанныеСтроки = Новый Структура(ИменаКолонок);
			ЗаполнитьЗначенияСвойств(ДанныеСтроки, Выборка);
			ДанныеПересчета.Добавить(ДанныеСтроки);
			
		КонецЦикла;
		
	КонецЕсли;

	Возврат ДанныеПересчета;
	
КонецФункции

Процедура СоздатьЗаданиеЗавершенияПересчета(МобильноеУстройство, ИдентификаторДокумента) Экспорт
	
	ДокументыОбмена = ПолучитьДокументыОбменаПересчетаПоИдентификаторуДокумента(ИдентификаторДокумента);
	
	Если ДокументыОбмена.Документы.Количество() = 0 Тогда
		ВызватьИсключение СтрСоединить(ДокументыОбмена.Ошибки);
	КонецЕсли;
	
	НаименованиеОчередиЗаданий = НСтр("ru = 'Завершение группового пересчета'");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОчередьЗаданий.Хеш
		|ИЗ
		|	РегистрСведений.SUI_ОчередьЗаданий КАК ОчередьЗаданий
		|ГДЕ
		|	ОчередьЗаданий.Статус В (&АктивныеСтатусыОчередиЗаданий)
		|	И ОчередьЗаданий.ИдентификаторДокумента = &ИдентификаторДокумента
		|	И ОчередьЗаданий.Наименование ПОДОБНО ""%"" + &НаименованиеОчередиЗаданий + ""%""";
	
	Запрос.УстановитьПараметр("ИдентификаторДокумента", ИдентификаторДокумента);
	Запрос.УстановитьПараметр("НаименованиеОчередиЗаданий", НаименованиеОчередиЗаданий);
	
	АктивныеСтатусыОчередиЗаданий = Новый Массив();
	АктивныеСтатусыОчередиЗаданий.Добавить(Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Открыто);
	АктивныеСтатусыОчередиЗаданий.Добавить(Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Выполняется);
	Запрос.УстановитьПараметр("АктивныеСтатусыОчередиЗаданий", АктивныеСтатусыОчередиЗаданий);
	
	Если Не Запрос.Выполнить().Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ПредставлениеДокументаОчереди = ИдентификаторДокумента;
	
	УстановитьПривилегированныйРежим(Истина);
	СсылкаДокумента = SUI_ИнтеграцияВКонфигурацию.СсылкаПоИдентификаторуSimple(ИдентификаторДокумента);
	Если ЗначениеЗаполнено(СсылкаДокумента) Тогда
		ПредставлениеДокументаОчереди = Строка(СсылкаДокумента);
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
	НаименованиеЗадания = СтрШаблон(НаименованиеОчередиЗаданий + " (%1)", ПредставлениеДокументаОчереди);
	
	ПараметрыСозданияЗадания = SUI_ОчередьЗаданийКлиентСервер.ПараметрыСозданияЗадания();
	ПараметрыСозданияЗадания.ИдентификаторДокумента = ИдентификаторДокумента;
	ПараметрыСозданияЗадания.Наименование = НаименованиеЗадания;
	
	ПараметрыПроцедуры = Новый Массив();
	ПараметрыПроцедуры.Добавить(ИдентификаторДокумента);
	ПараметрыПроцедуры.Добавить(МобильноеУстройство);
	
	SUI_ОчередьЗаданийКлиентСервер.ДобавитьОбработчикВПараметрыСозданияЗадания(ПараметрыСозданияЗадания,
		"РегистрыСведений.SUI_docs_tbl_goods_delta.ВыполнитьЗавершениеПересчетаПоДокументу", ПараметрыПроцедуры);
	
	РегистрыСведений.SUI_ОчередьЗаданий.СоздатьЗадание(ПараметрыСозданияЗадания);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ЗагрузитьИтогиПересчетаВТоварыДокументаОбмена(ИдентификаторДокумента) Экспорт
	
	ДанныеЗагружены = Ложь;
	
	ИтогиПоДокументамОбмена = ПолучитьИтогиПересчетаПоДокументамОбмена(ИдентификаторДокумента);
	
	Для Каждого КлючЗначение Из ИтогиПоДокументамОбмена Цикл
		
		Загруженно = РегистрыСведений.SUI_docs_tbl_goods.ЗагрузитьИзМобильногоУстройства(
			КлючЗначение.Ключ, КлючЗначение.Значение);
		
		Если Загруженно Тогда
			ДанныеЗагружены = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ДанныеЗагружены;
	
КонецФункции

Процедура ВыполнитьЗавершениеПересчетаПоДокументу(ИдентификаторДокумента, МобильноеУстройство = Неопределено) Экспорт
	
	ИтогиПоДокументамОбмена = ПолучитьИтогиПересчетаПоДокументамОбмена(ИдентификаторДокумента);
	
	Для Каждого КлючЗначение Из ИтогиПоДокументамОбмена Цикл
		
		ДанныеДляЗагрузки = РегистрыСведений.SUI_docs.ДанныеДляЗагрузкиИзМобильногоУстройства(
			ИдентификаторДокумента, МобильноеУстройство);
		
		ДанныеДляЗагрузки.ИдентификаторДокументаОбмена = КлючЗначение.Ключ;
		ДанныеДляЗагрузки.Таблицы.Товары = КлючЗначение.Значение;
		
		РегистрыСведений.SUI_docs.ЗагрузитьИзМобильногоУстройства(ДанныеДляЗагрузки);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДокументыОбменаПересчетаПоИдентификаторуДокумента(ИдентификаторДокумента)
	
	ОтборДокументовОбмена = Новый Соответствие();
	ОтборДокументовОбмена.Вставить("id_doc", ИдентификаторДокумента);
	
	ПоляДокументовОбмена = Новый Соответствие();
	ПоляДокументовОбмена.Вставить("Состояние", "Состояние");
	ПоляДокументовОбмена.Вставить("НастройкаДокумента.Используется", "НастройкаДокументаИспользуется");
	ПоляДокументовОбмена.Вставить("НастройкаДокумента.ПометкаУдаления", "НастройкаДокументаПометкаУдаления");
	ПоляДокументовОбмена.Вставить("НастройкаДокумента.ГрупповоеСканирование", "ГрупповоеСканирование");
	
	РезультатДокументыОбмена = РегистрыСведений.SUI_docs.ПолучитьДанныеДокументовОбмена(
		ОтборДокументовОбмена, ПоляДокументовОбмена);
	
	Результат = Новый Структура();
	Результат.Вставить("Ошибки", Новый Массив());
	Результат.Вставить("Документы", РезультатДокументыОбмена.Выгрузить());
	
	ОтобранныеСтроки = Новый Массив();
	
	Если Результат.Документы.Количество() = 0 Тогда
		
		ТекстОшибки = НСтр("ru = 'Документ обмена ""%1"" не был выгружен.'");
		ТекстОшибки = СтрШаблон(ТекстОшибки, ИдентификаторДокумента);
		Результат.Ошибки.Добавить(ТекстОшибки);
		
	Иначе
		
		РабочиеСостоянияДокументовОбмена = РегистрыСведений.SUI_docs.РабочиеСостоянияДокументовОбмена();
		
		Для Каждого СтрокаДокумент Из Результат.Документы Цикл
			
			Если Не СтрокаДокумент.НастройкаДокументаИспользуется Или СтрокаДокумент.НастройкаДокументаПометкаУдаления Тогда
				
				ТекстОшибки = НСтр("ru = 'Настройка документа обмена ""%1"" (%2) не используется.'");
				ТекстОшибки = СтрШаблон(ТекстОшибки, СтрокаДокумент.id_doc, СтрокаДокумент.sid);
				Результат.Ошибки.Добавить(ТекстОшибки);
				
			ИначеЕсли Не СтрокаДокумент.ГрупповоеСканирование Тогда
				
				ТекстОшибки = НСтр("ru = 'Настройка документа обмена ""%1"" (%2) не поддерживает групповую работу.'");
				ТекстОшибки = СтрШаблон(ТекстОшибки, СтрокаДокумент.id_doc, СтрокаДокумент.sid);
				Результат.Ошибки.Добавить(ТекстОшибки);
				
			ИначеЕсли РабочиеСостоянияДокументовОбмена.Найти(СтрокаДокумент.Состояние) = Неопределено Тогда
				
				ТекстОшибки = НСтр("ru = 'Документ обмена ""%1"" (%2) находится в состоянии ""%3"".'");
				ТекстОшибки = СтрШаблон(ТекстОшибки, СтрокаДокумент.id_doc, СтрокаДокумент.sid, СтрокаДокумент.Состояние);
				Результат.Ошибки.Добавить(ТекстОшибки);
				
			Иначе
				ОтобранныеСтроки.Добавить(СтрокаДокумент);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Результат.Документы = Результат.Документы.Скопировать(ОтобранныеСтроки);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьИтогиПересчетаПоДокументамОбмена(ИдентификаторДокумента)
	
	ИтогиПоДокументамОбмена = Новый Соответствие();
	
	ДокументыОбмена = ПолучитьДокументыОбменаПересчетаПоИдентификаторуДокумента(ИдентификаторДокумента);
	
	Если ДокументыОбмена.Документы.Количество() = 0 Тогда
		ВызватьИсключение СтрСоединить(ДокументыОбмена.Ошибки);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИдентификаторыДокументовОбмена", ДокументыОбмена.Документы.ВыгрузитьКолонку("sid"));
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПересчетТоваровДокументаОбмена.sid_doc КАК ИдентификаторДокументаОбмена,
		|	ПересчетТоваровДокументаОбмена.id_good,
		|	ПересчетТоваровДокументаОбмена.id_properties,
		|	ПересчетТоваровДокументаОбмена.id_series,
		|	ПересчетТоваровДокументаОбмена.id_cell,
		|	ПересчетТоваровДокументаОбмена.id_unit,
		|	ПересчетТоваровДокументаОбмена.id_price,
		|	ПересчетТоваровДокументаОбмена.price,
		|	СУММА(ПересчетТоваровДокументаОбмена.d_qtty) КАК qtty,
		|	ПересчетТоваровДокументаОбмена.use_series,
		|	ЛОЖЬ КАК use_mark,
		|	ПересчетТоваровДокументаОбмена.ТипТаблицы
		|ИЗ
		|	РегистрСведений.SUI_docs_tbl_goods_delta КАК ПересчетТоваровДокументаОбмена
		|ГДЕ
		|	ПересчетТоваровДокументаОбмена.sid_doc В (&ИдентификаторыДокументовОбмена)
		|СГРУППИРОВАТЬ ПО
		|	ПересчетТоваровДокументаОбмена.sid_doc,
		|	ПересчетТоваровДокументаОбмена.id_good,
		|	ПересчетТоваровДокументаОбмена.id_properties,
		|	ПересчетТоваровДокументаОбмена.id_series,
		|	ПересчетТоваровДокументаОбмена.id_cell,
		|	ПересчетТоваровДокументаОбмена.id_unit,
		|	ПересчетТоваровДокументаОбмена.id_price,
		|	ПересчетТоваровДокументаОбмена.price,
		|	ПересчетТоваровДокументаОбмена.ТипТаблицы,
		|	ПересчетТоваровДокументаОбмена.use_series";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Для Каждого СтрокаДокументОбмена Из ДокументыОбмена.Документы Цикл
			
			ТаблицаТовары = РегистрыСведений.SUI_docs_tbl_goods.ПолучитьТаблицуЭталон();
			
			Выборка.Сбросить();
			ПараметрыОтбораПоДокументуОбмена = Новый Структура();
			ПараметрыОтбораПоДокументуОбмена.Вставить("ИдентификаторДокументаОбмена", СтрокаДокументОбмена.sid);
			Пока Выборка.НайтиСледующий(ПараметрыОтбораПоДокументуОбмена) Цикл
				ЗаполнитьЗначенияСвойств(ТаблицаТовары.Добавить(), Выборка);
			КонецЦикла;
			
			Если ТаблицаТовары.Количество() > 0 Тогда
				ИтогиПоДокументамОбмена.Вставить(СтрокаДокументОбмена.sid, ТаблицаТовары);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ИтогиПоДокументамОбмена;
	
КонецФункции

#КонецОбласти

#КонецЕсли
