
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Загрузить пересчет.
// 
// Параметры:
//  МобильноеУстройство - ПланОбменаСсылка.SUI_МобильныеУстройства - Мобильное устройство данных пересчета
//  ИдентификаторДокумента - Строка - Идентификатор документа пересчета
//  Данные - ТаблицаЗначений - Данные пересчета см. SUI_ДокументыОбмена.ТаблицаПересчетТоваровДокументаОбмена
//  Перезаписать - Булево - Записать данные пересчета очистив старые
// 
// Возвращаемое значение:
//  Структура - Загрузить пересчет:
// * ДанныеЗагружены - Булево - Признак загруженных данных
// * Ошибки - Массив из Строка - Массив ошибок возникших при загрузке
Функция ЗагрузитьПересчет(МобильноеУстройство, ИдентификаторДокумента, Данные, Перезаписать = Ложь) Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("ДанныеЗагружены", Ложь);
	Результат.Вставить("Ошибки", Новый Массив());
	
	Если Данные.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	СостоянияКЗагрузке = SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.МассивЗначений( 
		Перечисления.SUI_СостоянияДокументовОбмена.КВыгрузке,
		Перечисления.SUI_СостоянияДокументовОбмена.Выгружен, 
		Перечисления.SUI_СостоянияДокументовОбмена.Загружен,
		Перечисления.SUI_СостоянияДокументовОбмена.ВРаботе);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДокументыОбмена.sid,
		|	ДокументыОбмена.id_doc,
		|	ДокументыОбмена.НастройкаДокумента.ГрупповоеСканирование КАК ГрупповоеСканирование,
		|	ДокументыОбмена.Состояние,
		|	ВЫБОР
		|		КОГДА ДокументыОбмена.НастройкаДокумента.ГрупповоеСканирование
		|		И ДокументыОбмена.Состояние В (&СостоянияКЗагрузке)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Загружать
		|ПОМЕСТИТЬ втДокументыОбмена
		|ИЗ
		|	РегистрСведений.SUI_docs КАК ДокументыОбмена
		|ГДЕ
		|	ДокументыОбмена.id_doc = &ИдентификаторДокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&ДатаЗагрузки КАК Период,
		|	&МобильноеУстройство КАК МобильноеУстройство,
		|	Данные.sid,
		|	Данные.id_good,
		|	Данные.id_properties,
		|	Данные.id_unit,
		|	Данные.id_cell,
		|	Данные.id_series,
		|	Данные.id_price,
		|	Данные.price,
		|	Данные.use_series,
		|	Данные.ТипТаблицы,
		|	Данные.d_qtty
		|ПОМЕСТИТЬ втДанные
		|ИЗ
		|	&Данные КАК Данные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втДокументыОбмена.sid КАК sid_doc,
		|	втДанные.Период,
		|	втДанные.МобильноеУстройство,
		|	втДанные.sid,
		|	втДанные.id_good,
		|	втДанные.id_properties,
		|	втДанные.id_unit,
		|	втДанные.id_cell,
		|	втДанные.id_series,
		|	втДанные.id_price,
		|	втДанные.price,
		|	втДанные.use_series,
		|	втДанные.ТипТаблицы,
		|	втДанные.d_qtty
		|ИЗ
		|	втДокументыОбмена КАК втДокументыОбмена
		|		ЛЕВОЕ СОЕДИНЕНИЕ втДанные КАК втДанные
		|		ПО ИСТИНА
		|ГДЕ
		|	втДокументыОбмена.Загружать
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втДокументыОбмена.sid,
		|	втДокументыОбмена.id_doc,
		|	втДокументыОбмена.ГрупповоеСканирование,
		|	втДокументыОбмена.Состояние
		|ИЗ
		|	втДокументыОбмена КАК втДокументыОбмена
		|ГДЕ
		|	НЕ втДокументыОбмена.Загружать";
	
	Запрос.УстановитьПараметр("ИдентификаторДокумента", ИдентификаторДокумента);
	Запрос.УстановитьПараметр("ДатаЗагрузки", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("МобильноеУстройство", МобильноеУстройство);
	Запрос.УстановитьПараметр("СостоянияКЗагрузке", СостоянияКЗагрузке);
	Запрос.УстановитьПараметр("Данные", Данные);
		
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	РезультатДанныеПересчета = РезультатыЗапроса[РезультатыЗапроса.ВГраница() - 1];
	РезультатНеЗагружаемыеДокументы = РезультатыЗапроса[РезультатыЗапроса.ВГраница()];
	
	Если РезультатДанныеПересчета.Пустой() Тогда
		
		Если РезультатНеЗагружаемыеДокументы.Пустой() Тогда
			
			ТекстОшибки = НСтр("ru = 'Документ обмена ""%1"" отсутствует.'");
			ТекстОшибки = СтрШаблон(ТекстОшибки, ИдентификаторДокумента);
			Результат.Ошибки.Добавить(ТекстОшибки);
			
		Иначе
			
			Выборка = РезультатНеЗагружаемыеДокументы.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				Если Не Выборка.ГрупповоеСканирование Тогда
					
					ТекстОшибки = НСтр("ru = 'Документ обмена ""%1"" (%2) не поддерживает групповое сканирование.'");
					ТекстОшибки = СтрШаблон(ТекстОшибки, Выборка.id_doc, Выборка.sid);
					Результат.Ошибки.Добавить(ТекстОшибки);
					
				Иначе
					
					ТекстОшибки = НСтр("ru = 'Документ обмена ""%1"" (%2) в состоянии ""%3"".'");
					ТекстОшибки = СтрШаблон(ТекстОшибки, Выборка.id_doc, Выборка.sid, Выборка.Состояние);
					Результат.Ошибки.Добавить(ТекстОшибки);
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	Иначе
		
		Выборка = РезультатДанныеПересчета.Выбрать();
		
		Если Перезаписать Тогда
			
			ДанныеКОчистке = РезультатДанныеПересчета.Выгрузить();
			ДанныеКОчистке.Свернуть("sid_doc,МобильноеУстройство");
			
			НачатьТранзакцию();
			
			Попытка
				
				Блокировка = Новый БлокировкаДанных;
				ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.SUI_docs_tbl_goods_delta");
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
				ЭлементБлокировки.ИсточникДанных = ДанныеКОчистке;
				ЭлементБлокировки.ИспользоватьИзИсточникаДанных("sid_doc", "sid_doc");
				ЭлементБлокировки.ИспользоватьИзИсточникаДанных("МобильноеУстройство", "МобильноеУстройство");
				Блокировка.Заблокировать();
				
				Для Каждого СтрокаДанныхКОчистке Из ДанныеКОчистке Цикл
					
					НаборЗаписей = СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.sid_doc.Установить(СтрокаДанныхКОчистке.sid_doc);
					НаборЗаписей.Отбор.МобильноеУстройство.Установить(СтрокаДанныхКОчистке.МобильноеУстройство);
					
					Отбор = Новый Структура();
					Отбор.Вставить("sid_doc", СтрокаДанныхКОчистке.sid_doc);
					Отбор.Вставить("МобильноеУстройство", СтрокаДанныхКОчистке.МобильноеУстройство);
					
					Выборка.Сбросить();
					
					Пока Выборка.НайтиСледующий(Отбор) Цикл
						ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
					КонецЦикла;
					
					НаборЗаписей.ОбменДанными.Загрузка = Истина;
					НаборЗаписей.Записать(Истина);
					
				КонецЦикла;
				
				ЗафиксироватьТранзакцию();
				
			Исключение
				ОтменитьТранзакцию();
				Ошибка = ИнформацияОбОшибке();
				ТекстОшибки = НСтр("ru = 'Ошибка перезаписи данных пересчета!'");
				ВызватьИсключение(ТекстОшибки, , , , Ошибка);
			КонецПопытки;
			
		Иначе
			
			НачатьТранзакцию();
			
			Попытка
				
				Пока Выборка.Следующий() Цикл
					
					Запись = СоздатьМенеджерЗаписи();
					ЗаполнитьЗначенияСвойств(Запись, Выборка);
					Запись.Записать(Истина);
					
				КонецЦикла;
				
				ЗафиксироватьТранзакцию();
				
			Исключение
				ОтменитьТранзакцию();
				Ошибка = ИнформацияОбОшибке();
				ТекстОшибки = НСтр("ru = 'Ошибка записи данных пересчета!'");
				ВызватьИсключение(ТекстОшибки, , , , Ошибка);
			КонецПопытки;
			
		КонецЕсли;
		
		Результат.ДанныеЗагружены = Истина;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
