
#Область ПрограммныйИнтерфейс

#Область ОбработчикиПодписокНаСобытия

// SUI документы при записи (ДокументСсылка).
// 
// Параметры:
//  Источник - ДокументСсылка - Источник
//  Отказ - Булево - Отказ
Процедура SUI_ДокументыПриЗаписи(Источник, Отказ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Отказ Или Источник.ОбменДанными.Загрузка Или
		Источник.ДополнительныеСвойства.Свойство("ОтключитьМеханизмРегистрацииОбъектов") Тогда 
		Возврат;
	КонецЕсли;
	
	ПараметрыВыгрузки = Новый Структура();
	ПараметрыВыгрузки.Вставить("ДокументСсылка", Источник.Ссылка);
	ПараметрыВыгрузки.Вставить("ЭтоПодпискаНаСобытие");
	
	Если Источник.ДополнительныеСвойства.Свойство("SUI_НеРегистрироватьИзменения") Тогда
		ПараметрыВыгрузки.Вставить("НеРегистрироватьИзменения");
	КонецЕсли;
	
	Если Источник.ДополнительныеСвойства.Свойство("SUI_МобильноеУстройство") Тогда
		ПараметрыВыгрузки.Вставить("МобильноеУстройство", Источник.ДополнительныеСвойства.SUI_МобильноеУстройство);
	КонецЕсли;
	
	Если Источник.ДополнительныеСвойства.Свойство("SUI_ИсключитьМобильноеУстройство") Тогда
		ПараметрыВыгрузки.Вставить("ИсключитьМобильноеУстройство", Источник.ДополнительныеСвойства.SUI_ИсключитьМобильноеУстройство);
	КонецЕсли;
	
	Если Источник.ПометкаУдаления Тогда
		ПараметрыВыгрузки.Вставить("Состояние", Перечисления.SUI_СостоянияДокументовОбмена.Отменен);
	КонецЕсли;

	ВыгрузитьДокументОбмена(ПараметрыВыгрузки);
	
КонецПроцедуры

// SUI документы обмена перед записью (РегистрСведенийНаборЗаписей.SUI_docs).
// 
// Параметры:
//  Источник - РегистрСведенийНаборЗаписей.SUI_docs - Источник
//  Отказ - Булево - Отказ
//  Замещение - Булево - Замещение
Процедура SUI_ДокументыОбменаПередЗаписью(Источник, Отказ, Замещение) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Отказ Или
		Источник.ОбменДанными.Загрузка Или
		ТипЗнч(Источник) <> Тип("РегистрСведенийНаборЗаписей.SUI_docs") Тогда
		Возврат;
	КонецЕсли;

	Если Источник.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;

	Если Не Источник.ЗаписьИсторииДанных.ДополнительныеДанные.Свойство("НеУдалятьДанные") Тогда
		
		Если Не ЗначениеЗаполнено(Источник.Отбор.sid.Значение) И
			Не ЗначениеЗаполнено(Источник.Отбор.id_doc.Значение) И 
			Не ЗначениеЗаполнено(Источник.Отбор.НастройкаДокумента.Значение) Тогда
			Источник.ДополнительныеСвойства.Вставить("Удаление");
		Иначе
			
			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ
				|	SUI_docs.sid,
				|	SUI_docs.id_doc,
				|	SUI_docs.НастройкаДокумента
				|ИЗ
				|	РегистрСведений.SUI_docs КАК SUI_docs
				|ГДЕ
				|	ВЫБОР
				|		КОГДА &id_doc <> НЕОПРЕДЕЛЕНО
				|			ТОГДА SUI_docs.id_doc = &id_doc
				|		ИНАЧЕ ИСТИНА
				|	КОНЕЦ
				|	И ВЫБОР
				|		КОГДА &sid <> НЕОПРЕДЕЛЕНО
				|			ТОГДА SUI_docs.sid = &sid
				|		ИНАЧЕ ИСТИНА
				|	КОНЕЦ
				|	И ВЫБОР
				|		КОГДА &НастройкаДокумента <> НЕОПРЕДЕЛЕНО
				|			ТОГДА SUI_docs.НастройкаДокумента = &НастройкаДокумента
				|		ИНАЧЕ ИСТИНА
				|	КОНЕЦ
				|СГРУППИРОВАТЬ ПО
				|	SUI_docs.sid,
				|	SUI_docs.id_doc,
				|	SUI_docs.НастройкаДокумента";
			
			Если ЗначениеЗаполнено(Источник.Отбор.sid.Значение) Тогда
				Запрос.УстановитьПараметр("sid", Источник.Отбор.sid.Значение);
			Иначе
				Запрос.УстановитьПараметр("sid", Неопределено);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Источник.Отбор.id_doc.Значение) Тогда
				Запрос.УстановитьПараметр("id_doc", Источник.Отбор.id_doc.Значение);
			Иначе
				Запрос.УстановитьПараметр("id_doc", Неопределено);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Источник.Отбор.НастройкаДокумента.Значение) Тогда
				Запрос.УстановитьПараметр("НастройкаДокумента", Источник.Отбор.НастройкаДокумента.Значение);
			Иначе
				Запрос.УстановитьПараметр("НастройкаДокумента", Неопределено);
			КонецЕсли;
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Если Не РезультатЗапроса.Пустой() Тогда
				
				Источник.ДополнительныеСвойства.Вставить("Удаление", Новый Массив());
				
				Выборка = РезультатЗапроса.Выбрать();
				
				Пока Выборка.Следующий() Цикл
					
					НаборЗаписей = РегистрыСведений.SUI_docs.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.sid.Установить(Выборка.sid);
					НаборЗаписей.Отбор.id_doc.Установить(Выборка.id_doc);
					НаборЗаписей.Отбор.НастройкаДокумента.Установить(Выборка.НастройкаДокумента);
					
					Источник.ДополнительныеСвойства.Удаление.Добавить(НаборЗаписей);
					
				КонецЦикла;
				
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

// SUI документы обмена при записи (РегистрСведенийНаборЗаписей.SUI_docs).
// 
// Параметры:
//  Источник - РегистрСведенийНаборЗаписей.SUI_docs - Источник
//  Отказ - Булево - Отказ
//  Замещение - Булево - Замещение
Процедура SUI_ДокументыОбменаПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	Если Отказ Или
		Источник.ОбменДанными.Загрузка Или
		ТипЗнч(Источник) <> Тип("РегистрСведенийНаборЗаписей.SUI_docs") Тогда
		Возврат;
	КонецЕсли;

	Если Источник.Количество() = 0 И Источник.ДополнительныеСвойства.Свойство("Удаление") Тогда
		УдалитьРегистрациюИзмененийДокументаОбмена(Источник.ДополнительныеСвойства.Удаление);
		УдалитьСвязанныеДанныеДокументаОбмена(Источник.ДополнительныеСвойства.Удаление);
		Возврат;
	КонецЕсли;
	
	Если Источник.ДополнительныеСвойства.Свойство("ОтключитьМеханизмРегистрацииОбъектов") Тогда
		Возврат;
	КонецЕсли;
	
	ЗарегистрироватьИзмененияДокументаОбмена(Источник);
	
КонецПроцедуры

#КонецОбласти

Функция ПараметрыВыгрузкиДокументаОбмена() Экспорт
	
	ПараметрыЗагрузки = Новый Структура();
	
	ПараметрыЗагрузки.Вставить("ДокументСсылка");
	ПараметрыЗагрузки.Вставить("МобильноеУстройство");
	ПараметрыЗагрузки.Вставить("НастройкаДокумента");
	
	Возврат ПараметрыЗагрузки;
	
КонецФункции

//@skip-check bsl-legacy-check-expression-type
//@skip-check doc-comment-parameter-section
Процедура ВыгрузитьДокументОбмена(ПараметрыВыгрузки, АдресРезультата = Неопределено) Экспорт
	
	ДанныеВыгружены = Ложь;
	
	ДокументСсылка = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыВыгрузки, "ДокументСсылка");

	ОбщегоНазначенияКлиентСервер.Проверить(
		SUI_ОбщегоНазначения.ЭтоСсылкаДокумента(ДокументСсылка),
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Значение (%1) не является ссылкой документа'"), ДокументСсылка),
		КонтекстВызоваСтрокой("ВыгрузитьДокументОбмена"));
		
	ОбщегоНазначенияКлиентСервер.Проверить(
		ОбщегоНазначения.СсылкаСуществует(ДокументСсылка),
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Ссылка документа (%1) не существует'"), ДокументСсылка),
		КонтекстВызоваСтрокой("ВыгрузитьДокументОбмена"));
		
	Если ПараметрыВыгрузки.Свойство("НастройкаДокумента") И ЗначениеЗаполнено(ПараметрыВыгрузки.НастройкаДокумента) Тогда
		НастройкаДокумента = НастройкаДокументаПоПараметру(ПараметрыВыгрузки.НастройкаДокумента, , "ВыгрузитьДокументОбмена");
		Если SUI_НастройкиДокументовСервер.ДокументСоответствуетОтборуНастройки(НастройкаДокумента, ДокументСсылка) Тогда
			ПараметрыВыгрузки.Вставить("Настройки", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(НастройкаДокумента));
		КонецЕсли;
		ПараметрыВыгрузки.Удалить("НастройкаДокумента");
	Иначе
		ПараметрыВыгрузки.Вставить("Настройки", SUI_НастройкиДокументовСервер.ПолучитьНастройкиДокумента(ДокументСсылка));
	КонецЕсли;
	
	Если ПараметрыВыгрузки.Настройки.Количество() = 0 Тогда
		Если Не ПараметрыВыгрузки.Свойство("ЭтоПодпискаНаСобытие") Тогда
			ОбщегоНазначения.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Для документа %1 отсутствуют настройки.'"), ДокументСсылка));
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	ПараметрыВыгрузки.Вставить("МобильноеУстройство", SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ПараметрыВыгрузки, "МобильноеУстройство", ПланыОбмена.SUI_МобильныеУстройства.ПустаяСсылка(), Тип("ПланОбменаСсылка.SUI_МобильныеУстройства")));
	
	Если ПараметрыВыгрузки.МобильноеУстройство.Пустая() Тогда
		ПараметрыВыгрузки.Удалить("МобильноеУстройство");
	КонецЕсли;
		
	ПараметрыВыгрузки.Вставить("ИсключитьМобильноеУстройство", SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ПараметрыВыгрузки, "ИсключитьМобильноеУстройство", ПланыОбмена.SUI_МобильныеУстройства.ПустаяСсылка(), Тип("ПланОбменаСсылка.SUI_МобильныеУстройства")));
	
	Если ПараметрыВыгрузки.ИсключитьМобильноеУстройство.Пустая() Тогда
		ПараметрыВыгрузки.Удалить("ИсключитьМобильноеУстройство");
	КонецЕсли;
	
	Если ПараметрыВыгрузки.Свойство("ЭтоПодпискаНаСобытие") Тогда
		Состояние = Неопределено;
	Иначе
		Состояние = Перечисления.SUI_СостоянияДокументовОбмена.КВыгрузке;
		ПараметрыВыгрузки.Вставить("ПринудительнаяВыгрузка");
	КонецЕсли;
	
	Для Каждого НастройкаДокумента Из ПараметрыВыгрузки.Настройки Цикл
		
		//@skip-check query-in-loop
		ДанныеДокументаОбмена = СформироватьДанныеДокументаОбменаИзДокумента(ДокументСсылка, НастройкаДокумента, Состояние);
		
		Если ДанныеДокументаОбмена = Неопределено Тогда
			Если ПараметрыВыгрузки.Свойство("ПринудительнаяВыгрузка") Тогда
				ОбщегоНазначения.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Не удалось сформировать данные документа по настройке %1'"), 
						НастройкаДокумента));
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		Если ПараметрыВыгрузки.Свойство("ЭтоПодпискаНаСобытие") И 
			ДанныеДокументаОбмена.ДокументОбменаСуществует Тогда
			ПараметрыВыгрузки.Вставить("НеРегистрироватьИзменения");
		КонецЕсли;
		
		ДанныеДокументаОбмена.Вставить("МобильноеУстройство", ПланыОбмена.SUI_МобильныеУстройства.ПустаяСсылка());
		
		//@skip-check query-in-loop
		ЗаписатьДанныеДокументаОбмена(ДанныеДокументаОбмена, ПараметрыВыгрузки, ДанныеВыгружены);
	
	КонецЦикла;
	
	Если ЗначениеЗаполнено(АдресРезультата) И ЭтоАдресВременногоХранилища(АдресРезультата) Тогда
		ПоместитьВоВременноеХранилище(ДанныеВыгружены, АдресРезультата);
	КонецЕсли;

КонецПроцедуры

Функция ВыгрузитьИПолучитьДокументОбмена(ПараметрыВыгрузки) Экспорт

	ДанныеДокументов = Новый Массив();

	ВыгрузитьДокументОбмена(ОбщегоНазначения.СкопироватьРекурсивно(ПараметрыВыгрузки, Ложь));
	
	Если ПараметрыВыгрузки.Свойство("SUI_АдресноеХранение") И ПараметрыВыгрузки.SUI_АдресноеХранение Тогда
		ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.ДокументыАдресногоХранения;
	Иначе
		ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.Документы;
	КонецЕсли;
		
	ТаблицаКоллекции = SUI_ПакетыДанных.ПолучитьСостояниеТаблиц(ПараметрыВыгрузки.МобильноеУстройство);
	ТаблицаКоллекции.Очистить();
	
	СтрокаТаблицы = ТаблицаКоллекции.Добавить();
	СтрокаТаблицы.МобильноеУстройство = ПараметрыВыгрузки.МобильноеУстройство;
	СтрокаТаблицы.Таблица = ТаблицаИнтеграции;
	СтрокаТаблицы.ИмяТаблицы = SUI_НастройкиМетаданныхСервер.ПолучитьИмяТаблицыВКонфигурации(СтрокаТаблицы.Таблица);
	СтрокаТаблицы.ИмяТаблицыМобильногоУстройства = SUI_НастройкиМетаданныхСервер.ПолучитьИмяТаблицыМобильногоУстройства(
		СтрокаТаблицы.Таблица);
	
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("НастройкаДокумента", ПараметрыВыгрузки.НастройкаДокумента);
	ПараметрыОтбора.Вставить("id_doc", 
		SUI_ИнтеграцияВКонфигурацию.ИдентификаторSimpleПоСсылке(ПараметрыВыгрузки.ДокументСсылка));
		
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Параметры", ПараметрыОтбора);
	ДополнительныеПараметры.Вставить("ВыборПервых", 1);
	ДополнительныеПараметры.Вставить("НеИзменения", Истина);
	
	СтрокаТаблицы.ДанныеЗапроса = SUI_ПакетыДанных.ПолучитьЗапросДанных(СтрокаТаблицы.Таблица, 
		ПараметрыВыгрузки.МобильноеУстройство, , ДополнительныеПараметры);
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Записывать", Ложь);
	
	Результат = SUI_ПакетыДанных.СформироватьКоллекцииДанныхПакетаСообщений(ПараметрыВыгрузки.МобильноеУстройство, 
		ТаблицаКоллекции, , ДополнительныеПараметры);
	
	ДанныеДокумента = ?(Результат.Количество() = 1, 
		Результат[0].data.Получить(СтрокаТаблицы.ИмяТаблицыМобильногоУстройства), 
		Неопределено);
	
	Если ДанныеДокумента <> Неопределено Тогда
		
		Для индекс = 0 По ДанныеДокумента.ВГраница() Цикл
			
			Если ДанныеДокумента[индекс].id_doc = ПараметрыОтбора.id_doc Тогда
				ДанныеДокументов.Добавить(ДанныеДокумента[индекс]);
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ?(ДанныеДокументов.Количество() = 0, Неопределено, ДанныеДокументов[0]);
	
КонецФункции

// Параметры загрузки документа обмена. Используется в см. SUI_ДокументыОбмена.ЗагрузитьДокументОбмена
// 
// Возвращаемое значение:
//  Структура - Параметры загрузки документа обмена:
// * Данные - Структура - Данные документа:
// 	* sid - Строка - Служебный идентификатор документа (36 символов)
// 	* id_doc - Строка - Идентификатор Simple документа (69 символов)
// 	* Таблицы - Соответствие из ПеречислениеСсылка.SUI_ТипыТаблицДокументовОбмена - Таблицы документа обмена
// * МобильноеУстройство - ПланОбменаСсылка.SUI_МобильныеУстройства, Неопределено - Мобильное устройство
Функция ПараметрыЗагрузкиДокументаОбмена() Экспорт
	
	Данные = Новый Структура("sid, id_doc, Таблицы", "", "", Новый Соответствие());
	
	ПараметрыЗагрузки = Новый Структура();
	
	ПараметрыЗагрузки.Вставить("Данные", Данные);
	ПараметрыЗагрузки.Вставить("МобильноеУстройство");
	ПараметрыЗагрузки.Вставить("ОбработкаЗаданийВФоне", Не ОбщегоНазначения.ИнформационнаяБазаФайловая());
	
	//@skip-check constructor-function-return-section
	Возврат ПараметрыЗагрузки;
	
КонецФункции

// Загрузить документ обмена.
// 
// Параметры:
//  ПараметрыЗагрузки - Структура - Параметры загрузки см. SUI_ДокументыОбмена.ПараметрыЗагрузкиДокументаОбмена
//  АдресРезультата - Строка - Адрес временного хранилища для помещения результата загрузки
// Возвращаемое значение:
//	Булево - Результат загрузки
Функция ЗагрузитьДокументОбмена(ПараметрыЗагрузки, АдресРезультата = Неопределено) Экспорт
	
	ДанныеЗагружены = Ложь;
	
	ОбщегоНазначенияКлиентСервер.Проверить(SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(ПараметрыЗагрузки.Данные.id_doc),
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Идентификатор документа ""%1"" не является идентификатором Simple.'"), ПараметрыЗагрузки.Данные.id_doc));
	
	ИсключаемыеСостояния = SUI_ОбщегоНазначенияКлиентСервер.МассивЗначений(
		Перечисления.SUI_СостоянияДокументовОбмена.Новый, 
		Перечисления.SUI_СостоянияДокументовОбмена.Отменен, 
		Перечисления.SUI_СостоянияДокументовОбмена.Завершен);

	ОбщегоНазначенияКлиентСервер.Проверить(ДокументБылВыгружен(ПараметрыЗагрузки.Данные.id_doc, ИсключаемыеСостояния),
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Документ с идентификатором ""%1"" не был выгружен.'"), ПараметрыЗагрузки.Данные.id_doc));
	
	// Если операция завершения группового пересчета
	БезТаблиц = ПараметрыЗагрузки.Свойство("ЗавершитьГрупповойПересчетДокументаОбмена");
	
	ПараметрыЗагрузки.Данные = ДанныеДокументаКЗагрузкеВДокументОбмена(ПараметрыЗагрузки.Данные.id_doc, ПараметрыЗагрузки.Данные.Таблицы, БезТаблиц);
		
	Для Каждого ДанныеДокумента Из ПараметрыЗагрузки.Данные Цикл
		
		ДанныеДокумента.МобильноеУстройство = ПараметрыЗагрузки.МобильноеУстройство;
		
		Если ДанныеДокумента.Состояние <> Перечисления.SUI_СостоянияДокументовОбмена.ВРаботе Тогда
			ДанныеДокумента.Состояние = Перечисления.SUI_СостоянияДокументовОбмена.Загружен;
		КонецЕсли;

		ПараметрыЗаписи = Новый Структура();
		
		Если ПараметрыЗагрузки.Свойство("НеРегистрироватьИзменения") Тогда
			ПараметрыЗаписи.Вставить("НеРегистрироватьИзменения");
		Иначе
			
			Если Константы.SUI_РегистрироватьИзмененияПослеЗагрузкиДокументаИзМУ.Получить() Тогда
				ПараметрыЗаписи.Вставить("ИсключитьМобильноеУстройство", ПараметрыЗагрузки.МобильноеУстройство);
			Иначе
				ПараметрыЗаписи.Вставить("НеРегистрироватьИзменения");
			КонецЕсли;
			
		КонецЕсли;
		
		Если ПараметрыЗагрузки.Свойство("ПерезаписьРезультатов") Тогда
			ПараметрыЗаписи.Вставить("ПерезаписьРезультатов");
		КонецЕсли;
		
		Если ПараметрыЗагрузки.Свойство("ЗавершитьГрупповойПересчетДокументаОбмена") Тогда
			ПараметрыЗаписи.Вставить("ЗавершитьГрупповойПересчетДокументаОбмена");
		КонецЕсли;
		
		Если ПараметрыЗагрузки.Свойство("ОтключитьПостобработкуДокументаОбмена") Тогда
			ПараметрыЗаписи.Вставить("ОтключитьПостобработкуДокументаОбмена");
		КонецЕсли;
		
		ПараметрыЗаписи.Вставить("ЭтоЗагрузка");
		
		//@skip-check query-in-loop
		ЗаписатьДанныеДокументаОбмена(ДанныеДокумента, ПараметрыЗаписи, ДанныеЗагружены);
		
	КонецЦикла;
	
	Возврат ДанныеЗагружены;
	
КонецФункции

Функция ПолучитьДанныеПересчетаСтрок(МобильноеУстройство, ИдентификаторДокумента) Экспорт
	
	ОбщегоНазначенияКлиентСервер.Проверить(SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(ИдентификаторДокумента),
		СтрШаблон(НСтр("ru = 'Идентификатор документа ""%1"" не является идентификатором Simple.'"), ИдентификаторДокумента));
	
	ИсключаемыеСостояния = SUI_ОбщегоНазначенияКлиентСервер.МассивЗначений(
		Перечисления.SUI_СостоянияДокументовОбмена.Новый, 
		Перечисления.SUI_СостоянияДокументовОбмена.Отменен, 
		Перечисления.SUI_СостоянияДокументовОбмена.Завершен);

	ОбщегоНазначенияКлиентСервер.Проверить(ДокументБылВыгружен(ИдентификаторДокумента, ИсключаемыеСостояния),
		СтрШаблон(НСтр("ru = 'Документ с идентификатором ""%1"" не был выгружен.'"), ИдентификаторДокумента));
	
	ДанныеПересчета = Новый Массив();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("id_doc", ИдентификаторДокумента);
	Запрос.УстановитьПараметр("МобильноеУстройство", МобильноеУстройство);
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	SUI_docs.sid,
		|	SUI_docs.id_doc
		|ПОМЕСТИТЬ втДанныеДокумента
		|ИЗ
		|	РегистрСведений.SUI_docs КАК SUI_docs
		|ГДЕ
		|	SUI_docs.id_doc = &id_doc
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втДанныеДокумента.id_doc,
		|	SUI_docs_tbl_goods_delta.id_good,
		|	SUI_docs_tbl_goods_delta.id_properties,
		|	SUI_docs_tbl_goods_delta.id_series,
		|	SUI_docs_tbl_goods_delta.id_cell,
		|	SUI_docs_tbl_goods_delta.id_unit,
		|	SUI_docs_tbl_goods_delta.id_price,
		|	SUI_docs_tbl_goods_delta.price,
		|	СУММА(SUI_docs_tbl_goods_delta.d_qtty) КАК qtty,
		|	СУММА(ВЫБОР
		|		КОГДА НЕ SUI_МобильныеУстройства.Ссылка ЕСТЬ NULL
		|			ТОГДА SUI_docs_tbl_goods_delta.d_qtty
		|		ИНАЧЕ 0
		|	КОНЕЦ) КАК d_qtty,
		|	SUI_docs_tbl_goods_delta.use_series,
		|	ВЫБОР
		|		КОГДА SUI_docs_tbl_goods_delta.ТипТаблицы = ЗНАЧЕНИЕ(Перечисление.SUI_ТипыТаблицДокументовОбмена.Отбор)
		|			ТОГДА ""out""
		|		КОГДА SUI_docs_tbl_goods_delta.ТипТаблицы = ЗНАЧЕНИЕ(Перечисление.SUI_ТипыТаблицДокументовОбмена.Размещение)
		|			ТОГДА ""in""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК table_type
		|ИЗ
		|	РегистрСведений.SUI_docs_tbl_goods_delta КАК SUI_docs_tbl_goods_delta
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втДанныеДокумента КАК втДанныеДокумента
		|		ПО втДанныеДокумента.sid = SUI_docs_tbl_goods_delta.sid_doc
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланОбмена.SUI_МобильныеУстройства КАК SUI_МобильныеУстройства
		|		ПО SUI_docs_tbl_goods_delta.МобильноеУстройство = SUI_МобильныеУстройства.Ссылка
		|		И SUI_МобильныеУстройства.Ссылка = &МобильноеУстройство
		|СГРУППИРОВАТЬ ПО
		|	втДанныеДокумента.id_doc,
		|	SUI_docs_tbl_goods_delta.id_good,
		|	SUI_docs_tbl_goods_delta.id_properties,
		|	SUI_docs_tbl_goods_delta.id_series,
		|	SUI_docs_tbl_goods_delta.id_cell,
		|	SUI_docs_tbl_goods_delta.id_unit,
		|	SUI_docs_tbl_goods_delta.id_price,
		|	SUI_docs_tbl_goods_delta.price,
		|	SUI_docs_tbl_goods_delta.use_series,
		|	ВЫБОР
		|		КОГДА SUI_docs_tbl_goods_delta.ТипТаблицы = ЗНАЧЕНИЕ(Перечисление.SUI_ТипыТаблицДокументовОбмена.Отбор)
		|			ТОГДА ""out""
		|		КОГДА SUI_docs_tbl_goods_delta.ТипТаблицы = ЗНАЧЕНИЕ(Перечисление.SUI_ТипыТаблицДокументовОбмена.Размещение)
		|			ТОГДА ""in""
		|		ИНАЧЕ """"
		|	КОНЕЦ";
	
	РезультатЗапроса = Запрос.Выполнить();

	Если Не РезультатЗапроса.Пустой() Тогда
		
		ИменаКолонок = SUI_ОбщегоНазначения.ПолучитьИменаКолонокРезультатаЗапроса(РезультатЗапроса);
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ДанныеСтроки = Новый Структура(ИменаКолонок);
			ЗаполнитьЗначенияСвойств(ДанныеСтроки, Выборка);
			ДанныеПересчета.Добавить(ДанныеСтроки);
		КонецЦикла;
		
	КонецЕсли;

	Возврат ДанныеПересчета;
	
КонецФункции

Функция ДанныеДокументаОбменаКЗагрузкеВДокумент(Параметры, АдресРезультата = Неопределено) Экспорт
	
	ДокументСсылка = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ДокументСсылка");
	
	ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(ДокументСсылка),
		НСтр("ru = 'Не удалось получить ссылку документа для загрузки данных документа обмена в документ.'"));

	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ШаблонИдентификатораSimple", SUI_ИнтеграцияВКонфигурациюКлиентСервер.ШаблонИдентификатораSimple());
	Запрос.УстановитьПараметр("id_doc", SUI_ИнтеграцияВКонфигурацию.ИдентификаторSimpleПоСсылке(ДокументСсылка));
	
	//@skip-check bsl-variable-name-invalid
	sid = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "sid", "", Тип("Строка"));
	Если ПустаяСтрока(sid) Тогда
		Идентификатор = ИдентификаторДокументаПоПараметру(ДокументСсылка, "ДанныеДокументаОбменаКЗагрузкеВДокумент");
		Запрос.УстановитьПараметр("sid", SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Идентификатор, "SID"));
	Иначе
		Запрос.УстановитьПараметр("sid", sid);
	КонецЕсли;
	
	НастройкаДокумента = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "НастройкаДокумента", 
		Справочники.SUI_НастройкиДокументов.ПустаяСсылка(), Тип("СправочникСсылка.SUI_НастройкиДокументов"));
	
	Если ЗначениеЗаполнено(НастройкаДокумента) И Не НастройкаДокумента.Пустая() Тогда
		Запрос.УстановитьПараметр("НастройкаДокумента", НастройкаДокумента);
	Иначе
		Запрос.УстановитьПараметр("НастройкаДокумента", Неопределено);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ЭтоДокументСборШтрихкодов", (ДокументСсылка.Метаданные() = Метаданные.Документы.SUI_СборШтрихкодов));
	
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	SUI_docs.sid КАК sid
		|ПОМЕСТИТЬ втSIDДокумента
		|ИЗ
		|	РегистрСведений.SUI_docs КАК SUI_docs
		|ГДЕ
		|	ВЫБОР
		|		КОГДА &id_doc <> НЕОПРЕДЕЛЕНО
		|			ТОГДА SUI_docs.id_doc = &id_doc
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|	И ВЫБОР
		|		КОГДА &sid <> НЕОПРЕДЕЛЕНО
		|			ТОГДА SUI_docs.sid = &sid
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|	И ВЫБОР
		|		КОГДА &НастройкаДокумента <> НЕОПРЕДЕЛЕНО
		|			ТОГДА SUI_docs.НастройкаДокумента = &НастройкаДокумента
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	SUI_docs.sid КАК sid,
		|	SUI_docs.НастройкаДокумента КАК НастройкаДокумента,
		|	SUI_docs.doc_date КАК Дата,
		|	SUI_docs.doc_n КАК Номер,
		|	SUI_docs.id_countragents КАК Контрагент,
		|	SUI_docs.id_warehouse КАК Склад,
		|	SUI_docs.КонтролироватьДокумент КАК КонтролироватьДокумент,
		|	SUI_docs.ЭтоДокументАдресногоХранения КАК ЭтоДокументАдресногоХранения,
		|	SUI_docs.Состояние КАК Состояние,
		|	SUI_docs.МобильноеУстройство КАК МобильноеУстройство,
		|	SUI_docs.ДатаОбновления КАК ДатаОбновления
		|ИЗ
		|	втSIDДокумента КАК втSIDДокумента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.SUI_docs КАК SUI_docs
		|		ПО втSIDДокумента.sid = SUI_docs.sid
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА SUI_docs_tbl_goods.qtty > 0
		|		И SUI_docs_tbl_goods.qtty = SUI_docs_tbl_goods.qtty_plan
		|			ТОГДА 0
		|		КОГДА SUI_docs_tbl_goods.qtty > SUI_docs_tbl_goods.qtty_plan
		|			ТОГДА 1
		|		КОГДА SUI_docs_tbl_goods.qtty < SUI_docs_tbl_goods.qtty_plan
		|			ТОГДА 2
		|		ИНАЧЕ 3
		|	КОНЕЦ КАК ИндексКартинки,
		|	SUI_docs_tbl_goods.sid КАК sid,
		|	SUI_docs_tbl_goods.id_good КАК id_good,
		|	SUI_docs_tbl_goods.id_properties КАК id_properties,
		|	SUI_docs_tbl_goods.id_series КАК id_series,
		|	SUI_docs_tbl_goods.id_cell КАК id_cell,
		|	SUI_docs_tbl_goods.id_unit КАК id_unit,
		|	SUI_docs_tbl_goods.id_price КАК id_price,
		|	SUI_docs_tbl_goods.price КАК price,
		|	SUI_docs_tbl_goods.qtty КАК qtty,
		|	SUI_docs_tbl_goods.qtty_plan КАК qtty_plan,
		|	SUI_docs_tbl_goods.use_series КАК use_series,
		|	SUI_docs_tbl_goods.ТипТаблицы КАК ТипТаблицы
		|ИЗ
		|	втSIDДокумента КАК втSIDДокумента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.SUI_docs_tbl_goods КАК SUI_docs_tbl_goods
		|		ПО втSIDДокумента.sid = SUI_docs_tbl_goods.sid_doc
		|ИТОГИ
		|ПО
		|	ТипТаблицы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(SUI_docs_tbl_series.sid) КАК sid,
		|	SUI_docs_tbl_series.id_good КАК id_good,
		|	SUI_docs_tbl_series.id_properties КАК id_properties,
		|	SUI_docs_tbl_series.id_series КАК id_series,
		|	SUI_docs_tbl_series.id_warehouse КАК id_warehouse,
		|	СУММА(SUI_docs_tbl_series.qtty) КАК qtty
		|ИЗ
		|	втSIDДокумента КАК втSIDДокумента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.SUI_docs_tbl_series КАК SUI_docs_tbl_series
		|		ПО втSIDДокумента.sid = SUI_docs_tbl_series.sid_doc
		|ГДЕ
		|	SUI_docs_tbl_series.СтатусОбработки <> ЗНАЧЕНИЕ(Перечисление.SUI_СтатусыОбработкиСтрок.Новая)
		|	И SUI_docs_tbl_series.id_series ПОДОБНО &ШаблонИдентификатораSimple
		|СГРУППИРОВАТЬ ПО
		|	SUI_docs_tbl_series.id_good,
		|	SUI_docs_tbl_series.id_properties,
		|	SUI_docs_tbl_series.id_series,
		|	SUI_docs_tbl_series.id_warehouse
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	SUI_docs_tbl_barcodes.sid КАК sid,
		|	SUI_docs_tbl_barcodes.id_marking_code КАК id_marking_code
		|ИЗ
		|	втSIDДокумента КАК втSIDДокумента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.SUI_docs_tbl_barcodes КАК SUI_docs_tbl_barcodes
		|		ПО втSIDДокумента.sid = SUI_docs_tbl_barcodes.sid_doc
		|ГДЕ
		|	SUI_docs_tbl_barcodes.id_marking_code ПОДОБНО &ШаблонИдентификатораSimple
		|	И SUI_docs_tbl_barcodes.СтатусОбработки <> ЗНАЧЕНИЕ(Перечисление.SUI_СтатусыОбработкиСтрок.Новая)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	SUI_docs_tbl_barcode_flow.barcode КАК barcode,
		|	SUI_tbl_barcodes.id_good КАК id_good,
		|	SUI_tbl_barcodes.id_property КАК id_property,
		|	SUI_tbl_barcodes.id_series КАК id_series,
		|	SUI_tbl_barcodes.id_unit КАК id_unit,
		|	СУММА(1) КАК qtty
		|ИЗ
		|	втSIDДокумента КАК втSIDДокумента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.SUI_docs_tbl_barcode_flow КАК SUI_docs_tbl_barcode_flow
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.SUI_tbl_barcodes КАК SUI_tbl_barcodes
		|			ПО SUI_docs_tbl_barcode_flow.barcode = SUI_tbl_barcodes.barcode
		|		ПО втSIDДокумента.sid = SUI_docs_tbl_barcode_flow.sid_doc
		|СГРУППИРОВАТЬ ПО
		|	SUI_docs_tbl_barcode_flow.barcode,
		|	SUI_tbl_barcodes.id_good,
		|	SUI_tbl_barcodes.id_property,
		|	SUI_tbl_barcodes.id_series,
		|	SUI_tbl_barcodes.id_unit
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	SUI_docs_tbl_barcode_flow.barcode КАК Штрихкод,
		|	СУММА(1) КАК Количество
		|ИЗ
		|	втSIDДокумента КАК втSIDДокумента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.SUI_docs_tbl_barcode_flow КАК SUI_docs_tbl_barcode_flow
		|		ПО втSIDДокумента.sid = SUI_docs_tbl_barcode_flow.sid_doc
		|		И &ЭтоДокументСборШтрихкодов
		|СГРУППИРОВАТЬ ПО
		|	SUI_docs_tbl_barcode_flow.barcode
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ втSIDДокумента";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	РезультатДанныеДокумент = РезультатыЗапроса[1];
	РезультатТовары = РезультатыЗапроса[2];
	РезультатСерии = РезультатыЗапроса[3];
	РезультатШтрихкодыУпаковок = РезультатыЗапроса[4];
	РезультатПотокШтрихкодов = РезультатыЗапроса[5];
	РезультатСборШтрихкодов = РезультатыЗапроса[6];

	Если РезультатДанныеДокумент.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не удалось получить данные документа обмена'"));
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеДокументаОбмена = Новый Структура(SUI_ОбщегоНазначения.ПолучитьИменаКолонокРезультатаЗапроса(РезультатДанныеДокумент));
	
	ВыборкаДанныеДокумента = РезультатДанныеДокумент.Выбрать();
	ВыборкаДанныеДокумента.Следующий();
	
	ЗаполнитьЗначенияСвойств(ДанныеДокументаОбмена, ВыборкаДанныеДокумента);
	
	SUI_ИнтеграцияВКонфигурацию.ВосстановитьСсылкиИдентификаторовSimple(ДанныеДокументаОбмена);

	ДанныеДокументаОбмена.Вставить("ДокументСсылка", ДокументСсылка);
	ДанныеДокументаОбмена.Вставить("ЭтоДокументСборШтрихкодов", Запрос.Параметры.ЭтоДокументСборШтрихкодов);
	
	НастройкиДокумента = SUI_НастройкиДокументовСервер.СформироватьНастройкиДокумента(ДанныеДокументаОбмена.НастройкаДокумента);

	ДанныеДокументаОбмена.Вставить("Таблицы", Новый Соответствие());
	
	Если ДанныеДокументаОбмена.ЭтоДокументСборШтрихкодов Тогда
		
		ДанныеДокументаОбмена.Таблицы.Вставить(Перечисления.SUI_ТипыТаблицДокументовОбмена.ПотокШтрихкодов, 
			РезультатСборШтрихкодов.Выгрузить());
	Иначе
		
		Если РезультатПотокШтрихкодов.Пустой() Тогда
			
			Если Не РезультатТовары.Пустой() Тогда
				
				Выборка = РезультатТовары.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
				Пока Выборка.Следующий() Цикл
					
					НастройкаТЧ = НастройкиДокумента.ТабличныеЧасти.Получить(Выборка.ТипТаблицы);
				
					Если Не ЗначениеЗаполнено(НастройкаТЧ) Тогда
						Продолжить;
					КонецЕсли;
					
					ТаблицаДокумента = ТаблицаДокументаПоНастройкеТабличнойЧасти(НастройкаТЧ.Элементы);
					
					КолонкиВыборки = SUI_ОбщегоНазначения.ПолучитьИменаКолонокРезультатаЗапроса(РезультатТовары);
					
					ДетальныеЗаписи = Выборка.Выбрать();
					
					Пока ДетальныеЗаписи.Следующий() Цикл
						
						ДанныеСтроки = Новый Структура(КолонкиВыборки);
						ЗаполнитьЗначенияСвойств(ДанныеСтроки, ДетальныеЗаписи);
						SUI_ИнтеграцияВКонфигурацию.ВосстановитьСсылкиИдентификаторовSimple(ДанныеСтроки, , Ложь);
						ЗаполнитьЗначенияСвойств(ТаблицаДокумента.Добавить(), ДанныеСтроки);
						
					КонецЦикла;
					
					ТаблицаДокумента.ЗаполнитьЗначения(ДанныеДокументаОбмена.sid, "sid_doc");
						
					ДанныеДокументаОбмена.Таблицы.Вставить(Выборка.ТипТаблицы, ТаблицаДокумента);
					
				КонецЦикла;
			
			КонецЕсли;
			
			Если Не РезультатСерии.Пустой() Тогда
			
				НастройкаТЧ = НастройкиДокумента.ТабличныеЧасти.Получить(Перечисления.SUI_ТипыТаблицДокументовОбмена.Серии);
				
				Если ЗначениеЗаполнено(НастройкаТЧ) Тогда
					
					ТаблицаДокумента = ТаблицаДокументаПоНастройкеТабличнойЧасти(НастройкаТЧ.Элементы);
				
					КолонкиВыборки = SUI_ОбщегоНазначения.ПолучитьИменаКолонокРезультатаЗапроса(РезультатСерии);
					
					Выборка = РезультатСерии.Выбрать();
	
					Пока Выборка.Следующий() Цикл
						ДанныеСтроки = Новый Структура(КолонкиВыборки);
						ЗаполнитьЗначенияСвойств(ДанныеСтроки, Выборка);
						SUI_ИнтеграцияВКонфигурацию.ВосстановитьСсылкиИдентификаторовSimple(ДанныеСтроки, , Ложь);
						ЗаполнитьЗначенияСвойств(ТаблицаДокумента.Добавить(), ДанныеСтроки);
					КонецЦикла;
					
					ТаблицаДокумента.ЗаполнитьЗначения(ДанныеДокументаОбмена.sid, "sid_doc");
					ДанныеДокументаОбмена.Таблицы.Вставить(Перечисления.SUI_ТипыТаблицДокументовОбмена.Серии, ТаблицаДокумента);
					
				Иначе
					
					ТаблицаСерийБезНастройки = Новый ТаблицаЗначений();
					
					Для Каждого Колонка Из РезультатСерии.Колонки Цикл
						ТаблицаСерийБезНастройки.Колонки.Добавить(Колонка.Имя);
					КонецЦикла;
					
					ТаблицаСерийБезНастройки.Колонки.Добавить("НомерСтроки", 
						SUI_ОбщегоНазначения.ОписаниеТипаЧисло(10, 0, ДопустимыйЗнак.Неотрицательный), НСтр("ru = 'Номер строки'"));
					ТаблицаСерийБезНастройки.Колонки.Добавить("sid_doc", SUI_ОбщегоНазначения.ОписаниеТипаСтрока(36), НСтр("ru = 'SID документа'"));
					
					КолонкиВыборки = SUI_ОбщегоНазначения.ПолучитьИменаКолонокРезультатаЗапроса(РезультатСерии);
					
					Выборка = РезультатСерии.Выбрать();
	
					Пока Выборка.Следующий() Цикл
						ДанныеСтроки = Новый Структура(КолонкиВыборки);
						ЗаполнитьЗначенияСвойств(ДанныеСтроки, Выборка);
						SUI_ИнтеграцияВКонфигурацию.ВосстановитьСсылкиИдентификаторовSimple(ДанныеСтроки, , Ложь);
						ЗаполнитьЗначенияСвойств(ТаблицаСерийБезНастройки.Добавить(), ДанныеСтроки);
					КонецЦикла;
		
					ТаблицаСерийБезНастройки.ЗаполнитьЗначения(ДанныеДокументаОбмена.sid, "sid_doc");
					ДанныеДокументаОбмена.Вставить("ТаблицаСерийБезНастройки", ТаблицаСерийБезНастройки);
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если Не РезультатШтрихкодыУпаковок.Пустой() Тогда
				
				НастройкаТЧ = НастройкиДокумента.ТабличныеЧасти.Получить(Перечисления.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок);
				
				Если ЗначениеЗаполнено(НастройкаТЧ) Тогда
					
					ТаблицаДокумента = ТаблицаДокументаПоНастройкеТабличнойЧасти(НастройкаТЧ.Элементы);
				
					КолонкиВыборки = SUI_ОбщегоНазначения.ПолучитьИменаКолонокРезультатаЗапроса(РезультатШтрихкодыУпаковок);
					
					Выборка = РезультатШтрихкодыУпаковок.Выбрать();
	
					Пока Выборка.Следующий() Цикл
						ДанныеСтроки = Новый Структура(КолонкиВыборки);
						ЗаполнитьЗначенияСвойств(ДанныеСтроки, Выборка);
						SUI_ИнтеграцияВКонфигурацию.ВосстановитьСсылкиИдентификаторовSimple(ДанныеСтроки, , Ложь);
						ЗаполнитьЗначенияСвойств(ТаблицаДокумента.Добавить(), ДанныеСтроки);
					КонецЦикла;
				
					ТаблицаДокумента.ЗаполнитьЗначения(ДанныеДокументаОбмена.sid, "sid_doc");
					ДанныеДокументаОбмена.Таблицы.Вставить(Перечисления.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок, ТаблицаДокумента);
					
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			// : Обрабатываем только поток ШК  
			НастройкаТЧ = НастройкиДокумента.ТабличныеЧасти.Получить(Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары);
			
			Если ЗначениеЗаполнено(НастройкаТЧ) Тогда
				
				ТаблицаДокумента = ТаблицаДокументаПоНастройкеТабличнойЧасти(НастройкаТЧ.Элементы);
				
				КолонкиВыборки = SUI_ОбщегоНазначения.ПолучитьИменаКолонокРезультатаЗапроса(РезультатПотокШтрихкодов);
				
				Выборка = РезультатПотокШтрихкодов.Выбрать();
				
				Пока Выборка.Следующий() Цикл
					ДанныеСтроки = Новый Структура(КолонкиВыборки);
					ЗаполнитьЗначенияСвойств(ДанныеСтроки, Выборка);
					SUI_ИнтеграцияВКонфигурацию.ВосстановитьСсылкиИдентификаторовSimple(ДанныеСтроки, , Ложь);
					ЗаполнитьЗначенияСвойств(ТаблицаДокумента.Добавить(), ДанныеСтроки);
				КонецЦикла;
				
				ТаблицаДокумента.ЗаполнитьЗначения(ДанныеДокументаОбмена.sid, "sid_doc");
				ДанныеДокументаОбмена.Таблицы.Вставить(Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары, ТаблицаДокумента);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресРезультата) И ЭтоАдресВременногоХранилища(АдресРезультата) Тогда
		ПоместитьВоВременноеХранилище(ДанныеДокументаОбмена, АдресРезультата);
	КонецЕсли;
	
	Возврат ДанныеДокументаОбмена;	
	
КонецФункции

Функция ДанныеДокументаДополнительные(Параметры, АдресРезультата = Неопределено) Экспорт
	
	ДанныеДокументаОбмена = Новый Структура();
	
	
	
	ДокументСсылка = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ДокументСсылка");
	
	ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(ДокументСсылка),
		НСтр("ru = 'Не удалось получить ссылку документа.'"));
	
	ИдентификаторДокумента = SUI_ИнтеграцияВКонфигурацию.ИдентификаторSimpleПоСсылке(ДокументСсылка);
	
	ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(ИдентификаторДокумента),
		НСтр("ru = 'Не удалось получить идентификатор документа.'"));
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ИдентификаторДокумента", ИдентификаторДокумента);
	Запрос.Текст = "ВЫБРАТЬ
	|	SUI_docs_tbl_series.id_good КАК Номенклатура,
	|	SUI_docs_tbl_series.number КАК Штрихкод
	|ИЗ
	|	РегистрСведений.SUI_docs_tbl_series КАК SUI_docs_tbl_series
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.SUI_docs КАК SUI_docs
	|		ПО (SUI_docs.sid = SUI_docs_tbl_series.sid_doc)
	|ГДЕ
	|	SUI_docs.id_doc = &ИдентификаторДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	SUI_tbl_barcodes.id_good КАК Номенклатура,
	|	SUI_docs_tbl_barcode_flow.barcode КАК Штрихкод,
	|	ЕСТЬNULL(SUI_tbl_barcodes.id_property, НЕОПРЕДЕЛЕНО) КАК Характеристика,
	|	ЕСТЬNULL(SUI_tbl_barcodes.id_series, НЕОПРЕДЕЛЕНО) КАК Серия,
	|	ЕСТЬNULL(SUI_tbl_barcodes.id_unit, НЕОПРЕДЕЛЕНО) КАК Упаковка
	|ИЗ
	|	РегистрСведений.SUI_docs_tbl_barcode_flow КАК SUI_docs_tbl_barcode_flow
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.SUI_docs КАК SUI_docs
	|		ПО (SUI_docs.sid = SUI_docs_tbl_barcode_flow.sid_doc)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.SUI_tbl_barcodes КАК SUI_tbl_barcodes
	|		ПО SUI_docs_tbl_barcode_flow.barcode = SUI_tbl_barcodes.barcode
	|ГДЕ
	|	SUI_docs.id_doc = &ИдентификаторДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	SUI_docs_tbl_barcodes.id_good КАК Номенклатура,
	|	SUI_docs_tbl_barcodes.mark_code КАК Штрихкод,
	|	SUI_docs_tbl_barcodes.id_property КАК Характеристика,
	|	SUI_docs_tbl_barcodes.id_series КАК Серия,
	|	SUI_docs_tbl_barcodes.id_unit КАК Упаковка
	|ИЗ
	|	РегистрСведений.SUI_docs_tbl_barcodes КАК SUI_docs_tbl_barcodes
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.SUI_docs КАК SUI_docs
	|		ПО SUI_docs_tbl_barcodes.sid_doc = SUI_docs.sid
	|ГДЕ
	|	SUI_docs.id_doc = &ИдентификаторДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	SUI_docs_tbl_goods_deltaСрезПоследних.id_good КАК Номенклатура
	|ИЗ
	|	РегистрСведений.SUI_docs_tbl_goods_delta.СрезПоследних КАК SUI_docs_tbl_goods_deltaСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.SUI_docs КАК SUI_docs
	|		ПО (SUI_docs_tbl_goods_deltaСрезПоследних.sid_doc = SUI_docs.id_doc)
	|ГДЕ
	|	SUI_docs.id_doc = &ИдентификаторДокумента";
	
	РезультатыЗапроса 	= Запрос.ВыполнитьПакет();
	
	РезультатСерии 		= РезультатыЗапроса[0];
	РезультатПоток 		= РезультатыЗапроса[1];
	РезультатШтрихкод 	= РезультатыЗапроса[2];
	РезультатПересчет 	= РезультатыЗапроса[3];
	
	// Серии
	Если Не РезультатСерии.Пустой() Тогда
		
		ДанныеДокументаОбмена.Вставить("ТабличныйДокументСерии", Новый ТабличныйДокумент());
		
		ИменаКолонок = SUI_ОбщегоНазначения.ПолучитьИменаКолонокРезультатаЗапроса(РезультатСерии);
		
		МакетДанных = Обработки.SUI_ФормаДополнительнаяИнформация.ПолучитьМакет("МакетДанные");
		
		ДанныеДокументаОбмена.ТабличныйДокументСерии.Вывести(МакетДанных.ПолучитьОбласть("ШапкаТаблицы|ОсновнаяИнформация"));

		ОбластьСтрокаОсновнаяИнформация = МакетДанных.ПолучитьОбласть("СтрокаТаблицы|ОсновнаяИнформация");

		Выборка = РезультатСерии.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			СтруктураДанных = Новый Структура(ИменаКолонок);
			ЗаполнитьЗначенияСвойств(СтруктураДанных, Выборка);
			
			SUI_ИнтеграцияВКонфигурацию.ВосстановитьСсылкиИдентификаторовSimple(СтруктураДанных, , Ложь);
			
			ОбластьСтрокаОсновнаяИнформация.Параметры.Заполнить(СтруктураДанных);       

			ДанныеДокументаОбмена.ТабличныйДокументСерии.Вывести(ОбластьСтрокаОсновнаяИнформация);
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Поток
	Если Не РезультатПоток.Пустой() Тогда
		
		ДанныеДокументаОбмена.Вставить("ТабличныйДокументПоток", Новый ТабличныйДокумент());
	
		ИменаКолонок = SUI_ОбщегоНазначения.ПолучитьИменаКолонокРезультатаЗапроса(РезультатПоток);
		
		МакетДанных = Обработки.SUI_ФормаДополнительнаяИнформация.ПолучитьМакет("МакетДанные");
		
		ДанныеДокументаОбмена.ТабличныйДокументПоток.Вывести(МакетДанных.ПолучитьОбласть("ШапкаТаблицы|ОсновнаяИнформация"));
		ДанныеДокументаОбмена.ТабличныйДокументПоток.Присоединить(МакетДанных.ПолучитьОбласть("ШапкаТаблицы|ДополнительнаяИнформация"));
		
		ОбластьСтрокаОсновнаяИнформация = МакетДанных.ПолучитьОбласть("СтрокаТаблицы|ОсновнаяИнформация");
		ОбластьСтрокаДополнительнаяИнформация = МакетДанных.ПолучитьОбласть("СтрокаТаблицы|ДополнительнаяИнформация");
		
		Выборка = РезультатПоток.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			СтруктураДанных = Новый Структура(ИменаКолонок);
			ЗаполнитьЗначенияСвойств(СтруктураДанных, Выборка);
			
			SUI_ИнтеграцияВКонфигурацию.ВосстановитьСсылкиИдентификаторовSimple(СтруктураДанных, , Ложь);
			
			ОбластьСтрокаОсновнаяИнформация.Параметры.Заполнить(СтруктураДанных);
			ОбластьСтрокаДополнительнаяИнформация.Параметры.Заполнить(СтруктураДанных);

			ДанныеДокументаОбмена.ТабличныйДокументПоток.Вывести(ОбластьСтрокаОсновнаяИнформация);
			ДанныеДокументаОбмена.ТабличныйДокументПоток.Присоединить(ОбластьСтрокаДополнительнаяИнформация);
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Штрихкод
	Если Не РезультатШтрихкод.Пустой() Тогда
		
		ДанныеДокументаОбмена.Вставить("ТабличныйДокументШтрихкоды", Новый ТабличныйДокумент());
	
		ИменаКолонок = SUI_ОбщегоНазначения.ПолучитьИменаКолонокРезультатаЗапроса(РезультатШтрихкод);
		
		МакетДанных = Обработки.SUI_ФормаДополнительнаяИнформация.ПолучитьМакет("МакетДанные");
		
		ДанныеДокументаОбмена.ТабличныйДокументШтрихкоды.Вывести(МакетДанных.ПолучитьОбласть("ШапкаТаблицы|ОсновнаяИнформация"));
		ДанныеДокументаОбмена.ТабличныйДокументШтрихкоды.Присоединить(МакетДанных.ПолучитьОбласть("ШапкаТаблицы|ДополнительнаяИнформация"));
		
		ОбластьСтрокаОсновнаяИнформация = МакетДанных.ПолучитьОбласть("СтрокаТаблицы|ОсновнаяИнформация");
		ОбластьСтрокаДополнительнаяИнформация = МакетДанных.ПолучитьОбласть("СтрокаТаблицы|ДополнительнаяИнформация");
		
		Выборка = РезультатШтрихкод.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			СтруктураДанных = Новый Структура(ИменаКолонок);
			ЗаполнитьЗначенияСвойств(СтруктураДанных, Выборка);
			
			SUI_ИнтеграцияВКонфигурацию.ВосстановитьСсылкиИдентификаторовSimple(СтруктураДанных, , Ложь);
			
			ОбластьСтрокаОсновнаяИнформация.Параметры.Заполнить(СтруктураДанных);
			ОбластьСтрокаДополнительнаяИнформация.Параметры.Заполнить(СтруктураДанных);

			ДанныеДокументаОбмена.ТабличныйДокументШтрихкоды.Вывести(ОбластьСтрокаОсновнаяИнформация);
			ДанныеДокументаОбмена.ТабличныйДокументШтрихкоды.Присоединить(ОбластьСтрокаДополнительнаяИнформация);
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Пересчет
	Если Не РезультатПересчет.Пустой() Тогда
		
		ДанныеДокументаОбмена.Вставить("ТабличныйДокументПересчет", Новый ТабличныйДокумент());
		
		ИменаКолонок = SUI_ОбщегоНазначения.ПолучитьИменаКолонокРезультатаЗапроса(РезультатПересчет);
		
		МакетДанных = Обработки.SUI_ФормаДополнительнаяИнформация.ПолучитьМакет("МакетДанные");
		
		ДанныеДокументаОбмена.ТабличныйДокументПересчет.Вывести(МакетДанных.ПолучитьОбласть("ШапкаТаблицы|ОсновнаяИнформация"));

		ОбластьСтрокаОсновнаяИнформация = МакетДанных.ПолучитьОбласть("СтрокаТаблицы|ОсновнаяИнформация");
		
		Выборка = РезультатПересчет.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			СтруктураДанных = Новый Структура(ИменаКолонок);
			ЗаполнитьЗначенияСвойств(СтруктураДанных, Выборка);
			
			SUI_ИнтеграцияВКонфигурацию.ВосстановитьСсылкиИдентификаторовSimple(СтруктураДанных, , Ложь);
			
			ОбластьСтрокаОсновнаяИнформация.Параметры.Заполнить(СтруктураДанных);
			ОбластьСтрокаДополнительнаяИнформация.Параметры.Заполнить(СтруктураДанных);

			ДанныеДокументаОбмена.ТабличныйДокументПересчет.Вывести(ОбластьСтрокаОсновнаяИнформация);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресРезультата) И ЭтоАдресВременногоХранилища(АдресРезультата) Тогда
		ПоместитьВоВременноеХранилище(ДанныеДокументаОбмена, АдресРезультата);
	КонецЕсли;
	
	Возврат ДанныеДокументаОбмена;	
	
КонецФункции

Процедура ЗаписатьДокументОбъект(ДокументОбъект, НастройкаДокумента, ТаблицыДокументаОбмена, СтрокиКОбработкеАлгоритмом) Экспорт
	
	НастройкиДокумента = SUI_НастройкиДокументовСервер.СформироватьНастройкиДокумента(НастройкаДокумента);
	
	
	ИмяМетаданныхДокумент = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НастройкиДокумента, "ИмяМетаданных", "", Тип("Строка"));
	
	Если ЗначениеЗаполнено(ИмяМетаданныхДокумент) Тогда	
		
		ТаблицыДокумента = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НастройкиДокумента, "ТабличныеЧасти", Новый Соответствие, Тип("Соответствие"));
		
		НастрокиТаблицПропускатьПриЗаписи = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НастройкиДокумента,
			"ДополнительныеНастройки.ПропускатьПриЗаписи", Новый Соответствие, Тип("Соответствие"));
		
		Для Каждого ТаблицаНаФорме Из ТаблицыДокументаОбмена Цикл
			
			Если ЗначениеЗаполнено(НастрокиТаблицПропускатьПриЗаписи.Получить(ТаблицаНаФорме.Ключ)) И НастрокиТаблицПропускатьПриЗаписи.Получить(ТаблицаНаФорме.Ключ) Тогда
				
				ИмяТЧ = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ТаблицыДокумента.Получить(ТаблицаНаФорме.Ключ),"ИмяТабличнойЧасти", "", Тип("Строка"));
				
				Если Не ПустаяСтрока(ИмяТЧ) Тогда 					
					Запрос1 = Новый Запрос("
					|ВЫБРАТЬ
					|	*
					|ИЗ
					|	Документ." + ИмяМетаданныхДокумент+"."+ИмяТЧ+" КАК Документ
					|ГДЕ
					|	Документ.Ссылка = &Ссылка");
					Запрос1.УстановитьПараметр("Ссылка", ДокументОбъект.Ссылка); 
					ДокументОбъект[ИмяТЧ].Очистить();
					ДокументОбъект[ИмяТЧ].Загрузить(Запрос1.Выполнить().Выгрузить());
				КонецЕсли;
								
			КонецЕсли;  
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	АлгоритмПослеЗаписи = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НастройкиДокумента, 
		"ДополнительныеНастройки.ОбработчикиСобытий.ПослеЗаписи", "", Тип("Строка"));
	
	ЗапуститьЗадание = Ложь;
	//ВыполнитьАлгоритмПередЗаписью = Ложь;
	
	НачатьТранзакцию();
	
	Попытка
		
		УстановитьПривилегированныйРежим(Истина);
		
		Если СтрокиКОбработкеАлгоритмом <> Неопределено И СтрокиКОбработкеАлгоритмом.Количество() > 0 Тогда
					
			АлгоритмыОбработкиСтрок = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НастройкиДокумента, 
				"ДополнительныеНастройки.АлгоритмыОбработкиСтрокТабличныхЧастей", Новый Соответствие(), Тип("Соответствие"));
			
			СтрокиКОбработкеАлгоритмом.Свернуть("ТипТаблицы, НомерСтроки");
			
			Построитель = Новый ПостроительЗапроса;
			Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(СтрокиКОбработкеАлгоритмом);
			
			ТипыТаблицКОбработкеАлгоритмом = СтрокиКОбработкеАлгоритмом.Скопировать();
			ТипыТаблицКОбработкеАлгоритмом.Свернуть("ТипТаблицы");
			
			Для Каждого СтрокаТипыТаблицКобработкеАлгоритмом Из ТипыТаблицКОбработкеАлгоритмом Цикл

				НастройкаТЧ = НастройкиДокумента.ТабличныеЧасти.Получить(СтрокаТипыТаблицКобработкеАлгоритмом.ТипТаблицы);
					
				Если Не ЗначениеЗаполнено(НастройкаТЧ) Тогда
					Продолжить;
				КонецЕсли;
				
				АлгоритмОбработкиСтроки = АлгоритмыОбработкиСтрок.Получить(СтрокаТипыТаблицКобработкеАлгоритмом.ТипТаблицы);
				
				Если Не ЗначениеЗаполнено(АлгоритмОбработкиСтроки) Тогда
					Продолжить;
				КонецЕсли;
				
				Построитель.Отбор.Сбросить();
				
				СтрокаОтбора = Построитель.Отбор.Добавить("ТипТаблицы");
				СтрокаОтбора.ВидСравнения = ВидСравнения.Равно;
				СтрокаОтбора.Значение = СтрокаТипыТаблицКобработкеАлгоритмом.ТипТаблицы;
				СтрокаОтбора.Использование = Истина;
				
				Построитель.Выполнить();
				НомераСтрок = Построитель.Результат.Выгрузить().ВыгрузитьКолонку("НомерСтроки");
				
				Для Каждого СтрокаТЧДокумента Из ДокументОбъект[НастройкаТЧ.ИмяТабличнойЧасти] Цикл
					
					Если НомераСтрок.Найти(СтрокаТЧДокумента.НомерСтроки) = Неопределено Тогда
						Продолжить;
					КонецЕсли;
					
					ВыполнитьПроизвольныйАлгоритм_ОбработкаСтрокиТабличнойЧасти(АлгоритмОбработкиСтроки, ДокументОбъект, СтрокаТЧДокумента);
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЕсли;

		ВыполнитьПроизвольныйАлгоритм_ПередЗаписью(SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НастройкиДокумента, 
			"ДополнительныеНастройки.ОбработчикиСобытий.ПередЗаписью", "", Тип("Строка")), ДокументОбъект);
			
		ВыполнитьУстановкуЗначений(НастройкиДокумента.ТаблицаУстановкиРеквизитов, ДокументОбъект, ТаблицыДокументаОбмена); 
		
		УдалитьПустыеСтроки(НастройкиДокумента.ТабличныеЧасти, ДокументОбъект, ТаблицыДокументаОбмена);
		
		ДокументОбъект.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
		
		ДокументОбъект.Записать(?(НастройкиДокумента.ПроводитьДокумент, ?(ДокументОбъект.ПометкаУдаления, РежимЗаписиДокумента.Запись, РежимЗаписиДокумента.Проведение), РежимЗаписиДокумента.Запись));
		
		ВыполнитьПроизвольныйАлгоритм_ПослеЗаписи(АлгоритмПослеЗаписи, ДокументОбъект.Ссылка);
		
		Если НастройкиДокумента.ДополнительныеНастройки.Свойство("АлгоритмыОбработкиСозданияДокументаНаОсновании") Тогда
			
			СоздатьДокументыНаОсновании(ДокументОбъект.Ссылка, 
				НастройкиДокумента.ДополнительныеНастройки.АлгоритмыОбработкиСозданияДокументаНаОсновании, 
				ТаблицыДокументаОбмена, НастройкиДокумента.ТаблицаСозданияДокументов);
							               
		КонецЕсли;
			
		ЗапуститьЗадание = Истина;
		
		УстановитьПривилегированныйРежим(Ложь);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(), , 
			Метаданные.ОбщиеМодули.SUI_ДокументыОбмена, ДокументОбъект.Ссылка, ИнформацияОбОшибке());
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Возникла исключительная ошибка при записи документа %1.
			|%2'"), ДокументОбъект.Ссылка, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	// Обновить строки таблиц документа обмена после записи документа в фоне
	Если ЗапуститьЗадание Тогда
		
		ПараметрыЗадания = Новый Структура();
		ПараметрыЗадания.Вставить("ТаблицыДокументаОбмена", ТаблицыДокументаОбмена);
		ПараметрыЗадания.Вставить("ДокументСсылка", ДокументОбъект.Ссылка);
		
		ПараметрыВыполненияПроцедуры = SUI_ДлительныеОперации.ПараметрыВыполненияПроцедуры();
		SUI_ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполненияПроцедуры,
			"SUI_ДокументыОбмена.ЗаданиеОбновитьТаблицыДокументаОбменаПослеЗаписиВДокумент", ПараметрыЗадания);
			
	КонецЕсли;
					
КонецПроцедуры

// Получить состояние документа обмена.
// 
// Параметры:
//  Документ - ДокументСсылка, Строка - Документ ссылка, идентификатор Simple документа или SID документа обмена.
//  НастройкаДокумента - СправочникСсылка.SUI_НастройкиДокументов - Настройка документа
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.SUI_СостоянияДокументовОбмена, Неопределено - Состояние документа обмена или Неопределено,
//	если документ обмена не найден
Функция СостояниеДокументаОбмена(Документ, НастройкаДокумента = Неопределено) Экспорт
	
	Идентификатор = ИдентификаторДокументаПоПараметру(Документ, "СостояниеДокументаОбмена");
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("id_doc", ?(Идентификатор.Свойство("ID"), Идентификатор.ID, Неопределено));
	Запрос.УстановитьПараметр("sid", ?(Идентификатор.Свойство("SID"), Идентификатор.SID, Неопределено));
	Запрос.УстановитьПараметр("НастройкаДокумента", НастройкаДокумента);
	
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	SUI_docs.Состояние
		|ИЗ
		|	РегистрСведений.SUI_docs КАК SUI_docs
		|ГДЕ
		|	ВЫБОР
		|		КОГДА &id_doc <> НЕОПРЕДЕЛЕНО
		|			ТОГДА SUI_docs.id_doc = &id_doc
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|	И ВЫБОР
		|		КОГДА &НастройкаДокумента <> НЕОПРЕДЕЛЕНО
		|			ТОГДА SUI_docs.НастройкаДокумента = &НастройкаДокумента
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|	И ВЫБОР
		|		КОГДА &sid <> НЕОПРЕДЕЛЕНО
		|			ТОГДА SUI_docs.sid = &sid
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ";
		
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Состояние;

КонецФункции

// Документ был выгружен.
// 
// Параметры:
//  Документ - ДокументСсылка, Строка - Документ ссылка, идентификатор Simple документа или SID документа обмена.
//  ИсключаемыеСостояния - Массив из ПеречислениеСсылка.SUI_СостоянияДокументовОбмена - Исключаемые состояния документа обмена
//  НастройкаДокумента - СправочникСсылка.SUI_НастройкиДокументов - Настройка документа
// 
// Возвращаемое значение:
//  Булево - Документ был выгружен
Функция ДокументБылВыгружен(Документ, Знач ИсключаемыеСостояния = Неопределено, НастройкаДокумента = Неопределено) Экспорт
	
	Если ИсключаемыеСостояния = Неопределено Тогда
		ИсключаемыеСостояния = Новый Массив();
	КонецЕсли;
	
	СостояниеДокумента = СостояниеДокументаОбмена(Документ, НастройкаДокумента);
	
	Если Не ЗначениеЗаполнено(СостояниеДокумента) Тогда
		Возврат Ложь;
	Иначе
		Возврат (ИсключаемыеСостояния.Найти(СостояниеДокумента) = Неопределено);
	КонецЕсли;
	
КонецФункции

// Сменить состояние документа обмена.
// 
// Параметры:
//  НовоеСостояние - ПеречислениеСсылка.SUI_СостоянияДокументовОбмена - Новое состояние
//  Документ - ДокументСсылка, Строка - Документ ссылка, идентификатор Simple документа или SID документа обмена.
//  НастройкаДокумента - СправочникСсылка.SUI_НастройкиДокументов - Настройка документа
//  ОтключитьРегистрациюИзменений - Булево - Отключить регистрацию изменений
//  НеОбновлятьМеткуВремени - Булево - Не обновлять метку времени
Процедура СменитьСостояниеДокументаОбмена(НовоеСостояние, Документ, НастройкаДокумента = Неопределено,
	ОтключитьРегистрациюИзменений = Ложь, НеОбновлятьМеткуВремени = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	
	Если SUI_ОбщегоНазначения.ЭтоСсылкаДокумента(Документ) Тогда
		Запрос.УстановитьПараметр("id_doc", 
			SUI_ИнтеграцияВКонфигурацию.ИдентификаторSimpleПоСсылке(Документ, Истина));
		Запрос.УстановитьПараметр("sid", Неопределено);
	ИначеЕсли SUI_СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(Документ) Тогда
		Запрос.УстановитьПараметр("sid", Документ);
		Запрос.УстановитьПараметр("id_doc", Неопределено);
	ИначеЕсли SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(Документ) Тогда
		Запрос.УстановитьПараметр("id_doc", Документ);
		Запрос.УстановитьПараметр("sid", Неопределено);
	Иначе
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не передано значение параметра ""Документ"".'"));
		Возврат;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НастройкаДокумента", НастройкаДокумента);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	SUI_docs.sid КАК sid,
		|	SUI_docs.id_doc КАК id_doc,
		|	SUI_docs.НастройкаДокумента КАК НастройкаДокумента
		|ИЗ
		|	РегистрСведений.SUI_docs КАК SUI_docs
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &sid <> НЕОПРЕДЕЛЕНО
		|				ТОГДА SUI_docs.sid = &sid
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &id_doc <> НЕОПРЕДЕЛЕНО
		|				ТОГДА SUI_docs.id_doc = &id_doc
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &НастройкаДокумента <> НЕОПРЕДЕЛЕНО
		|				ТОГДА SUI_docs.НастройкаДокумента = &НастройкаДокумента
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Отсутствуют выгруженные документы обмена для смены состояния.'"));
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
		
	Попытка

		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.SUI_docs");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
		ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("sid", "sid");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("id_doc", "id_doc");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("НастройкаДокумента", "НастройкаДокумента");
		Блокировка.Заблокировать();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			НаборЗаписей = РегистрыСведений.SUI_docs.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.sid.Установить(Выборка.sid);
			НаборЗаписей.Отбор.id_doc.Установить(Выборка.id_doc);
			НаборЗаписей.Отбор.НастройкаДокумента.Установить(Выборка.НастройкаДокумента);
			
			НаборЗаписей.Прочитать();
			
			Если НаборЗаписей.Количество() = 1 Тогда
				
				НаборЗаписей[0].Состояние = НовоеСостояние;
			
				Если ОтключитьРегистрациюИзменений Тогда
					НаборЗаписей.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
				КонецЕсли;
				
				// Регистрировать изменения для завершенных документов
				Если НовоеСостояние = Перечисления.SUI_СостоянияДокументовОбмена.Завершен Тогда
					
					НаборЗаписей.ДополнительныеСвойства.Вставить("РегистрироватьИзменения");
					
					Если НаборЗаписей.ДополнительныеСвойства.Свойство("ОтключитьМеханизмРегистрацииОбъектов") Тогда
						НаборЗаписей.ДополнительныеСвойства.Удалить("ОтключитьМеханизмРегистрацииОбъектов");
					КонецЕсли;
					
				КонецЕсли;
				
				Если НеОбновлятьМеткуВремени Тогда
					НаборЗаписей.ДополнительныеСвойства.Вставить("НеОбновлятьМеткуВремени");
				КонецЕсли;

				НаборЗаписей.Записать();
			
			КонецЕсли;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(), , 
			Метаданные.ОбщиеМодули.SUI_ДокументыОбмена, Документ, ИнформацияОбОшибке());
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Возникла исключительная ошибка при смене состояния документов обмена
			|%1'"), ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

Процедура УдалитьДокументыОбмена(Знач ДокументыОбмена) Экспорт
	
	Если SUI_ОбщегоНазначения.ЭтоСсылкаДокумента(ДокументыОбмена) Тогда
		ДокументыОбмена = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДокументыОбмена);
	КонецЕсли;
	
	ОписаниеТипаМассив = Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Тип("Массив")));
	ДокументыОбмена = ОписаниеТипаМассив.ПривестиЗначение(ДокументыОбмена);
	
	Идентификаторы = Новый Массив();
	Для Индекс = 0 По ДокументыОбмена.ВГраница() Цикл
		
		Если SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(ДокументыОбмена[Индекс]) Тогда
			Идентификаторы.Добавить(ДокументыОбмена[Индекс]);
		ИначеЕсли SUI_ОбщегоНазначения.ЭтоСсылкаДокумента(ДокументыОбмена[Индекс]) Тогда
			Идентификаторы.Добавить(SUI_ИнтеграцияВКонфигурацию.ИдентификаторSimpleПоСсылке(ДокументыОбмена[Индекс], Истина));
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	SUI_docs.sid КАК sid,
		|	SUI_docs.id_doc КАК id_doc,
		|	SUI_docs.НастройкаДокумента КАК НастройкаДокумента
		|ИЗ
		|	РегистрСведений.SUI_docs КАК SUI_docs
		|ГДЕ
		|	SUI_docs.id_doc В(&id_doc)";
	
	Запрос.УстановитьПараметр("id_doc", Идентификаторы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.SUI_docs");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
		ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("sid", "sid");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("id_doc", "id_doc");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("НастройкаДокумента", "НастройкаДокумента");
		Блокировка.Заблокировать();
		
		Выборка = РезультатЗапроса.Выбрать();
	
		Пока Выборка.Следующий() Цикл
			
			НаборЗаписей = РегистрыСведений.SUI_docs.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.sid.Установить(Выборка.sid);
			НаборЗаписей.Отбор.id_doc.Установить(Выборка.id_doc);
			НаборЗаписей.Отбор.НастройкаДокумента.Установить(Выборка.НастройкаДокумента);
			
			НаборЗаписей.Записать(Истина);
			
		КонецЦикла;
		
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Данные документов были удалены'"));
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(НСтр("ru = 'Удаление'")), , 
			Метаданные.ОбщиеМодули.SUI_ДокументыОбмена, , ИнформацияОбОшибке());
		ВызватьИсключение ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
КонецПроцедуры

Функция ЭтоДокументГрупповогоПересчета(Знач Документ) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	SUI_НастройкиДокументов.ГрупповоеСканирование КАК ГрупповоеСканирование
		|ИЗ
		|	РегистрСведений.SUI_docs КАК SUI_docs
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.SUI_НастройкиДокументов КАК SUI_НастройкиДокументов
		|		ПО SUI_docs.НастройкаДокумента = SUI_НастройкиДокументов.Ссылка
		|ГДЕ
		|	SUI_docs.id_doc = &id_doc";
	
	Если SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(Документ) Тогда
		Запрос.УстановитьПараметр("id_doc", Документ);
	Иначе
		Запрос.УстановитьПараметр("id_doc", SUI_ИнтеграцияВКонфигурацию.ИдентификаторSimpleПоСсылке(Документ));
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.ГрупповоеСканирование;
	КонецЕсли;
	
КонецФункции

Функция ДокументНуждаетсяВОбработке(Знач Документ) Экспорт
		
	Запрос = Новый Запрос;

	Запрос.Текст =
	"ВЫБРАТЬ
	|	SUI_ОчередьЗаданий.Идентификатор КАК Идентификатор,
	|	SUI_ОчередьЗаданий.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.SUI_ОчередьЗаданий КАК SUI_ОчередьЗаданий
	|ГДЕ
	|	SUI_ОчередьЗаданий.Статус В(&Статус)
	|	И SUI_ОчередьЗаданий.ИдентификаторДокумента = &id_doc
	|
	|УПОРЯДОЧИТЬ ПО
	|	SUI_ОчередьЗаданий.Обновлено УБЫВ";
	
	Если SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(Документ) Тогда
		Запрос.УстановитьПараметр("id_doc", Документ);
	Иначе
		Запрос.УстановитьПараметр("id_doc", SUI_ИнтеграцияВКонфигурацию.ИдентификаторSimpleПоСсылке(Документ));
	КонецЕсли;
	
	Статусы = Новый СписокЗначений;
	Статусы.Добавить(Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Открыто);
	Статусы.Добавить(Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.Выполняется);
	Статусы.Добавить(Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.ОшибкаОбработки);
	
	Запрос.УстановитьПараметр("Статус", Статусы);
	
	РезультатыЗапроса = Запрос.Выполнить().Выбрать();
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ЕстьАктивныеЗадания", Истина);
	СтруктураВозврата.Вставить("ЕстьОшибкаОбработки", Ложь);

	Если РезультатыЗапроса.Следующий() Тогда 			
		СтруктураВозврата.ЕстьОшибкаОбработки = (РезультатыЗапроса.Статус = Перечисления.SUI_СтатусыОбработкиОчередиЗаданий.ОшибкаОбработки);
	Иначе 
		СтруктураВозврата.ЕстьАктивныеЗадания = Ложь;
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции
    
#Область ТаблицыДокументаОбмена

Функция ТаблицаДокументыОбмена() Экспорт
	
	Таблица = Новый ТаблицаЗначений;
	
	Для Каждого Колонка Из SUI_ДокументыОбменаПовтИсп.КолонкиТаблицыДокументыОбмена() Цикл
		Таблица.Колонки.Добавить(Колонка.Имя, Колонка.Тип, Колонка.Заголовок);
	КонецЦикла;

	Возврат Таблица;
	
КонецФункции

Функция ТаблицаТоварыДокументаОбмена() Экспорт
	
	Таблица = Новый ТаблицаЗначений;
	
	Для Каждого Колонка Из SUI_ДокументыОбменаПовтИсп.КолонкиТаблицыТовары() Цикл
		Таблица.Колонки.Добавить(Колонка.Имя, Колонка.Тип, Колонка.Заголовок);
	КонецЦикла;

	Возврат Таблица;
	
КонецФункции

Функция ТаблицаПересчетТоваровДокументаОбмена() Экспорт
	
	Таблица = Новый ТаблицаЗначений;
	
	Для Каждого Колонка Из SUI_ДокументыОбменаПовтИсп.КолонкиТаблицыПересчетТоваров() Цикл
		Таблица.Колонки.Добавить(Колонка.Имя, Колонка.Тип, Колонка.Заголовок);
	КонецЦикла;

	Возврат Таблица;
	
КонецФункции

Функция ТаблицаСерииДокументаОбмена() Экспорт

	Таблица = Новый ТаблицаЗначений;
	
	Для Каждого Колонка Из SUI_ДокументыОбменаПовтИсп.КолонкиТаблицыСерии() Цикл
		Таблица.Колонки.Добавить(Колонка.Имя, Колонка.Тип, Колонка.Заголовок);
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

Функция ТаблицаШтрихкодыДокументаОбмена() Экспорт
	
	Таблица = Новый ТаблицаЗначений;

	Для Каждого Колонка Из SUI_ДокументыОбменаПовтИсп.КолонкиТаблицыШтрихкодыУпаковок() Цикл
		Таблица.Колонки.Добавить(Колонка.Имя, Колонка.Тип, Колонка.Заголовок);
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

Функция ТаблицаПотокШтрихкодовОбмена() Экспорт
	
	Таблица = Новый ТаблицаЗначений;
	
	Для Каждого Колонка Из SUI_ДокументыОбменаПовтИсп.КолонкиТаблицыПотокШтрихкодов() Цикл
		Таблица.Колонки.Добавить(Колонка.Имя, Колонка.Тип, Колонка.Заголовок);
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

#КонецОбласти

#Область ТаблицыДокумента

// Таблица документа по настройке табличной части.
// 
// Параметры:
//  КоллекцияРеквизитовТабличнойЧасти - ФиксированноеСоответствие из Структура - Коллекция настроек реквизитов табличной части
// 
// Возвращаемое значение:
//  Неопределено, ТаблицаЗначений - Таблица документа по настройке табличной части
Функция ТаблицаДокументаПоНастройкеТабличнойЧасти(КоллекцияРеквизитовТабличнойЧасти) Экспорт
	
	Если ТипЗнч(КоллекцияРеквизитовТабличнойЧасти) <> Тип("ФиксированноеСоответствие") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Таблица = Новый ТаблицаЗначений;
	
	Для Каждого РеквизитТЧ Из КоллекцияРеквизитовТабличнойЧасти Цикл
		
		Если Не ЗначениеЗаполнено(РеквизитТЧ.Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		Таблица.Колонки.Добавить(РеквизитТЧ.Ключ, РеквизитТЧ.Значение.Тип, ПредставлениеКолонкиТаблицы(РеквизитТЧ.Ключ));
		
	КонецЦикла;
	
	Таблица.Колонки.Добавить("ИндексКартинки", SUI_ОбщегоНазначения.ОписаниеТипаЧисло(1));
	Таблица.Колонки.Добавить("НомерСтроки", SUI_ОбщегоНазначения.ОписаниеТипаЧисло(10, 0, ДопустимыйЗнак.Неотрицательный), 
		НСтр("ru = 'Номер строки'"));
	Таблица.Колонки.Добавить("sid", SUI_ОбщегоНазначения.ОписаниеТипаСтрока(36), НСтр("ru = 'SID'"));
	Таблица.Колонки.Добавить("sid_doc", SUI_ОбщегоНазначения.ОписаниеТипаСтрока(36), НСтр("ru = 'SID документа'"));
	
	Возврат Таблица;
	
КонецФункции

#КонецОбласти

#Область ВыполнениеАлгоритмов

Процедура ВыполнитьПроизвольныйАлгоритм_ПередЗаписью(Алгоритм, ДокументОбъект) Экспорт
	
	Если Не ЗначениеЗаполнено(Алгоритм) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		УстановитьБезопасныйРежим(Истина);
		Выполнить(Алгоритм);
	Исключение
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(
			ИмяСобытия(НСтр("ru = 'Выполнение алгоритма. Перед записью'")), , 
			Метаданные.ОбщиеМодули.SUI_ДокументыОбмена, 
			ДокументОбъект.Ссылка, 
			ИнформацияОбОшибке());
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'При выполнении алгоритма ""Перед записью документа"" возникла исключительная ошибка:
			|%1.
			|Проверьте произвольный алгоритм в настройках документа обмена.'"), 
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

Процедура ВыполнитьУстановкуЗначений(ТаблицаУстановкиРеквизитов, ДокументОбъект, ТаблицыДокументаОбмена) Экспорт
	
	Если Не ЗначениеЗаполнено(ТаблицаУстановкиРеквизитов) Тогда
		Возврат;	
	КонецЕсли;
	
	Попытка

		ЕстьРасхождения = Ложь;
		
		Для Каждого ТаблицаДокументаОбмена Из ТаблицыДокументаОбмена Цикл
			
			Если ТаблицаДокументаОбмена.Значение.Колонки.Найти("qtty_plan") <> Неопределено 
				И ТаблицаДокументаОбмена.Значение.Колонки.Найти("qtty")  <> Неопределено Тогда 
				
				ЕстьРасхождения = Не ОбщегоНазначения.КоллекцииИдентичны(
				ТаблицаДокументаОбмена.Значение.ВыгрузитьКолонку("qtty_plan"), 
				ТаблицаДокументаОбмена.Значение.ВыгрузитьКолонку("qtty"), , , Истина);
				
				Если ЕстьРасхождения Тогда
					Прервать;
				КонецЕсли;
				
			КонецЕсли; 
			
		КонецЦикла;
        
		Для Каждого РеквизитДокументЗначение Из ТаблицаУстановкиРеквизитов Цикл
			
			Если (Не РеквизитДокументЗначение.ПриРасхождении И Не ЕстьРасхождения) Или
				(РеквизитДокументЗначение.ПриРасхождении И ЕстьРасхождения) Тогда
				ДокументОбъект[РеквизитДокументЗначение.Ключ] = РеквизитДокументЗначение.Значение.Получить();
			КонецЕсли;
			
		КонецЦикла; 
		
	Исключение 
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'При заполнении реквизитов из настроек возникла исключительная ошибка:
			|%1.
			|Проверьте заполнение реквизитов в настройках документа обмена.'"), 
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

Процедура УдалитьПустыеСтроки(НастройкиТабличныеЧасти, ДокументОбъект, ТаблицыДокументаОбмена) Экспорт
	
	Если Не ЗначениеЗаполнено(НастройкиТабличныеЧасти) Тогда
		Возврат;	
	КонецЕсли;
	
	Попытка
		
		Для Каждого ТаблицаДокументаОбмена Из НастройкиТабличныеЧасти Цикл
			
			Если ТаблицаДокументаОбмена.Значение.УдалятьПустыеСтроки Тогда
				ТаблицаДокумента = ДокументОбъект[ТаблицаДокументаОбмена.Значение.ИмяТабличнойЧасти]; 
				Таблица = ТаблицаДокументаОбмена.Значение.Элементы.Получить("qtty"); 
				Если Таблица <> Неопределено Тогда 
					УдалитьСтроки = ТаблицаДокумента.НайтиСтроки(Новый Структура(Таблица.Имя, 0));
					Для каждого Стр Из УдалитьСтроки Цикл
						ТаблицаДокумента.Удалить(Стр);
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
	Исключение 
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(НСтр("ru = 'Заполнение реквизитов.'")), , 
		Метаданные.ОбщиеМодули.SUI_ДокументыОбмена, ДокументОбъект.Ссылка, ИнформацияОбОшибке());
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'При удалении пустых строк возникла исключительная ошибка:
		|%1.
		|Проверьте настройки документа обмена.'"), 
		ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры 

Процедура ВыполнитьПроизвольныйАлгоритм_ПослеЗаписи(Алгоритм, ДокументСсылка) Экспорт
	
	Если Не ЗначениеЗаполнено(Алгоритм) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		УстановитьБезопасныйРежим(Истина);
		Выполнить(Алгоритм);
	Исключение
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(
			ИмяСобытия(НСтр("ru = 'Выполнение алгоритма. После записи'")), , 
			Метаданные.ОбщиеМодули.SUI_ДокументыОбмена, 
			ДокументСсылка, 
			ИнформацияОбОшибке());
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'При выполнении алгоритма ""После записи документа"" возникла исключительная ошибка:
			|%1.
			|Проверьте произвольный алгоритм в настройках документа обмена.'"), 
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

Процедура ВыполнитьПроизвольныйАлгоритм_ОбработкаСтрокиТабличнойЧасти(Алгоритм, ДокументОбъект, ТекущаяСтрока) Экспорт
	
	Если Не ЗначениеЗаполнено(Алгоритм) Тогда
		Возврат;
	КонецЕсли;

	Попытка
		УстановитьБезопасныйРежим(Истина);
		Выполнить(Алгоритм);
	Исключение
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(
			ИмяСобытия(НСтр("ru = 'Выполнение алгоритма. Обработка строк табличной части'")), , 
			Метаданные.ОбщиеМодули.SUI_ДокументыОбмена, 
			ДокументОбъект.Ссылка, 
			ИнформацияОбОшибке());
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'При выполнении алгоритма ""Обработка строк табличной части документа"" возникла исключительная ошибка:
			|%1.
			|Проверьте произвольный алгоритм в настройках документа обмена.'"), 
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

Процедура ВыполнитьПроизвольныйАлгоритм_ОбработкаШтрихкода(Алгоритм, СтрокаОбработки, ШаблонШтрихкода, ЭтоКодМаркировки) Экспорт
	
	Если ТипЗнч(Алгоритм) <> Тип("Строка") Или ПустаяСтрока(Алгоритм) Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрНайти(Алгоритм, "Алгоритм") > 0 Тогда
		Алгоритм = СтрЗаменить(Алгоритм, "Алгоритм", "");	
	КонецЕсли;
	
	Попытка
		УстановитьБезопасныйРежим(Истина);
		Выполнить(Алгоритм);
	Исключение
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(НСтр("ru = 'Выполнение алгоритма'")), , 
			Метаданные.ОбщиеМодули.SUI_ДокументыОбмена, , ИнформацияОбОшибке());
		ВызватьИсключение СтрШаблон(НСтр("ru = 'При выполнении алгоритма ""Обработка штрихкода"" документа обмена возникла исключительная ошибка:
		|%1.
		|Проверьте произвольный алгоритм в настройках шаблона штрихкода'"), 
		ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

Процедура ВыполнитьПроизвольныйАлгоритм_ПолучитьШтрихкодДокумента(Знач Алгоритм, Знач ДокументСсылка, Штрихкод) Экспорт
	
	Алгоритм = SUI_ОбщегоНазначения.ОписаниеТипаСтрока(0).ПривестиЗначение(Алгоритм);
	Если ПустаяСтрока(Алгоритм) Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрНайти(Алгоритм, "Алгоритм") > 0 Тогда
		Алгоритм = СтрЗаменить(Алгоритм, "Алгоритм", "");	
	КонецЕсли;
	
	Попытка
		УстановитьБезопасныйРежим(Истина);
		Выполнить(Алгоритм);
		Штрихкод = SUI_ОбщегоНазначения.ОписаниеТипаСтрока(100).ПривестиЗначение(Штрихкод);
		Штрихкод = ОбщегоНазначенияКлиентСервер.УдалитьНедопустимыеСимволыXML(Штрихкод);
	Исключение
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(НСтр("ru = 'Выполнение алгоритма'")), , 
			Метаданные.ОбщиеМодули.SUI_ДокументыОбмена, , ИнформацияОбОшибке());
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'При выполнении алгоритма ""Получить штрихкод документа"" возникла исключительная ошибка:
			|%1.
			|Проверьте произвольный алгоритм в Центре настроек %2'"), 
		ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()), SUI_SimpleКлиентСервер.Представление());
	КонецПопытки;

КонецПроцедуры

Процедура ВыполнитьПроизвольныйАлгоритм_СозданиеДокументаНаОсновании(Алгоритм, ДокументОбъект, ДокументОснование) Экспорт
	
	Если Не ЗначениеЗаполнено(Алгоритм) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		УстановитьБезопасныйРежим(Истина);
		Выполнить(Алгоритм);
	Исключение
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'При выполнении алгоритма ""Создание документа на основании"" возникла исключительная ошибка:
			|%1.
			|Проверьте произвольный алгоритм в настройках документа обмена.'"), 
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

Процедура ЗаписатьСопоставлениеПотокаШтрихкодов(ПараметрыЗаписи, Адрес) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаСопоставления", ПараметрыЗаписи.ТаблицаСопоставления);
	Запрос.УстановитьПараметр("sid_doc", ПараметрыЗаписи.sid_doc);
	Запрос.УстановитьПараметр("ПолученныеЗаписи", ПараметрыЗаписи.ПолученныеЗаписи);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	&sid_doc КАК sid_doc,
		|	*
		|ПОМЕСТИТЬ втТаблицаСопоставления
		|ИЗ
		|	&ТаблицаСопоставления КАК ТаблицаСопоставления
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	sid_doc,
		|	Штрихкод
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	*
		|ИЗ
		|	втТаблицаСопоставления КАК втТаблицаСопоставления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	SUI_docs_tbl_barcode_flow.Период,
		|	SUI_docs_tbl_barcode_flow.sid,
		|	SUI_docs_tbl_barcode_flow.sid_doc
		|ИЗ
		|	РегистрСведений.SUI_docs_tbl_barcode_flow КАК SUI_docs_tbl_barcode_flow
		|		#ТекстСоединенияТаблиц
		|ГДЕ
		|	SUI_docs_tbl_barcode_flow.sid_doc = &sid_doc
		|	И SUI_docs_tbl_barcode_flow.sid В (&ПолученныеЗаписи)";
	
	Если ПараметрыЗаписи.УдалятьНеСопоставленные Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ТекстСоединенияТаблиц", "");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ТекстСоединенияТаблиц", "
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ втТаблицаСопоставления КАК втТаблицаСопоставления
		|		ПО SUI_docs_tbl_barcode_flow.barcode = втТаблицаСопоставления.Штрихкод");
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		РезультатыЗапроса = Запрос.ВыполнитьПакет();
		
		Если Не РезультатыЗапроса[2].Пустой() Тогда
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.SUI_docs_tbl_barcode_flow");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
			ЭлементБлокировки.ИсточникДанных = РезультатыЗапроса[2];
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Период", "Период");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("sid", "sid");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("sid_doc", "sid_doc");
			Блокировка.Заблокировать();
			
			Выборка = РезультатыЗапроса[2].Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				НаборЗаписей = РегистрыСведений.SUI_docs_tbl_barcode_flow.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
				НаборЗаписей.Отбор.sid.Установить(Выборка.sid);
				НаборЗаписей.Отбор.sid_doc.Установить(Выборка.sid_doc);
				
				НаборЗаписей.ДополнительныеСвойства.Вставить("SUI_ОтключитьПодписку");
				НаборЗаписей.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
				
				НаборЗаписей.Записать(Истина);
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если Не РезультатыЗапроса[1].Пустой() Тогда
			
			ХарактеристикиИспользуются = SUI_НастройкиМетаданныхСервер.ТаблицаИспользуется(Перечисления.SUI_ТаблицыИнтеграции.ХарактеристикиНоменклатуры);
			УпаковкиИспользуются = SUI_НастройкиМетаданныхСервер.ТаблицаИспользуется(Перечисления.SUI_ТаблицыИнтеграции.УпаковкиНоменклатуры);
			
			ТаблицаДляЗаписи = ТаблицаТоварыДокументаОбмена();
			
			Выборка = РезультатыЗапроса[1].Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				Если ХарактеристикиИспользуются Тогда
					Характеристика = Выборка.Характеристика;
				Иначе
					Характеристика = Неопределено;
				КонецЕсли;
				
				Если УпаковкиИспользуются Тогда
					Упаковка = Выборка.Упаковка;	
				Иначе
					Упаковка = Неопределено;
				КонецЕсли;
					
				Если Выборка.Записывать Тогда
					
					РезультатСозданияШК = SUI_ШтрихкодыНоменклатуры.СоздатьШтрихкодНоменклатуры(
						ПараметрыЗаписи.АлгоритмСозданияШтрихкодаНоменклатуры, 
						Выборка.Штрихкод, 
						Выборка.Номенклатура, 
						Характеристика, 
						Упаковка);
					
					Если Не РезультатСозданияШК Тогда
						Продолжить;
					КонецЕсли;
				
				КонецЕсли;
				
				ДанныеЗаписиТоварыДокументаОбмена = Новый Структура();
				ДанныеЗаписиТоварыДокументаОбмена.Вставить("sid", 			Строка(Новый УникальныйИдентификатор()));
				ДанныеЗаписиТоварыДокументаОбмена.Вставить("sid_doc", 		ПараметрыЗаписи.sid_doc);	
				ДанныеЗаписиТоварыДокументаОбмена.Вставить("id_good", 		Выборка.Номенклатура);
				ДанныеЗаписиТоварыДокументаОбмена.Вставить("id_properties", Характеристика);
				ДанныеЗаписиТоварыДокументаОбмена.Вставить("id_unit", 		Упаковка);
				ДанныеЗаписиТоварыДокументаОбмена.Вставить("qtty", 			Выборка.Количество);
				ДанныеЗаписиТоварыДокументаОбмена.Вставить("ТипТаблицы", 	Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары);
				
				SUI_ИнтеграцияВКонфигурацию.ПривестиСсылкиКИдентификаторамSimple(
					ДанныеЗаписиТоварыДокументаОбмена, "sid, sid_doc, qtty, ТипТаблицы");
					
				Если Не SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(ДанныеЗаписиТоварыДокументаОбмена.id_good) Тогда
					Продолжить;
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(ТаблицаДляЗаписи.Добавить(), ДанныеЗаписиТоварыДокументаОбмена);
				
			КонецЦикла;
			
			ЗаписатьДанныеДокументаОбмена_Товары(ТаблицаДляЗаписи);
				
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Если ЭтоАдресВременногоХранилища(Адрес) Тогда
		ПоместитьВоВременноеХранилище(Истина, Адрес);
	КонецЕсли;
	
КонецПроцедуры

// Загрузить таблицы документа обмена в документ объект.
// 
// Параметры:
//  ДокументОбъект - ДокументОбъект - Документ объект в который необходимо загрузить
//  НастройкаДокумента - СправочникСсылка.SUI_НастройкиДокументов - Настройка документа обмена
//  ТаблицыДокументаОбмена - Соответствие из ТаблицаЗначений - Таблицы документа обмена
//  ТаблицаСерийБезНастройки - ТаблицаЗначений - Таблица серий из документа обмена без настройки ТЧ серии
Процедура ЗагрузитьТаблицыДокументаОбменаВДокументОбъект(ДокументОбъект, НастройкаДокумента, ТаблицыДокументаОбмена, ТаблицаСерийБезНастройки) Экспорт
	
	ОбщегоНазначенияКлиентСервер.Проверить(Не ДокументОбъект.Заблокирован(), СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Документ %1 заблокирован. Загрузка данных прервана.'"), ДокументОбъект.Ссылка));
	
	НастройкиДокумента = SUI_НастройкиДокументовСервер.СформироватьНастройкиДокумента(НастройкаДокумента);
	
	АлгоритмыТЧ = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НастройкиДокумента, 
		"ДополнительныеНастройки.АлгоритмыОбработкиСтрокТабличныхЧастей", Новый Соответствие(), Тип("Соответствие"));
	АлгоритмПередЗаписью = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НастройкиДокумента, 
		"ДополнительныеНастройки.ОбработчикиСобытий.ПередЗаписью", "", Тип("Строка"));

	Если ДокументОбъект.Метаданные() = Метаданные.Документы.SUI_СборШтрихкодов Тогда
		
		ТаблицаСборШК = ТаблицыДокументаОбмена.Получить(Перечисления.SUI_ТипыТаблицДокументовОбмена.ПотокШтрихкодов);
		
		Если ТаблицаСборШК <> Неопределено Тогда
			
			Запрос = Новый Запрос();
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	Источник.Штрихкод,
				|	Источник.Количество
				|ПОМЕСТИТЬ втИсточник
				|ИЗ
				|	&ТаблицаИсточник КАК Источник
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	Приемник.Штрихкод,
				|	Приемник.Количество
				|ПОМЕСТИТЬ втПриемник
				|ИЗ
				|	&ТаблицаПриемник КАК Приемник
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ЕСТЬNULL(втИсточник.Штрихкод, втПриемник.Штрихкод) КАК Штрихкод,
				|	ЕСТЬNULL(втИсточник.Количество, 0) + ЕСТЬNULL(втПриемник.Количество, 0) КАК Количество
				|ИЗ
				|	втИсточник КАК втИсточник
				|		ПОЛНОЕ СОЕДИНЕНИЕ втПриемник КАК втПриемник
				|		ПО втИсточник.Штрихкод = втПриемник.Штрихкод
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|УНИЧТОЖИТЬ втИсточник
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|УНИЧТОЖИТЬ втПриемник";
			
			Запрос.УстановитьПараметр("ТаблицаИсточник", ТаблицаСборШК);
			Запрос.УстановитьПараметр("ТаблицаПриемник", ДокументОбъект.Штрихкоды.Выгрузить());
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ТаблицаСборШК = РезультатЗапроса.Выгрузить();
			
			ДокументОбъект.Штрихкоды.Загрузить(ТаблицаСборШК);
			
			ТаблицыДокументаОбмена.Вставить(Перечисления.SUI_ТипыТаблицДокументовОбмена.ПотокШтрихкодов, ТаблицаСборШК);
			
		КонецЕсли;
		
	Иначе
		
		// Загрузка таблицы Штрихкоды упаковок
		ЗагрузитьТаблицыДокументаОбменаВДокументОбъект_ШтрихкодыУпаковок(ДокументОбъект,
			ТаблицыДокументаОбмена.Получить(Перечисления.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок),
			НастройкиДокумента.ТабличныеЧасти.Получить(Перечисления.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок),
			АлгоритмыТЧ.Получить(Перечисления.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок));
		
		// Загрузка таблицы Серии
		ЗагрузитьТаблицыДокументаОбменаВДокументОбъект_Серии(ДокументОбъект,
			ТаблицыДокументаОбмена.Получить(Перечисления.SUI_ТипыТаблицДокументовОбмена.Серии),
			НастройкиДокумента.ТабличныеЧасти.Получить(Перечисления.SUI_ТипыТаблицДокументовОбмена.Серии),
			АлгоритмыТЧ.Получить(Перечисления.SUI_ТипыТаблицДокументовОбмена.Серии));
	
		// Загрузка таблицы Товары
		ЗагрузитьТаблицыДокументаОбменаВДокументОбъект_Товары(ДокументОбъект,
			ТаблицыДокументаОбмена.Получить(Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары),
			НастройкиДокумента.ТабличныеЧасти.Получить(Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары),
			НастройкиДокумента.ТабличныеЧасти.Получить(Перечисления.SUI_ТипыТаблицДокументовОбмена.Серии),
			АлгоритмыТЧ.Получить(Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары),
			ТаблицаСерийБезНастройки);
		
		// Загрузка таблицы Отбор
		ЗагрузитьТаблицыДокументаОбменаВДокументОбъект_Товары(ДокументОбъект,
			ТаблицыДокументаОбмена.Получить(Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор),
			НастройкиДокумента.ТабличныеЧасти.Получить(Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор),
			НастройкиДокумента.ТабличныеЧасти.Получить(Перечисления.SUI_ТипыТаблицДокументовОбмена.Серии),
			АлгоритмыТЧ.Получить(Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор),
			ТаблицаСерийБезНастройки);
			
		// Загрузка таблицы Размещение
		ЗагрузитьТаблицыДокументаОбменаВДокументОбъект_Товары(ДокументОбъект,
			ТаблицыДокументаОбмена.Получить(Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение),
			НастройкиДокумента.ТабличныеЧасти.Получить(Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение),
			НастройкиДокумента.ТабличныеЧасти.Получить(Перечисления.SUI_ТипыТаблицДокументовОбмена.Серии),
			АлгоритмыТЧ.Получить(Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение),
			ТаблицаСерийБезНастройки);
			
	КонецЕсли;
	
	// Обновить данные в таблицах документа обмена после выполнения алгоритмов
	Для Каждого ТаблицаДокументаОбмена Из ТаблицыДокументаОбмена Цикл
		
		НастройкаТЧ = НастройкиДокумента.ТабличныеЧасти.Получить(ТаблицаДокументаОбмена.Ключ);
		
		Если Не ЗначениеЗаполнено(НастройкаТЧ) Тогда
			 Продолжить;
		КонецЕсли;
		
		Для Каждого СтрокаДокумента Из ДокументОбъект[НастройкаТЧ.ИмяТабличнойЧасти] Цикл
			
			СтрокиТаблицыДокументаОбмена = ТаблицаДокументаОбмена.Значение.НайтиСтроки(
				Новый Структура("НомерСтроки", СтрокаДокумента.НомерСтроки));
			
			Для Каждого СтрокаТаблицыДокументаОбмена Из СтрокиТаблицыДокументаОбмена Цикл
				
				Для Каждого РеквизитТЧ Из НастройкаТЧ.Элементы Цикл
					
					Если РеквизитТЧ.Ключ = "qtty_plan" Или Не ЗначениеЗаполнено(РеквизитТЧ.Значение) Тогда
						Продолжить;
					КонецЕсли;
					
					Если РеквизитТЧ.Значение.Имя = Неопределено И РеквизитТЧ.Значение.ПостоянноеЗначение <> Неопределено Тогда
						СтрокаТаблицыДокументаОбмена[РеквизитТЧ.Ключ] = РеквизитТЧ.Значение.ПостоянноеЗначение;
					ИначеЕсли РеквизитТЧ.Значение.Имя <> Неопределено Тогда 
						СтрокаТаблицыДокументаОбмена[РеквизитТЧ.Ключ] = СтрокаДокумента[РеквизитТЧ.Значение.Имя];
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры

Процедура ПолучитьШтрихкодыМаркировкиДокументаОбмена(Параметры, АдресРезультата) Экспорт
	
	ШтрихкодыМаркировки = Новый Массив();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДокументыОбмена.sid КАК sid,
		|	ДокументыОбмена.id_doc КАК id_doc,
		|	ДокументыОбмена.НастройкаДокумента КАК НастройкаДокумента
		|ПОМЕСТИТЬ втДокументыОбмена
		|ИЗ
		|	РегистрСведений.SUI_docs КАК ДокументыОбмена
		|ГДЕ
		|	ДокументыОбмена.id_doc = &ИдентификаторДокумента
		|	И ВЫБОР
		|		КОГДА &НастройкаДокумента = НЕОПРЕДЕЛЕНО
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ДокументыОбмена.НастройкаДокумента = &НастройкаДокумента
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеШтрихкодов.Количество КАК Количество,
		|	ДанныеШтрихкодов.ФорматBase64 КАК ФорматBase64,
		|	ДанныеШтрихкодов.Штрихкод КАК Штрихкод,
		|	ДанныеШтрихкодов.ШтрихкодМаркиАлкогольнойПродукции КАК ШтрихкодМаркиАлкогольнойПродукции,
		|	ДанныеШтрихкодов.ШтрихкодУпаковки КАК ШтрихкодУпаковки
		|ИЗ
		|	(ВЫБРАТЬ
		|		1 КАК Количество,
		|		ВЫБОР
		|			КОГДА ШтрихкодыДокументаОбмена.ШтрихкодBase64 <> """"
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ КАК ФорматBase64,
		|		ВЫБОР
		|			КОГДА ШтрихкодыДокументаОбмена.ШтрихкодBase64 <> """"
		|				ТОГДА ШтрихкодыДокументаОбмена.ШтрихкодBase64
		|			КОГДА ШтрихкодыДокументаОбмена.barcode_from_scanner <> """"
		|				ТОГДА ШтрихкодыДокументаОбмена.barcode_from_scanner
		|			ИНАЧЕ ШтрихкодыДокументаОбмена.mark_code
		|		КОНЕЦ КАК Штрихкод,
		|		"""" КАК ШтрихкодМаркиАлкогольнойПродукции,
		|		ВЫБОР
		|			КОГДА ШтрихкодыДокументаОбмена.ШтрихкодBase64 <> """"
		|				ТОГДА ШтрихкодыДокументаОбмена.SSCCBase64
		|			ИНАЧЕ ШтрихкодыДокументаОбмена.SSCC
		|		КОНЕЦ КАК ШтрихкодУпаковки
		|	ИЗ
		|		втДокументыОбмена КАК втДокументыОбмена
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.SUI_docs_tbl_barcodes КАК ШтрихкодыДокументаОбмена
		|			ПО втДокументыОбмена.sid = ШтрихкодыДокументаОбмена.sid_doc
		|			И ВЫБОР
		|				КОГДА ШтрихкодыДокументаОбмена.mark_code <> """"
		|				ИЛИ ШтрихкодыДокументаОбмена.barcode_from_scanner <> """"
		|				ИЛИ ШтрихкодыДокументаОбмена.ШтрихкодBase64 <> """"
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		1,
		|		ИСТИНА,
		|		ПотокШтрихкодов.ШтрихкодBase64,
		|		"""",
		|		""""
		|	ИЗ
		|		втДокументыОбмена КАК втДокументыОбмена
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.SUI_docs_tbl_barcode_flow КАК ПотокШтрихкодов
		|			ПО втДокументыОбмена.sid = ПотокШтрихкодов.sid_doc
		|			И (ПотокШтрихкодов.ЭтоШтрихкодКМ
		|			ИЛИ ПотокШтрихкодов.ЭтоШтрихкодSSCC)
		|	СГРУППИРОВАТЬ ПО
		|		ПотокШтрихкодов.ШтрихкодBase64) КАК ДанныеШтрихкодов
		|ГДЕ
		|	ДанныеШтрихкодов.Штрихкод <> """"
		|	ИЛИ ДанныеШтрихкодов.ШтрихкодУпаковки <> """"";
	
	Запрос.УстановитьПараметр("ИдентификаторДокумента", SUI_ИнтеграцияВКонфигурацию.ИдентификаторSimpleПоСсылке(
		Параметры.ДокументСсылка));
	Запрос.УстановитьПараметр("НастройкаДокумента", Параметры.НастройкаДокумента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ШтрихкодыМаркировки.Добавить(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Выборка));
		КонецЦикла;
		
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(ШтрихкодыМаркировки, АдресРезультата);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриДобавленииРегламентныхЗаданийПодсистемы(РегламентныеЗаданияПодсистемы) Экспорт
	
	РегламентноеЗаданиеПодсистемы = РегламентныеЗаданияПодсистемы.Добавить();
	РегламентноеЗаданиеПодсистемы.Ключ = SUI_ДокументыОбменаКлиентСервер.КлючиРегламентныхЗаданий().ВыполнитьОчисткуОбработанныхДокументов;
	РегламентноеЗаданиеПодсистемы.Наименование = НСтр("ru = 'Simple: Очистка обработанных документов'");
	РегламентноеЗаданиеПодсистемы.ИмяМетода = "SUI_ДокументыОбмена.ВыполнитьОчисткуОбработанныхДокументов";
	РегламентноеЗаданиеПодсистемы.КоличествоПовторовПриАварийномЗавершении = 1;
	РегламентноеЗаданиеПодсистемы.ИнтервалПовтораПриАварийномЗавершении = 60;
	РегламентноеЗаданиеПодсистемы.Расписание.ПериодПовтораДней = 1;
	
КонецПроцедуры

//@skip-check query-in-loop
Процедура ВыполнитьОчисткуОбработанныхДокументов() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ДниХранения = Константы.SUI_ХранениеОбработанныхДокументовОбмена.Получить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ДниХранения = 0 Тогда
		Возврат;
	КонецЕсли;

	SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(НСтр("ru = 'Удаление'")), УровеньЖурналаРегистрации.Примечание, 
		Метаданные.ОбщиеМодули.SUI_ДокументыОбмена, , НСтр("ru = 'Начало удаления завершенных документов обмена'"));
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 100
		|	SUI_docs.id_doc КАК id_doc
		|ИЗ
		|	РегистрСведений.SUI_docs КАК SUI_docs
		|ГДЕ
		|	SUI_docs.ДатаОбновления < &ДатаНачалаЗаписей";
	
	Запрос.УстановитьПараметр("ДатаНачалаЗаписей", ТекущаяДатаСеанса() - 86400 * ДниХранения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Пока Не РезультатЗапроса.Пустой() Цикл
		УдалитьДокументыОбмена(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("id_doc"));
		РезультатЗапроса = Запрос.Выполнить();
	КонецЦикла;
	
	SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(НСтр("ru = 'Удаление'")), УровеньЖурналаРегистрации.Примечание, 
		Метаданные.ОбщиеМодули.SUI_ДокументыОбмена, , НСтр("ru = 'Завершение удаления завершенных документов обмена'"));
	
КонецПроцедуры 

#Область Задания

Процедура ЗапуститьЗаданияПослеЗаписиДокументаОбмена(ВыполняемыеЗадания, АдресРезультата = Неопределено) Экспорт
	
	Если ВыполняемыеЗадания.Найти("СоздатьСерииНоменклатуры") <> Неопределено Тогда
		
		Попытка
			ЗаданиеСоздатьСерииНоменклатурыДокументаОбмена(Новый Структура());
		Исключение
			SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытияЗадание(), ,
				Метаданные.ОбщиеМодули.SUI_ДокументыОбмена, , ИнформацияОбОшибке());	
		КонецПопытки;
		
	КонецЕсли;
	
	Если ВыполняемыеЗадания.Найти("СоздатьШтрихкодыУпаковок") <> Неопределено Тогда
		
		Попытка
			ЗаданиеСоздатьШтрихкодыУпаковокДокументаОбмена(Новый Структура());
		Исключение
			SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытияЗадание(), ,
				Метаданные.ОбщиеМодули.SUI_ДокументыОбмена, , ИнформацияОбОшибке());	
		КонецПопытки;
		
	КонецЕсли;
	
	Если ВыполняемыеЗадания.Найти("ЗагрузитьИтогиПересчетаВДокументОбмена") <> Неопределено Тогда
		
		Попытка
			ЗаданиеЗагрузитьИтогиПересчетаВДокументОбмена(Новый Структура());
		Исключение
			SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытияЗадание(), ,
				Метаданные.ОбщиеМодули.SUI_ДокументыОбмена, , ИнформацияОбОшибке());	
		КонецПопытки;
		
	КонецЕсли;

КонецПроцедуры

Процедура ЗаданиеСоздатьСерииНоменклатурыДокументаОбмена(Параметры, АдресРезультата = Неопределено) Экспорт
	
	ОбработкаВыполнена = Ложь;
	
	// Оценка производительности
	ОценкаПроизводительности_НачалоЗамера = SUI_ОценкаПроизводительности.НачатьЗамерВремени();
	ОценкаПроизводительности_ВесЗамера = 0;
	ОценкаПроизводительности_КлючеваяОперация = "ЗаданиеСоздатьСерииНоменклатурыДокументаОбмена";
	
	Если Не SUI_НастройкиМетаданныхСервер.ТаблицаИспользуется(Перечисления.SUI_ТаблицыИнтеграции.Номенклатура) Или
		Не SUI_НастройкиМетаданныхСервер.ТаблицаИспользуется(Перечисления.SUI_ТаблицыИнтеграции.СерииНоменклатуры) Тогда
		Возврат;
	КонецЕсли;
	
	АлгоритмСоздания = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		SUI_НастройкиМетаданныхСервер.ПолучитьДополнительныеНастройки(Перечисления.SUI_ТаблицыИнтеграции.СерииНоменклатуры), 
		"АлгоритмСозданияСерииНоменклатуры.Алгоритм", "", Тип("Строка"));
	
	Если ПустаяСтрока(АлгоритмСоздания) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Отсутствует алгоритм создания серий номенклатуры.
		|Создание серий номенклатуры было пропущено.'"));
		Возврат;
	КонецЕсли;
	
	ТипыРеквизитов = SUI_ОбщегоНазначенияКлиентСервер.МассивЗначений(
		Перечисления.SUI_ТаблицыИнтеграции.Номенклатура,
		Перечисления.SUI_ТаблицыИнтеграции.СерииНоменклатуры);
	
	ПараметрыПолученияНастроек = РегистрыСведений.SUI_НастройкиТаблицИнтеграции.ПараметрыПолученияНастроек(ТипыРеквизитов);	
	ПараметрыПолученияНастроек.ОсновнойОбъект = Истина;
	
	НастройкиТаблиц = РегистрыСведений.SUI_НастройкиТаблицИнтеграции.ПолучитьНастройки(ПараметрыПолученияНастроек);
	
	Ошибки = Новый Массив();
	
	Для индекс = 0 По ТипыРеквизитов.ВГраница() Цикл
		
		ТаблицаИнтеграции = ТипыРеквизитов[индекс];
		ТипыРеквизитов[индекс] = Неопределено;
		
		СтрокаНастройки = НастройкиТаблиц.Найти(ТаблицаИнтеграции, "ТаблицаИнтеграции");
		
		Если СтрокаНастройки = Неопределено Тогда
			Ошибки.Добавить(СтрШаблон(НСтр("ru = 'Отсутствует настройка для таблицы %1.'"), ТаблицаИнтеграции));
			Продолжить;
		КонецЕсли;
		
		Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных();
		SUI_КомпоновкаДанныхСервер.ИнициализироватьКомпоновщикНастроек(Компоновщик,
			СтрокаНастройки.СхемаКомпоновкиДанных,
			СтрокаНастройки.НастройкиКомпоновкиДанных);
		
		СтрокаНастройки.НастройкиКомпоновкиДанных = Компоновщик.ПолучитьНастройки();
		
		ПолеНайдено = Ложь;
		Для Каждого ЭлементВыбора Из СтрокаНастройки.НастройкиКомпоновкиДанных.Выбор.Элементы Цикл
			
			Если ЭлементВыбора.Использование И ЭлементВыбора.Заголовок = "id" Тогда
				
				ДоступноеПоле = СтрокаНастройки.НастройкиКомпоновкиДанных.Выбор.ДоступныеПоляВыбора
					.НайтиПоле(ЭлементВыбора.Поле);
				
				Если ДоступноеПоле <> Неопределено Тогда
					ТипыРеквизитов[индекс] = ДоступноеПоле.ТипЗначения;
					ПолеНайдено = Истина;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если Не ПолеНайдено Тогда
			Ошибки.Добавить(СтрШаблон(НСтр("ru = 'Не настроен реквизит id для таблицы %1.'"), ТаблицаИнтеграции));
		КонецЕсли;
		
	КонецЦикла;
	
	Если Ошибки.Количество() > 0 Тогда
		Для индекс = 0 По Ошибки.ВГраница() Цикл
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = '%1
			|Создание серий номенклатуры пропущено.'"), Ошибки[индекс]));
		КонецЦикла;
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	Запрос.УстановитьПараметр("sid_doc", ?(Параметры.Свойство("sid_doc"), Параметры.sid_doc, Неопределено));
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	РегистрСерий.sid КАК sid,
		|	РегистрСерий.sid_doc КАК sid_doc,
		|	РегистрСерий.id_good,
		|	РегистрСерий.name КАК Наименование,
		|	РегистрСерий.number КАК Номер,
		|	РегистрСерий.production_date КАК ДатаПроизводства,
		|	РегистрСерий.best_before КАК ГоденДо
		|ПОМЕСТИТЬ втТаблица
		|ИЗ
		|	РегистрСведений.SUI_docs_tbl_series КАК РегистрСерий
		|ГДЕ
		|	РегистрСерий.СтатусОбработки = ЗНАЧЕНИЕ(Перечисление.SUI_СтатусыОбработкиСтрок.Новая)
		|	И ВЫБОР
		|		КОГДА &sid_doc <> НЕОПРЕДЕЛЕНО
		|			ТОГДА РегистрСерий.sid_doc = &sid_doc
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	sid,
		|	sid_doc";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	Если РезультатыЗапроса[0].Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Отсутствуют данные для создания серий номенклатуры.'"));
		Возврат;
	КонецЕсли;
	
	Пока Не РезультатыЗапроса[0].Пустой() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			БлокировкаДанных = Новый БлокировкаДанных();
			ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.SUI_docs_tbl_series");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = РезультатыЗапроса[0];
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("sid", "sid");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("sid_doc", "sid_doc");
			БлокировкаДанных.Заблокировать();
			
			ТаблицаСерий = РезультатыЗапроса[0].Выгрузить();
			ТаблицаСерий.Колонки.Добавить("Номенклатура", ТипыРеквизитов[0]);
			ТаблицаСерий.Колонки.Добавить("Серия", ТипыРеквизитов[1]);
			ТаблицаСерий.Колонки.Добавить("Пропустить", Новый ОписаниеТипов("Булево"));
			
			// Оценка производительности
			ОценкаПроизводительности_ВесЗамера = ОценкаПроизводительности_ВесЗамера + ТаблицаСерий.Количество();
			
			Для Каждого СтрокаТаблицыСерий Из ТаблицаСерий Цикл
				
				СтрокаТаблицыСерий.Номенклатура = ТипыРеквизитов[0].ПривестиЗначение(
					SUI_ИнтеграцияВКонфигурацию.СсылкаПоИдентификаторуSimple(СтрокаТаблицыСерий.id_good, Истина));
				
				Если Не ЗначениеЗаполнено(СтрокаТаблицыСерий.Номенклатура) Тогда
					СтрокаТаблицыСерий.Пропустить = Истина;
				КонецЕсли;
				
			КонецЦикла;
			
			ТаблицаСерий = ТаблицаСерий.Скопировать(Новый Структура("Пропустить", Ложь));
			
			ТаблицаСерий.Колонки.Удалить("id_good");
			ТаблицаСерий.Колонки.Удалить("Пропустить");
			
			ОжидаемыеКолонки = Новый Соответствие();
			Для Каждого ИмяКолонки Из СтрРазделить("sid,sid_doc,Серия", ",") Цикл
				ОжидаемыеКолонки.Вставить(ИмяКолонки, ТаблицаСерий.Колонки[ИмяКолонки].ТипЗначения);
			КонецЦикла;
			
			Попытка
				
				ТаблицаСерий = SUI_СерииНоменклатуры.СоздатьСерииНоменклатуры(АлгоритмСоздания, ТаблицаСерий);
				
				ТипРезультата = ТипЗнч(ТаблицаСерий);
				ОжидаемыйТипРезультата = Тип("ТаблицаЗначений");
				ОбщегоНазначенияКлиентСервер.Проверить(ТипРезультата = ОжидаемыйТипРезультата,
					СтрШаблон(НСтр("ru = 'Результат вернул тип %1. Ожидаемый тип %2'"), 
					ТипРезультата, ОжидаемыйТипРезультата));
				
				Для Каждого ОжидаемаяКолонка Из ОжидаемыеКолонки Цикл
				
					Колонка = ТаблицаСерий.Колонки.Найти(ОжидаемаяКолонка.Ключ);
					
					ОбщегоНазначенияКлиентСервер.Проверить(Колонка <> Неопределено,
						СтрШаблон(НСтр("ru = 'В таблице результата отсутствует обязательная колонка %1'"), 
						ОжидаемаяКолонка.Ключ));
					
					ОбщегоНазначенияКлиентСервер.Проверить(ОжидаемаяКолонка.Значение = Колонка.ТипЗначения,
						СтрШаблон(НСтр("ru = 'Колонка %1 таблицы результата содержит тип %2. Ожидаемый тип %3'"), 
						Колонка.Имя, Колонка.ТипЗначения, ОжидаемаяКолонка.Значение));
					
				КонецЦикла;
				
				ТаблицаСерий.Свернуть("sid,sid_doc,Серия");
				
			Исключение
				ВызватьИсключение СтрШаблон(
					НСтр("ru = 'Возникла ошибка при выполнении алгоритма создания серий номенклатуры:
					|%1'"), ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
			
			ЗапросРезультат = Новый Запрос();
			ЗапросРезультат.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
			ЗапросРезультат.УстановитьПараметр("ТаблицаСерий", ТаблицаСерий);
			ЗапросРезультат.УстановитьПараметр("ДатаОбновления", ТекущаяДатаСеанса());
			ЗапросРезультат.Текст = 
				"ВЫБРАТЬ
				|	ТаблицаСерий.sid КАК sid,
				|	ТаблицаСерий.sid_doc КАК sid_doc,
				|	ТаблицаСерий.Серия
				|ПОМЕСТИТЬ втТаблицаСерий
				|ИЗ
				|	&ТаблицаСерий КАК ТаблицаСерий
				|
				|ИНДЕКСИРОВАТЬ ПО
				|	sid,
				|	sid_doc
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	РегистрСерий.sid,
				|	РегистрСерий.sid_doc,
				|	РегистрСерий.id_good,
				|	РегистрСерий.id_properties,
				|	РегистрСерий.id_warehouse,
				|	РегистрСерий.qtty,
				|	РегистрСерий.additional_details,
				|	РегистрСерий.best_before,
				|	РегистрСерий.name,
				|	РегистрСерий.number,
				|	РегистрСерий.production_date,
				|	ЗНАЧЕНИЕ(Перечисление.SUI_СтатусыОбработкиСтрок.ОбработкаНеТребуется) КАК СтатусОбработки,
				|	&ДатаОбновления КАК ДатаОбновления,
				|	ЕСТЬNULL(втТаблицаСерий.Серия, НЕОПРЕДЕЛЕНО) КАК Серия
				|ИЗ
				|	втТаблица КАК втТаблица
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.SUI_docs_tbl_series КАК РегистрСерий
				|			ЛЕВОЕ СОЕДИНЕНИЕ втТаблицаСерий КАК втТаблицаСерий
				|			ПО РегистрСерий.sid = втТаблицаСерий.sid
				|			И РегистрСерий.sid_doc = втТаблицаСерий.sid_doc
				|		ПО втТаблица.sid = РегистрСерий.sid
				|		И втТаблица.sid_doc = РегистрСерий.sid_doc";
			
			//@skip-check query-in-loop
			РезультатЗапроса = ЗапросРезультат.Выполнить();
			
			Если Не РезультатЗапроса.Пустой() Тогда
				
				Выборка = РезультатЗапроса.Выбрать();
				
				Пока Выборка.Следующий() Цикл
					
					НаборЗаписей = РегистрыСведений.SUI_docs_tbl_series.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.sid.Установить(Выборка.sid);
					НаборЗаписей.Отбор.sid_doc.Установить(Выборка.sid_doc);
					
					Запись = НаборЗаписей.Добавить();
					ЗаполнитьЗначенияСвойств(Запись, Выборка);
					
					Запись.id_series = SUI_ИнтеграцияВКонфигурацию.ИдентификаторSimpleПоСсылке(Выборка.Серия, Истина);
					
					Если ПустаяСтрока(Запись.id_series) Тогда
						Запись.СтатусОбработки = Перечисления.SUI_СтатусыОбработкиСтрок.Пропущена;
					Иначе
						ОбработкаВыполнена = Истина;
					КонецЕсли;
					
					НаборЗаписей.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
					НаборЗаписей.ОбменДанными.Загрузка = Истина;
					НаборЗаписей.Записать(Истина);
					
				КонецЦикла;
				
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			Ошибка = ИнформацияОбОшибке();
			
			SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(
				ИмяСобытияЗадание(НСтр("ru = 'Создание серий номенклатуры'")), , 
				Метаданные.ОбщиеМодули.SUI_ДокументыОбмена, , Ошибка);
			
			// Оценка производительности
			SUI_ОценкаПроизводительности.ЗакончитьЗамерВремени(
				ОценкаПроизводительности_КлючеваяОперация, 
				ОценкаПроизводительности_НачалоЗамера, 
				ОценкаПроизводительности_ВесЗамера, 
				ОбработкаОшибок.КраткоеПредставлениеОшибки(Ошибка), 
				Истина);
				
			ВызватьИсключение ОбработкаОшибок.КраткоеПредставлениеОшибки(Ошибка);
			
		КонецПопытки;
		
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
		//@skip-check query-in-loop
		РезультатыЗапроса = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
		
	КонецЦикла;
	
	// Оценка производительности
	Если ОценкаПроизводительности_ВесЗамера > 0 Тогда
		SUI_ОценкаПроизводительности.ЗакончитьЗамерВремени(ОценкаПроизводительности_КлючеваяОперация, 
			ОценкаПроизводительности_НачалоЗамера, ОценкаПроизводительности_ВесЗамера);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресРезультата) И ЭтоАдресВременногоХранилища(АдресРезультата) Тогда
		ПоместитьВоВременноеХранилище(ОбработкаВыполнена, АдресРезультата);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаданиеСоздатьШтрихкодыУпаковокДокументаОбмена(Параметры, АдресРезультата = Неопределено) Экспорт
	
	Результат = Ложь;
	
	Если Не SUI_НастройкиМетаданныхСервер.ТаблицаИспользуется(Перечисления.SUI_ТаблицыИнтеграции.Номенклатура) Или
		Не SUI_НастройкиМетаданныхСервер.ТаблицаИспользуется(Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыУпаковок) Тогда
		Возврат;
	КонецЕсли;
	
	НастройкаШтрихкодыУпаковок = SUI_НастройкиМетаданныхСервер.ПолучитьДополнительныеНастройки(
		Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыУпаковок);
	
	АлгоритмСоздания = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НастройкаШтрихкодыУпаковок, 
		"АлгоритмСозданияШтрихкодаУпаковки.Алгоритм", "", Тип("Строка"));
	
	Если Не ЗначениеЗаполнено(АлгоритмСоздания) Тогда
		ОбщегоНазначения.СообщитьПользователю("ru = 'Отсутствует настройка создания штрихкодов упаковок.
		|Создание штрихкодов упаковок было пропущено.'");
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("sid_doc", ?(Параметры.Свойство("sid_doc"), Параметры.sid_doc, Неопределено));
	Запрос.УстановитьПараметр("ШаблонИдентификатораSimple", 
		SUI_ИнтеграцияВКонфигурациюКлиентСервер.ШаблонИдентификатораSimple());
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ШтрихкодыДокументовОбмена.sid КАК sid,
		|	ШтрихкодыДокументовОбмена.sid_doc КАК sid_doc,
		|	ШтрихкодыДокументовОбмена.id_good КАК id_good,
		|	ШтрихкодыДокументовОбмена.id_property КАК id_property,
		|	ШтрихкодыДокументовОбмена.id_series КАК id_series,
		|	ШтрихкодыДокументовОбмена.id_unit КАК id_unit,
		|	ШтрихкодыДокументовОбмена.id_cell КАК id_cell,
		|	ШтрихкодыДокументовОбмена.mark_code КАК mark_code,
		|	ШтрихкодыДокументовОбмена.id_marking_code КАК id_marking_code,
		|	ШтрихкодыДокументовОбмена.id_SSCC КАК id_SSCC,
		|	ШтрихкодыДокументовОбмена.SSCC КАК SSCC,
		|	ШтрихкодыДокументовОбмена.SSCCBase64,
		|	ШтрихкодыДокументовОбмена.ШтрихкодBase64,
		|	ШтрихкодыДокументовОбмена.series_number КАК series_number
		|ПОМЕСТИТЬ втШтрихкодыДокументовОбмена
		|ИЗ
		|	РегистрСведений.SUI_docs_tbl_barcodes КАК ШтрихкодыДокументовОбмена
		|ГДЕ
		|	ШтрихкодыДокументовОбмена.СтатусОбработки = ЗНАЧЕНИЕ(Перечисление.SUI_СтатусыОбработкиСтрок.Новая)
		|	И ВЫБОР
		|		КОГДА &sid_doc <> НЕОПРЕДЕЛЕНО
		|			ТОГДА ШтрихкодыДокументовОбмена.sid_doc = &sid_doc
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втШтрихкодыДокументовОбмена.sid КАК sid,
		|	втШтрихкодыДокументовОбмена.sid_doc КАК sid_doc,
		|	втШтрихкодыДокументовОбмена.id_good КАК id_good,
		|	втШтрихкодыДокументовОбмена.id_property КАК id_property,
		|	втШтрихкодыДокументовОбмена.series_number КАК series_number
		|ПОМЕСТИТЬ втШтрихкодыДокументовОбменаБезСерии
		|ИЗ
		|	втШтрихкодыДокументовОбмена КАК втШтрихкодыДокументовОбмена
		|ГДЕ
		|	НЕ втШтрихкодыДокументовОбмена.id_series ПОДОБНО &ШаблонИдентификатораSimple
		|	И втШтрихкодыДокументовОбмена.series_number <> """"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ШтрихкодыДокументовОбменаБезСерии.sid КАК sid,
		|	СерииДокументовОбмена.id_series КАК id_series
		|ПОМЕСТИТЬ втНовыеСерииШтрихкодовДокументовОбмена
		|ИЗ
		|	РегистрСведений.SUI_docs_tbl_series КАК СерииДокументовОбмена
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втШтрихкодыДокументовОбменаБезСерии КАК ШтрихкодыДокументовОбменаБезСерии
		|		ПО СерииДокументовОбмена.sid_doc = ШтрихкодыДокументовОбменаБезСерии.sid_doc
		|		И СерииДокументовОбмена.id_good = ШтрихкодыДокументовОбменаБезСерии.id_good
		|		И СерииДокументовОбмена.id_properties = ШтрихкодыДокументовОбменаБезСерии.id_property
		|		И СерииДокументовОбмена.number = ШтрихкодыДокументовОбменаБезСерии.series_number
		|ГДЕ
		|	СерииДокументовОбмена.СтатусОбработки <> ЗНАЧЕНИЕ(Перечисление.SUI_СтатусыОбработкиСтрок.Новая)
		|	И СерииДокументовОбмена.id_series ПОДОБНО &ШаблонИдентификатораSimple
		|	И СерииДокументовОбмена.number <> """"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втШтрихкодыДокументовОбмена.sid,
		|	втШтрихкодыДокументовОбмена.sid_doc,
		|	втШтрихкодыДокументовОбмена.id_good,
		|	втШтрихкодыДокументовОбмена.id_property,
		|	ЕСТЬNULL(втНовыеСерииШтрихкодовДокументовОбмена.id_series, втШтрихкодыДокументовОбмена.id_series) КАК id_series,
		|	втШтрихкодыДокументовОбмена.id_unit,
		|	втШтрихкодыДокументовОбмена.id_cell,
		|	втШтрихкодыДокументовОбмена.mark_code,
		|	втШтрихкодыДокументовОбмена.id_marking_code,
		|	втШтрихкодыДокументовОбмена.id_SSCC,
		|	втШтрихкодыДокументовОбмена.SSCC,
		|	втШтрихкодыДокументовОбмена.SSCCBase64,
		|	втШтрихкодыДокументовОбмена.ШтрихкодBase64,
		|	втШтрихкодыДокументовОбмена.series_number
		|ИЗ
		|	втШтрихкодыДокументовОбмена КАК втШтрихкодыДокументовОбмена
		|		ЛЕВОЕ СОЕДИНЕНИЕ втНовыеСерииШтрихкодовДокументовОбмена КАК втНовыеСерииШтрихкодовДокументовОбмена
		|		ПО втШтрихкодыДокументовОбмена.sid = втНовыеСерииШтрихкодовДокументовОбмена.sid";
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Пока Не РезультатЗапроса.Пустой() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.SUI_docs_tbl_barcodes");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("sid", "sid");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("sid_doc", "sid_doc");
			Блокировка.Заблокировать();
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				//@skip-check structure-consructor-too-many-keys
				Данные = Новый Структура("mark_code,SSCC,id_marking_code,id_SSCC");
				ЗаполнитьЗначенияСвойств(Данные, Выборка);
				
				Если ЗначениеЗаполнено(Данные.mark_code) И
					SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(Выборка.id_good) Тогда
					
					Данные.id_marking_code = SUI_ИнтеграцияВКонфигурацию.СсылкаПоИдентификаторуSimple(
						Выборка.id_marking_code, Истина);
					Данные.id_SSCC = SUI_ИнтеграцияВКонфигурацию.СсылкаПоИдентификаторуSimple(
						Выборка.id_SSCC, Истина);
					
					ПараметрыМетода = Новый Массив();
					ПараметрыМетода.Добавить(Данные.mark_code);
					ПараметрыМетода.Добавить(Данные.SSCC);
					ПараметрыМетода.Добавить(SUI_ИнтеграцияВКонфигурацию.СсылкаПоИдентификаторуSimple(Выборка.id_good, Истина));
					ПараметрыМетода.Добавить(SUI_ИнтеграцияВКонфигурацию.СсылкаПоИдентификаторуSimple(Выборка.id_property, Истина));
					ПараметрыМетода.Добавить(SUI_ИнтеграцияВКонфигурацию.СсылкаПоИдентификаторуSimple(Выборка.id_series, Истина));
					ПараметрыМетода.Добавить(SUI_ИнтеграцияВКонфигурацию.СсылкаПоИдентификаторуSimple(Выборка.id_unit, Истина));
					ПараметрыМетода.Добавить(SUI_ИнтеграцияВКонфигурацию.СсылкаПоИдентификаторуSimple(Выборка.id_cell, Истина));
					ПараметрыМетода.Добавить(Данные.id_marking_code);
					ПараметрыМетода.Добавить(Данные.id_SSCC);
					
					ПараметрыМетода = Обработки.SUI_РедакторКода.ВыполнитьКодЧерезМетодКонфигурации(
						"SUI_ШтрихкодыУпаковок.СоздатьШтрихкодУпаковки", АлгоритмСоздания, ПараметрыМетода, Истина);
					
					Данные.id_marking_code = ПараметрыМетода[ПараметрыМетода.ВГраница() - 1];
					Данные.id_marking_code = SUI_ИнтеграцияВКонфигурацию.ИдентификаторSimpleПоСсылке(
						Данные.id_marking_code, Истина);
					
					Данные.id_SSCC = ПараметрыМетода[ПараметрыМетода.ВГраница()];
					Данные.id_SSCC = SUI_ИнтеграцияВКонфигурацию.ИдентификаторSimpleПоСсылке(Данные.id_SSCC, Истина);
					
					Если Не ЗначениеЗаполнено(Данные.id_marking_code) Тогда
						Данные.Вставить("СтатусОбработки", Перечисления.SUI_СтатусыОбработкиСтрок.Пропущена);
					Иначе
						Данные.Вставить("СтатусОбработки", Перечисления.SUI_СтатусыОбработкиСтрок.ОбработкаНеТребуется);
						Результат = Истина;
					КонецЕсли;
					
				Иначе
					Данные.Вставить("СтатусОбработки", Перечисления.SUI_СтатусыОбработкиСтрок.Пропущена);
				КонецЕсли;
				
				НаборЗаписей = РегистрыСведений.SUI_docs_tbl_barcodes.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.sid.Установить(Выборка.sid);
				НаборЗаписей.Отбор.sid_doc.Установить(Выборка.sid_doc);
				
				НаборЗаписей.Прочитать();
				
				Если НаборЗаписей.Количество() = 1 Тогда
					
					ЗаполнитьЗначенияСвойств(НаборЗаписей[0], Данные);
					НаборЗаписей[0].ДатаОбновления = ТекущаяДатаСеанса();
					
					НаборЗаписей.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
					НаборЗаписей.ОбменДанными.Загрузка = Истина;
					НаборЗаписей.Записать(Истина);
					
				КонецЕсли;
				
			КонецЦикла;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытияЗадание(НСтр("ru = 'Создание штрихкодов упаковок'")), , 
				Метаданные.ОбщиеМодули.SUI_ДокументыОбмена, , ИнформацияОбОшибке());
			ВызватьИсключение ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
		
		//@skip-check query-in-loop
		РезультатЗапроса = Запрос.Выполнить();
		
	КонецЦикла;

	Если ЗначениеЗаполнено(АдресРезультата) И ЭтоАдресВременногоХранилища(АдресРезультата) Тогда
		ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаданиеЗагрузитьИтогиПересчетаВДокументОбмена(Параметры, АдресРезультата = Неопределено) Экспорт
	
	Результат = Ложь;
	
	Если Не SUI_НастройкиМетаданныхСервер.ТаблицаИспользуется(Перечисления.SUI_ТаблицыИнтеграции.Номенклатура) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ШаблонИдентификатораSimple", SUI_ИнтеграцияВКонфигурациюКлиентСервер.ШаблонИдентификатораSimple());
	
	Если Параметры.Свойство("sid_doc") Тогда
		Запрос.УстановитьПараметр("sid_doc", Параметры.sid_doc);
	Иначе
		Запрос.УстановитьПараметр("sid_doc", Неопределено);
	КонецЕсли;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	SUI_docs_tbl_goods_delta.sid_doc,
		|	SUI_docs_tbl_goods_delta.id_good,
		|	SUI_docs_tbl_goods_delta.id_properties,
		|	SUI_docs_tbl_goods_delta.id_series,
		|	SUI_docs_tbl_goods_delta.id_cell,
		|	SUI_docs_tbl_goods_delta.id_unit,
		|	SUI_docs_tbl_goods_delta.id_price,
		|	SUI_docs_tbl_goods_delta.price,
		|	СУММА(SUI_docs_tbl_goods_delta.d_qtty) КАК d_qtty,
		|	SUI_docs_tbl_goods_delta.use_series,
		|	SUI_docs_tbl_goods_delta.ТипТаблицы
		|ПОМЕСТИТЬ втИтогиПересчета
		|ИЗ
		|	РегистрСведений.SUI_docs_tbl_goods_delta КАК SUI_docs_tbl_goods_delta
		|ГДЕ
		|	ВЫБОР
		|		КОГДА &sid_doc <> НЕОПРЕДЕЛЕНО
		|			ТОГДА SUI_docs_tbl_goods_delta.sid_doc = &sid_doc
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|СГРУППИРОВАТЬ ПО
		|	SUI_docs_tbl_goods_delta.sid_doc,
		|	SUI_docs_tbl_goods_delta.id_good,
		|	SUI_docs_tbl_goods_delta.id_properties,
		|	SUI_docs_tbl_goods_delta.id_series,
		|	SUI_docs_tbl_goods_delta.id_cell,
		|	SUI_docs_tbl_goods_delta.id_unit,
		|	SUI_docs_tbl_goods_delta.id_price,
		|	SUI_docs_tbl_goods_delta.price,
		|	SUI_docs_tbl_goods_delta.use_series,
		|	SUI_docs_tbl_goods_delta.ТипТаблицы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(SUI_docs_tbl_goods.sid, """") КАК sid,
		|	ЕСТЬNULL(SUI_docs_tbl_goods.sid_doc, втИтогиПересчета.sid_doc) КАК sid_doc,
		|	ЕСТЬNULL(SUI_docs_tbl_goods.id_good, втИтогиПересчета.id_good) КАК id_good,
		|	ЕСТЬNULL(SUI_docs_tbl_goods.id_properties, втИтогиПересчета.id_properties) КАК id_properties,
		|	ЕСТЬNULL(SUI_docs_tbl_goods.id_series, втИтогиПересчета.id_series) КАК id_series,
		|	ЕСТЬNULL(SUI_docs_tbl_goods.id_cell, втИтогиПересчета.id_cell) КАК id_cell,
		|	ЕСТЬNULL(SUI_docs_tbl_goods.id_unit, втИтогиПересчета.id_unit) КАК id_unit,
		|	ЕСТЬNULL(SUI_docs_tbl_goods.id_price, втИтогиПересчета.id_price) КАК id_price,
		|	ЕСТЬNULL(SUI_docs_tbl_goods.price, втИтогиПересчета.price) КАК price,
		|	втИтогиПересчета.d_qtty КАК qtty,
		|	ЕСТЬNULL(SUI_docs_tbl_goods.qtty_plan, 0) КАК qtty_plan,
		|	ЕСТЬNULL(SUI_docs_tbl_goods.use_series, втИтогиПересчета.use_series) КАК use_series,
		|	ЕСТЬNULL(SUI_docs_tbl_goods.ТипТаблицы, втИтогиПересчета.ТипТаблицы) КАК ТипТаблицы
		|ИЗ
		|	втИтогиПересчета КАК втИтогиПересчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.SUI_docs_tbl_goods КАК SUI_docs_tbl_goods
		|		ПО втИтогиПересчета.sid_doc = SUI_docs_tbl_goods.sid_doc
		|		И втИтогиПересчета.id_good = SUI_docs_tbl_goods.id_good
		|		И втИтогиПересчета.id_properties = SUI_docs_tbl_goods.id_properties
		|		И втИтогиПересчета.id_series = SUI_docs_tbl_goods.id_series
		|		И втИтогиПересчета.id_cell = SUI_docs_tbl_goods.id_cell
		|		И втИтогиПересчета.id_unit = SUI_docs_tbl_goods.id_unit
		|		И втИтогиПересчета.id_price = SUI_docs_tbl_goods.id_price
		|		И втИтогиПересчета.price = SUI_docs_tbl_goods.price
		|		И втИтогиПересчета.use_series = SUI_docs_tbl_goods.use_series
		|		И втИтогиПересчета.ТипТаблицы = SUI_docs_tbl_goods.ТипТаблицы";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			//@skip-check bsl-variable-name-invalid
			sid = Выборка.sid;
			
			Если Не ЗначениеЗаполнено(sid) Тогда
				sid = Строка(Новый УникальныйИдентификатор());
			КонецЕсли;
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.SUI_docs_tbl_goods");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
			ЭлементБлокировки.УстановитьЗначение("sid", sid);
			ЭлементБлокировки.УстановитьЗначение("sid_doc", Выборка.sid_doc);
			Блокировка.Заблокировать();
		
			НаборЗаписей = РегистрыСведений.SUI_docs_tbl_goods.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.sid.Установить(sid);
			НаборЗаписей.Отбор.sid_doc.Установить(Выборка.sid_doc);
			НаборЗаписей.Прочитать();
			
			Если НаборЗаписей.Количество() = 0 Тогда
				Запись = НаборЗаписей.Добавить();
			Иначе
				Для Индекс = 1 По НаборЗаписей.Количество() - 1 Цикл
					НаборЗаписей.Удалить(НаборЗаписей[Индекс]);
				КонецЦикла;
			КонецЕсли;
			
			Запись = НаборЗаписей[0];
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			Запись.sid = sid;
			
			НаборЗаписей.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
			НаборЗаписей.Записать(Истина);
			
		КонецЦикла;
		
		Результат = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытияЗадание(НСтр("ru = 'Загрузка итогов пересчета'")), , 
			Метаданные.ОбщиеМодули.SUI_ДокументыОбмена, , ИнформацияОбОшибке());
		ВызватьИсключение ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;

	Если ЗначениеЗаполнено(АдресРезультата) И ЭтоАдресВременногоХранилища(АдресРезультата) Тогда
		ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаданиеОбновитьТаблицыДокументаОбменаПослеЗаписиВДокумент(Параметры, АдресРезультата = Неопределено) Экспорт

	Результат = Ложь;
	
	ДокументСсылка = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ДокументСсылка");

	Таблицы = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ТаблицыДокументаОбмена", 
		Новый Соответствие(), Тип("Соответствие"));
		
	НачатьТранзакцию();
	
	Попытка
		
		Для Каждого Таблица Из Таблицы Цикл
		
			Если ТипЗнч(Таблица.Значение) <> Тип("ТаблицаЗначений") Или 
				Таблица.Значение.Количество() = 0 Или
				Таблица.Значение.Колонки.Найти("sid") = Неопределено Или
				Таблица.Значение.Колонки.Найти("sid_doc") = Неопределено Тогда
				Продолжить;
			КонецЕсли;
	
			Если Таблица.Ключ = Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары Или
				Таблица.Ключ = Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор Или
				Таблица.Ключ = Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение Тогда
				МенеджерОбъекта = РегистрыСведений.SUI_docs_tbl_goods;
			ИначеЕсли Таблица.Ключ = Перечисления.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок Тогда
				МенеджерОбъекта = РегистрыСведений.SUI_docs_tbl_barcodes;
			ИначеЕсли Таблица.Ключ = Перечисления.SUI_ТипыТаблицДокументовОбмена.Серии Тогда
				МенеджерОбъекта = РегистрыСведений.SUI_docs_tbl_series;
			Иначе
				Продолжить;
			КонецЕсли;
			
			КолонкиТаблицы = Новый Массив();
			Для Каждого Колонка Из Таблица.Значение.Колонки Цикл
				КолонкиТаблицы.Добавить(Колонка.Имя);
			КонецЦикла;
			КолонкиТаблицы = СтрСоединить(КолонкиТаблицы, ",");
			
			Для Каждого СтрокаТаблицы Из Таблица.Значение Цикл
					
				ДанныеСтроки = Новый Структура(КолонкиТаблицы);
				ЗаполнитьЗначенияСвойств(ДанныеСтроки, СтрокаТаблицы);
				SUI_ИнтеграцияВКонфигурацию.ПривестиСсылкиКИдентификаторамSimple(ДанныеСтроки);
				
				Если Таблица.Ключ = Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары Или
					Таблица.Ключ = Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор Или
					Таблица.Ключ = Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение Тогда
					ДанныеСтроки.Вставить("ТипТаблицы", Таблица.Ключ);
				КонецЕсли;
				
				НаборЗаписей = МенеджерОбъекта.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.sid.Установить(ДанныеСтроки.sid);
				НаборЗаписей.Отбор.sid_doc.Установить(ДанныеСтроки.sid_doc);

				Если ПроверитьСтрокуТаблицыДокументаПередЗаписью(ДанныеСтроки, Таблица.Ключ) Тогда
					
					НаборЗаписей.Прочитать();
					
					Если НаборЗаписей.Количество() = 0 Тогда
						ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), ДанныеСтроки);
					Иначе
						
						ИсключаемыеПоля = "sid,sid_doc";
						Если ДанныеСтроки.Свойство("barcode_from_scanner") Тогда
							ИсключаемыеПоля = ИсключаемыеПоля + "barcode_from_scanner";
						КонецЕсли;
						
						ЗаполнитьЗначенияСвойств(НаборЗаписей[0], ДанныеСтроки, , ИсключаемыеПоля);
						
					КонецЕсли;
					
				КонецЕсли;

				НаборЗаписей.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
				
				Если НаборЗаписей.ПроверитьЗаполнение() Тогда
					НаборЗаписей.Записать(Истина);
				КонецЕсли;
				
			КонецЦикла;
		
			Результат = Истина;
			
		КонецЦикла;

		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(
			ИмяСобытияЗадание(НСтр("ru = 'Обновление таблиц после записи документа'")), , 
			Метаданные.ОбщиеМодули.SUI_ДокументыОбмена, ДокументСсылка, ИнформацияОбОшибке());
		ВызватьИсключение ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	Если ЗначениеЗаполнено(АдресРезультата) И ЭтоАдресВременногоХранилища(АдресРезультата) Тогда
		ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаданиеЗагрузитьДокументОбменаВДокумент1СПослеЗагрузки(ДанныеДокументаОбмена) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	SUI_docs.sid,
		|	SUI_docs.id_doc КАК ДокументСсылка,
		|	SUI_docs.НастройкаДокумента
		|ИЗ
		|	РегистрСведений.SUI_docs КАК SUI_docs
		|ГДЕ
		|	ВЫБОР
		|		КОГДА &sid <> НЕОПРЕДЕЛЕНО
		|		ИЛИ &id_doc <> НЕОПРЕДЕЛЕНО
		|		ИЛИ &НастройкаДокумента <> НЕОПРЕДЕЛЕНО
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ
		|	И ВЫБОР
		|		КОГДА &sid <> НЕОПРЕДЕЛЕНО
		|			ТОГДА SUI_docs.sid = &sid
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|	И ВЫБОР
		|		КОГДА &id_doc <> НЕОПРЕДЕЛЕНО
		|			ТОГДА SUI_docs.id_doc = &id_doc
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|	И ВЫБОР
		|		КОГДА &НастройкаДокумента <> НЕОПРЕДЕЛЕНО
		|			ТОГДА SUI_docs.НастройкаДокумента = &НастройкаДокумента
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ";
	
	Если ДанныеДокументаОбмена.Свойство("sid") Тогда
		Запрос.УстановитьПараметр("sid", ДанныеДокументаОбмена.sid);
	Иначе
		Запрос.УстановитьПараметр("sid", Неопределено);
	КонецЕсли;
	
	Если ДанныеДокументаОбмена.Свойство("id_doc") Тогда
		Запрос.УстановитьПараметр("id_doc", ДанныеДокументаОбмена.id_doc);
	Иначе
		Запрос.УстановитьПараметр("id_doc", Неопределено);
	КонецЕсли;
	
	Если ДанныеДокументаОбмена.Свойство("НастройкаДокумента") Тогда
		Запрос.УстановитьПараметр("НастройкаДокумента", ДанныеДокументаОбмена.НастройкаДокумента);
	Иначе
		Запрос.УстановитьПараметр("НастройкаДокумента", Неопределено);
	КонецЕсли;

	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	ДокументОбмена = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Выборка);
	SUI_ИнтеграцияВКонфигурацию.ВосстановитьСсылкиИдентификаторовSimple(ДокументОбмена);
	
	Если Не ЗначениеЗаполнено(ДокументОбмена.ДокументСсылка) Тогда
		Возврат;
	КонецЕсли;

	НачатьТранзакцию();
	
	Попытка
		
		// Взять документ. Состояние документа ВРаботе
		СменитьСостояниеДокументаОбмена(Перечисления.SUI_СостоянияДокументовОбмена.ВРаботе, 
			ДокументОбмена.ДокументСсылка,
			ДокументОбмена.НастройкаДокумента, 
			Истина);
			
		// Подготовить данные документа обмена к загрузке в документ 1С
 		ДанныеДокумента = ДанныеДокументаОбменаКЗагрузкеВДокумент(ДокументОбмена);
		
		Если ДанныеДокумента <> Неопределено Тогда
			
			ОбъектДокумента = ДанныеДокумента.ДокументСсылка.ПолучитьОбъект();
			
			// Загрузить данные в объект документа
			ЗагрузитьТаблицыДокументаОбменаВДокументОбъект(ОбъектДокумента, ДанныеДокумента.НастройкаДокумента, 
				ДанныеДокумента.Таблицы, SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДокумента, "ТаблицаСерийБезНастройки"));
			
			// Выполнить запись объекта документа
			ЗаписатьДокументОбъект(ОбъектДокумента, ДанныеДокумента.НастройкаДокумента, ДанныеДокумента.Таблицы, Неопределено);
				
		КонецЕсли;
		
		ЗавершатьДокументОбмена = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОбмена.НастройкаДокумента, "ЗавершатьДокумент1СПослеПолученияИзТСД");
		
		Если ЗавершатьДокументОбмена Тогда 
			// Завершить документ. Состояние документа Завершен
			СменитьСостояниеДокументаОбмена(Перечисления.SUI_СостоянияДокументовОбмена.Завершен, 
				ДокументОбмена.ДокументСсылка,
				ДокументОбмена.НастройкаДокумента, 
				Истина); 
		Иначе 
			// Завершить документ. Состояние документа Загружен
			СменитьСостояниеДокументаОбмена(Перечисления.SUI_СостоянияДокументовОбмена.Загружен, 
				ДокументОбмена.ДокументСсылка,
				ДокументОбмена.НастройкаДокумента, 
				Истина);	
		КонецЕсли;
			
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(
			ИмяСобытияЗадание(НСтр("ru = 'Запись в документ 1С'")), , 
			Метаданные.ОбщиеМодули.SUI_ДокументыОбмена, ДокументОбмена.ДокументСсылка, ИнформацияОбОшибке());
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СоздатьДокументыНаОсновании(ДокументОснование, НастройкиСозданияДокументовНаОсновании, ТаблицыДокументаОбмена, 
	НастройкаТаблицаСозданияДокументов)
	
	Если Не ЗначениеЗаполнено(НастройкиСозданияДокументовНаОсновании) Тогда
		Возврат;	
	КонецЕсли;
	
	ЕстьРасхождения = Ложь;
	
	Для Каждого ТаблицаДокументаОбмена Из ТаблицыДокументаОбмена Цикл
		
		Если ТаблицаДокументаОбмена.Значение.Колонки.Найти("qtty_plan") = Неопределено Или
				ТаблицаДокументаОбмена.Значение.ВыгрузитьКолонку("qtty") = Неопределено Тогда
			Продолжить;	
		КонецЕсли;
		
		ЕстьРасхождения = Не ОбщегоНазначения.КоллекцииИдентичны(
		ТаблицаДокументаОбмена.Значение.ВыгрузитьКолонку("qtty_plan"), 
		ТаблицаДокументаОбмена.Значение.ВыгрузитьКолонку("qtty"), , , Истина);
		
		Если ЕстьРасхождения Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	
	Для Каждого СтрокаСозданияДокументов Из НастройкаТаблицаСозданияДокументов Цикл
		
		Попытка 
			Если (Не СтрокаСозданияДокументов.ПриРасхождении И Не ЕстьРасхождения) Или
				(СтрокаСозданияДокументов.ПриРасхождении И ЕстьРасхождения) Тогда
				
				ДокументОбъект = Документы[СтрокаСозданияДокументов.Значение].СоздатьДокумент(); 
				ДокументОбъект.Заполнить(ДокументОснование);
				
				ДокументОбъект.Дата = ТекущаяДатаСеанса();	
								
				АлгоритмОбработки = НастройкиСозданияДокументовНаОсновании.Получить(СтрокаСозданияДокументов.Значение);
				
				Если Не (АлгоритмОбработки = Неопределено Или АлгоритмОбработки = "") Тогда
					ВыполнитьПроизвольныйАлгоритм_СозданиеДокументаНаОсновании(АлгоритмОбработки, ДокументОбъект, ДокументОснование);	
				КонецЕсли;   
				
				ДокументОбъект.Записать(?(СтрокаСозданияДокументов.Проводить, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись)); 
				
			КонецЕсли;
		Исключение 
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'При выполнении алгоритма ""Создание документа на основании"" возникла исключительная ошибка:
				|%1.
				|Проверьте произвольный алгоритм в настройках документа обмена.'"), 
				ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));	
		КонецПопытки;
		
	КонецЦикла;

КонецПроцедуры

Функция ИмяСобытия(ВложенноеСобытие = "")
	Возврат SUI_ДокументыОбменаКлиентСервер.ИмяСобытия(ВложенноеСобытие);	
КонецФункции

Функция ИмяСобытияЗадание(ВложенноеСобытие = "")
	Возврат SUI_ДокументыОбменаКлиентСервер.ИмяСобытияЗадание(ВложенноеСобытие);	
КонецФункции

Функция КонтекстВызоваСтрокой(КонтекстВызова = "")
	
	Если ЗначениеЗаполнено(КонтекстВызова) Тогда
		Возврат КонтекстВызова + " (" + Метаданные.ОбщиеМодули.SUI_ДокументыОбмена.ПолноеИмя() + ")";
	Иначе
		Возврат Метаданные.ОбщиеМодули.SUI_ДокументыОбмена.ПолноеИмя();
	КонецЕсли;
	
КонецФункции

// Идентификатор документа по параметру.
// 
// Параметры:
//  Документ - ДокументСсылка, Строка, УникальныйИдентификатор - Документ ссылка, 
//  	идентификатор Simple документа или SID документа обмена.
//  КонтекстВызова - Строка - например, имя процедуры или функции, в которой выполняется проверка
//  
// Возвращаемое значение:
//  Структура - Идентификатор документа по параметру:
// * SID - Строка - Идентификатор SID, если параметр уникальный идентификатор
//	* ID - Строка - Идентификатор Simple, если параметр идентификатор Simple или ДокументСсылка
//@skip-check constructor-function-return-section
Функция ИдентификаторДокументаПоПараметру(Документ, КонтекстВызова = "")

	Если ТипЗнч(Документ) = Тип("Строка") Тогда

		Если СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(Документ) Тогда
			Возврат Новый Структура("SID", Документ);
		Иначе
			
			ОбщегоНазначенияКлиентСервер.Проверить(
			SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(Документ),
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Идентификатор документа обмена (%1) не является идентификатором Simple'"), Документ),
			КонтекстВызоваСтрокой(КонтекстВызова));
			
			Возврат Новый Структура("ID", Документ);
			
		КонецЕсли;

	ИначеЕсли ТипЗнч(Документ) = Тип("УникальныйИдентификатор") Тогда
		Возврат Новый Структура("SID", Строка(Документ));
	Иначе
		
		ОбщегоНазначенияКлиентСервер.Проверить(
			SUI_ОбщегоНазначения.ЭтоСсылкаДокумента(Документ),
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Значение (%1) не является ссылкой документа'"), Документ),
			КонтекстВызоваСтрокой(КонтекстВызова));
			
		ОбщегоНазначенияКлиентСервер.Проверить(
			ОбщегоНазначения.СсылкаСуществует(Документ),
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Ссылка документа (%1) не существует'"), Документ),
			КонтекстВызоваСтрокой(КонтекстВызова));

		Возврат Новый Структура("ID", 
			SUI_ИнтеграцияВКонфигурацию.ИдентификаторSimpleПоСсылке(Документ, Истина));
		
	КонецЕсли;
	
КонецФункции

// Настройка документа по параметру.
// 
// Параметры:
//  НастройкаДокумента - СправочникСсылка.SUI_НастройкиДокументов - Настройка документа
//  НеПустая - Булево - Не пустая ссылка настройки
//  КонтекстВызова - Строка - например, имя процедуры или функции, в которой выполняется проверка
// 
// Возвращаемое значение:
//  СправочникСсылка.SUI_НастройкиДокументов - Настройка документа
Функция НастройкаДокументаПоПараметру(НастройкаДокумента, НеПустая = Истина, КонтекстВызова = "")
	
	ОбщегоНазначенияКлиентСервер.Проверить(
		ТипЗнч(НастройкаДокумента) = Тип("СправочникСсылка.SUI_НастройкиДокументов"),
		НСтр("ru = 'Значение не является настройкой документа обмена'"),
		КонтекстВызоваСтрокой(КонтекстВызова));
	
	Если НеПустая Тогда
		
		ОбщегоНазначенияКлиентСервер.Проверить(
		Не НастройкаДокумента.Пустая(),
		НСтр("ru = 'Пустая ссылка настройки документа'"),
		КонтекстВызоваСтрокой(КонтекстВызова));
		
	КонецЕсли;
	
	Возврат НастройкаДокумента;
	
КонецФункции

Функция ПолучитьSIDДокументовОбмена(Документ, НастройкаДокумента = Неопределено) Экспорт
	
	SIDДокументовОбмена = Новый Массив();
	Идентификаторы 		= Новый Массив();
	НастройкиДокументов = Новый Массив();

	Если ТипЗнч(Документ) = Тип("Массив") Тогда
		Идентификаторы = Документ;
	ИначеЕсли ТипЗнч(Документ) = Тип("СписокЗначений") Тогда
		Идентификаторы = Документ.ВыгрузитьЗначения();
	Иначе
		Идентификаторы.Добавить(Документ);
	КонецЕсли;
	
	Идентификаторы = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Идентификаторы);
	
	Если ТипЗнч(НастройкаДокумента) = Тип("Массив") Тогда
		НастройкиДокументов = НастройкаДокумента;
	ИначеЕсли ТипЗнч(НастройкаДокумента) = Тип("СписокЗначений") Тогда
		НастройкиДокументов = НастройкаДокумента.ВыгрузитьЗначения();
	ИначеЕсли ЗначениеЗаполнено(НастройкаДокумента) Тогда
		НастройкиДокументов.Добавить(НастройкаДокумента);
	КонецЕсли;

	НастройкиДокументов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(НастройкиДокументов);
	
	ОбщегоНазначенияКлиентСервер.Проверить(
		(ЗначениеЗаполнено(Идентификаторы) Или ЗначениеЗаполнено(НастройкиДокументов)),
		НСтр("ru = 'Не переданны параметры для получения SID документов обмена.'"),
		КонтекстВызоваСтрокой("ПолучитьSIDДокументовОбмена"));
	
	//@skip-check bsl-variable-name-invalid
	ID = Новый Массив();
	SID = Новый Массив();
	Настройки = Новый Массив();
	
	Для Каждого Идентификатор Из Идентификаторы Цикл
		
		ИдентификаторДокумента = ИдентификаторДокументаПоПараметру(Идентификатор, "ПолучитьSIDДокументовОбмена");
	
		Если ИдентификаторДокумента.Свойство("ID") Тогда
			ID.Добавить(ИдентификаторДокумента.ID);
		ИначеЕсли ИдентификаторДокумента.Свойство("SID") Тогда
			SID.Добавить(ИдентификаторДокумента.SID);
		КонецЕсли;
	
	КонецЦикла;
	
	Для Каждого НастройкаДокумента Из НастройкиДокументов Цикл
		Настройки.Добавить(НастройкаДокументаПоПараметру(НастройкаДокумента, , "ПолучитьSIDДокументовОбмена"));
	КонецЦикла;
	
	Запрос = Новый Запрос;
	
	//@skip-check bsl-variable-name-invalid
	мсвУсловия = Новый Массив();
	Если ЗначениеЗаполнено(ID) Тогда
		Запрос.УстановитьПараметр("ID", ID);
		мсвУсловия.Добавить("SUI_docs.id_doc В (&ID)");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(SID) Тогда
		Запрос.УстановитьПараметр("SID", SID);
		мсвУсловия.Добавить("SUI_docs.sid В (&SID)");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Настройки) Тогда
		Запрос.УстановитьПараметр("Настройки", Настройки);
		мсвУсловия.Добавить("SUI_docs.НастройкаДокумента В (&Настройки)");
	КонецЕсли;

	Если Запрос.Параметры.Количество() > 0 Тогда

		Запрос.Текст =
			"ВЫБРАТЬ
			|	SUI_docs.sid
			|ИЗ
			|	РегистрСведений.SUI_docs КАК SUI_docs
			|ГДЕ
			|	" + СтрСоединить(мсвУсловия, Символы.ПС + Символы.Таб + "И ");
		
		УстановитьПривилегированныйРежим(Истина);
		SIDДокументовОбмена = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("sid");
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
	Возврат SIDДокументовОбмена;
	
КонецФункции

Процедура ЗарегистрироватьИзмененияДокументаОбмена(НаборЗаписей)
	
	Если НаборЗаписей.ДополнительныеСвойства.Свойство("НеРегистрироватьИзменения") Или
		Не НаборЗаписей.ДополнительныеСвойства.Свойство("РегистрироватьИзменения") Тогда
		Возврат;
	КонецЕсли;
	
	Если НаборЗаписей.Количество() <> 1 Тогда
		Возврат;
	КонецЕсли;
	
	Если НаборЗаписей[0].Состояние = Перечисления.SUI_СостоянияДокументовОбмена.Отменен Тогда 
		УдалитьРегистрациюИзмененийДокументаОбмена(НаборЗаписей);
		Возврат;
	КонецЕсли;
	
	Если НаборЗаписей[0].Состояние = Перечисления.SUI_СостоянияДокументовОбмена.Завершен Тогда 
		НаборЗаписей.ДополнительныеСвойства.Вставить("МобильныеУстройства", SUI_МобильныеУстройстваСервер.ВсеМобильныеУстройства());
		Если НаборЗаписей.ДополнительныеСвойства.Свойство("МобильноеУстройство") Тогда
			НаборЗаписей.ДополнительныеСвойства.Удалить("МобильноеУстройство");
		КонецЕсли;
	КонецЕсли;
	
	Если НаборЗаписей[0].Состояние <> Перечисления.SUI_СостоянияДокументовОбмена.КВыгрузке И
		НаборЗаписей[0].Состояние <> Перечисления.SUI_СостоянияДокументовОбмена.Загружен И
		НаборЗаписей[0].Состояние <> Перечисления.SUI_СостоянияДокументовОбмена.ВРаботе И
		НаборЗаписей[0].Состояние <> Перечисления.SUI_СостоянияДокументовОбмена.Завершен Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НастройкаДокумента", НаборЗаписей[0].НастройкаДокумента);
	Запрос.УстановитьПараметр("МобильныеУстройства", SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		НаборЗаписей.ДополнительныеСвойства, "МобильныеУстройства", Новый Массив(), Тип("Массив")));
	Запрос.УстановитьПараметр("МобильноеУстройство", SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		НаборЗаписей.ДополнительныеСвойства, "МобильноеУстройство"));
	Запрос.УстановитьПараметр("ИсключитьМобильноеУстройство", SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		НаборЗаписей.ДополнительныеСвойства, "ИсключитьМобильноеУстройство"));
	Запрос.Текст =
		"ВЫБРАТЬ
		|	SUI_МобильныеУстройства.Ссылка
		|ИЗ
		|	РегистрСведений.SUI_НастройкиДокументовМобильныхУстройств КАК SUI_НастройкиДокументовМобильныхКлиентов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланОбмена.SUI_МобильныеУстройства КАК SUI_МобильныеУстройства
		|		ПО SUI_МобильныеУстройства.Ссылка = SUI_НастройкиДокументовМобильныхКлиентов.МобильноеУстройство
		|ГДЕ
		|	SUI_НастройкиДокументовМобильныхКлиентов.НастройкаДокумента = &НастройкаДокумента
		|	И НЕ SUI_МобильныеУстройства.ПометкаУдаления
		|	И НЕ SUI_НастройкиДокументовМобильныхКлиентов.НастройкаДокумента.ПометкаУдаления
		|	И SUI_НастройкиДокументовМобильныхКлиентов.НастройкаДокумента.Используется
		|	И НЕ SUI_МобильныеУстройства.ЭтотУзел
		|	И #УсловиеПоМобильномуУстройству
		|	И ВЫБОР
		|		КОГДА &ИсключитьМобильноеУстройство <> НЕОПРЕДЕЛЕНО
		|			И &ИсключитьМобильноеУстройство <> ЗНАЧЕНИЕ(ПланОбмена.SUI_МобильныеУстройства.ПустаяСсылка)
		|			ТОГДА SUI_МобильныеУстройства.Ссылка <> &ИсключитьМобильноеУстройство
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ";
	
	Если ЗначениеЗаполнено(Запрос.Параметры.МобильноеУстройство) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#УсловиеПоМобильномуУстройству", "SUI_МобильныеУстройства.Ссылка = &МобильноеУстройство");
	ИначеЕсли ЗначениеЗаполнено(Запрос.Параметры.МобильныеУстройства) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#УсловиеПоМобильномуУстройству", "SUI_МобильныеУстройства.Ссылка В (&МобильныеУстройства)");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#УсловиеПоМобильномуУстройству", "ИСТИНА");
	КонецЕсли;
	
	МобильныеУстройства = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Если МобильныеУстройства.Количество() > 0 Тогда
		
		Попытка
			ПланыОбмена.ЗарегистрироватьИзменения(МобильныеУстройства, НаборЗаписей);
		Исключение
			SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(), , 
				Метаданные.ОбщиеМодули.SUI_ДокументыОбмена, , ИнформацияОбОшибке());
			ВызватьИсключение СтрШаблон(НСтр("ru = 'Возникла исключительная ошибка при регистрации изменений на мобильных устройствах документа обмена
				|%1'"), ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьРегистрациюИзмененийДокументаОбмена(Знач НаборыЗаписей, МобильныеУстройства = Неопределено)
	
	Если МобильныеУстройства = Неопределено тогда
		ВсеМобильныеУстройства = SUI_МобильныеУстройстваСервер.ВсеМобильныеУстройства(Истина, Ложь);
	Иначе
		ВсеМобильныеУстройства = МобильныеУстройства;
	КонецЕсли;
	
	Если ТипЗнч(НаборыЗаписей) = Тип("РегистрСведенийНаборЗаписей.SUI_docs") Тогда
		НаборыЗаписей = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(НаборыЗаписей);
	КонецЕсли;
	
	Если ВсеМобильныеУстройства.Количество() > 0 Тогда

		Попытка
			
			Если ТипЗнч(НаборыЗаписей) <> Тип("Массив") Тогда
				
				Для Каждого МобильноеУстройство Из ВсеМобильныеУстройства Цикл
					ПланыОбмена.УдалитьРегистрациюИзменений(МобильноеУстройство, Метаданные.РегистрыСведений.SUI_docs);
				КонецЦикла;
				
			Иначе
				
				Для Каждого НаборЗаписей Из НаборыЗаписей Цикл
					ПланыОбмена.УдалитьРегистрациюИзменений(ВсеМобильныеУстройства, НаборЗаписей);
				КонецЦикла;
				
			КонецЕсли;

		Исключение
			SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(), , 
				Метаданные.ОбщиеМодули.SUI_ДокументыОбмена, , ИнформацияОбОшибке());
			ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Возникла исключительная ошибка при удалении регистрации изменений на мобильных устройствах документа обмена
				|%1'"), ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	КонецЕсли;
		
КонецПроцедуры

#Область ДанныеДокументаОбмена

Функция СформироватьДанныеДокументаОбменаИзДокумента(ДокументСсылка, НастройкаДокумента, НовоеСостояние = Неопределено)
	
	ДанныеДокумента = Новый Структура();
	ДанныеДокумента.Вставить("ДокументОбменаСуществует", Ложь);
	
	Идентификатор = ИдентификаторДокументаПоПараметру(ДокументСсылка, "СформироватьДанныеДокументаОбменаИзСсылкиДокумента");
	
	Если Не Идентификатор.Свойство("ID") Или Не ЗначениеЗаполнено(Идентификатор.ID) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НастройкиДокумента = SUI_НастройкиДокументовСервер.СформироватьНастройкиДокумента(НастройкаДокумента);
	
	Если Не ЗначениеЗаполнено(НастройкиДокумента) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СерииИспользуются = SUI_НастройкиМетаданныхСервер.ТаблицаИспользуется(Перечисления.SUI_ТаблицыИнтеграции.СерииНоменклатуры);
	
	// Получение признака маркировки Начало
	Если НастройкиДокумента.ИспользуетсяМаркировка Тогда
		АлгоритмыПризнакМаркировки = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НастройкиДокумента, 
			"ДополнительныеНастройки." + SUI_ДокументыОбменаКлиентСервер.ДополнительныеНастройки_КлючАлгоритмыПризнакаМаркировки(),
			Новый Соответствие(), Тип("Соответствие"));
	Иначе
		АлгоритмыПризнакМаркировки = Новый Соответствие();
	КонецЕсли;
	// Получение признака маркировки Конец
	
	// Получение статуса указания серий Начало
	АлгоритмыСтатусУказанияСерий = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НастройкиДокумента, 
			"ДополнительныеНастройки." + SUI_ДокументыОбменаКлиентСервер.ДополнительныеНастройки_КлючАлгоритмыПолученияСтатусаУказанияСерии(),
			Новый Соответствие(), Тип("Соответствие"));
	// Получение статуса указания серий Конец
	
	// Дополнительные реквизиты Начало
	Если ПолучитьФункциональнуюОпцию("SUI_ИспользоватьДополнительныеРеквизитыТаблиц") Тогда
		АлгоритмыДополнительныхРеквизитов = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НастройкиДокумента, 
			"ДополнительныеНастройки." + SUI_ДокументыОбменаКлиентСервер.ДополнительныеНастройки_КлючАлгоритмыДополнительныхРеквизитов(),
			Новый Соответствие(), Тип("Соответствие"));
		ТаблицаВыводаДополнительныхПолей = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НастройкиДокумента, 
			"ТаблицаВыводаДополнительныхПолей", Новый ТаблицаЗначений, Тип("ТаблицаЗначений"));
	Иначе
		АлгоритмыДополнительныхРеквизитов = Новый Соответствие();
		ТаблицаВыводаДополнительныхПолей = Новый ТаблицаЗначений;
	КонецЕсли;
	// Дополнительные реквизиты Конец
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	SUI_docs.sid,
		|	SUI_docs.Состояние
		|ИЗ
		|	РегистрСведений.SUI_docs КАК SUI_docs
		|ГДЕ
		|	SUI_docs.id_doc = &id_doc
		|	И SUI_docs.НастройкаДокумента = &НастройкаДокумента";
	
	Запрос.УстановитьПараметр("id_doc", Идентификатор.ID);
	Запрос.УстановитьПараметр("НастройкаДокумента", НастройкаДокумента);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если РезультатЗапроса.Пустой() Тогда
		ДанныеДокумента.Вставить("sid", Строка(Новый УникальныйИдентификатор()));
		ДанныеДокумента.Вставить("Состояние");
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ДанныеДокумента.Вставить("sid", Выборка.sid);
		ДанныеДокумента.Вставить("Состояние", Выборка.Состояние);
		ДанныеДокумента.ДокументОбменаСуществует = Истина;
	КонецЕсли;

	ДанныеДокумента.Вставить("id_doc", Идентификатор.ID);
	ДанныеДокумента.Вставить("НастройкаДокумента", НастройкаДокумента);
	ДанныеДокумента.Вставить("doc_type", НастройкиДокумента.ИмяДокументаМП);
	ДанныеДокумента.Вставить("КонтролироватьДокумент", НастройкиДокумента.КонтролироватьДокумент);
	ДанныеДокумента.Вставить("ЭтоДокументАдресногоХранения", НастройкиДокумента.ЭтоДокументАдресногоХранения);
	// artem - 29.08.24 - B119267 -
	ДанныеДокумента.Вставить("Агрегация", НастройкиДокумента.Агрегация);
	
	// Получение признака маркировки Начало
	ДобавитьПризнакИспользованияМаркировкиВПриемник(ДанныеДокумента, 
		ПолучитьАлгоритмИзКоллекции(АлгоритмыПризнакМаркировки, "ИзДокумента"), 
		Новый Структура("ДокументСсылка", ДокументСсылка));
	// Получение признака маркировки Конец 
	
	// Дополнительные реквизиты Начало
	SUI_ДополнительныеРеквизитыТаблиц.ДобавитьДополнительныеРеквизитыВПриемник(ДанныеДокумента, 
		ПолучитьАлгоритмИзКоллекции(АлгоритмыДополнительныхРеквизитов, "ИзДокумента"), 
		Новый Структура("ДокументСсылка", ДокументСсылка),,ТаблицаВыводаДополнительныхПолей);
	// Дополнительные реквизиты Конец
	
	// Штрихкод документа Начало
	ДанныеДокумента.Вставить("barcode", "");
	ВыполнитьПроизвольныйАлгоритм_ПолучитьШтрихкодДокумента(
		ПолучитьФункциональнуюОпцию("SUI_АлгоритмПолученияШтрихкодаДокумента"),
		ДокументСсылка, ДанныеДокумента.barcode);
	// Штрихкод документа Конец
	
	// Признак сбора ШК Начало
	Если ДокументСсылка.Метаданные() = Метаданные.Документы.SUI_СборШтрихкодов Тогда
		ДанныеДокумента.Вставить("is_barc_flow", Истина);
	Иначе
		ДанныеДокумента.Вставить("is_barc_flow", НастройкиДокумента.СборШтрихкодов);
	КонецЕсли;
	// Признак сбора ШК Конец
	
	// Реквизиты документа >>>
	//@skip-check bsl-variable-name-invalid
	мсвВыбрать = Новый Массив();
	//@skip-check bsl-variable-name-invalid
	сткПараметры = Новый Структура();
	Для Каждого НастройкаРеквизита Из НастройкиДокумента.Реквизиты Цикл
		
		Если ЗначениеЗаполнено(НастройкаРеквизита.Значение) Тогда
			
			Если НастройкаРеквизита.Значение.ПостоянноеЗначение <> Неопределено Тогда
				мсвВыбрать.Добавить("&" + НастройкаРеквизита.Ключ + " КАК " + НастройкаРеквизита.Ключ);
				сткПараметры.Вставить(НастройкаРеквизита.Ключ, НастройкаРеквизита.Значение.ПостоянноеЗначение); 
			ИначеЕсли НастройкаРеквизита.Значение.Имя <> Неопределено Тогда
				мсвВыбрать.Добавить(НастройкаРеквизита.Значение.Имя + " КАК " + НастройкаРеквизита.Ключ);
			Иначе
				мсвВыбрать.Добавить("НЕОПРЕДЕЛЕНО КАК " + НастройкаРеквизита.Ключ);
			КонецЕсли;

		Иначе
			мсвВыбрать.Добавить("НЕОПРЕДЕЛЕНО КАК " + НастройкаРеквизита.Ключ);
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	Запрос.УстановитьПараметр("СостояниеДокументаОбмена", ДанныеДокумента.Состояние);
	
	Для Каждого сткПараметр Из сткПараметры Цикл
		Запрос.УстановитьПараметр(сткПараметр.Ключ, сткПараметр.Значение);
	КонецЦикла;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ПометкаУдаления 
		|			И &СостояниеДокументаОбмена <> ЗНАЧЕНИЕ(Перечисление.SUI_СостоянияДокументовОбмена.Завершен)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.SUI_СостоянияДокументовОбмена.Отменен)
		|		ИНАЧЕ &СостояниеДокументаОбмена
		|	КОНЕЦ КАК Состояние,
		|	" + СтрСоединить(мсвВыбрать, "," + Символы.ПС + Символы.Таб) + "
		|ИЗ
		|	" + ДокументСсылка.Метаданные().ПолноеИмя() + "
		|ГДЕ
		|	Ссылка = &ДокументСсылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		ДанныеДокумента.Вставить(Колонка.Имя);
	КонецЦикла;
	
	Если Не ДанныеДокумента.Свойство("id_countragents") Тогда
		ДанныеДокумента.Вставить("id_countragents");
	КонецЕсли;
	
	Если Не ДанныеДокумента.Свойство("id_warehouse") Тогда
		ДанныеДокумента.Вставить("id_warehouse");
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(ДанныеДокумента, Выборка);

	SUI_ИнтеграцияВКонфигурацию.ПривестиСсылкиКИдентификаторамSimple(ДанныеДокумента, "НастройкаДокумента, Состояние");
	
	Если ДанныеДокумента.Состояние <> Перечисления.SUI_СостоянияДокументовОбмена.Отменен Тогда
		
		Если ТипЗнч(НовоеСостояние) = Тип("ПеречислениеСсылка.SUI_СостоянияДокументовОбмена") И
			ЗначениеЗаполнено(НовоеСостояние) Тогда
			ДанныеДокумента.Вставить("Состояние", НовоеСостояние);
		ИначеЕсли Не ЗначениеЗаполнено(ДанныеДокумента.Состояние) Тогда
			ДанныеДокумента.Состояние = НастройкиДокумента.СостояниеДокументаПоУмолчанию;
		КонецЕсли;
		
	КонецЕсли;
	
	// Табличные части документа >>>
	ДанныеДокумента.Вставить("Таблицы", Новый Соответствие());
	
	// Таблица Штрихкоды упаковок
	НастройкаТЧ = НастройкиДокумента.ТабличныеЧасти.Получить(Перечисления.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок);
	Если ЗначениеЗаполнено(НастройкаТЧ) Тогда
		
		НастройкаРеквизита = НастройкаТЧ.Элементы.Получить("id_marking_code");
		
		Если ЗначениеЗаполнено(НастройкаРеквизита) И 
			(НастройкаРеквизита.ПостоянноеЗначение <> Неопределено Или
			НастройкаРеквизита.Имя <> Неопределено) Тогда	
			
			Запрос = Новый Запрос();
			Если НастройкаРеквизита.ПостоянноеЗначение <> Неопределено Тогда
				Запрос.УстановитьПараметр("&id_marking_code", НастройкаРеквизита.ПостоянноеЗначение);
			КонецЕсли;
			Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
			Запрос.Текст = "
			|ВЫБРАТЬ
			|	НомерСтроки КАК НомерСтроки,
			|	" + ?(НастройкаРеквизита.ПостоянноеЗначение <> Неопределено, "&id_marking_code", НастройкаРеквизита.Имя) + " КАК id
			|ИЗ
			|	" + ДокументСсылка.Метаданные().ПолноеИмя() + "." + НастройкаТЧ.ИмяТабличнойЧасти + "
			|ГДЕ
			|	Ссылка = &ДокументСсылка";
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Если Не РезультатЗапроса.Пустой() Тогда
				
				ИдентификаторыШтрихкодовУпаковок = Новый ТаблицаЗначений();
				ИдентификаторыШтрихкодовУпаковок.Колонки.Добавить("НомерСтроки", SUI_ОбщегоНазначения.ОписаниеТипаЧисло(6));
				ИдентификаторыШтрихкодовУпаковок.Колонки.Добавить("id", SUI_ОбщегоНазначения.ОписаниеТипаСтрока(69));
				
				Выборка = РезультатЗапроса.Выбрать();
				Пока Выборка.Следующий() Цикл
					СтрокаИдентификаторыШтрихкодовУпаковок = ИдентификаторыШтрихкодовУпаковок.Добавить();
					СтрокаИдентификаторыШтрихкодовУпаковок.НомерСтроки = Выборка.НомерСтроки;
					СтрокаИдентификаторыШтрихкодовУпаковок.id = SUI_ИнтеграцияВКонфигурацию.ИдентификаторSimpleПоСсылке(Выборка.id, Истина)
				КонецЦикла;

				Запрос = Новый Запрос;
				Запрос.УстановитьПараметр("sid_doc", ДанныеДокумента.sid);
				Запрос.УстановитьПараметр("ИдентификаторыШтрихкодовУпаковок", ИдентификаторыШтрихкодовУпаковок);
				Запрос.Текст =
					"ВЫБРАТЬ
					|	ИдентификаторыШтрихкодовУпаковок.НомерСтроки,
					|	ИдентификаторыШтрихкодовУпаковок.id
					|ПОМЕСТИТЬ втИдентификаторыШтрихкодовУпаковок
					|ИЗ
					|	&ИдентификаторыШтрихкодовУпаковок КАК ИдентификаторыШтрихкодовУпаковок
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	&sid_doc КАК sid_doc,
					|	втИдентификаторыШтрихкодовУпаковок.НомерСтроки,
					|	SUI_tbl_marking_codes.id КАК id_marking_code,
					|	SUI_tbl_marking_codes.id_good КАК id_good,
					|	SUI_tbl_marking_codes.id_property КАК id_property,
					|	SUI_tbl_marking_codes.id_series КАК id_series,
					|	SUI_tbl_marking_codes.id_unit КАК id_unit,
					|	SUI_tbl_marking_codes.mark_code КАК mark_code,
					|	ЗНАЧЕНИЕ(Перечисление.SUI_СтатусыОбработкиСтрок.ОбработкаНеТребуется) КАК СтатусОбработки
					|ПОМЕСТИТЬ втШтрихкодыУпаковокДокумента
					|ИЗ
					|	втИдентификаторыШтрихкодовУпаковок КАК втИдентификаторыШтрихкодовУпаковок
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.SUI_tbl_marking_codes КАК SUI_tbl_marking_codes
					|		ПО втИдентификаторыШтрихкодовУпаковок.id = SUI_tbl_marking_codes.id
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|УНИЧТОЖИТЬ втИдентификаторыШтрихкодовУпаковок
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ЕСТЬNULL(barcodesПоИдентификатору.sid, ЕСТЬNULL(barcodesПоЗначениюШтрихкода.sid, """")) КАК sid,
					|	втШтрихкодыУпаковокДокумента.sid_doc,
					|	втШтрихкодыУпаковокДокумента.НомерСтроки,
					|	втШтрихкодыУпаковокДокумента.id_marking_code,
					|	втШтрихкодыУпаковокДокумента.id_good,
					|	втШтрихкодыУпаковокДокумента.id_property,
					|	втШтрихкодыУпаковокДокумента.id_series,
					|	втШтрихкодыУпаковокДокумента.id_unit,
					|	втШтрихкодыУпаковокДокумента.mark_code,
					|	втШтрихкодыУпаковокДокумента.СтатусОбработки
					|ИЗ
					|	втШтрихкодыУпаковокДокумента КАК втШтрихкодыУпаковокДокумента
					|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.SUI_docs_tbl_barcodes КАК barcodesПоИдентификатору
					|		ПО втШтрихкодыУпаковокДокумента.sid_doc = barcodesПоИдентификатору.sid_doc
					|		И втШтрихкодыУпаковокДокумента.СтатусОбработки = barcodesПоИдентификатору.СтатусОбработки
					|		И втШтрихкодыУпаковокДокумента.id_marking_code = barcodesПоИдентификатору.id_marking_code
					|		И втШтрихкодыУпаковокДокумента.id_good = barcodesПоИдентификатору.id_good
					|		И втШтрихкодыУпаковокДокумента.id_property = barcodesПоИдентификатору.id_property
					|		И втШтрихкодыУпаковокДокумента.id_series = barcodesПоИдентификатору.id_series
					|		И втШтрихкодыУпаковокДокумента.id_unit = barcodesПоИдентификатору.id_unit
					|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.SUI_docs_tbl_barcodes КАК barcodesПоЗначениюШтрихкода
					|		ПО втШтрихкодыУпаковокДокумента.sid_doc = barcodesПоЗначениюШтрихкода.sid_doc
					|		И втШтрихкодыУпаковокДокумента.СтатусОбработки <> barcodesПоЗначениюШтрихкода.СтатусОбработки
					|		И втШтрихкодыУпаковокДокумента.mark_code = barcodesПоЗначениюШтрихкода.mark_code
					|		И втШтрихкодыУпаковокДокумента.id_good = barcodesПоЗначениюШтрихкода.id_good
					|		И втШтрихкодыУпаковокДокумента.id_property = barcodesПоЗначениюШтрихкода.id_property
					|		И втШтрихкодыУпаковокДокумента.id_series = barcodesПоЗначениюШтрихкода.id_series
					|		И втШтрихкодыУпаковокДокумента.id_unit = barcodesПоЗначениюШтрихкода.id_unit";
					
				РезультатЗапроса = Запрос.Выполнить();
				
				ТаблицаДанных = ТаблицаШтрихкодыДокументаОбмена();
				
				Если Не РезультатЗапроса.Пустой() Тогда
					
					// Дополнительные реквизиты Начало
					ДополнительныеРеквизиты_Алгоритм = ПолучитьАлгоритмИзКоллекции(АлгоритмыДополнительныхРеквизитов, 
						Перечисления.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок);
					// Дополнительные реквизиты Конец
					
					// Выборка строк из ТЧ Начало
					Если ЗначениеЗаполнено(ДополнительныеРеквизиты_Алгоритм) Тогда
						РезультатВыборкиТЧ = ПолучитьВыборкуТабличнойЧастиДокумента(ДокументСсылка, НастройкаТЧ.ИмяТабличнойЧасти);
					Иначе
						РезультатВыборкиТЧ = Неопределено;
					КонецЕсли;
					// Выборка строк из ТЧ Конец
				
					ИменаКолонокЗапроса = SUI_ОбщегоНазначения.ПолучитьИменаКолонокРезультатаЗапроса(РезультатЗапроса);
					
					Выборка = РезультатЗапроса.Выбрать();
					
					Пока Выборка.Следующий() Цикл
						
						ДанныеЗапроса = Новый Структура(ИменаКолонокЗапроса);
						ЗаполнитьЗначенияСвойств(ДанныеЗапроса, Выборка);
						
						Если Не ЗначениеЗаполнено(ДанныеЗапроса.sid) Тогда
							ДанныеЗапроса.sid = Строка(Новый УникальныйИдентификатор());
						КонецЕсли;
						
						SUI_ИнтеграцияВКонфигурацию.ПривестиСсылкиКИдентификаторамSimple(ДанныеЗапроса, "СтатусОбработки");
						
						// Параметры алгоритма строки ТЧ Начало
						ПараметрыАлгоритма = Неопределено;
						Если РезультатВыборкиТЧ <> Неопределено Тогда
							РезультатВыборкиТЧ.Выборка.Сбросить();
							Если РезультатВыборкиТЧ.Выборка.НайтиСледующий(Новый Структура("НомерСтроки", Выборка.НомерСтроки)) Тогда
								ПараметрыАлгоритма = Новый Структура("ДанныеСтроки", Новый Структура(РезультатВыборкиТЧ.Колонки));
								ЗаполнитьЗначенияСвойств(ПараметрыАлгоритма.ДанныеСтроки, РезультатВыборкиТЧ.Выборка);
							КонецЕсли;
						КонецЕсли;
						// Параметры алгоритма строки ТЧ Конец
						
						// Дополнительные реквизиты Начало
						SUI_ДополнительныеРеквизитыТаблиц.ДобавитьДополнительныеРеквизитыВПриемник(ДанныеЗапроса, 
							ДополнительныеРеквизиты_Алгоритм, ПараметрыАлгоритма);
						// Дополнительные реквизиты Конец
						
						ЗаполнитьЗначенияСвойств(ТаблицаДанных.Добавить(), ДанныеЗапроса);
						
					КонецЦикла;
				
				КонецЕсли;
				
				ДанныеДокумента.Таблицы.Вставить(Перечисления.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок, ТаблицаДанных);
				
			КонецЕсли;				
			
		КонецЕсли;

	КонецЕсли;
	
	// Таблица Серии
	НастройкаТЧ = НастройкиДокумента.ТабличныеЧасти.Получить(Перечисления.SUI_ТипыТаблицДокументовОбмена.Серии);
	Если ЗначениеЗаполнено(НастройкаТЧ) И СерииИспользуются Тогда
		
		мсвВыбрать = Новый Массив();
		сткПараметры = Новый Структура();
		Для Каждого РеквизитТЧ Из НастройкаТЧ.Элементы Цикл
			
			ТекстВыбораДобавлен = Ложь;
			
			Если ЗначениеЗаполнено(РеквизитТЧ.Значение) Тогда
				
				Если РеквизитТЧ.Значение.ПостоянноеЗначение <> Неопределено Тогда
					мсвВыбрать.Добавить("&" + РеквизитТЧ.Ключ + " КАК " + РеквизитТЧ.Ключ);
					сткПараметры.Вставить(РеквизитТЧ.Ключ, РеквизитТЧ.Значение.ПостоянноеЗначение);
					ТекстВыбораДобавлен = Истина;
				ИначеЕсли РеквизитТЧ.Значение.Имя <> Неопределено Тогда
					мсвВыбрать.Добавить(РеквизитТЧ.Значение.Имя + " КАК " + РеквизитТЧ.Ключ);
					ТекстВыбораДобавлен = Истина;
				КонецЕсли;
				
			КонецЕсли;
			
			Если Не ТекстВыбораДобавлен Тогда
				Если РеквизитТЧ.Ключ = "id_good" Или РеквизитТЧ.Ключ = "id_series" Тогда
					мсвВыбрать = Новый Массив();
					Прервать;
				КонецЕсли;
				мсвВыбрать.Добавить("НЕОПРЕДЕЛЕНО КАК " + РеквизитТЧ.Ключ);
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(мсвВыбрать) Тогда
			
			мсвВыбрать.Добавить("НомерСтроки КАК НомерСтроки");
			
			Запрос = Новый Запрос();
			Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
			Для Каждого сткПараметр Из сткПараметры Цикл
				Запрос.УстановитьПараметр(сткПараметр.Ключ, сткПараметр.Значение);
			КонецЦикла;
			Запрос.Текст = "
			|ВЫБРАТЬ
			|	" + СтрСоединить(мсвВыбрать, "," + Символы.ПС + Символы.Таб) + "
			|ИЗ
			|	" + ДокументСсылка.Метаданные().ПолноеИмя() + "." + НастройкаТЧ.ИмяТабличнойЧасти + "
			|ГДЕ
			|	Ссылка = &ДокументСсылка";
			
			РезультатЗапроса = Запрос.Выполнить();

			Если Не РезультатЗапроса.Пустой() Тогда
				
				// Дополнительные реквизиты Начало
				ДополнительныеРеквизиты_Алгоритм = ПолучитьАлгоритмИзКоллекции(АлгоритмыДополнительныхРеквизитов, 
					Перечисления.SUI_ТипыТаблицДокументовОбмена.Серии);
				// Дополнительные реквизиты Конец
				
				// Выборка строк из ТЧ Начало
				Если ЗначениеЗаполнено(ДополнительныеРеквизиты_Алгоритм) Тогда
					РезультатВыборкиТЧ = ПолучитьВыборкуТабличнойЧастиДокумента(ДокументСсылка, НастройкаТЧ.ИмяТабличнойЧасти);
				Иначе
					РезультатВыборкиТЧ = Неопределено;
				КонецЕсли;
				// Выборка строк из ТЧ Конец
				
				ТаблицаДанныхИзДокумента = ТаблицаСерииДокументаОбмена();
				
				ИменаКолонокЗапроса = SUI_ОбщегоНазначения.ПолучитьИменаКолонокРезультатаЗапроса(РезультатЗапроса);
				
				Выборка = РезультатЗапроса.Выбрать();
				
				Пока Выборка.Следующий() Цикл
					
					ДанныеЗапроса = Новый Структура(ИменаКолонокЗапроса);
					ЗаполнитьЗначенияСвойств(ДанныеЗапроса, Выборка);
					SUI_ИнтеграцияВКонфигурацию.ПривестиСсылкиКИдентификаторамSimple(ДанныеЗапроса);
					
					// Параметры алгоритма строки ТЧ Начало
					ПараметрыАлгоритма = Неопределено;
					Если РезультатВыборкиТЧ <> Неопределено Тогда
						РезультатВыборкиТЧ.Выборка.Сбросить();
						Если РезультатВыборкиТЧ.Выборка.НайтиСледующий(Новый Структура("НомерСтроки", Выборка.НомерСтроки)) Тогда
							ПараметрыАлгоритма = Новый Структура("ДанныеСтроки", Новый Структура(РезультатВыборкиТЧ.Колонки));
							ЗаполнитьЗначенияСвойств(ПараметрыАлгоритма.ДанныеСтроки, РезультатВыборкиТЧ.Выборка);
						КонецЕсли;
					КонецЕсли;
					// Параметры алгоритма строки ТЧ Конец
					
					// Дополнительные реквизиты Начало
					SUI_ДополнительныеРеквизитыТаблиц.ДобавитьДополнительныеРеквизитыВПриемник(ДанныеЗапроса, 
						ДополнительныеРеквизиты_Алгоритм, ПараметрыАлгоритма);
					// Дополнительные реквизиты Конец
					
					ЗаполнитьЗначенияСвойств(ТаблицаДанныхИзДокумента.Добавить(), ДанныеЗапроса);
					
				КонецЦикла;
			
				Запрос = Новый Запрос;
				Запрос.УстановитьПараметр("sid_doc", ДанныеДокумента.sid);
				Запрос.УстановитьПараметр("ТаблицаДанныхИзДокумента", ТаблицаДанныхИзДокумента);
				Запрос.Текст =
					"ВЫБРАТЬ
					|	ТаблицаДанныхИзДокумента.id_good,
					|	ТаблицаДанныхИзДокумента.id_properties,
					|	ТаблицаДанныхИзДокумента.id_series,
					|	ТаблицаДанныхИзДокумента.id_warehouse,
					|	ТаблицаДанныхИзДокумента.qtty,
					|	ТаблицаДанныхИзДокумента.additional_details
					|ПОМЕСТИТЬ втТаблицаДанныхИзДокумента
					|ИЗ
					|	&ТаблицаДанныхИзДокумента КАК ТаблицаДанныхИзДокумента
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ЕСТЬNULL(SUI_docs_tbl_series.sid, """") КАК sid,
					|	&sid_doc,
					|	втТаблицаДанныхИзДокумента.id_good,
					|	втТаблицаДанныхИзДокумента.id_properties,
					|	втТаблицаДанныхИзДокумента.id_series,
					|	втТаблицаДанныхИзДокумента.id_warehouse,
					|	втТаблицаДанныхИзДокумента.qtty,
					|	втТаблицаДанныхИзДокумента.additional_details,
					|	ЗНАЧЕНИЕ(Перечисление.SUI_СтатусыОбработкиСтрок.ОбработкаНеТребуется) КАК СтатусОбработки
					|ИЗ
					|	втТаблицаДанныхИзДокумента КАК втТаблицаДанныхИзДокумента
					|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.SUI_docs_tbl_series КАК SUI_docs_tbl_series
					|		ПО SUI_docs_tbl_series.sid_doc = &sid_doc
					|		И SUI_docs_tbl_series.id_good = втТаблицаДанныхИзДокумента.id_good
					|		И SUI_docs_tbl_series.id_properties = втТаблицаДанныхИзДокумента.id_properties
					|		И SUI_docs_tbl_series.id_series = втТаблицаДанныхИзДокумента.id_series
					|		И SUI_docs_tbl_series.id_warehouse = втТаблицаДанныхИзДокумента.id_warehouse
					|ГДЕ
					|	втТаблицаДанныхИзДокумента.id_good <> """"
					|	И втТаблицаДанныхИзДокумента.id_series <> """"
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|УНИЧТОЖИТЬ втТаблицаДанныхИзДокумента";
					
				РезультатЗапроса = Запрос.Выполнить();
				
				ТаблицаДанных = ТаблицаСерииДокументаОбмена();
				
				Если Не РезультатЗапроса.Пустой() Тогда
					
					ИменаКолонокЗапроса = SUI_ОбщегоНазначения.ПолучитьИменаКолонокРезультатаЗапроса(РезультатЗапроса);
					
					Выборка = РезультатЗапроса.Выбрать();
					
					Пока Выборка.Следующий() Цикл
						
						ДанныеЗапроса = Новый Структура(ИменаКолонокЗапроса);
						ЗаполнитьЗначенияСвойств(ДанныеЗапроса, Выборка);
						
						Если Не ЗначениеЗаполнено(ДанныеЗапроса.sid) Тогда
							ДанныеЗапроса.sid = Строка(Новый УникальныйИдентификатор());
						КонецЕсли;
	
						ЗаполнитьЗначенияСвойств(ТаблицаДанных.Добавить(), ДанныеЗапроса);
						
					КонецЦикла;
				
				КонецЕсли;
			
				ДанныеДокумента.Таблицы.Вставить(Перечисления.SUI_ТипыТаблицДокументовОбмена.Серии, ТаблицаДанных);
			
			КонецЕсли;
			
		КонецЕсли;

	КонецЕсли;
	
	// Таблицы Товары, Отбор, Размещение
	Для Каждого НастройкаТЧ Из НастройкиДокумента.ТабличныеЧасти Цикл
		
		Если Не ЗначениеЗаполнено(НастройкаТЧ.Значение) Или
			(НастройкаТЧ.Ключ <> Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары И
			НастройкаТЧ.Ключ <> Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор И
			НастройкаТЧ.Ключ <> Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение) Тогда
			Продолжить;
		КонецЕсли;
		
		ТекстВыбрать_use_series = "ВЫБОР
		|	КОГДА ТИПЗНАЧЕНИЯ(&СтатусУказанияСерий_use_series) = ТИП(ЧИСЛО)
		|		ТОГДА ВЫБОР
		|				КОГДА &СтатусУказанияСерий_use_series > 0
		|					ТОГДА 1
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|	КОГДА ТИПЗНАЧЕНИЯ(&СтатусУказанияСерий_use_series) = ТИП(БУЛЕВО)
		|		ТОГДА ВЫБОР
		|				КОГДА &СтатусУказанияСерий_use_series = ИСТИНА
		|					ТОГДА 1
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|	ИНАЧЕ 0
		|КОНЕЦ КАК use_series";
		
		мсвВыбрать = Новый Массив();
		сткПараметры = Новый Структура();
		Для Каждого РеквизитТЧ Из НастройкаТЧ.Значение.Элементы Цикл
			
			ТекстВыбораДобавлен = Ложь;
			
			Если ЗначениеЗаполнено(РеквизитТЧ.Значение) Тогда
				
				Если РеквизитТЧ.Значение.ПостоянноеЗначение <> Неопределено Тогда
					
					Если РеквизитТЧ.Ключ = "use_series" Тогда
						мсвВыбрать.Добавить(ТекстВыбрать_use_series);
						сткПараметры.Вставить("СтатусУказанияСерий_use_series", РеквизитТЧ.Значение.ПостоянноеЗначение);
					Иначе
						мсвВыбрать.Добавить("&" + РеквизитТЧ.Ключ + " КАК " + РеквизитТЧ.Ключ);
						сткПараметры.Вставить(РеквизитТЧ.Ключ, РеквизитТЧ.Значение.ПостоянноеЗначение);
					КонецЕсли;
					
					ТекстВыбораДобавлен = Истина;
					
				ИначеЕсли РеквизитТЧ.Значение.Имя <> Неопределено Тогда
					
					Если РеквизитТЧ.Ключ = "use_series" Тогда
						мсвВыбрать.Добавить(
							СтрЗаменить(ТекстВыбрать_use_series, "&СтатусУказанияСерий_use_series", РеквизитТЧ.Значение.Имя));
					Иначе
						мсвВыбрать.Добавить(РеквизитТЧ.Значение.Имя + " КАК " + РеквизитТЧ.Ключ);
					КонецЕсли;
					
					ТекстВыбораДобавлен = Истина;

				КонецЕсли;
	
			КонецЕсли;
			
			Если Не ТекстВыбораДобавлен Тогда
				
				Если РеквизитТЧ.Ключ = "id_good" Или 
					РеквизитТЧ.Ключ = "qtty_plan" Или
					(РеквизитТЧ.Ключ = "id_cell" И 
					(НастройкаТЧ.Ключ = Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор И
					НастройкаТЧ.Ключ = Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение)) Тогда
					мсвВыбрать = Новый Массив();
					Прервать;
				КонецЕсли;
				
				мсвВыбрать.Добавить("НЕОПРЕДЕЛЕНО КАК " + РеквизитТЧ.Ключ);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(мсвВыбрать) Тогда
			
			мсвВыбрать.Добавить("НомерСтроки КАК НомерСтроки");
			
			Запрос = Новый Запрос();
			Запрос.УстановитьПараметр("ТипТаблицы", НастройкаТЧ.Ключ);
			Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
			Для Каждого сткПараметр Из сткПараметры Цикл
				Запрос.УстановитьПараметр(сткПараметр.Ключ, сткПараметр.Значение);
			КонецЦикла;
			Запрос.Текст = "
			|ВЫБРАТЬ
			|	&ТипТаблицы КАК ТипТаблицы,
			|	" + СтрСоединить(мсвВыбрать, "," + Символы.ПС + Символы.Таб) + "
			|ИЗ
			|	" + ДокументСсылка.Метаданные().ПолноеИмя() + "." + НастройкаТЧ.Значение.ИмяТабличнойЧасти + "
			|ГДЕ
			|	Ссылка = &ДокументСсылка";
			
			//@skip-check query-in-loop
			РезультатЗапроса = Запрос.Выполнить();
			
			Если Не РезультатЗапроса.Пустой() Тогда
				
				// Признак использования маркировки Начало
				АлгоритмПризнакаМаркировкиВСтроке = ПолучитьАлгоритмИзКоллекции(АлгоритмыПризнакМаркировки, НастройкаТЧ.Ключ);
				// Признак использования маркировки Конец
				
				// Признак использования маркировки Начало
				АлгоритмСтатусУказанияСерийВСтроке = ПолучитьАлгоритмИзКоллекции(АлгоритмыСтатусУказанияСерий, НастройкаТЧ.Ключ);
				// Признак использования маркировки Конец

				// Дополнительные реквизиты Начало
				ДополнительныеРеквизиты_Алгоритм = ПолучитьАлгоритмИзКоллекции(АлгоритмыДополнительныхРеквизитов, НастройкаТЧ.Ключ);
				// Дополнительные реквизиты Конец
				
				// Выборка строк из ТЧ Начало
				Если ЗначениеЗаполнено(АлгоритмПризнакаМаркировкиВСтроке) Или ЗначениеЗаполнено(ДополнительныеРеквизиты_Алгоритм)
					Или ЗначениеЗаполнено(АлгоритмСтатусУказанияСерийВСтроке) Тогда
					РезультатВыборкиТЧ = ПолучитьВыборкуТабличнойЧастиДокумента(ДокументСсылка, НастройкаТЧ.Значение.ИмяТабличнойЧасти);
				Иначе
					РезультатВыборкиТЧ = Неопределено;
				КонецЕсли;
				// Выборка строк из ТЧ Конец
				
				ТаблицаДанныхИзДокумента = ТаблицаТоварыДокументаОбмена();
				
				ИменаКолонокЗапроса = SUI_ОбщегоНазначения.ПолучитьИменаКолонокРезультатаЗапроса(РезультатЗапроса);
				
				Выборка = РезультатЗапроса.Выбрать();
				
				Пока Выборка.Следующий() Цикл
					
					ДанныеЗапроса = Новый Структура(ИменаКолонокЗапроса);
					ЗаполнитьЗначенияСвойств(ДанныеЗапроса, Выборка);
					SUI_ИнтеграцияВКонфигурацию.ПривестиСсылкиКИдентификаторамSimple(ДанныеЗапроса, "ТипТаблицы");
					
					// Параметры алгоритма строки ТЧ Начало
					ПараметрыАлгоритма = Неопределено;
					Если РезультатВыборкиТЧ <> Неопределено Тогда
						РезультатВыборкиТЧ.Выборка.Сбросить();
						Если РезультатВыборкиТЧ.Выборка.НайтиСледующий(Новый Структура("НомерСтроки", Выборка.НомерСтроки)) Тогда
							ПараметрыАлгоритма = Новый Структура("ДанныеСтроки", Новый Структура(РезультатВыборкиТЧ.Колонки));
							ЗаполнитьЗначенияСвойств(ПараметрыАлгоритма.ДанныеСтроки, РезультатВыборкиТЧ.Выборка);
						КонецЕсли;
					КонецЕсли;
					// Параметры алгоритма строки ТЧ Конец
					
					// Признак использования маркировки Начало
					ДобавитьПризнакИспользованияМаркировкиВПриемник(ДанныеЗапроса, 
						АлгоритмПризнакаМаркировкиВСтроке, ПараметрыАлгоритма);
					// Признак использования маркировки Конец
					
					// Получение статуса указания серии Начало
					ДобавитьСтатусУказанияСерийВПриемник(ДанныеЗапроса, 
						АлгоритмСтатусУказанияСерийВСтроке, ПараметрыАлгоритма);
					// Получение статуса указания серии Конец
					
					// Дополнительные реквизиты Начало
					SUI_ДополнительныеРеквизитыТаблиц.ДобавитьДополнительныеРеквизитыВПриемник(ДанныеЗапроса, 
						ДополнительныеРеквизиты_Алгоритм, ПараметрыАлгоритма);
					// Дополнительные реквизиты Конец
					
					ЗаполнитьЗначенияСвойств(ТаблицаДанныхИзДокумента.Добавить(), ДанныеЗапроса);
					
				КонецЦикла;

				Запрос = Новый Запрос;
				Запрос.УстановитьПараметр("sid_doc", ДанныеДокумента.sid);
				Запрос.УстановитьПараметр("ТаблицаДанныхИзДокумента", ТаблицаДанныхИзДокумента);
				Запрос.Текст =
					"ВЫБРАТЬ
					|	ТаблицаДанныхИзДокумента.id_good,
					|	ТаблицаДанныхИзДокумента.id_properties,
					|	ТаблицаДанныхИзДокумента.id_series,
					|	ТаблицаДанныхИзДокумента.id_cell,
					|	ТаблицаДанныхИзДокумента.id_unit,
					|	ТаблицаДанныхИзДокумента.id_price,
					|	ТаблицаДанныхИзДокумента.price,
					|	ТаблицаДанныхИзДокумента.qtty_plan,
					|	ТаблицаДанныхИзДокумента.qtty,
					|	ТаблицаДанныхИзДокумента.use_series,
					|	ТаблицаДанныхИзДокумента.use_mark,
					|	ТаблицаДанныхИзДокумента.additional_details,
					|	ТаблицаДанныхИзДокумента.ТипТаблицы
					|ПОМЕСТИТЬ втТаблицаДанныхИзДокумента
					|ИЗ
					|	&ТаблицаДанныхИзДокумента КАК ТаблицаДанныхИзДокумента
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ЕСТЬNULL(SUI_docs_tbl_goods.sid, """") КАК sid,
					|	&sid_doc,
					|	втТаблицаДанныхИзДокумента.id_good,
					|	втТаблицаДанныхИзДокумента.id_properties,
					|	втТаблицаДанныхИзДокумента.id_series,
					|	втТаблицаДанныхИзДокумента.id_cell,
					|	втТаблицаДанныхИзДокумента.id_unit,
					|	втТаблицаДанныхИзДокумента.id_price,
					|	втТаблицаДанныхИзДокумента.price,
					|	втТаблицаДанныхИзДокумента.qtty_plan,
					|	ЕСТЬNULL(SUI_docs_tbl_goods.qtty, 0) КАК qtty,
					|	втТаблицаДанныхИзДокумента.use_series,
					|	втТаблицаДанныхИзДокумента.use_mark,
					|	втТаблицаДанныхИзДокумента.additional_details,
					|	втТаблицаДанныхИзДокумента.ТипТаблицы
					|ИЗ
					|	втТаблицаДанныхИзДокумента КАК втТаблицаДанныхИзДокумента
					|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.SUI_docs_tbl_goods КАК SUI_docs_tbl_goods
					|		ПО SUI_docs_tbl_goods.sid_doc = &sid_doc
					|		И втТаблицаДанныхИзДокумента.id_good = SUI_docs_tbl_goods.id_good
					|		И втТаблицаДанныхИзДокумента.id_properties = SUI_docs_tbl_goods.id_properties
					|		И втТаблицаДанныхИзДокумента.id_series = SUI_docs_tbl_goods.id_series
					|		И втТаблицаДанныхИзДокумента.id_cell = SUI_docs_tbl_goods.id_cell
					|		И втТаблицаДанныхИзДокумента.id_unit = SUI_docs_tbl_goods.id_unit
					|		И втТаблицаДанныхИзДокумента.id_price = SUI_docs_tbl_goods.id_price
					|		И втТаблицаДанныхИзДокумента.ТипТаблицы = SUI_docs_tbl_goods.ТипТаблицы
					|ГДЕ
					|	втТаблицаДанныхИзДокумента.id_good <> """";
					|
					|////////////////////////////////////////////////////////////////////////////////
					|УНИЧТОЖИТЬ втТаблицаДанныхИзДокумента";
					
				//@skip-check query-in-loop
				РезультатЗапроса = Запрос.Выполнить();
				
				ТаблицаДанных = ТаблицаТоварыДокументаОбмена();
				
				Если Не РезультатЗапроса.Пустой() Тогда
					
					ИменаКолонокЗапроса = SUI_ОбщегоНазначения.ПолучитьИменаКолонокРезультатаЗапроса(РезультатЗапроса);
					
					Выборка = РезультатЗапроса.Выбрать();
					
					Пока Выборка.Следующий() Цикл
						
						ДанныеЗапроса = Новый Структура(ИменаКолонокЗапроса);
						ЗаполнитьЗначенияСвойств(ДанныеЗапроса, Выборка);
						
						Если Не ЗначениеЗаполнено(ДанныеЗапроса.sid) Тогда
							ДанныеЗапроса.sid = Строка(Новый УникальныйИдентификатор());
						КонецЕсли;
						
						ЗаполнитьЗначенияСвойств(ТаблицаДанных.Добавить(), ДанныеЗапроса);
						
					КонецЦикла;
				
				КонецЕсли;
				
				ДанныеДокумента.Таблицы.Вставить(НастройкаТЧ.Ключ, ТаблицаДанных);
			
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Перезаполнить таблицу серий по таблице товаров, отбора и размещения
	Если СерииИспользуются Тогда
	
		ТаблицаСерий = ДанныеДокумента.Таблицы.Получить(Перечисления.SUI_ТипыТаблицДокументовОбмена.Серии);
		Если ТаблицаСерий = Неопределено Тогда
			ТаблицаСерий = ТаблицаСерииДокументаОбмена();
		КонецЕсли;
		
		Для Каждого Таблица Из ДанныеДокумента.Таблицы Цикл
			
			Если Таблица.Ключ <> Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары И
				Таблица.Ключ <> Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор И
				Таблица.Ключ <> Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение Тогда
				Продолжить;
			КонецЕсли;
			
			Запрос = Новый Запрос();
			Запрос.УстановитьПараметр("ШаблонИдентификатораSimple", SUI_ИнтеграцияВКонфигурациюКлиентСервер.ШаблонИдентификатораSimple());
			Запрос.УстановитьПараметр("ТаблицаСерий", ТаблицаСерий.Скопировать());
			Запрос.УстановитьПараметр("Таблица", Таблица.Значение);
			Запрос.Текст = "ВЫБРАТЬ
			|	ТаблицаСерий.sid,
			|	ТаблицаСерий.sid_doc,
			|	ТаблицаСерий.id_good,
			|	ТаблицаСерий.id_properties,
			|	ТаблицаСерий.id_series,
			|	ТаблицаСерий.id_warehouse,
			|	ТаблицаСерий.qtty,
			|	ТаблицаСерий.СтатусОбработки
			|ПОМЕСТИТЬ втТаблицаСерий
			|ИЗ
			|	&ТаблицаСерий КАК ТаблицаСерий
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Таблица.sid_doc,
			|	Таблица.id_good,
			|	Таблица.id_properties,
			|	Таблица.id_series,
			|	Таблица.qtty_plan КАК qtty
			|ПОМЕСТИТЬ втТаблица
			|ИЗ
			|	&Таблица КАК Таблица
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	втТаблица.sid_doc,
			|	втТаблица.id_good,
			|	втТаблица.id_properties,
			|	втТаблица.id_series,
			|	СУММА(втТаблица.qtty) КАК qtty,
			|	ЗНАЧЕНИЕ(Перечисление.SUI_СтатусыОбработкиСтрок.ОбработкаНеТребуется) КАК СтатусОбработки
			|ПОМЕСТИТЬ втТаблицаФильтр
			|ИЗ
			|	втТаблица КАК втТаблица
			|ГДЕ
			|	втТаблица.id_good ПОДОБНО &ШаблонИдентификатораSimple
			|	И втТаблица.id_series ПОДОБНО &ШаблонИдентификатораSimple
			|СГРУППИРОВАТЬ ПО
			|	втТаблица.sid_doc,
			|	втТаблица.id_good,
			|	втТаблица.id_properties,
			|	втТаблица.id_series,
			|	ЗНАЧЕНИЕ(Перечисление.SUI_СтатусыОбработкиСтрок.ОбработкаНеТребуется)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ втТаблица
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЕСТЬNULL(втТаблицаСерий.sid, """") КАК sid,
			|	ЕСТЬNULL(втТаблицаСерий.sid_doc, втТаблицаФильтр.sid_doc) КАК sid_doc,
			|	ЕСТЬNULL(втТаблицаСерий.id_good, втТаблицаФильтр.id_good) КАК id_good,
			|	ЕСТЬNULL(втТаблицаСерий.id_properties, втТаблицаФильтр.id_properties) КАК id_properties,
			|	ЕСТЬNULL(втТаблицаСерий.id_series, втТаблицаФильтр.id_series) КАК id_series,
			|	ЕСТЬNULL(втТаблицаСерий.id_warehouse, """") КАК id_warehouse,
			|	ЕСТЬNULL(втТаблицаСерий.qtty, втТаблицаФильтр.qtty) КАК qtty,
			|	ЕСТЬNULL(втТаблицаСерий.СтатусОбработки, втТаблицаФильтр.СтатусОбработки) КАК СтатусОбработки
			|ПОМЕСТИТЬ втСерииДокумента
			|ИЗ
			|	втТаблицаСерий КАК втТаблицаСерий
			|		ПОЛНОЕ СОЕДИНЕНИЕ втТаблицаФильтр КАК втТаблицаФильтр
			|		ПО втТаблицаСерий.sid_doc = втТаблицаФильтр.sid_doc
			|		И втТаблицаСерий.id_good = втТаблицаФильтр.id_good
			|		И втТаблицаСерий.id_properties = втТаблицаФильтр.id_properties
			|		И втТаблицаСерий.id_series = втТаблицаФильтр.id_series
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ втТаблицаСерий
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ втТаблицаФильтр
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЕСТЬNULL(SUI_docs_tbl_series.sid, втСерииДокумента.sid) КАК sid,
			|	втСерииДокумента.sid_doc,
			|	втСерииДокумента.id_good,
			|	втСерииДокумента.id_properties,
			|	втСерииДокумента.id_series,
			|	втСерииДокумента.id_warehouse,
			|	втСерииДокумента.qtty,
			|	втСерииДокумента.СтатусОбработки
			|ПОМЕСТИТЬ втСерииДокументаФильтр
			|ИЗ
			|	втСерииДокумента КАК втСерииДокумента
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.SUI_docs_tbl_series КАК SUI_docs_tbl_series
			|		ПО втСерииДокумента.sid_doc = SUI_docs_tbl_series.sid_doc
			|		И втСерииДокумента.id_good = SUI_docs_tbl_series.id_good
			|		И втСерииДокумента.id_properties = SUI_docs_tbl_series.id_properties
			|		И втСерииДокумента.id_series = SUI_docs_tbl_series.id_series
			|		И ВЫБОР
			|			КОГДА втСерииДокумента.sid <> """"
			|				ТОГДА втСерииДокумента.sid = SUI_docs_tbl_series.sid
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ втСерииДокумента
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	втСерииДокумента.sid,
			|	втСерииДокумента.sid_doc,
			|	втСерииДокумента.id_good,
			|	втСерииДокумента.id_properties,
			|	втСерииДокумента.id_series,
			|	втСерииДокумента.id_warehouse,
			|	СУММА(втСерииДокумента.qtty) КАК qtty,
			|	втСерииДокумента.СтатусОбработки
			|ИЗ
			|	втСерииДокументаФильтр КАК втСерииДокумента
			|СГРУППИРОВАТЬ ПО
			|	втСерииДокумента.sid,
			|	втСерииДокумента.sid_doc,
			|	втСерииДокумента.id_good,
			|	втСерииДокумента.id_properties,
			|	втСерииДокумента.id_series,
			|	втСерииДокумента.id_warehouse,
			|	втСерииДокумента.СтатусОбработки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ втСерииДокументаФильтр";
			
			//@skip-check query-in-loop
			РезультатЗапроса = Запрос.Выполнить();
			
			Если Не РезультатЗапроса.Пустой() Тогда
				
				ТаблицаСерий = ТаблицаСерииДокументаОбмена();
				
				Выборка = РезультатЗапроса.Выбрать();
				
				Пока Выборка.Следующий() Цикл
					
					СтрокаТаблицыСерий = ТаблицаСерий.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТаблицыСерий, Выборка);
					
					Если Не ЗначениеЗаполнено(СтрокаТаблицыСерий.sid) Тогда
						СтрокаТаблицыСерий.sid = Строка(Новый УникальныйИдентификатор());
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ТаблицаСерий) Тогда
			ДанныеДокумента.Таблицы.Вставить(Перечисления.SUI_ТипыТаблицДокументовОбмена.Серии, ТаблицаСерий);
		КонецЕсли;
	
	КонецЕсли;
	
	// 20.09.2024 - artem - B120423 >>>
	Если НастройкиДокумента.ТабличныеЧасти.Получить(Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор) <> Неопределено Тогда
		ДанныеДокумента.Вставить("cells_process_type", "selection");
	ИначеЕсли НастройкиДокумента.ТабличныеЧасти.Получить(Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение) <> Неопределено Тогда
		ДанныеДокумента.Вставить("cells_process_type", "placement");
	Иначе
		ДанныеДокумента.Вставить("cells_process_type", "");
	КонецЕсли;
	
	Если ДанныеДокумента.cells_process_type = "selection" Или
		ДанныеДокумента.cells_process_type = "placement" Тогда
		ДанныеДокумента.Вставить("process_type", "cells");
	ИначеЕсли НастройкиДокумента.ComputerVision Тогда
		ДанныеДокумента.Вставить("process_type", "CV");
	ИначеЕсли НастройкиДокумента.ТабличныеЧасти.Получить(Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары) <> Неопределено Тогда
		ДанныеДокумента.Вставить("process_type", "document");
	Иначе
		ДанныеДокумента.Вставить("process_type", "");
	КонецЕсли;
	// 20.09.2024 - artem - B120423 <<<
	
	Возврат ДанныеДокумента;
	
КонецФункции

//@skip-check query-in-loop
Процедура ЗаписатьДанныеДокументаОбмена(ДанныеДокументаОбмена, ПараметрыЗаписи, ДанныеЗаписаны = Ложь)
	
	ОбщегоНазначенияКлиентСервер.Проверить(
		СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ДанныеДокументаОбмена.sid),
		НСтр("ru = 'Не заполнен служебный идентификатор документа.'"),
		КонтекстВызоваСтрокой("ЗаписатьДанныеДокументаОбмена"));
		
	ОбщегоНазначенияКлиентСервер.Проверить(
		SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(ДанныеДокументаОбмена.id_doc),
		НСтр("ru = 'Не заполнен идентификатор Simple документа обмена.'"),
		КонтекстВызоваСтрокой("ЗаписатьДанныеДокументаОбмена"));

	СостояниеЗагрузки = Новый Структура();
	СостояниеЗагрузки.Вставить("ДокументОбмена", 			Ложь);
	СостояниеЗагрузки.Вставить("ТаблицаШтрихкодыУпаковок", 	Ложь);
	СостояниеЗагрузки.Вставить("ТаблицаСерии", 				Ложь);
	СостояниеЗагрузки.Вставить("ТаблицаТовары", 			Ложь);
	СостояниеЗагрузки.Вставить("ТаблицаПересчетТоваров", 	Ложь);
	СостояниеЗагрузки.Вставить("ТаблицаПотокШтрихкодов", 	Ложь);
	СостояниеЗагрузки.Вставить("ЭтоЗагрузкаИзТСД", 			ПараметрыЗаписи.Свойство("ЭтоЗагрузка"));
	СостояниеЗагрузки.Вставить("ЗагрузитьПересчетВТовары", 	Ложь);

	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.SUI_docs");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
		ЭлементБлокировки.УстановитьЗначение("sid", ДанныеДокументаОбмена.sid);
		ЭлементБлокировки.УстановитьЗначение("id_doc", ДанныеДокументаОбмена.id_doc);
		ЭлементБлокировки.УстановитьЗначение("НастройкаДокумента", ДанныеДокументаОбмена.НастройкаДокумента);
		Блокировка.Заблокировать();
		
		//@skip-check bsl-legacy-check-string-literal
		НастройкаГрупповогоСканирования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			ДанныеДокументаОбмена.НастройкаДокумента, "ГрупповоеСканирование");
		
		НаборЗаписей = РегистрыСведений.SUI_docs.СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор.sid.Установить(ДанныеДокументаОбмена.sid);
		НаборЗаписей.Отбор.id_doc.Установить(ДанныеДокументаОбмена.id_doc);
		НаборЗаписей.Отбор.НастройкаДокумента.Установить(ДанныеДокументаОбмена.НастройкаДокумента);
		
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() = 0 Тогда
			
			Если ДанныеДокументаОбмена.Состояние = Перечисления.SUI_СостоянияДокументовОбмена.Отменен Или
				ДанныеДокументаОбмена.Состояние = Перечисления.SUI_СостоянияДокументовОбмена.Завершен Тогда
				ОтменитьТранзакцию();
				Возврат;
			Иначе
				НаборЗаписей.Добавить();
				СостояниеЗагрузки.ДокументОбмена = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
		// Удалить записи, если записей более 2
		Для Индекс = 1 По НаборЗаписей.Количество() - 1 Цикл
			НаборЗаписей.Удалить(НаборЗаписей[Индекс]);
			СостояниеЗагрузки.ДокументОбмена = Истина;
		КонецЦикла;
		
		// Перезаписать документ обмена если есть различия
		Если СостояниеЗагрузки.ДокументОбмена Или 
			ТребуетсяОбновлениеЗаписиДокументаОбмена(НаборЗаписей[0], ДанныеДокументаОбмена) Тогда
			
			ЗаполнитьЗначенияСвойств(НаборЗаписей[0], ДанныеДокументаОбмена);
			
			НаборЗаписей.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
			НаборЗаписей.Записать(Истина);
			НаборЗаписей.ДополнительныеСвойства.Удалить("ОтключитьМеханизмРегистрацииОбъектов");
			
			СостояниеЗагрузки.ДокументОбмена = Истина;
			
		КонецЕсли;
		
		// Таблицы
		Если ДанныеДокументаОбмена.Состояние <> Перечисления.SUI_СостоянияДокументовОбмена.Отменен И
			ДанныеДокументаОбмена.Состояние <> Перечисления.SUI_СостоянияДокументовОбмена.Завершен Тогда
			
			Для Каждого Таблица Из ДанныеДокументаОбмена.Таблицы Цикл
				
				// Таблица Штрихкоды упаковок
				Если Таблица.Ключ = Перечисления.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок Тогда
					
					ЗаписатьДанныеДокументаОбмена_ШтрихкодыУпаковок(Таблица.Значение, 
						СостояниеЗагрузки.ТаблицаШтрихкодыУпаковок, , 
						СостояниеЗагрузки.ЭтоЗагрузкаИзТСД);
				
				// Таблица Серии
				ИначеЕсли Таблица.Ключ = Перечисления.SUI_ТипыТаблицДокументовОбмена.Серии Тогда
					
					ЗаписатьДанныеДокументаОбмена_Серии(Таблица.Значение, 
						СостояниеЗагрузки.ТаблицаСерии, 
						ПараметрыЗаписи.Свойство("ПерезаписатьСерии"), , 
						СостояниеЗагрузки.ЭтоЗагрузкаИзТСД);
				
				// Таблица Товары, Отбор или Размещение
				ИначеЕсли Таблица.Ключ = Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары Или 
					Таблица.Ключ = Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор Или 
					Таблица.Ключ = Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение Тогда

					ЗаписатьДанныеДокументаОбмена_Товары(Таблица.Значение, 
						СостояниеЗагрузки.ТаблицаТовары, 
						СостояниеЗагрузки.ЭтоЗагрузкаИзТСД);
				
				// Таблица Поток штрихкодов
				ИначеЕсли Таблица.Ключ = Перечисления.SUI_ТипыТаблицДокументовОбмена.ПотокШтрихкодов Тогда
					
					ЗаписатьДанныеДокументаОбмена_ПотокШтрихкодов(Таблица.Значение, 
						СостояниеЗагрузки.ТаблицаПотокШтрихкодов);
				
				// Таблица Пересчет товаров
				ИначеЕсли Таблица.Ключ = "ТаблицаПересчетТоваров" И НастройкаГрупповогоСканирования Тогда
					
					Таблица.Значение.ЗаполнитьЗначения(ДанныеДокументаОбмена.МобильноеУстройство, "МобильноеУстройство");
  					
					ЗаписатьДанныеДокументаОбмена_ПересчетТоваров(Таблица.Значение, 
						СостояниеЗагрузки.ТаблицаПересчетТоваров, 
						ПараметрыЗаписи.Свойство("ПерезаписьРезультатов"));
					
				КонецЕсли;

			КонецЦикла;
			
		КонецЕсли;
		
		// Завершение группового пересчета документа обмена
		Если СостояниеЗагрузки.ЭтоЗагрузкаИзТСД И 
			НастройкаГрупповогоСканирования И 
			ПараметрыЗаписи.Свойство("ЗавершитьГрупповойПересчетДокументаОбмена") Тогда
			СостояниеЗагрузки.ЗагрузитьПересчетВТовары = Истина;
		КонецЕсли;
		
		// Если это принудительная выгрузка или есть изменения по документу обмена
		Если ПараметрыЗаписи.Свойство("ПринудительнаяВыгрузка") Или
			СостояниеЗагрузки.ДокументОбмена Или
			СостояниеЗагрузки.ТаблицаТовары Или
			СостояниеЗагрузки.ТаблицаШтрихкодыУпаковок Или
			СостояниеЗагрузки.ТаблицаСерии Или
			СостояниеЗагрузки.ТаблицаПересчетТоваров Или
			СостояниеЗагрузки.ТаблицаПотокШтрихкодов Или
			СостояниеЗагрузки.ЗагрузитьПересчетВТовары Тогда

			Если ПараметрыЗаписи.Свойство("НеРегистрироватьИзменения") Тогда
				НаборЗаписей.ДополнительныеСвойства.Вставить("НеРегистрироватьИзменения");
			Иначе
				
				НаборЗаписей.ДополнительныеСвойства.Вставить("РегистрироватьИзменения");
				
				Если ПараметрыЗаписи.Свойство("МобильноеУстройство") Тогда
					НаборЗаписей.ДополнительныеСвойства.Вставить("МобильноеУстройство", ПараметрыЗаписи.МобильноеУстройство);	
				КонецЕсли; 
				
				Если ПараметрыЗаписи.Свойство("ИсключитьМобильноеУстройство") Тогда
					НаборЗаписей.ДополнительныеСвойства.Вставить("ИсключитьМобильноеУстройство", ПараметрыЗаписи.ИсключитьМобильноеУстройство);	
				КонецЕсли;
			
			КонецЕсли;

			НаборЗаписей.Записать(Истина);
			
			СостояниеЗагрузки.ДокументОбмена = Истина;
			
			// Постобработка документа обмена    
			Если Не ПараметрыЗаписи.Свойство("ОтключитьПостобработкуДокументаОбмена") Тогда
				ДанныеПостобработки = Новый Структура("sid, id_doc, НастройкаДокумента");
				ЗаполнитьЗначенияСвойств(ДанныеПостобработки, ДанныеДокументаОбмена);
				ЗаписатьДанныеДокументаОбмена_СоздатьЗаданиеПостобработки(ДанныеПостобработки, СостояниеЗагрузки);
			КонецЕсли;
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(), , 
			Метаданные.ОбщиеМодули.SUI_ДокументыОбмена, , ИнформацияОбОшибке());
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Возникла исключительная ошибка при записи данных документа обмена
			|%1'"), ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	ДанныеЗаписаны = СостояниеЗагрузки.ДокументОбмена;
	
КонецПроцедуры

Процедура ЗаписатьДанныеДокументаОбмена_СоздатьЗаданиеПостобработки(ДанныеПостобработки, СостояниеЗагрузки)
	
	Если Не СостояниеЗагрузки.ЭтоЗагрузкаИзТСД Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ДокументСсылка = SUI_ИнтеграцияВКонфигурацию.СсылкаПоИдентификаторуSimple(ДанныеПостобработки.id_doc, Истина);
	
	ПараметрыСозданияЗадания = SUI_ОчередьЗаданийКлиентСервер.ПараметрыСозданияЗадания();
	ПараметрыСозданияЗадания.Наименование = СтрШаблон(НСтр("ru = 'Постобработка документа обмена (%1)'"),
		?(ЗначениеЗаполнено(ДокументСсылка), ДокументСсылка, ДанныеПостобработки.НастройкаДокумента));
		
	ПараметрыСозданияЗадания.ИдентификаторДокумента = SUI_ИнтеграцияВКонфигурацию.ИдентификаторSimpleПоСсылке(ДокументСсылка);
	
	// Обработчик создания серий номенклатуры
	Если СостояниеЗагрузки.ТаблицаСерии Тогда
		ПараметрыПроцедуры = Новый Структура("sid_doc", ДанныеПостобработки.sid);
		SUI_ОчередьЗаданийКлиентСервер.ДобавитьОбработчикВПараметрыСозданияЗадания(
			ПараметрыСозданияЗадания, 
			"SUI_ДокументыОбмена.ЗаданиеСоздатьСерииНоменклатурыДокументаОбмена",
			SUI_ОбщегоНазначенияКлиентСервер.МассивЗначений(ПараметрыПроцедуры, Неопределено));
	КонецЕсли;
	
	// Обработчик создания штрихкодов упаковок
	Если СостояниеЗагрузки.ТаблицаШтрихкодыУпаковок Тогда
		ПараметрыПроцедуры = Новый Структура("sid_doc", ДанныеПостобработки.sid);
		SUI_ОчередьЗаданийКлиентСервер.ДобавитьОбработчикВПараметрыСозданияЗадания(
			ПараметрыСозданияЗадания, 
			"SUI_ДокументыОбмена.ЗаданиеСоздатьШтрихкодыУпаковокДокументаОбмена",
			SUI_ОбщегоНазначенияКлиентСервер.МассивЗначений(ПараметрыПроцедуры, Неопределено));
	КонецЕсли;
	
	// Обработчик загрузки итогов пересчета в документ обмена
	Если СостояниеЗагрузки.ЗагрузитьПересчетВТовары Тогда
		ПараметрыПроцедуры = Новый Структура("sid_doc", ДанныеПостобработки.sid);
		SUI_ОчередьЗаданийКлиентСервер.ДобавитьОбработчикВПараметрыСозданияЗадания(
			ПараметрыСозданияЗадания, 
			"SUI_ДокументыОбмена.ЗаданиеЗагрузитьИтогиПересчетаВДокументОбмена",
			SUI_ОбщегоНазначенияКлиентСервер.МассивЗначений(ПараметрыПроцедуры, Неопределено));
	КонецЕсли;
	
	// Если документ обмена был загружен
	Если СостояниеЗагрузки.ДокументОбмена Тогда
		
		ДанныеНастройкиДокументаОбмена = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			ДанныеПостобработки.НастройкаДокумента, 
			"ЗагружатьВДокумент1СПослеПолученияИзТСД, ГрупповоеСканирование");

		// Обработчик загрузки в документ 1С
		Если ДанныеНастройкиДокументаОбмена.ЗагружатьВДокумент1СПослеПолученияИзТСД Тогда
			
			// Если не Групповое сканирование ИЛИ Групповое сканирование и Есть обработчик загрузки пересчета товаров
			Если Не ДанныеНастройкиДокументаОбмена.ГрупповоеСканирование Или
				(ДанныеНастройкиДокументаОбмена.ГрупповоеСканирование И СостояниеЗагрузки.ЗагрузитьПересчетВТовары) Тогда
				
				ПараметрыСозданияЗадания.Наименование = СтрШаблон(НСтр("ru = 'Загрузка в документ 1С (%1)'"),
				?(ЗначениеЗаполнено(ДокументСсылка), ДокументСсылка, ДанныеПостобработки.НастройкаДокумента));
			
				ПараметрыПроцедуры = Новый Структура();
				ПараметрыПроцедуры.Вставить("sid", ДанныеПостобработки.sid);
				ПараметрыПроцедуры.Вставить("id_doc", ДанныеПостобработки.id_doc);
				ПараметрыПроцедуры.Вставить("НастройкаДокумента", ДанныеПостобработки.НастройкаДокумента);
				
				SUI_ОчередьЗаданийКлиентСервер.ДобавитьОбработчикВПараметрыСозданияЗадания(
					ПараметрыСозданияЗадания, 
					"SUI_ДокументыОбмена.ЗаданиеЗагрузитьДокументОбменаВДокумент1СПослеЗагрузки",
					SUI_ОбщегоНазначенияКлиентСервер.МассивЗначений(ПараметрыПроцедуры, Неопределено));
				
			КонецЕсли;
			
		КонецЕсли;

	КонецЕсли;
	
	// Создать задание очереди
	Если ПараметрыСозданияЗадания.Обработчики.Количество() > 0 Тогда
		SUI_ОчередьЗаданий.СоздатьЗадание(ПараметрыСозданияЗадания);
	КонецЕсли;
		
КонецПроцедуры

Процедура ЗаписатьДанныеДокументаОбмена_Товары(Таблица, ЗаписьВыполнена = Ложь, ЭтоЗагрузка = Ложь)

	Если Таблица.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли;
	
	Если Не SUI_НастройкиМетаданныхСервер.ТаблицаИспользуется(Перечисления.SUI_ТаблицыИнтеграции.Номенклатура) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Таблица", Таблица);
	Запрос.УстановитьПараметр("ЭтоЗагрузка", ЭтоЗагрузка);
	Запрос.УстановитьПараметр("ШаблонУникальногоИдентификатора", SUI_ОбщегоНазначенияКлиентСервер.ШаблонУникальногоИдентификатора());
	Запрос.УстановитьПараметр("ШаблонИдентификатораSimple", SUI_ИнтеграцияВКонфигурациюКлиентСервер.ШаблонИдентификатораSimple());
	Запрос.Текст = "ВЫБРАТЬ
	|	Таблица.sid КАК sid,
	|	Таблица.sid_doc КАК sid_doc,
	|	Таблица.id_good,
	|	Таблица.id_properties,
	|	Таблица.id_series,
	|	Таблица.id_cell,
	|	Таблица.id_unit,
	|	Таблица.id_price,
	|	Таблица.price,
	|	Таблица.qtty,
	|	Таблица.qtty_plan,
	|	ВЫБОР
	|		КОГДА Таблица.use_series > 1
	|			ТОГДА 1
	|		КОГДА Таблица.use_series < 0
	|			ТОГДА 0
	|		ИНАЧЕ Таблица.use_series
	|	КОНЕЦ КАК use_series,
	|	Таблица.additional_details,
	|	Таблица.use_mark,
	|	Таблица.ТипТаблицы
	|ПОМЕСТИТЬ втТаблица
	|ИЗ
	|	&Таблица КАК Таблица
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	sid,
	|	sid_doc
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТаблица.sid,
	|	втТаблица.sid_doc,
	|	втТаблица.id_good,
	|	втТаблица.id_properties,
	|	втТаблица.id_series,
	|	втТаблица.id_cell,
	|	втТаблица.id_unit,
	|	втТаблица.id_price,
	|	втТаблица.price,
	|	втТаблица.qtty,
	|	втТаблица.qtty_plan,
	|	втТаблица.use_series,
	|	ВЫБОР
	|		КОГДА &ЭтоЗагрузка
	|			ТОГДА ЕСТЬNULL(SUI_docs_tbl_goods.additional_details, """")
	|		ИНАЧЕ втТаблица.additional_details
	|	КОНЕЦ КАК additional_details,
	|	ВЫБОР
	|		КОГДА &ЭтоЗагрузка
	|			ТОГДА ЕСТЬNULL(SUI_docs_tbl_goods.use_mark, ЛОЖЬ)
	|		ИНАЧЕ втТаблица.use_mark
	|	КОНЕЦ КАК use_mark,
	|	втТаблица.ТипТаблицы,
	|	ВЫБОР
	|		КОГДА SUI_docs_tbl_goods.sid ЕСТЬ NULL
	|		ИЛИ втТаблица.id_good <> SUI_docs_tbl_goods.id_good
	|		ИЛИ втТаблица.id_properties <> SUI_docs_tbl_goods.id_properties
	|		ИЛИ втТаблица.id_series <> SUI_docs_tbl_goods.id_series
	|		ИЛИ втТаблица.id_cell <> SUI_docs_tbl_goods.id_cell
	|		ИЛИ втТаблица.id_unit <> SUI_docs_tbl_goods.id_unit
	|		ИЛИ втТаблица.id_price <> SUI_docs_tbl_goods.id_price
	|		ИЛИ втТаблица.price <> SUI_docs_tbl_goods.price
	|		ИЛИ втТаблица.qtty <> SUI_docs_tbl_goods.qtty
	|		ИЛИ втТаблица.qtty_plan <> SUI_docs_tbl_goods.qtty_plan
	|		ИЛИ втТаблица.use_series <> SUI_docs_tbl_goods.use_series
	|		ИЛИ втТаблица.ТипТаблицы <> SUI_docs_tbl_goods.ТипТаблицы
	|		ИЛИ (НЕ &ЭтоЗагрузка И втТаблица.use_mark <> ЕСТЬNULL(SUI_docs_tbl_goods.use_mark, ЛОЖЬ))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ Записывать
	|ПОМЕСТИТЬ втФильтр
	|ИЗ
	|	втТаблица КАК втТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.SUI_docs_tbl_goods КАК SUI_docs_tbl_goods
	|		ПО втТаблица.sid = SUI_docs_tbl_goods.sid
	|		И втТаблица.sid_doc = SUI_docs_tbl_goods.sid_doc
	|ГДЕ
	|	втТаблица.sid ПОДОБНО &ШаблонУникальногоИдентификатора
	|	И втТаблица.sid_doc ПОДОБНО &ШаблонУникальногоИдентификатора
	|	И втТаблица.id_good ПОДОБНО &ШаблонИдентификатораSimple
	|	И ВЫБОР
	|		КОГДА втТаблица.id_properties <> """"
	|			ТОГДА втТаблица.id_properties ПОДОБНО &ШаблонИдентификатораSimple
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА втТаблица.id_series <> """"
	|			ТОГДА втТаблица.id_series ПОДОБНО &ШаблонИдентификатораSimple
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА втТаблица.id_cell <> """"
	|			ТОГДА втТаблица.id_cell ПОДОБНО &ШаблонИдентификатораSimple
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА втТаблица.id_unit <> """"
	|			ТОГДА втТаблица.id_unit ПОДОБНО &ШаблонИдентификатораSimple
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА втТаблица.id_price <> """"
	|			ТОГДА втТаблица.id_price ПОДОБНО &ШаблонИдентификатораSimple
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ втТаблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втФильтр.sid,
	|	втФильтр.sid_doc,
	|	втФильтр.id_good,
	|	втФильтр.id_properties,
	|	втФильтр.id_series,
	|	втФильтр.id_cell,
	|	втФильтр.id_unit,
	|	втФильтр.id_price,
	|	втФильтр.price,
	|	втФильтр.qtty,
	|	втФильтр.qtty_plan,
	|	втФильтр.use_series,
	|	втФильтр.additional_details,
	|	втФильтр.use_mark,
	|	втФильтр.ТипТаблицы
	|ИЗ
	|	втФильтр КАК втФильтр
	|ГДЕ
	|	втФильтр.Записывать
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ втФильтр";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		НачатьТранзакцию();
		
		Попытка
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				НаборЗаписей = РегистрыСведений.SUI_docs_tbl_goods.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.sid.Установить(Выборка.sid);
				НаборЗаписей.Отбор.sid_doc.Установить(Выборка.sid_doc);
				ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
				НаборЗаписей.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
				НаборЗаписей.Записать(Истина);
				
			КонецЦикла;
		
			ЗаписьВыполнена = Истина;
			
			ЗафиксироватьТранзакцию();

		Исключение
			ОтменитьТранзакцию();
			SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(НСтр("ru = 'Товары'")), , 
				Метаданные.ОбщиеМодули.SUI_ДокументыОбмена, , ИнформацияОбОшибке());
			ВызватьИсключение СтрШаблон(НСтр("ru = 'Возникла исключительная ошибка при записи данных товаров документа обмена
				|%1'"), ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьДанныеДокументаОбмена_ШтрихкодыУпаковок(Таблица, ЗаписьВыполнена = Ложь, 
	ОбработкаЗаданийВФоне = Истина, ЭтоЗагрузка = Ложь)
	
	Если Таблица.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли;
	
	Если Не SUI_НастройкиМетаданныхСервер.ТаблицаИспользуется(Перечисления.SUI_ТаблицыИнтеграции.Номенклатура) Или
		Не SUI_НастройкиМетаданныхСервер.ТаблицаИспользуется(Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыУпаковок) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Таблица", Таблица);
	Запрос.УстановитьПараметр("ЭтоЗагрузка", ЭтоЗагрузка);
	Запрос.УстановитьПараметр("ШаблонУникальногоИдентификатора", SUI_ОбщегоНазначенияКлиентСервер.ШаблонУникальногоИдентификатора());
	Запрос.УстановитьПараметр("ШаблонИдентификатораSimple", SUI_ИнтеграцияВКонфигурациюКлиентСервер.ШаблонИдентификатораSimple());
	Запрос.Текст = "ВЫБРАТЬ
	|	Таблица.sid КАК sid,
	|	Таблица.sid_doc КАК sid_doc,
	|	Таблица.id_marking_code,
	|	Таблица.id_good,
	|	Таблица.id_property,
	|	Таблица.id_series,
	|	Таблица.id_unit,
	|	Таблица.id_cell,
	|	Таблица.mark_code,
	|	Таблица.id_SSCC,
	|	Таблица.SSCC,
	|	Таблица.series_number,
	|	ВЫБОР
	|		КОГДА &ЭтоЗагрузка
	|			ТОГДА Таблица.barcode_from_scanner
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК barcode_from_scanner,
	|	Таблица.additional_details,
	|	Таблица.СтатусОбработки,
	|	Таблица.ШтрихкодBase64,
	|	Таблица.SSCCBase64
	|ПОМЕСТИТЬ втТаблица
	|ИЗ
	|	&Таблица КАК Таблица
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	sid,
	|	sid_doc
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТаблица.sid,
	|	втТаблица.sid_doc,
	|	втТаблица.id_marking_code,
	|	втТаблица.id_good,
	|	втТаблица.id_property,
	|	втТаблица.id_series,
	|	втТаблица.id_unit,
	|	втТаблица.id_cell,
	|	втТаблица.mark_code,
	|	втТаблица.id_SSCC,
	|	втТаблица.SSCC,
	|	втТаблица.series_number,
	|	ВЫБОР
	|		КОГДА &ЭтоЗагрузка
	|			ТОГДА втТаблица.barcode_from_scanner
	|		ИНАЧЕ ЕСТЬNULL(SUI_docs_tbl_barcodes.barcode_from_scanner, """")
	|	КОНЕЦ КАК barcode_from_scanner,
	|	ВЫБОР
	|		КОГДА &ЭтоЗагрузка
	|			ТОГДА втТаблица.ШтрихкодBase64
	|		ИНАЧЕ ЕСТЬNULL(SUI_docs_tbl_barcodes.ШтрихкодBase64, """")
	|	КОНЕЦ КАК ШтрихкодBase64,
	|	ВЫБОР
	|		КОГДА &ЭтоЗагрузка
	|			ТОГДА втТаблица.SSCCBase64
	|		ИНАЧЕ ЕСТЬNULL(SUI_docs_tbl_barcodes.SSCCBase64, """")
	|	КОНЕЦ КАК SSCCBase64,
	|	ВЫБОР
	|		КОГДА &ЭтоЗагрузка
	|			ТОГДА ЕСТЬNULL(SUI_docs_tbl_barcodes.additional_details, """")
	|		ИНАЧЕ втТаблица.additional_details
	|	КОНЕЦ КАК additional_details,
	|	втТаблица.СтатусОбработки,
	|	&ЭтоЗагрузка КАК ЗагруженоИзМобильногоУстройства,
	|	ВЫБОР
	|		КОГДА SUI_docs_tbl_barcodes.sid ЕСТЬ NULL
	|		ИЛИ втТаблица.id_marking_code <> SUI_docs_tbl_barcodes.id_marking_code
	|		ИЛИ втТаблица.id_good <> SUI_docs_tbl_barcodes.id_good
	|		ИЛИ втТаблица.id_property <> SUI_docs_tbl_barcodes.id_property
	|		ИЛИ втТаблица.id_series <> SUI_docs_tbl_barcodes.id_series
	|		ИЛИ втТаблица.id_unit <> SUI_docs_tbl_barcodes.id_unit
	|		ИЛИ втТаблица.mark_code <> SUI_docs_tbl_barcodes.mark_code
	|		ИЛИ втТаблица.СтатусОбработки <> SUI_docs_tbl_barcodes.СтатусОбработки
	|		ИЛИ &ЭтоЗагрузка <> ЕСТЬNULL(SUI_docs_tbl_barcodes.ЗагруженоИзМобильногоУстройства, ИСТИНА)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Записывать
	|ПОМЕСТИТЬ втФильтр
	|ИЗ
	|	втТаблица КАК втТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.SUI_docs_tbl_barcodes КАК SUI_docs_tbl_barcodes
	|		ПО втТаблица.sid = SUI_docs_tbl_barcodes.sid
	|		И втТаблица.sid_doc = SUI_docs_tbl_barcodes.sid_doc
	|ГДЕ
	|	втТаблица.sid ПОДОБНО &ШаблонУникальногоИдентификатора
	|	И втТаблица.sid_doc ПОДОБНО &ШаблонУникальногоИдентификатора
	|	И втТаблица.id_good ПОДОБНО &ШаблонИдентификатораSimple
	|	И ВЫБОР
	|		КОГДА втТаблица.id_marking_code <> """"
	|			ТОГДА втТаблица.id_marking_code ПОДОБНО &ШаблонИдентификатораSimple
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА втТаблица.id_property <> """"
	|			ТОГДА втТаблица.id_property ПОДОБНО &ШаблонИдентификатораSimple
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА втТаблица.id_series <> """"
	|			ТОГДА втТаблица.id_series ПОДОБНО &ШаблонИдентификатораSimple
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА втТаблица.id_unit <> """"
	|			ТОГДА втТаблица.id_unit ПОДОБНО &ШаблонИдентификатораSimple
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ втТаблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втФильтр.sid,
	|	втФильтр.sid_doc,
	|	втФильтр.id_marking_code,
	|	втФильтр.id_good,
	|	втФильтр.id_property,
	|	втФильтр.id_series,
	|	втФильтр.id_unit,
	|	втФильтр.id_cell,
	|	втФильтр.mark_code,
	|	втФильтр.barcode_from_scanner,
	|	втФильтр.id_SSCC,
	|	втФильтр.SSCC,
	|	втФильтр.series_number,
	|	втФильтр.additional_details,
	|	втФильтр.СтатусОбработки,
	|	втФильтр.ШтрихкодBase64,
	|	втФильтр.SSCCBase64,
	|	втФильтр.ЗагруженоИзМобильногоУстройства
	|ИЗ
	|	втФильтр КАК втФильтр
	|ГДЕ
	|	втФильтр.Записывать
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ втФильтр";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		НачатьТранзакцию();
		
		Попытка
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				НаборЗаписей = РегистрыСведений.SUI_docs_tbl_barcodes.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.sid.Установить(Выборка.sid);
				НаборЗаписей.Отбор.sid_doc.Установить(Выборка.sid_doc);
				ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
				НаборЗаписей.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
				НаборЗаписей.Записать(Истина);
				
			КонецЦикла;
		
			ЗаписьВыполнена = Истина;
	
			ЗафиксироватьТранзакцию();

		Исключение
			ОтменитьТранзакцию();
			SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(НСтр("ru = 'Штрихкоды упаковок'")), , 
				Метаданные.ОбщиеМодули.SUI_ДокументыОбмена, , ИнформацияОбОшибке());
			ВызватьИсключение СтрШаблон(НСтр("ru = 'Возникла исключительная ошибка при записи данных штрихкодов упаковок документа обмена
				|%1'"), ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
			
	КонецЕсли;
	
КонецПроцедуры

//@skip-check method-too-many-params
Процедура ЗаписатьДанныеДокументаОбмена_Серии(Таблица, ЗаписьВыполнена = Ложь, Перезаписать = Истина, 
	ОбработкаЗаданийВФоне = Истина, ЭтоЗагрузка = Ложь)
	
	Если Таблица.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли;
	
	Если Не SUI_НастройкиМетаданныхСервер.ТаблицаИспользуется(Перечисления.SUI_ТаблицыИнтеграции.Номенклатура) Или
		Не SUI_НастройкиМетаданныхСервер.ТаблицаИспользуется(Перечисления.SUI_ТаблицыИнтеграции.СерииНоменклатуры) Тогда
		Возврат;
	КонецЕсли;

	НачатьТранзакцию();
	
	Попытка
		
		Если Перезаписать Тогда
		
			Запрос = Новый Запрос();
			Запрос.УстановитьПараметр("Таблица", Таблица);
			Запрос.Текст = "ВЫБРАТЬ
			|	Таблица.sid_doc
			|ПОМЕСТИТЬ втТаблица
			|ИЗ
			|	&Таблица КАК Таблица
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	SUI_docs_tbl_series.sid_doc
			|ИЗ
			|	РегистрСведений.SUI_docs_tbl_series КАК SUI_docs_tbl_series
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втТаблица КАК втТаблица
			|		ПО втТаблица.sid_doc = SUI_docs_tbl_series.sid_doc
			|СГРУППИРОВАТЬ ПО
			|	SUI_docs_tbl_series.sid_doc
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ втТаблица";
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Если Не РезультатЗапроса.Пустой() Тогда
				
				Выборка = РезультатЗапроса.Выбрать();
	
				Пока Выборка.Следующий() Цикл
					НаборЗаписей = РегистрыСведений.SUI_docs_tbl_series.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.sid_doc.Установить(Выборка.sid_doc);
					НаборЗаписей.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
					НаборЗаписей.Записать(Истина);
					ЗаписьВыполнена = Истина;
				КонецЦикла;
			
			КонецЕсли;
		
		КонецЕсли;
		
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("Таблица", Таблица);
		Запрос.УстановитьПараметр("ЭтоЗагрузка", ЭтоЗагрузка);
		Запрос.УстановитьПараметр("ШаблонУникальногоИдентификатора", SUI_ОбщегоНазначенияКлиентСервер.ШаблонУникальногоИдентификатора());
		Запрос.УстановитьПараметр("ШаблонИдентификатораSimple", SUI_ИнтеграцияВКонфигурациюКлиентСервер.ШаблонИдентификатораSimple());
		Запрос.Текст = "ВЫБРАТЬ
		|	Таблица.sid КАК sid,
		|	Таблица.sid_doc КАК sid_doc,
		|	Таблица.id_good,
		|	Таблица.id_properties,
		|	Таблица.id_series,
		|	Таблица.id_warehouse,
		|	Таблица.qtty,
		|	ВЫБОР
		|		КОГДА Таблица.id_series ПОДОБНО &ШаблонИдентификатораSimple
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.SUI_СтатусыОбработкиСтрок.ОбработкаНеТребуется)
		|		ИНАЧЕ Таблица.СтатусОбработки
		|	КОНЕЦ КАК СтатусОбработки,
		|	Таблица.name,
		|	Таблица.number,
		|	Таблица.production_date,
		|	Таблица.best_before,
		|	Таблица.additional_details
		|ПОМЕСТИТЬ втТаблица
		|ИЗ
		|	&Таблица КАК Таблица
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	sid,
		|	sid_doc
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТаблица.sid,
		|	втТаблица.sid_doc,
		|	втТаблица.id_good,
		|	втТаблица.id_properties,
		|	втТаблица.id_series,
		|	втТаблица.id_warehouse,
		|	втТаблица.qtty,
		|	втТаблица.СтатусОбработки,
		|	втТаблица.name,
		|	втТаблица.number,
		|	втТаблица.production_date,
		|	втТаблица.best_before,
		|	ВЫБОР
		|		КОГДА &ЭтоЗагрузка
		|			ТОГДА ЕСТЬNULL(SUI_docs_tbl_series.additional_details, """")
		|		ИНАЧЕ втТаблица.additional_details
		|	КОНЕЦ КАК additional_details,
		|	ВЫБОР
		|		КОГДА SUI_docs_tbl_series.sid ЕСТЬ NULL
		|		ИЛИ втТаблица.id_good <> SUI_docs_tbl_series.id_good
		|		ИЛИ втТаблица.id_properties <> SUI_docs_tbl_series.id_properties
		|		ИЛИ втТаблица.id_series <> SUI_docs_tbl_series.id_series
		|		ИЛИ втТаблица.id_warehouse <> SUI_docs_tbl_series.id_warehouse
		|		ИЛИ втТаблица.qtty <> SUI_docs_tbl_series.qtty
		|		ИЛИ втТаблица.СтатусОбработки <> SUI_docs_tbl_series.СтатусОбработки
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ Записывать
		|ПОМЕСТИТЬ втФильтр
		|ИЗ
		|	втТаблица КАК втТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.SUI_docs_tbl_series КАК SUI_docs_tbl_series
		|		ПО втТаблица.sid = SUI_docs_tbl_series.sid
		|		И втТаблица.sid_doc = SUI_docs_tbl_series.sid_doc
		|ГДЕ
		|	втТаблица.sid ПОДОБНО &ШаблонУникальногоИдентификатора
		|	И втТаблица.sid_doc ПОДОБНО &ШаблонУникальногоИдентификатора
		|	И втТаблица.id_good ПОДОБНО &ШаблонИдентификатораSimple
		|	И ВЫБОР
		|		КОГДА втТаблица.id_properties <> """"
		|			ТОГДА втТаблица.id_properties ПОДОБНО &ШаблонИдентификатораSimple
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|	И ВЫБОР
		|		КОГДА втТаблица.id_series <> """"
		|			ТОГДА втТаблица.id_series ПОДОБНО &ШаблонИдентификатораSimple
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|	И ВЫБОР
		|		КОГДА втТаблица.id_warehouse <> """"
		|			ТОГДА втТаблица.id_warehouse ПОДОБНО &ШаблонИдентификатораSimple
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ втТаблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втФильтр.sid,
		|	втФильтр.sid_doc,
		|	втФильтр.id_good,
		|	втФильтр.id_properties,
		|	втФильтр.id_series,
		|	втФильтр.id_warehouse,
		|	втФильтр.qtty,
		|	втФильтр.СтатусОбработки,
		|	втФильтр.name,
		|	втФильтр.number,
		|	втФильтр.production_date,
		|	втФильтр.best_before,
		|	втФильтр.additional_details
		|ИЗ
		|	втФильтр КАК втФильтр
		|ГДЕ
		|	втФильтр.Записывать
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ втФильтр";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				НаборЗаписей = РегистрыСведений.SUI_docs_tbl_series.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.sid.Установить(Выборка.sid);
				НаборЗаписей.Отбор.sid_doc.Установить(Выборка.sid_doc);
			
				Если Выборка.СтатусОбработки = Перечисления.SUI_СтатусыОбработкиСтрок.ОбработкаНеТребуется Тогда
					ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка, , "name,number,production_date,best_before");
				Иначе
					ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
				КонецЕсли;

				НаборЗаписей.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
				НаборЗаписей.Записать(Истина);
			
			КонецЦикла;
			
			ЗаписьВыполнена = Истина;

		КонецЕсли;

		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(НСтр("ru = 'Серии'")), , 
			Метаданные.ОбщиеМодули.SUI_ДокументыОбмена, , ИнформацияОбОшибке());
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Возникла исключительная ошибка при записи данных серий документа обмена
			|%1'"), ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаписатьДанныеДокументаОбмена_ПотокШтрихкодов(Таблица, ЗаписьВыполнена = Ложь)
	
	Если Таблица.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли;

	ПериодЗаписи = ТекущаяДатаСеанса();

	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.SUI_docs_tbl_barcode_flow");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
		ЭлементБлокировки.ИсточникДанных = Таблица;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("sid", "sid");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("sid_doc", "sid_doc");
		Блокировка.Заблокировать();
				
		Если Константы.SUI_ЗамещатьВПотокеШтрихкодов.Получить() Тогда

			Для Каждого СтрокаТаблицы Из Таблица Цикл
				
				НаборЗаписей = РегистрыСведений.SUI_docs_tbl_barcode_flow.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.sid.Установить(СтрокаТаблицы.sid);
				НаборЗаписей.Отбор.sid_doc.Установить(СтрокаТаблицы.sid_doc);
				Запись = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(Запись, СтрокаТаблицы);
				Запись.Период = ПериодЗаписи;
				НаборЗаписей.Записать(Истина);
				
			КонецЦикла;
			
		Иначе
			
			Для Каждого СтрокаТаблицы Из Таблица Цикл
				
				МенеджерЗаписи = РегистрыСведений.SUI_docs_tbl_barcode_flow.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтрокаТаблицы);
				МенеджерЗаписи.Период = ПериодЗаписи;
				МенеджерЗаписи.Записать();
				
			КонецЦикла;
		
		КонецЕсли;
		
		ЗаписьВыполнена = Истина;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(НСтр("ru = 'Поток штрихкодов'")), , 
			Метаданные.ОбщиеМодули.SUI_ДокументыОбмена, , ИнформацияОбОшибке());
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Возникла исключительная ошибка при записи данных потока штрихкодов документа обмена
			|%1'"), ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаписатьДанныеДокументаОбмена_ПересчетТоваров(Таблица, ЗаписьВыполнена = Ложь, Перезаписать = Ложь)
	
	Если Таблица.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли;
	
	Если Не SUI_НастройкиМетаданныхСервер.ТаблицаИспользуется(Перечисления.SUI_ТаблицыИнтеграции.Номенклатура) Тогда
		Возврат;
	КонецЕсли;

	ПериодЗаписи = ТекущаяДатаСеанса();
	
	Попытка
		
		// Очистить таблицу пересчета
		Если Перезаписать Тогда
		
			НачатьТранзакцию();
			
			Попытка
	
				ТаблицаКопия = Таблица.Скопировать(, "sid_doc,МобильноеУстройство");
				ТаблицаКопия.Свернуть("sid_doc,МобильноеУстройство");
				
				Блокировка = Новый БлокировкаДанных;
				ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.SUI_docs_tbl_goods_delta");
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
				ЭлементБлокировки.ИсточникДанных = ТаблицаКопия;
				ЭлементБлокировки.ИспользоватьИзИсточникаДанных("sid_doc", "sid_doc");
				ЭлементБлокировки.ИспользоватьИзИсточникаДанных("МобильноеУстройство", "МобильноеУстройство");
				Блокировка.Заблокировать();
				
				Для Каждого СтрокаТаблицыКопии Из ТаблицаКопия Цикл
					
					НаборЗаписей = РегистрыСведений.SUI_docs_tbl_goods_delta.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.sid_doc.Установить(СтрокаТаблицыКопии.sid_doc);
					НаборЗаписей.Отбор.МобильноеУстройство.Установить(СтрокаТаблицыКопии.МобильноеУстройство); 
					НаборЗаписей.Записать(Истина);
				
				КонецЦикла;
	
				ЗафиксироватьТранзакцию();
				
			Исключение
				ОтменитьТранзакцию();
				ВызватьИсключение;
			КонецПопытки;
		
		КонецЕсли;
		
		// Выполнить запись в таблицу пересчета
		НачатьТранзакцию();
		
		Попытка
	
			Для Каждого СтрокаТаблицы Из Таблица Цикл
				
				МенеджерЗаписи = РегистрыСведений.SUI_docs_tbl_goods_delta.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтрокаТаблицы);
				МенеджерЗаписи.Период = ПериодЗаписи;
				МенеджерЗаписи.Записать();
				
			КонецЦикла;
			
			ЗаписьВыполнена = Истина;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
		
	Исключение
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(НСтр("ru = 'Пересчет товаров'")), , 
			Метаданные.ОбщиеМодули.SUI_ДокументыОбмена, , ИнформацияОбОшибке());
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура УдалитьСвязанныеДанныеДокументаОбмена(НаборыЗаписей)

	НачатьТранзакцию();
	
	Попытка
		
		НЗ_Товары = РегистрыСведений.SUI_docs_tbl_goods.СоздатьНаборЗаписей();
		НЗ_ПересчетТоваров = РегистрыСведений.SUI_docs_tbl_goods_delta.СоздатьНаборЗаписей();
		НЗ_Серии = РегистрыСведений.SUI_docs_tbl_series.СоздатьНаборЗаписей();
		НЗ_ШтрихкодыУпаковок = РегистрыСведений.SUI_docs_tbl_barcodes.СоздатьНаборЗаписей();
		НЗ_ПотокШтрихкодов = РегистрыСведений.SUI_docs_tbl_barcode_flow.СоздатьНаборЗаписей();
		
		Если ЗначениеЗаполнено(НаборыЗаписей) Тогда
	
			Для Каждого НаборЗаписей Из НаборыЗаписей Цикл
				
				НЗ_Товары.Отбор.sid_doc.Установить(НаборЗаписей.Отбор.sid.Значение);
				НЗ_Товары.Записать(Истина);
				
				НЗ_ПересчетТоваров.Отбор.sid_doc.Установить(НаборЗаписей.Отбор.sid.Значение);
				НЗ_ПересчетТоваров.Записать(Истина);
				
				НЗ_Серии.Отбор.sid_doc.Установить(НаборЗаписей.Отбор.sid.Значение);
				НЗ_Серии.Записать(Истина);
				
				НЗ_ШтрихкодыУпаковок.Отбор.sid_doc.Установить(НаборЗаписей.Отбор.sid.Значение);
				НЗ_ШтрихкодыУпаковок.Записать(Истина);
				
				НЗ_ПотокШтрихкодов.Отбор.sid_doc.Установить(НаборЗаписей.Отбор.sid.Значение);
				НЗ_ПотокШтрихкодов.Записать(Истина);
		
			КонецЦикла;
			
		Иначе
			
			НЗ_Товары.Записать(Истина);
			НЗ_ПересчетТоваров.Записать(Истина);
			НЗ_Серии.Записать(Истина);
			НЗ_ШтрихкодыУпаковок.Записать(Истина);
			НЗ_ПотокШтрихкодов.Записать(Истина);
		
		КонецЕсли;

		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(), , 
			Метаданные.ОбщиеМодули.SUI_ДокументыОбмена, , ИнформацияОбОшибке());
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Возникла исключительная ошибка при удалении данных документов обмена
			|%1'"), ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

КонецПроцедуры

Функция ПредставлениеКолонкиТаблицы(Знач ИмяКолонки)
	
	ИмяКолонки = НРег(ИмяКолонки);
	
	Если ИмяКолонки = "id_good" Тогда
		Возврат "Номенклатура";
	ИначеЕсли ИмяКолонки = "id_properties" Или ИмяКолонки = "id_property" Тогда
		Возврат "Характеристика";    
	ИначеЕсли ИмяКолонки = "id_series" Тогда
		Возврат "Серия";
	ИначеЕсли ИмяКолонки = "id_unit" Тогда
		Возврат "Упаковка";
	ИначеЕсли ИмяКолонки = "id_cell" Тогда
		Возврат "Ячейка";
	ИначеЕсли ИмяКолонки = "id_price" Тогда
		Возврат "Вид цены";
	ИначеЕсли ИмяКолонки = "price" Тогда
		Возврат "Цена";
	ИначеЕсли ИмяКолонки = "qtty" Тогда
		Возврат "Количество (факт)";
	ИначеЕсли ИмяКолонки = "qtty_plan" Тогда
		Возврат "Количество (план)";
	ИначеЕсли ИмяКолонки = "датаобновления" Тогда
		Возврат "Дата обновления"; 
	ИначеЕсли ИмяКолонки = "id_marking_code" Тогда
		Возврат "Штрихкод упаковки";
	ИначеЕсли ИмяКолонки = "mark_code" Тогда
		Возврат "Значение штрихкода упаковки";
	ИначеЕсли ИмяКолонки = "barcode" Тогда
		Возврат "Штрихкод";
	ИначеЕсли ИмяКолонки = "id_warehouse" Тогда
		Возврат "Склад";
	Иначе
		Возврат ИмяКолонки;
	КонецЕсли;
	
КонецФункции

Функция СформироватьПараметрыОтбора(НастройкиРеквизитовТЧ, СтрокаДанных, СписокКлючей = "", ИсключитьКлючи = "")
	
	ПараметрыОтбора = Новый Структура();
	
	Ключи = СтрРазделить(СписокКлючей, ",");
	ИсключаяКлючи = СтрРазделить(ИсключитьКлючи, ",");
	
	Для Каждого НастройкаРеквизитаТЧ Из НастройкиРеквизитовТЧ Цикл
		
		Если Не ЗначениеЗаполнено(НастройкаРеквизитаТЧ.Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Ключи) И Ключи.Найти(НастройкаРеквизитаТЧ.Ключ) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ИсключаяКлючи) И ИсключаяКлючи.Найти(НастройкаРеквизитаТЧ.Ключ) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если НастройкаРеквизитаТЧ.Значение.Имя = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаДанных.Владелец().Колонки.Найти(НастройкаРеквизитаТЧ.Ключ) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыОтбора.Вставить(НастройкаРеквизитаТЧ.Значение.Имя, НастройкаРеквизитаТЧ.Значение.Тип.ПривестиЗначение(
			СтрокаДанных[НастройкаРеквизитаТЧ.Ключ]));
		
	КонецЦикла;
	
	Возврат ПараметрыОтбора;
	
КонецФункции

Функция ДанныеДокументаКЗагрузкеВДокументОбмена(Знач Документ, Таблицы, БезТаблиц = Ложь)
	
	ДанныеДокументов = Новый Массив();
	
	Документ = ИдентификаторДокументаПоПараметру(Документ, "ДанныеДокументаКЗагрузкеВДокументОбмена");

	Запрос = Новый Запрос;
	
	Если Документ.Свойство("ID") Тогда
		Запрос.УстановитьПараметр("id_doc", Документ.ID);
		Запрос.УстановитьПараметр("sid", Неопределено);
	ИначеЕсли Документ.Свойство("SID") Тогда 
		Запрос.УстановитьПараметр("sid", Документ.SID);
		Запрос.УстановитьПараметр("id_doc", Неопределено);
	Иначе
		Возврат ДанныеДокументов;
	КонецЕсли;

	Запрос.Текст =
		"ВЫБРАТЬ
		|	SUI_docs.sid,
		|	SUI_docs.id_doc,
		|	SUI_docs.НастройкаДокумента,
		|	SUI_docs.doc_date,
		|	SUI_docs.doc_n,
		|	SUI_docs.doc_type,
		|	SUI_docs.id_countragents,
		|	SUI_docs.id_warehouse,
		|	SUI_docs.КонтролироватьДокумент,
		|	SUI_docs.ЭтоДокументАдресногоХранения,
		|	SUI_docs.Состояние,
		|	SUI_docs.МобильноеУстройство
		|ИЗ
		|	РегистрСведений.SUI_docs КАК SUI_docs
		|ГДЕ
		|	ВЫБОР
		|		КОГДА &sid <> НЕОПРЕДЕЛЕНО
		|			ТОГДА SUI_docs.sid = &sid
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|	И ВЫБОР
		|		КОГДА &id_doc <> НЕОПРЕДЕЛЕНО
		|			ТОГДА SUI_docs.id_doc = &id_doc
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ДанныеДокументов;
	КонецЕсли;
	
	КолонкиЗапроса = SUI_ОбщегоНазначения.ПолучитьИменаКолонокРезультатаЗапроса(РезультатЗапроса);
	
	ВыборкаДокумент = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДокумент.Следующий() Цикл
		
		ДанныеДокумента = Новый Структура(КолонкиЗапроса);
		ЗаполнитьЗначенияСвойств(ДанныеДокумента, ВыборкаДокумент);
		ДанныеДокумента.Вставить("Таблицы", Новый Соответствие());
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("sid_doc", ДанныеДокумента.sid);
		Запрос.УстановитьПараметр("ШаблонУникальногоИдентификатора", SUI_ОбщегоНазначенияКлиентСервер.ШаблонУникальногоИдентификатора());
		Запрос.УстановитьПараметр("ШаблонИдентификатораSimple", SUI_ИнтеграцияВКонфигурациюКлиентСервер.ШаблонИдентификатораSimple());
		Запрос.УстановитьПараметр("ТаблицаТовары", SUI_ОбщегоНазначенияКлиентСервер.ЗначениеСоответствия(Таблицы,
			Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары, ТаблицаТоварыДокументаОбмена()));
		Запрос.УстановитьПараметр("ТаблицаСерии", SUI_ОбщегоНазначенияКлиентСервер.ЗначениеСоответствия(Таблицы,
			Перечисления.SUI_ТипыТаблицДокументовОбмена.Серии, ТаблицаСерииДокументаОбмена()));
		Запрос.УстановитьПараметр("ТаблицаШтрихкодыУпаковок", SUI_ОбщегоНазначенияКлиентСервер.ЗначениеСоответствия(Таблицы,
			Перечисления.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок, ТаблицаШтрихкодыДокументаОбмена()));
		Запрос.УстановитьПараметр("ТаблицаПотокШтрихкодов", SUI_ОбщегоНазначенияКлиентСервер.ЗначениеСоответствия(Таблицы,
			Перечисления.SUI_ТипыТаблицДокументовОбмена.ПотокШтрихкодов, ТаблицаПотокШтрихкодовОбмена()));
			
		Запрос.УстановитьПараметр("ТаблицаПересчетТоваров", SUI_ОбщегоНазначенияКлиентСервер.ЗначениеСоответствия(Таблицы,
			"ТаблицаПересчетТоваров", ТаблицаПересчетТоваровДокументаОбмена()));
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	&sid_doc КАК sid_doc,
		|	ТаблицаТовары.id_good КАК id_good,
		|	ТаблицаТовары.id_properties КАК id_properties,
		|	ТаблицаТовары.id_series КАК id_series,
		|	ТаблицаТовары.id_cell КАК id_cell,
		|	ТаблицаТовары.id_unit КАК id_unit,
		|	ТаблицаТовары.id_price КАК id_price,
		|	ТаблицаТовары.price,
		|	ТаблицаТовары.qtty,
		|	ТаблицаТовары.qtty_plan,
		|	ВЫБОР
		|		КОГДА ТаблицаТовары.use_series > 1
		|			ТОГДА 1
		|		КОГДА ТаблицаТовары.use_series < 0
		|			ТОГДА 0
		|		ИНАЧЕ ТаблицаТовары.use_series
		|	КОНЕЦ КАК use_series,
		|	ТаблицаТовары.ТипТаблицы КАК ТипТаблицы
		|ПОМЕСТИТЬ втТаблицаТовары
		|ИЗ
		|	&ТаблицаТовары КАК ТаблицаТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&sid_doc КАК sid_doc,
		|	ТаблицаСерии.id_good,
		|	ТаблицаСерии.id_properties,
		|	ТаблицаСерии.id_series,
		|	ТаблицаСерии.id_warehouse,
		|	ТаблицаСерии.qtty,
		|	ТаблицаСерии.name,
		|	ТаблицаСерии.number,
		|	ТаблицаСерии.production_date,
		|	ТаблицаСерии.best_before
		|ПОМЕСТИТЬ втТаблицаСерии
		|ИЗ
		|	&ТаблицаСерии КАК ТаблицаСерии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&sid_doc КАК sid_doc,
		|	ТаблицаШтрихкодыУпаковок.id_marking_code,
		|	ТаблицаШтрихкодыУпаковок.id_good,
		|	ТаблицаШтрихкодыУпаковок.id_property,
		|	ТаблицаШтрихкодыУпаковок.id_series,
		|	ТаблицаШтрихкодыУпаковок.id_unit,
		|	ТаблицаШтрихкодыУпаковок.id_cell,
		|	ТаблицаШтрихкодыУпаковок.id_SSCC,
		|	ТаблицаШтрихкодыУпаковок.SSCC,
		|	ТаблицаШтрихкодыУпаковок.mark_code,
		|	ТаблицаШтрихкодыУпаковок.barcode_from_scanner,
		|	ТаблицаШтрихкодыУпаковок.ШтрихкодBase64,
		|	ТаблицаШтрихкодыУпаковок.SSCCBase64,
		|	ТаблицаШтрихкодыУпаковок.series_number
		|ПОМЕСТИТЬ втТаблицаШтрихкодыУпаковок
		|ИЗ
		|	&ТаблицаШтрихкодыУпаковок КАК ТаблицаШтрихкодыУпаковок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&sid_doc КАК sid_doc,
		|	ТаблицаПотокШтрихкодов.barcode,
		|	ТаблицаПотокШтрихкодов.ШтрихкодBase64,
		|	ТаблицаПотокШтрихкодов.ЭтоШтрихкодКМ,
		|	ТаблицаПотокШтрихкодов.ЭтоШтрихкодSSCC
		|ПОМЕСТИТЬ втТаблицаПотокШтрихкодов
		|ИЗ
		|	&ТаблицаПотокШтрихкодов КАК ТаблицаПотокШтрихкодов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&sid_doc КАК sid_doc,
		|	ТаблицаПересчетТоваров.id_good,
		|	ТаблицаПересчетТоваров.id_properties,
		|	ТаблицаПересчетТоваров.id_series,
		|	ТаблицаПересчетТоваров.id_cell,
		|	ТаблицаПересчетТоваров.id_unit,
		|	ТаблицаПересчетТоваров.id_price,
		|	ТаблицаПересчетТоваров.price,
		|	ТаблицаПересчетТоваров.d_qtty,
		|	ВЫБОР
		|		КОГДА ТаблицаПересчетТоваров.use_series > 1
		|			ТОГДА 1
		|		КОГДА ТаблицаПересчетТоваров.use_series < 0
		|			ТОГДА 0
		|		ИНАЧЕ ТаблицаПересчетТоваров.use_series
		|	КОНЕЦ КАК use_series,
		|	ТаблицаПересчетТоваров.ТипТаблицы
		|ПОМЕСТИТЬ втТаблицаПересчетТоваров
		|ИЗ
		|	&ТаблицаПересчетТоваров КАК ТаблицаПересчетТоваров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(SUI_docs_tbl_goods.sid, """") КАК sid,
		|	втТаблицаТовары.sid_doc,
		|	втТаблицаТовары.id_good,
		|	втТаблицаТовары.id_properties,
		|	втТаблицаТовары.id_series,
		|	втТаблицаТовары.id_cell,
		|	втТаблицаТовары.id_unit,
		|	втТаблицаТовары.id_price,
		|	ЕСТЬNULL(SUI_docs_tbl_goods.price, втТаблицаТовары.price) КАК price,
		|	втТаблицаТовары.qtty,
		|	ЕСТЬNULL(SUI_docs_tbl_goods.qtty_plan, 0) КАК qtty_plan,
		|	ЕСТЬNULL(SUI_docs_tbl_goods.use_series, втТаблицаТовары.use_series) КАК use_series,
		|	втТаблицаТовары.ТипТаблицы КАК ТипТаблицы
		|ИЗ
		|	втТаблицаТовары КАК втТаблицаТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.SUI_docs_tbl_goods КАК SUI_docs_tbl_goods
		|		ПО втТаблицаТовары.sid_doc = SUI_docs_tbl_goods.sid_doc
		|		И втТаблицаТовары.id_good = SUI_docs_tbl_goods.id_good
		|		И втТаблицаТовары.id_properties = SUI_docs_tbl_goods.id_properties
		|		И втТаблицаТовары.id_series = SUI_docs_tbl_goods.id_series
		|		И втТаблицаТовары.id_cell = SUI_docs_tbl_goods.id_cell
		|		И втТаблицаТовары.id_unit = SUI_docs_tbl_goods.id_unit
		|		И втТаблицаТовары.id_price = SUI_docs_tbl_goods.id_price
		|		И втТаблицаТовары.ТипТаблицы = SUI_docs_tbl_goods.ТипТаблицы
		|ГДЕ
		|	втТаблицаТовары.id_good <> """"
		|ИТОГИ
		|ПО
		|	ТипТаблицы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ втТаблицаТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(SUI_docs_tbl_series.sid, """") КАК sid,
		|	втТаблицаСерии.sid_doc,
		|	втТаблицаСерии.id_good,
		|	втТаблицаСерии.id_properties,
		|	ЕСТЬNULL(SUI_docs_tbl_series.id_series, ВЫБОР
		|		КОГДА втТаблицаСерии.id_series ПОДОБНО &ШаблонИдентификатораSimple
		|			ТОГДА втТаблицаСерии.id_series
		|		ИНАЧЕ """"
		|	КОНЕЦ) КАК id_series,
		|	втТаблицаСерии.id_warehouse,
		|	втТаблицаСерии.qtty,
		|	втТаблицаСерии.name,
		|	втТаблицаСерии.number,
		|	втТаблицаСерии.production_date,
		|	втТаблицаСерии.best_before,
		|	ВЫБОР
		|		КОГДА SUI_docs_tbl_series.sid ЕСТЬ NULL
		|		ИЛИ SUI_docs_tbl_series.id_series ЕСТЬ NULL
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.SUI_СтатусыОбработкиСтрок.Новая)
		|		ИНАЧЕ SUI_docs_tbl_series.СтатусОбработки
		|	КОНЕЦ КАК СтатусОбработки
		|ИЗ
		|	втТаблицаСерии КАК втТаблицаСерии
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.SUI_docs_tbl_series КАК SUI_docs_tbl_series
		|		ПО втТаблицаСерии.sid_doc = SUI_docs_tbl_series.sid_doc
		|		И втТаблицаСерии.id_good = SUI_docs_tbl_series.id_good
		|		И втТаблицаСерии.id_properties = SUI_docs_tbl_series.id_properties
		|		И втТаблицаСерии.id_warehouse = SUI_docs_tbl_series.id_warehouse
		|		И ВЫБОР
		|			КОГДА втТаблицаСерии.id_series ПОДОБНО &ШаблонИдентификатораSimple
		|				ТОГДА втТаблицаСерии.id_series = SUI_docs_tbl_series.id_series
		|			ИНАЧЕ ВЫБОР
		|				КОГДА втТаблицаСерии.name <> """"
		|				И втТаблицаСерии.number <> """"
		|					ТОГДА втТаблицаСерии.name = SUI_docs_tbl_series.name
		|					И втТаблицаСерии.number = SUI_docs_tbl_series.number
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ
		|		КОНЕЦ
		|ГДЕ
		|	втТаблицаСерии.id_good ПОДОБНО &ШаблонИдентификатораSimple
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ втТаблицаСерии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(SUI_docs_tbl_barcodes.sid, """") КАК sid,
		|	втТаблицаШтрихкодыУпаковок.sid_doc,
		|	ЕСТЬNULL(SUI_docs_tbl_barcodes.id_marking_code, втТаблицаШтрихкодыУпаковок.id_marking_code) КАК id_marking_code,
		|	ЕСТЬNULL(SUI_docs_tbl_barcodes.id_SSCC, втТаблицаШтрихкодыУпаковок.id_SSCC) КАК id_SSCC,
		|	втТаблицаШтрихкодыУпаковок.id_good,
		|	втТаблицаШтрихкодыУпаковок.id_property,
		|	втТаблицаШтрихкодыУпаковок.id_series,
		|	втТаблицаШтрихкодыУпаковок.id_unit, 
		|	втТаблицаШтрихкодыУпаковок.id_cell,
		|	ЕСТЬNULL(SUI_docs_tbl_barcodes.mark_code, втТаблицаШтрихкодыУпаковок.mark_code) КАК mark_code,
		|	ЕСТЬNULL(SUI_docs_tbl_barcodes.barcode_from_scanner, втТаблицаШтрихкодыУпаковок.barcode_from_scanner) КАК barcode_from_scanner,
		|	ЕСТЬNULL(SUI_docs_tbl_barcodes.SSCC, втТаблицаШтрихкодыУпаковок.SSCC) КАК SSCC,
		|	ЕСТЬNULL(SUI_docs_tbl_barcodes.series_number, втТаблицаШтрихкодыУпаковок.series_number) КАК series_number,
		|	ВЫБОР
		|		КОГДА НЕ SUI_docs_tbl_barcodes.sid ЕСТЬ NULL
		|		И SUI_docs_tbl_barcodes.id_marking_code ПОДОБНО &ШаблонИдентификатораSimple
		|		И SUI_docs_tbl_barcodes.mark_code <> """"
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.SUI_СтатусыОбработкиСтрок.ОбработкаНеТребуется)
		|		ИНАЧЕ ВЫБОР
		|			КОГДА втТаблицаШтрихкодыУпаковок.id_marking_code ПОДОБНО &ШаблонИдентификатораSimple
		|			И втТаблицаШтрихкодыУпаковок.mark_code <> """"
		|				ТОГДА ЗНАЧЕНИЕ(Перечисление.SUI_СтатусыОбработкиСтрок.ОбработкаНеТребуется)
		|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.SUI_СтатусыОбработкиСтрок.Новая)
		|		КОНЕЦ
		|	КОНЕЦ КАК СтатусОбработки,
		|	втТаблицаШтрихкодыУпаковок.ШтрихкодBase64,
		|	втТаблицаШтрихкодыУпаковок.SSCCBase64
		|ИЗ
		|	втТаблицаШтрихкодыУпаковок КАК втТаблицаШтрихкодыУпаковок
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.SUI_docs_tbl_barcodes КАК SUI_docs_tbl_barcodes
		|		ПО втТаблицаШтрихкодыУпаковок.sid_doc = SUI_docs_tbl_barcodes.sid_doc
		|		И втТаблицаШтрихкодыУпаковок.id_good = SUI_docs_tbl_barcodes.id_good
		|		И втТаблицаШтрихкодыУпаковок.id_property = SUI_docs_tbl_barcodes.id_property
		|		И втТаблицаШтрихкодыУпаковок.id_series = SUI_docs_tbl_barcodes.id_series
		|		И втТаблицаШтрихкодыУпаковок.id_unit = SUI_docs_tbl_barcodes.id_unit
		|		И втТаблицаШтрихкодыУпаковок.id_cell = SUI_docs_tbl_barcodes.id_cell
		|		И ВЫБОР
		|			КОГДА втТаблицаШтрихкодыУпаковок.id_marking_code ПОДОБНО &ШаблонИдентификатораSimple
		|				ТОГДА втТаблицаШтрихкодыУпаковок.id_marking_code = SUI_docs_tbl_barcodes.id_marking_code
		|			ИНАЧЕ втТаблицаШтрихкодыУпаковок.mark_code = SUI_docs_tbl_barcodes.mark_code
		|		КОНЕЦ
		|ГДЕ
		|	(втТаблицаШтрихкодыУпаковок.id_marking_code ПОДОБНО &ШаблонИдентификатораSimple
		|	ИЛИ втТаблицаШтрихкодыУпаковок.mark_code <> """")
		|	И втТаблицаШтрихкодыУпаковок.id_good <> """"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ втТаблицаШтрихкодыУпаковок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТаблицаПотокШтрихкодов.sid_doc,
		|	втТаблицаПотокШтрихкодов.barcode,
		|	втТаблицаПотокШтрихкодов.ШтрихкодBase64,
		|	втТаблицаПотокШтрихкодов.ЭтоШтрихкодКМ,
		|	втТаблицаПотокШтрихкодов.ЭтоШтрихкодSSCC
		|ИЗ
		|	втТаблицаПотокШтрихкодов КАК втТаблицаПотокШтрихкодов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ втТаблицаПотокШтрихкодов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТаблицаПересчетТоваров.sid_doc,
		|	втТаблицаПересчетТоваров.id_good,
		|	втТаблицаПересчетТоваров.id_properties,
		|	втТаблицаПересчетТоваров.id_series,
		|	втТаблицаПересчетТоваров.id_cell,
		|	втТаблицаПересчетТоваров.id_unit,
		|	втТаблицаПересчетТоваров.id_price,
		|	втТаблицаПересчетТоваров.price,
		|	втТаблицаПересчетТоваров.d_qtty,
		|	втТаблицаПересчетТоваров.use_series,
		|	втТаблицаПересчетТоваров.ТипТаблицы
		|ИЗ
		|	втТаблицаПересчетТоваров КАК втТаблицаПересчетТоваров
		|ГДЕ
		|	втТаблицаПересчетТоваров.id_good <> """"
		|	И втТаблицаПересчетТоваров.ТипТаблицы <> ЗНАЧЕНИЕ(Перечисление.SUI_ТипыТаблицДокументовОбмена.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ втТаблицаПересчетТоваров";	
		
		//@skip-check query-in-loop
		РезультатЗапроса = Запрос.ВыполнитьПакет();

		РезультатТовары = РезультатЗапроса[5];
		РезультатСерии = РезультатЗапроса[7];
		РезультатШК = РезультатЗапроса[9];
		РезультатПотокШК = РезультатЗапроса[11];
		РезультатПересчетТоваров = РезультатЗапроса[13];
		
		Если Не РезультатТовары.Пустой() Тогда
			
			Выборка = РезультатТовары.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока Выборка.Следующий() Цикл
				
				ТаблицаДанных = ТаблицаТоварыДокументаОбмена();

				ДетальныеЗаписи = Выборка.Выбрать();
				
				Пока ДетальныеЗаписи.Следующий() Цикл
					
					СтрокаТаблицы = ТаблицаДанных.Добавить();
					
					ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ДетальныеЗаписи);
					
					Если Не ЗначениеЗаполнено(СтрокаТаблицы.sid) Тогда
						СтрокаТаблицы.sid = Строка(Новый УникальныйИдентификатор());
					КонецЕсли;
					
				КонецЦикла;
				
				ДанныеДокумента.Таблицы.Вставить(Выборка.ТипТаблицы, ТаблицаДанных);
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если Не РезультатСерии.Пустой() Тогда
			
			ТаблицаДанных = ТаблицаСерииДокументаОбмена();
			
			Выборка = РезультатСерии.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				СтрокаТаблицы = ТаблицаДанных.Добавить();
				
				ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Выборка);
				
				Если Не ЗначениеЗаполнено(СтрокаТаблицы.sid) Тогда
					СтрокаТаблицы.sid = Строка(Новый УникальныйИдентификатор());
				КонецЕсли;
				
			КонецЦикла;
			
			ДанныеДокумента.Таблицы.Вставить(Перечисления.SUI_ТипыТаблицДокументовОбмена.Серии, ТаблицаДанных);
			
		КонецЕсли;
		
		Если Не РезультатШК.Пустой() Тогда
			
			ТаблицаДанных = ТаблицаШтрихкодыДокументаОбмена();
			
			Выборка = РезультатШК.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				СтрокаТаблицы = ТаблицаДанных.Добавить();
				
				ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Выборка);
				
				Если Не ЗначениеЗаполнено(СтрокаТаблицы.sid) Тогда
					СтрокаТаблицы.sid = Строка(Новый УникальныйИдентификатор());
				КонецЕсли;
				
			КонецЦикла;
			
			ДанныеДокумента.Таблицы.Вставить(Перечисления.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок, ТаблицаДанных);
			
		КонецЕсли;
		
		Если Не РезультатПотокШК.Пустой() Тогда
			
			ТаблицаДанных = ТаблицаПотокШтрихкодовОбмена();
			
			Выборка = РезультатПотокШК.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				СтрокаТаблицы = ТаблицаДанных.Добавить();
				
				ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Выборка);
				
				Если Не ЗначениеЗаполнено(СтрокаТаблицы.sid) Тогда
					СтрокаТаблицы.sid = Строка(Новый УникальныйИдентификатор());
				КонецЕсли;
				
			КонецЦикла;
			
			ДанныеДокумента.Таблицы.Вставить(Перечисления.SUI_ТипыТаблицДокументовОбмена.ПотокШтрихкодов, ТаблицаДанных);
			
		КонецЕсли;
		
		Если Не РезультатПересчетТоваров.Пустой() Тогда
			
			ТаблицаДанных = ТаблицаПересчетТоваровДокументаОбмена();
			
			Выборка = РезультатПересчетТоваров.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				СтрокаТаблицы = ТаблицаДанных.Добавить();
				
				ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Выборка);
				
				Если Не ЗначениеЗаполнено(СтрокаТаблицы.sid) Тогда
					СтрокаТаблицы.sid = Строка(Новый УникальныйИдентификатор());
				КонецЕсли;
				
			КонецЦикла;
			
			ДанныеДокумента.Таблицы.Вставить("ТаблицаПересчетТоваров", ТаблицаДанных);
			
		КонецЕсли;
		
		Если ДанныеДокумента.Таблицы.Количество() > 0 Или (ДанныеДокумента.Таблицы.Количество() = 0 И БезТаблиц) Тогда
			ДанныеДокументов.Добавить(ДанныеДокумента);
		КонецЕсли;

	КонецЦикла;
	
	Возврат ДанныеДокументов;
	
КонецФункции

Функция ТребуетсяОбновлениеЗаписиДокументаОбмена(ЗаписьНабора, СформированныеДанные)
	
	Результат = Ложь;
	
	ПроверяемыеДанные = Новый Массив();
	ПроверяемыеДанные.Добавить("Состояние");
	ПроверяемыеДанные.Добавить("МобильноеУстройство");
	ПроверяемыеДанные.Добавить("doc_n");
	ПроверяемыеДанные.Добавить("doc_date");
	ПроверяемыеДанные.Добавить("id_countragents");
	ПроверяемыеДанные.Добавить("id_warehouse");
	ПроверяемыеДанные.Добавить("ЭтоДокументАдресногоХранения");
	ПроверяемыеДанные.Добавить("КонтролироватьДокумент");
	ПроверяемыеДанные.Добавить("barcode");
	ПроверяемыеДанные.Добавить("use_mark");
	ПроверяемыеДанные.Добавить("additional_details");
	ПроверяемыеДанные.Добавить("is_barc_flow");
	
	// 20.09.2024 - artem - B119267 >>>
	ПроверяемыеДанные.Добавить("Агрегация");
	// 20.09.2024 - artem - B119267 <<<
	
	// 20.09.2024 - artem - B120423 >>>
	ПроверяемыеДанные.Добавить("process_type");
	ПроверяемыеДанные.Добавить("cells_process_type");
	// 20.09.2024 - artem - B120423 <<<
	
	Для индекс = 0 По ПроверяемыеДанные.ВГраница() Цикл
		
		Если СформированныеДанные.Свойство(ПроверяемыеДанные[индекс]) И
			ЗаписьНабора[ПроверяемыеДанные[индекс]] <> СформированныеДанные[ПроверяемыеДанные[индекс]] Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
		
КонецФункции

#КонецОбласти

#Область ЗагрузкаДокументаОбменаВДокумент

Процедура ЗагрузитьТаблицыДокументаОбменаВДокументОбъект_ШтрихкодыУпаковок(ДокументОбъект, ТаблицаДокументаОбмена, НастройкаТабличнойЧасти, АлгоритмОбработкиСтрок)
	
	Если Не ЗначениеЗаполнено(ТаблицаДокументаОбмена) Или Не ЗначениеЗаполнено(НастройкаТабличнойЧасти) Или
		НастройкаТабличнойЧасти.ТипТаблицы <> Перечисления.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок Или
		Не ЗначениеЗаполнено(НастройкаТабличнойЧасти.ИмяТабличнойЧасти) Тогда
		Возврат;
	КонецЕсли;
	
	НастройкаРеквизитаШтрихкодУпаковки = НастройкаТабличнойЧасти.Элементы.Получить("id_marking_code");
	
	Если Не ЗначениеЗаполнено(НастройкаРеквизитаШтрихкодУпаковки) Или НастройкаРеквизитаШтрихкодУпаковки.Имя = Неопределено Или
		ТаблицаДокументаОбмена.Колонки.Найти("id_marking_code") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из ТаблицаДокументаОбмена Цикл

		ПараметрыОтбора = СформироватьПараметрыОтбора(НастройкаТабличнойЧасти.Элементы, СтрокаТаблицы, "id_marking_code");
		
		Если Не ЗначениеЗаполнено(ПараметрыОтбора) Тогда
			Продолжить;
		КонецЕсли;
		
		// Найти строки штрихкода упаковки в табличной части
		СтрокиВДокументе = ДокументОбъект[НастройкаТабличнойЧасти.ИмяТабличнойЧасти].НайтиСтроки(ПараметрыОтбора);
		
		// Если штрихкод упаковки уже есть в табличной части
		Если СтрокиВДокументе.Количество() > 0 Тогда
			Для Каждого СтрокаВДокументе Из СтрокиВДокументе Цикл
				СтрокаТаблицы.НомерСтроки = СтрокаВДокументе.НомерСтроки;
			КонецЦикла;
			Продолжить;
		КонецЕсли;
		
		// Если штрихкод упаковки отсутствует в табличной части, то добавить
		ТекущаяСтрока = ДокументОбъект[НастройкаТабличнойЧасти.ИмяТабличнойЧасти].Добавить(); 
		ТекущаяСтрока[НастройкаРеквизитаШтрихкодУпаковки.Имя] = НастройкаРеквизитаШтрихкодУпаковки.Тип.ПривестиЗначение(
			СтрокаТаблицы.id_marking_code);
		
		СтрокаТаблицы.НомерСтроки = ТекущаяСтрока.НомерСтроки;
		
		// Выполнить произвольный алгоритм после программной обработки строки
		ВыполнитьПроизвольныйАлгоритм_ОбработкаСтрокиТабличнойЧасти(АлгоритмОбработкиСтрок, ДокументОбъект, ТекущаяСтрока);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьТаблицыДокументаОбменаВДокументОбъект_Серии(ДокументОбъект, ТаблицаДокументаОбмена, НастройкаТабличнойЧасти, АлгоритмОбработкиСтрок)
	
	Если Не ЗначениеЗаполнено(ТаблицаДокументаОбмена) Или Не ЗначениеЗаполнено(НастройкаТабличнойЧасти) Или
		НастройкаТабличнойЧасти.ТипТаблицы <> Перечисления.SUI_ТипыТаблицДокументовОбмена.Серии Или
		Не ЗначениеЗаполнено(НастройкаТабличнойЧасти.ИмяТабличнойЧасти) Тогда
		Возврат;
	КонецЕсли;
	
	НастройкаРеквизитаКоличество = НастройкаТабличнойЧасти.Элементы.Получить("qtty");

	Для Каждого СтрокаТаблицы Из ТаблицаДокументаОбмена Цикл
		
		СтрокаОбработана = Ложь;
		
		ПараметрыОтбора = СформироватьПараметрыОтбора(НастройкаТабличнойЧасти.Элементы, СтрокаТаблицы, 
			"id_good,id_properties,id_series,id_warehouse");
		
		Если Не ЗначениеЗаполнено(ПараметрыОтбора) Тогда
			Продолжить;
		КонецЕсли;
		
		// Найти строки по отбору
		СтрокиВДокументе = ДокументОбъект[НастройкаТабличнойЧасти.ИмяТабличнойЧасти].НайтиСтроки(ПараметрыОтбора);
		
		Если СтрокиВДокументе.Количество() > 0 Тогда
			// Выбрать найденную строку
			ТекущаяСтрока = СтрокиВДокументе[0];
		Иначе
			// Добавить новую строку
			ТекущаяСтрока = ДокументОбъект[НастройкаТабличнойЧасти.ИмяТабличнойЧасти].Добавить();
			ЗаполнитьЗначенияСвойств(ТекущаяСтрока, ПараметрыОтбора);
			СтрокаОбработана = Истина;
		КонецЕсли;
		
		СтрокаТаблицы.НомерСтроки = ТекущаяСтрока.НомерСтроки;
		
		// Обновить количество
		Если ЗначениеЗаполнено(НастройкаРеквизитаКоличество) И НастройкаРеквизитаКоличество.Имя <> Неопределено Тогда
			ТекущаяСтрока[НастройкаРеквизитаКоличество.Имя] = НастройкаРеквизитаКоличество.Тип.ПривестиЗначение(
				СтрокаТаблицы["qtty"]);
			СтрокаОбработана = Истина;
		КонецЕсли;

		// Выполнить произвольный алгоритм после программной обработки строки
		Если СтрокаОбработана Тогда
			ВыполнитьПроизвольныйАлгоритм_ОбработкаСтрокиТабличнойЧасти(АлгоритмОбработкиСтрок, ДокументОбъект, ТекущаяСтрока);
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьТаблицыДокументаОбменаВДокументОбъект_Товары(ДокументОбъект, ТаблицаДокументаОбмена, 
	НастройкаТабличнойЧасти, НастройкаТабличнойЧастиСерии,  АлгоритмОбработкиСтрок, ТаблицаСерийБезНастройки)
	
	Если Не ЗначениеЗаполнено(ТаблицаДокументаОбмена) Или Не ЗначениеЗаполнено(НастройкаТабличнойЧасти) Или
		(НастройкаТабличнойЧасти.ТипТаблицы <> Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары И
		НастройкаТабличнойЧасти.ТипТаблицы <> Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор И
		НастройкаТабличнойЧасти.ТипТаблицы <> Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение) Или
		Не ЗначениеЗаполнено(НастройкаТабличнойЧасти.ИмяТабличнойЧасти) Тогда
		Возврат;
	КонецЕсли;
	
	НастройкаРеквизитаКоличество 	= НастройкаТабличнойЧасти.Элементы.Получить("qtty");
	НастройкаРеквизитаСерия 		= НастройкаТабличнойЧасти.Элементы.Получить("id_series");

	Для Каждого СтрокаТаблицы Из ТаблицаДокументаОбмена Цикл
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.НомерСтроки) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаОбработана = Ложь;
		мсвНовыеСтроки = Новый Массив();
		
		ПараметрыОтбора = СформироватьПараметрыОтбора(НастройкаТабличнойЧасти.Элементы, СтрокаТаблицы, 
			"id_good,id_properties,id_series,id_cell,id_unit");
		
		Если Не ЗначениеЗаполнено(ПараметрыОтбора) Тогда
			Продолжить;
		КонецЕсли;
		
		// Найти строки по отбору
		СтрокиВДокументе = ДокументОбъект[НастройкаТабличнойЧасти.ИмяТабличнойЧасти].НайтиСтроки(ПараметрыОтбора);
		
		Если СтрокиВДокументе.Количество() > 0 Тогда
			// Выбрать найденную строку
			ТекущаяСтрока = СтрокиВДокументе[0];
		Иначе
			// Добавить новую строку
			ТекущаяСтрока = ДокументОбъект[НастройкаТабличнойЧасти.ИмяТабличнойЧасти].Добавить();
			ДанныеКЗаполнению = СформироватьПараметрыОтбора(НастройкаТабличнойЧасти.Элементы, СтрокаТаблицы, 
				"id_good,id_properties,id_series,id_cell,id_unit,id_price,price");
			ЗаполнитьЗначенияСвойств(ТекущаяСтрока, ДанныеКЗаполнению);
			СтрокаОбработана = Истина;
		КонецЕсли;
		
		СтрокаТаблицы.НомерСтроки = ТекущаяСтрока.НомерСтроки;
		
		// Обновить количество
		Если ЗначениеЗаполнено(НастройкаРеквизитаКоличество) И НастройкаРеквизитаКоличество.Имя <> Неопределено Тогда
			ТекущаяСтрока[НастройкаРеквизитаКоличество.Имя] = НастройкаРеквизитаКоличество.Тип.ПривестиЗначение(
				СтрокаТаблицы["qtty"]);
			СтрокаОбработана = Истина;
		КонецЕсли;
		
		// Обновить серию в строке
		Если ЗначениеЗаполнено(НастройкаРеквизитаСерия) И НастройкаРеквизитаСерия.Имя <> Неопределено И
			Не ЗначениеЗаполнено(ТекущаяСтрока[НастройкаРеквизитаСерия.Имя]) Тогда
			// Получить серию
			Если ЗначениеЗаполнено(НастройкаТабличнойЧастиСерии) Тогда
				//@skip-check query-in-loop
				ЗаполнитьСериюВСтрокеТабличнойЧастиТоварыДокумента(ДокументОбъект, ТекущаяСтрока, 
					НастройкаТабличнойЧасти, НастройкаТабличнойЧастиСерии);
				СтрокаОбработана = Истина;
			ИначеЕсли ЗначениеЗаполнено(ТаблицаСерийБезНастройки) Тогда

				ПараметрыЗаполненияСерии = ПараметрыЗаполненияСерииВДокументе();
				ПараметрыЗаполненияСерии.НастройкаТЧТовары = НастройкаТабличнойЧасти;
				ПараметрыЗаполненияСерии.ТЧТоварыДокумента = ДокументОбъект[НастройкаТабличнойЧасти.ИмяТабличнойЧасти];
				ПараметрыЗаполненияСерии.ТаблицаТоварыДокументаОбмена = ТаблицаДокументаОбмена;
				ПараметрыЗаполненияСерии.ТаблицаСерийДокументаОбмена = ТаблицаСерийБезНастройки;
				ПараметрыЗаполненияСерии.ТекущаяСтрокаДокумента = ТекущаяСтрока;
				ПараметрыЗаполненияСерии.ТекущаяСтрокаДокументаОбмена = СтрокаТаблицы;

				сткРезультат = ЗаполнитьСериюВСтрокеТабличнойЧастиТоварыДокументаПоСерииБезНастройки(ПараметрыЗаполненияСерии);
				
				Если сткРезультат.СтрокаОбработана Тогда
					СтрокаОбработана = Истина;
					мсвНовыеСтроки = сткРезультат.НовыеСтроки;
				КонецЕсли;

			КонецЕсли;
			
		КонецЕсли;

		// Выполнить произвольный алгоритм после программной обработки строки
		Если СтрокаОбработана Тогда
			ВыполнитьПроизвольныйАлгоритм_ОбработкаСтрокиТабличнойЧасти(АлгоритмОбработкиСтрок, ДокументОбъект, ТекущаяСтрока);
		КонецЕсли;
		
		Для Каждого НоваяСтрока Из мсвНовыеСтроки Цикл
			ВыполнитьПроизвольныйАлгоритм_ОбработкаСтрокиТабличнойЧасти(АлгоритмОбработкиСтрок, ДокументОбъект, НоваяСтрока);
		КонецЦикла;
		
		мсвНовыеСтроки.Очистить();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСериюВСтрокеТабличнойЧастиТоварыДокумента(ДокументОбъект, СтрокаТовары, НастройкаТЧТовары, НастройкаТЧСерии)
	
	Если Не ЗначениеЗаполнено(НастройкаТЧТовары) Или Не ЗначениеЗаполнено(НастройкаТЧСерии) Или
		НастройкаТЧСерии.ТипТаблицы <> Перечисления.SUI_ТипыТаблицДокументовОбмена.Серии Или
		Не ЗначениеЗаполнено(НастройкаТЧСерии.ИмяТабличнойЧасти) Или
		(НастройкаТЧТовары.ТипТаблицы <> Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары И
		НастройкаТЧТовары.ТипТаблицы <> Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор И
		НастройкаТЧТовары.ТипТаблицы <> Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение) Или
		Не ЗначениеЗаполнено(НастройкаТЧТовары.ИмяТабличнойЧасти) Тогда
		Возврат;
	КонецЕсли;
	
	Если ДокументОбъект[НастройкаТЧСерии.ИмяТабличнойЧасти].Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Товары_РеквизитСерия 			= НастройкаТЧТовары.Элементы.Получить("id_series");
	Товары_РеквизитНоменклатура		= НастройкаТЧТовары.Элементы.Получить("id_good");
	Товары_РеквизитХарактеристика	= НастройкаТЧТовары.Элементы.Получить("id_properties");
	
	
	Если Не ЗначениеЗаполнено(Товары_РеквизитСерия) Или Товары_РеквизитСерия.Имя = Неопределено Или 
		Не ЗначениеЗаполнено(Товары_РеквизитНоменклатура) Или Товары_РеквизитНоменклатура.Имя = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Серии_РеквизитСерия 			= НастройкаТЧТовары.Элементы.Получить("id_series");
	Серии_РеквизитНоменклатура		= НастройкаТЧТовары.Элементы.Получить("id_good");
	Серии_РеквизитХарактеристика	= НастройкаТЧТовары.Элементы.Получить("id_properties");
	
	Если Не ЗначениеЗаполнено(Серии_РеквизитСерия) Или Серии_РеквизитСерия.Имя = Неопределено Или 
		Не ЗначениеЗаполнено(Серии_РеквизитНоменклатура) Или Серии_РеквизитНоменклатура.Имя = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	
	//@skip-check bsl-variable-name-invalid
	мсвВыбрать 			= ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("Таблица." + Серии_РеквизитНоменклатура.Имя + " КАК " + Серии_РеквизитНоменклатура.Имя);
	//@skip-check bsl-variable-name-invalid
	мсвУсловия 			= ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("Таблица." + Серии_РеквизитНоменклатура.Имя + " = &" + Серии_РеквизитНоменклатура.Имя);
	//@skip-check bsl-variable-name-invalid
	мсвСгруппировать 	= ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("втТаблица." + Серии_РеквизитНоменклатура.Имя);
	Запрос.УстановитьПараметр(Серии_РеквизитНоменклатура.Имя, СтрокаТовары[Товары_РеквизитНоменклатура.Имя]);
	
	Если ЗначениеЗаполнено(Товары_РеквизитХарактеристика) И 
		Товары_РеквизитХарактеристика.Имя <> Неопределено И 
		ЗначениеЗаполнено(Серии_РеквизитХарактеристика) И
		Серии_РеквизитХарактеристика.Имя <> Неопределено Тогда
		мсвВыбрать.Добавить("Таблица." + Серии_РеквизитХарактеристика.Имя + " КАК " + Серии_РеквизитХарактеристика.Имя);
		мсвУсловия.Добавить("Таблица." + Серии_РеквизитХарактеристика.Имя + " = &" + Серии_РеквизитХарактеристика.Имя);
		мсвСгруппировать.Добавить("втТаблица." + Серии_РеквизитХарактеристика.Имя);
		Запрос.УстановитьПараметр(Серии_РеквизитХарактеристика.Имя, СтрокаТовары[Товары_РеквизитХарактеристика.Имя]);
	КонецЕсли;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	Запрос.УстановитьПараметр("Таблица", ДокументОбъект[НастройкаТЧСерии.ИмяТабличнойЧасти].Выгрузить());
	Запрос.Текст = "ВЫБРАТЬ
	|	Таблица." + Серии_РеквизитСерия.Имя + " КАК Серия,
	|	" + СтрСоединить(мсвВыбрать, ","  + Символы.ПС) + "
	|ПОМЕСТИТЬ втТаблица
	|ИЗ
	|	&Таблица КАК Таблица
	|ГДЕ
	|	" + СтрСоединить(мсвУсловия, Символы.ПС + Символы.Таб + "И ") + "
	|;
	|//////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	МАКСИМУМ(втТаблица.Серия) КАК Серия
	|ИЗ
	|	втТаблица КАК втТаблица
	|СГРУППИРОВАТЬ ПО
	|	" + СтрСоединить(мсвСгруппировать, "," + Символы.ПС);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	СтрокаТовары[Товары_РеквизитСерия.Имя] = Выборка.Серия;
	
КонецПроцедуры

Функция ПараметрыЗаполненияСерииВДокументе()
	
	ПараметрыЗаполненияСерии = Новый Структура();
	
	ПараметрыЗаполненияСерии.Вставить("НастройкаТЧТовары");
	ПараметрыЗаполненияСерии.Вставить("НастройкаТЧСерии");
	ПараметрыЗаполненияСерии.Вставить("ТЧТоварыДокумента");
	ПараметрыЗаполненияСерии.Вставить("ТаблицаТоварыДокументаОбмена");
	ПараметрыЗаполненияСерии.Вставить("ТаблицаСерийДокументаОбмена");
	ПараметрыЗаполненияСерии.Вставить("ТекущаяСтрокаДокумента");
	ПараметрыЗаполненияСерии.Вставить("ТекущаяСтрокаДокументаОбмена");

	Возврат ПараметрыЗаполненияСерии;
	
КонецФункции

// Заполнить серию в строке табличной части товары документа по серии без настройки.
// 
// Параметры:
//  ПараметрыЗаполнения - Структура - Параметры заполнения см. ПараметрыЗаполненияСерииВДокументе
// 
// Возвращаемое значение:
//  Массив - Массив новых строк документа
//@skip-check doc-comment-collection-item-type
Функция ЗаполнитьСериюВСтрокеТабличнойЧастиТоварыДокументаПоСерииБезНастройки(ПараметрыЗаполнения)
	
	//@skip-check bsl-variable-name-invalid
	сткРезультат = Новый Структура("СтрокаОбработана, НовыеСтроки", Ложь, Новый Массив());
	
	Если Не ЗначениеЗаполнено(ПараметрыЗаполнения.НастройкаТЧТовары) Или
		Не ЗначениеЗаполнено(ПараметрыЗаполнения.ТЧТоварыДокумента) Или
		Не ЗначениеЗаполнено(ПараметрыЗаполнения.ТаблицаТоварыДокументаОбмена) Или
		Не ЗначениеЗаполнено(ПараметрыЗаполнения.ТаблицаСерийДокументаОбмена) Или
		Не ЗначениеЗаполнено(ПараметрыЗаполнения.ТекущаяСтрокаДокумента) Или
		Не ЗначениеЗаполнено(ПараметрыЗаполнения.ТекущаяСтрокаДокументаОбмена) Тогда
		Возврат сткРезультат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыЗаполнения.НастройкаТЧСерии) Тогда
		// сткРезультат = ЗаполнитьСериюВСтрокеТабличнойЧастиТоварыДокумента
		Возврат сткРезультат;
	КонецЕсли;
	
	НастройкаРеквизитаКоличество 	= ПараметрыЗаполнения.НастройкаТЧТовары.Элементы.Получить("qtty");
	НастройкаРеквизитаНоменклатура 	= ПараметрыЗаполнения.НастройкаТЧТовары.Элементы.Получить("id_good");
	НастройкаРеквизитаСерия 		= ПараметрыЗаполнения.НастройкаТЧТовары.Элементы.Получить("id_series");
	НастройкаРеквизитаХарактеристика = ПараметрыЗаполнения.НастройкаТЧТовары.Элементы.Получить("id_properties");
	НастройкаРеквизитаСклад 		= ПараметрыЗаполнения.НастройкаТЧТовары.Элементы.Получить("id_warehouse");
	
	Если Не ЗначениеЗаполнено(НастройкаРеквизитаНоменклатура) Или 
		Не ЗначениеЗаполнено(НастройкаРеквизитаСерия) Или
		Не ЗначениеЗаполнено(НастройкаРеквизитаКоличество) Или
		ЗначениеЗаполнено(ПараметрыЗаполнения.ТекущаяСтрокаДокумента[НастройкаРеквизитаСерия.Имя]) Тогда
		Возврат сткРезультат;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура("id_good", ПараметрыЗаполнения.ТекущаяСтрокаДокумента[НастройкаРеквизитаНоменклатура.Имя]);
	
	Если ЗначениеЗаполнено(НастройкаРеквизитаХарактеристика) Тогда
		ПараметрыОтбора.Вставить("id_properties", 
			?(ЗначениеЗаполнено(ПараметрыЗаполнения.ТекущаяСтрокаДокумента[НастройкаРеквизитаХарактеристика.Имя]), ПараметрыЗаполнения.ТекущаяСтрокаДокумента[НастройкаРеквизитаХарактеристика.Имя], ""));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НастройкаРеквизитаСклад) Тогда
		ПараметрыОтбора.Вставить("id_warehouse", 
			?(ЗначениеЗаполнено(ПараметрыЗаполнения.ТекущаяСтрокаДокумента[НастройкаРеквизитаСклад.Имя]), ЗначениеЗаполнено(ПараметрыЗаполнения.ТекущаяСтрокаДокумента[НастройкаРеквизитаСклад.Имя]), ""));
	КонецЕсли;
	
	ПараметрыОтбора.Вставить("НомерСтроки", 0);
	
	СтрокиСерий = ПараметрыЗаполнения.ТаблицаСерийДокументаОбмена.НайтиСтроки(ПараметрыОтбора);
	
	КоличествоОстаток = ПараметрыЗаполнения.ТекущаяСтрокаДокументаОбмена.qtty;
	КоличествоПланОстаток = ПараметрыЗаполнения.ТекущаяСтрокаДокументаОбмена.qtty_plan;

	Для Индекс = 0 По СтрокиСерий.ВГраница() Цикл
		
		Если КоличествоОстаток = 0 Тогда
			Прервать;
		КонецЕсли;
		
		Количество = ?(ЗначениеЗаполнено(СтрокиСерий[Индекс].qtty), СтрокиСерий[Индекс].qtty, 1);
		КоличествоПлан = ?(СтрокиСерий.Количество() > 1, Количество, ПараметрыЗаполнения.ТекущаяСтрокаДокументаОбмена.qtty_plan);
		
		Если КоличествоОстаток >= Количество Тогда
			КоличествоОстаток = КоличествоОстаток - Количество;
		Иначе
			
			Количество = КоличествоОстаток;
			КоличествоОстаток = 0;
			
			КопияСтрокиСерии = ПараметрыЗаполнения.ТаблицаСерийДокументаОбмена.Добавить();
			ЗаполнитьЗначенияСвойств(КопияСтрокиСерии, СтрокиСерий[Индекс], , "sid,qtty");
			КопияСтрокиСерии.sid = Строка(Новый УникальныйИдентификатор());
			КопияСтрокиСерии.qtty = СтрокиСерий[Индекс].qtty - Количество;

			СтрокиСерий[Индекс].qtty = Количество;
			
		КонецЕсли;

		КоличествоПланОстаток = КоличествоПланОстаток - КоличествоПлан;

		Если Индекс = 0 Тогда
			СтрокаДокумента = ПараметрыЗаполнения.ТекущаяСтрокаДокумента;
			СтрокаДокументаОбмена = ПараметрыЗаполнения.ТекущаяСтрокаДокументаОбмена;
		Иначе
			
			СтрокаДокумента = ПараметрыЗаполнения.ТЧТоварыДокумента.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДокумента, ПараметрыЗаполнения.ТекущаяСтрокаДокумента, , 
				"НомерСтроки," + НастройкаРеквизитаСерия.Имя + "," + НастройкаРеквизитаКоличество.Имя);
				
			СтрокаДокументаОбмена = ПараметрыЗаполнения.ТаблицаТоварыДокументаОбмена.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДокументаОбмена, ПараметрыЗаполнения.ТекущаяСтрокаДокументаОбмена, , 
				"НомерСтроки, id_series, sid, qtty, qtty_plan");
				
			СтрокаДокументаОбмена.НомерСтроки = СтрокаДокумента.НомерСтроки;
			СтрокаДокументаОбмена.sid = Строка(Новый УникальныйИдентификатор());
			
			сткРезультат.НовыеСтроки.Добавить(СтрокаДокумента);
			
		КонецЕсли;
		
		СтрокаДокумента[НастройкаРеквизитаСерия.Имя] = СтрокиСерий[Индекс].id_series;
		СтрокаДокументаОбмена.id_series = СтрокиСерий[Индекс].id_series;
		
		СтрокаДокумента[НастройкаРеквизитаКоличество.Имя] = Количество;
		СтрокаДокументаОбмена.qtty = Количество;
		СтрокаДокументаОбмена.qtty_plan = КоличествоПлан;

		СтрокиСерий[Индекс].НомерСтроки = СтрокаДокумента.НомерСтроки;
		
		сткРезультат.СтрокаОбработана = Истина;
		
	КонецЦикла;
	
	Если КоличествоОстаток > 0 И сткРезультат.СтрокаОбработана Тогда
		
		СтрокаДокумента = ПараметрыЗаполнения.ТЧТоварыДокумента.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДокумента, ПараметрыЗаполнения.ТекущаяСтрокаДокумента, , 
			"НомерСтроки," + НастройкаРеквизитаСерия.Имя + "," + НастройкаРеквизитаКоличество.Имя);
			
		СтрокаДокументаОбмена = ПараметрыЗаполнения.ТаблицаТоварыДокументаОбмена.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДокументаОбмена, ПараметрыЗаполнения.ТекущаяСтрокаДокументаОбмена, , 
			"НомерСтроки, id_series, sid, qtty, qtty_plan");
			
		СтрокаДокументаОбмена.НомерСтроки = СтрокаДокумента.НомерСтроки;
		СтрокаДокументаОбмена.sid = Строка(Новый УникальныйИдентификатор());
		СтрокаДокументаОбмена.qtty_plan = КоличествоПланОстаток;
		
		сткРезультат.НовыеСтроки.Добавить(СтрокаДокумента);
		
		сткРезультат.СтрокаОбработана = Истина;
	
	Иначе
		
		Если КоличествоПланОстаток > 0 И сткРезультат.СтрокаОбработана Тогда
			
			СтрокаДокументаОбмена = ПараметрыЗаполнения.ТаблицаТоварыДокументаОбмена.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДокументаОбмена, ПараметрыЗаполнения.ТекущаяСтрокаДокументаОбмена, , 
				"НомерСтроки, id_series, sid, qtty, qtty_plan");
			
			СтрокаДокументаОбмена.sid = Строка(Новый УникальныйИдентификатор());
			СтрокаДокументаОбмена.qtty_plan = КоличествоПланОстаток;
		
		КонецЕсли;
		
	КонецЕсли;

	Возврат сткРезультат;

КонецФункции

#КонецОбласти

Функция ПроверитьСтрокуТаблицыДокументаПередЗаписью(ДанныеСтроки, ТипТаблицы)
	
	Если Не СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеСтроки, "sid", "")) Или
		Не СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеСтроки, "sid_doc", "")) Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	Если ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары Или 
		ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор Или 
		ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение Или
		ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Серии Тогда
		
		Если Не SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеСтроки, "id_good", "")) Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок Тогда
		
		Если Не ЗначениеЗаполнено(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеСтроки, "id_marking_code", "")) Тогда 
			Возврат Ложь;			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Процедура ДобавитьПризнакИспользованияМаркировкиВПриемник(Приемник, Алгоритм, ПараметрыАлгоритма)
	
	Приемник.Вставить("use_mark", Обработки.SUI_РедакторКода.ВыполнитьКод(
		Алгоритм, ПараметрыАлгоритма, Истина));
							
КонецПроцедуры

Функция ПолучитьВыборкуТабличнойЧастиДокумента(ДокументСсылка, ИмяТабличнойЧасти)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Неопределено;
	
	РезультатЗапросаТЧ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, ИмяТабличнойЧасти);
	
	Если РезультатЗапросаТЧ <> Неопределено Тогда
		
		Результат = Новый Структура();
		Результат.Вставить("Колонки", SUI_ОбщегоНазначения.ПолучитьИменаКолонокРезультатаЗапроса(РезультатЗапросаТЧ));
		Результат.Вставить("Выборка", РезультатЗапросаТЧ.Выбрать());
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьАлгоритмИзКоллекции(КоллекцияАлгоритмов, Ключ)
	Возврат SUI_ОбщегоНазначенияКлиентСервер.ЗначениеСоответствия(КоллекцияАлгоритмов, Ключ, "", Тип("Строка"));
КонецФункции
	
Процедура ДобавитьСтатусУказанияСерийВПриемник(Приемник, Алгоритм, ПараметрыАлгоритма)
	
	Приемник.Вставить("use_series", Обработки.SUI_РедакторКода.ВыполнитьКод(
		Алгоритм, ПараметрыАлгоритма, Истина));
							
КонецПроцедуры

#КонецОбласти
