
#Область ПрограммныйИнтерфейс

#Область ОбработчикиПодписокНаСобытия

// SUI документы при записи (ДокументСсылка).
// 
// Параметры:
//  Источник - ДокументСсылка - Источник
//  Отказ - Булево - Отказ
Процедура SUI_ДокументыПриЗаписи(Источник, Отказ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Отказ Или Источник.ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	НастройкиПоДокументу = Справочники.SUI_НастройкиДокументовОбмена.НастройкиПоДокументу(Источник.Ссылка, , 
		Новый Структура("СоздаватьДокументОбменаПриЗаписиДокумента1С", Истина));
	
	Если НастройкиПоДокументу.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НастройкиДокументовОбмена.Ссылка
		|ИЗ
		|	Справочник.SUI_НастройкиДокументовОбмена КАК НастройкиДокументовОбмена
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.SUI_ДокументОбмена КАК ДокументОбмена
		|		ПО ДокументОбмена.НастройкаДокумента = НастройкиДокументовОбмена.Ссылка
		|		И ДокументОбмена.ДокументОснование = &ДокументОснование
		|ГДЕ
		|	НастройкиДокументовОбмена.Ссылка В (&НастройкиПоДокументу)
		|	И ДокументОбмена.Ссылка ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ДокументОснование", SUI_ИнтеграцияВКонфигурацию.ИдентификаторSimpleПоСсылке(Источник.Ссылка));
	Запрос.УстановитьПараметр("НастройкиПоДокументу", НастройкиПоДокументу);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВыгрузки = Новый Структура();
	ПараметрыВыгрузки.Вставить("ДокументОснование", Источник.Ссылка);
	ПараметрыВыгрузки.Вставить("ПривилегированныйРежим", Истина);
	ПараметрыВыгрузки.Вставить("ВыполняетсяИзПодпискиНаСобытие");
	
	Если Источник.ДополнительныеСвойства.Свойство("ОтключитьМеханизмРегистрацииОбъектов") Тогда
		ПараметрыВыгрузки.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
	КонецЕсли;
	
	ПараметрыВыгрузки.Вставить("ПараметрыВыгрузкиДокументаОбмена", Новый Соответствие());
	
	ДанныеДляВыгрузки = Новый Структура();
	ДанныеДляВыгрузки.Вставить("ДоступенВыборДокументовОбмена", Ложь);
	ДанныеДляВыгрузки.Вставить("ВыбранныеДокументыОбмена", Новый ФиксированныйМассив(Новый Массив()));
	ДанныеДляВыгрузки.Вставить("ВыбранныеМобильныеУстройства", Неопределено);
		
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПараметрыВыгрузки.ПараметрыВыгрузкиДокументаОбмена.Вставить(Выборка.Ссылка, ДанныеДляВыгрузки);
	КонецЦикла;
	
	Если ПараметрыВыгрузки.Количество() > 0 Тогда
		
		#Если ВнешнееСоединение Тогда
			ВыгрузитьДокументОбменаВФоне(ПараметрыВыгрузки);
		#Иначе
			НаименованиеФЗ = СтрШаблон(НСтр("ru = '%1: Выгрузка в документ обмена при записи %2'"), 
				SUI_SimpleКлиентСервер.Представление(), Источник.Ссылка);
			ФоновыеЗадания.Выполнить("SUI_ДокументыОбмена.ВыгрузитьДокументОбменаВФоне", 
				ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПараметрыВыгрузки), , НаименованиеФЗ);
		#КонецЕсли
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ВыгрузитьДокументОбменаВФоне(ПараметрыВыгрузки, АдресРезультата = "") Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("СозданныеДокументыОбмена", Новый Массив());
	Результат.Вставить("ОбновленныеДокументыОбмена", Новый Массив());
	Результат.Вставить("ПропущенныеДокументыОбмена", Новый Массив());
	
	Если SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыВыгрузки, "ПривилегированныйРежим", Ложь, Тип("Булево")) Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		Для Каждого ПараметрВыгрузки Из ПараметрыВыгрузки.ПараметрыВыгрузкиДокументаОбмена Цикл
			
			Если ПараметрВыгрузки.Значение.ДоступенВыборДокументовОбмена И ПараметрВыгрузки.Значение.ВыбранныеДокументыОбмена.Количество() = 0 Тогда
				ТекстСообщения = НСтр("ru = 'По настройке ""%1"" и документу основанию ""%2"" необходимо выбрать документ обмена.
				|Выгрузка в документ обмена пропущена.'");
				ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ТекстСообщения, ПараметрВыгрузки.Ключ, ПараметрыВыгрузки.ДокументОснование));
				Продолжить;
			КонецЕсли;
			
			ДанныеЗаполнения = Новый Структура();
			ДанныеЗаполнения.Вставить("ДокументОснование", ПараметрыВыгрузки.ДокументОснование);
			ДанныеЗаполнения.Вставить("НастройкаДокумента", ПараметрВыгрузки.Ключ);
			
			Если Не ПараметрыВыгрузки.Свойство("ВыполняетсяИзПодпискиНаСобытие") Тогда
				ДанныеЗаполнения.Вставить("Состояние", Перечисления.SUI_СостоянияДокументовОбмена.КВыгрузке);
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ
				|	ДокументОбмена.Ссылка
				|ИЗ
				|	Документ.SUI_ДокументОбмена КАК ДокументОбмена
				|ГДЕ
				|	ДокументОбмена.Ссылка В (&ВыбранныеДокументыОбмена)
				|	И ДокументОбмена.НастройкаДокумента = &НастройкаДокумента
				|ДЛЯ ИЗМЕНЕНИЯ
				|	Документ.SUI_ДокументОбмена";
			
			Запрос.УстановитьПараметр("ВыбранныеДокументыОбмена", ПараметрВыгрузки.Значение.ВыбранныеДокументыОбмена);
			Запрос.УстановитьПараметр("НастройкаДокумента", ПараметрВыгрузки.Ключ);
			
			//@skip-check query-in-loop
			РезультатЗапроса = Запрос.Выполнить();
			
			Если РезультатЗапроса.Пустой() Тогда
				
				ДокументОбмена = Документы.SUI_ДокументОбмена.СоздатьДокумент();
				
				ДокументОбмена.Заполнить(ДанныеЗаполнения);
				
				Если ДокументОбмена.ПроверитьЗаполнение() Тогда
					
					Если ПараметрыВыгрузки.Свойство("ОтключитьМеханизмРегистрацииОбъектов") Тогда
						ДокументОбмена.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
					КонецЕсли;
					
					// Заполнить получателей для выгрузки
					Документы.SUI_ДокументОбмена.ЗаполнитьПолучателейОбменаДанными(ДокументОбмена,
						ПараметрВыгрузки.Значение.ВыбранныеМобильныеУстройства);
					
					ДокументОбмена.Записать(РежимЗаписиДокумента.Запись);
					
					Результат.СозданныеДокументыОбмена.Добавить(ДокументОбмена.Ссылка);
					
				КонецЕсли;
				
			ИначеЕсли Не ПараметрыВыгрузки.Свойство("ВыполняетсяИзПодпискиНаСобытие") Тогда
				
				Выборка = РезультатЗапроса.Выбрать();
				
				Пока Выборка.Следующий() Цикл
					
					ДокументОбмена = Выборка.Ссылка.ПолучитьОбъект();
					
					ДокументОбмена.Заполнить(ДанныеЗаполнения);
					
					Если ДокументОбмена.ПроверитьЗаполнение() Тогда
						
						Если ПараметрыВыгрузки.Свойство("ОтключитьМеханизмРегистрацииОбъектов") Тогда
							ДокументОбмена.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
						КонецЕсли;
						
						// Заполнить получателей для выгрузки
						Документы.SUI_ДокументОбмена.ЗаполнитьПолучателейОбменаДанными(ДокументОбмена,
							ПараметрВыгрузки.Значение.ВыбранныеМобильныеУстройства);
						
						ДокументОбмена.Записать(РежимЗаписиДокумента.Запись);
						
						Результат.ОбновленныеДокументыОбмена.Добавить(Выборка.Ссылка);
						
					Иначе
						Результат.ПропущенныеДокументыОбмена.Добавить(Выборка.Ссылка);
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
			//TODO: 30.07.2024 - artem - Отправлять прогресс выполнения в длительной операции
//			ДлительныеОперации.СообщитьПрогресс(, , );
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(SUI_ДокументыОбменаКлиентСервер.ИмяСобытия("ru = 'Выгрузка в документ обмена'"), ,
			Метаданные.ОбщиеМодули.SUI_ДокументыОбмена, 
			SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыВыгрузки, "ДокументОснование"), ИнформацияОбОшибке());
		ПолучитьСообщенияПользователю(Истина);
		ВызватьИсключение;
	КонецПопытки;
	
	Если ЭтоАдресВременногоХранилища(АдресРезультата) Тогда
		ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьДокументыОбменаВФоне(ДокументыОбменаКУдалению, АдресРезультата) Экспорт
	
	ТекущийДокументОбмена = Неопределено;
	
	НачатьТранзакцию();
	
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ДокументОбмена.Ссылка
			|ИЗ
			|	Документ.SUI_ДокументОбмена КАК ДокументОбмена
			|ГДЕ
			|	ДокументОбмена.Ссылка В (&ВыбранныеДокументыОбмена)
			|ДЛЯ ИЗМЕНЕНИЯ
			|	Документ.SUI_ДокументОбмена";
		
		Запрос.УстановитьПараметр("ВыбранныеДокументыОбмена", ДокументыОбменаКУдалению);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				ТекущийДокументОбмена = Выборка.Ссылка;
				
				ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = '%1 удален.'"), ТекущийДокументОбмена));
				
				ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
				ДокументОбъект.Удалить();
				
			КонецЦикла;
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(SUI_ДокументыОбменаКлиентСервер.ИмяСобытия("ru = 'Удаление документа обмена'"), ,
			Метаданные.ОбщиеМодули.SUI_ДокументыОбмена, ТекущийДокументОбмена, ИнформацияОбОшибке());
		ПолучитьСообщенияПользователю(Истина);
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти
