
#Область ПрограммныйИнтерфейс

Функция КлючДополнительныхРеквизитов() Экспорт
	Возврат "additional_details";
КонецФункции

Процедура ДобавитьДополнительныеРеквизитыВПриемник(Приемник, Алгоритм, ПараметрыАлгоритма, ПреобразоватьВJSON = Истина, ТаблицаВыводаДополнительныхПолей = Неопределено) Экспорт
	
	Результат = Обработки.SUI_РедакторКода.ВыполнитьКод(Алгоритм, ПараметрыАлгоритма, Истина);
	
	ТипЗначенияРезультата = Неопределено;
	
	Если Результат <> Неопределено Тогда
		
		ТипЗначенияРезультата = ТипЗнч(Результат);
		
		Если ТипЗначенияРезультата = Тип("ТаблицаЗначений") Тогда
			Результат = ОбщегоНазначения.ТаблицаЗначенийВМассив(Результат);
		ИначеЕсли ТипЗначенияРезультата = Тип("СписокЗначений") Тогда
			Результат = Результат.ВыгрузитьЗначения();
		ИначеЕсли ТипЗначенияРезультата = Тип("Структура") Или ТипЗначенияРезультата = Тип("ФиксированнаяСтруктура") Или
			ТипЗначенияРезультата = Тип("Соответствие") Или ТипЗначенияРезультата = Тип("ФиксированноеСоответствие") Или
			ТипЗначенияРезультата = Тип("Число") Или ТипЗначенияРезультата = Тип("Строка") Или
			ТипЗначенияРезультата = Тип("Дата") Или ТипЗначенияРезультата = Тип("Булево") Тогда
			Результат = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Результат);
		ИначеЕсли SUI_ОбщегоНазначения.ЭтоСсылка(ТипЗначенияРезультата) Тогда
			Результат = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Строка(Результат));
		ИначеЕсли ТипЗначенияРезультата <> Тип("Массив") И ТипЗначенияРезультата <> Тип("ФиксированныйМассив") Тогда
			Результат = Неопределено;
		КонецЕсли;
	
	КонецЕсли;                     
	
	Если ТаблицаВыводаДополнительныхПолей <> Неопределено Тогда
		Если ТаблицаВыводаДополнительныхПолей.Количество() 
			И ПараметрыАлгоритма.Свойство("ДокументСсылка") 
			И (ТипЗначенияРезультата = Тип("Структура")
			Или ТипЗначенияРезультата = Тип("Соответствие")  
			Или ТипЗначенияРезультата = Неопределено) Тогда
			
			Если Результат = Неопределено Тогда
				СтуктураДляДопРеквизитов = Новый Соответствие;
			ИначеЕсли ТипЗначенияРезультата = Тип("Структура") Тогда
				РезультатПромежуточный = Новый Соответствие;
				Для Каждого текЭлемент Из Результат[0] Цикл 
					РезультатПромежуточный.Вставить(текЭлемент.Ключ, текЭлемент.Значение);             
				КонецЦикла;
				Результат = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(РезультатПромежуточный);
			КонецЕсли;
			
			РеквизитДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПараметрыАлгоритма.ДокументСсылка, 
				СтрСоединить(ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТаблицаВыводаДополнительныхПолей.ВыгрузитьКолонку("РеквизитДокумента")), ","));
			
			Для Каждого РеквизитДокумента Из РеквизитДокумента Цикл
				
				СтрокаТаблицыВывода = ТаблицаВыводаДополнительныхПолей.Найти(РеквизитДокумента.Ключ, "РеквизитДокумента");
				Если СтрокаТаблицыВывода <> Неопределено Тогда
					Если Результат = Неопределено Тогда
						СтуктураДляДопРеквизитов.Вставить(СтрокаТаблицыВывода.ИмяНаУстройстве, РеквизитДокумента.Значение);
					Иначе
						Результат[0].Вставить(СтрокаТаблицыВывода.ИмяНаУстройстве, РеквизитДокумента.Значение);	
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
           			
			Если Результат = Неопределено Тогда
				
				Результат = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СтуктураДляДопРеквизитов);
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	Если ПреобразоватьВJSON Тогда
		Результат = ДополнительныеРеквизитыВJSON(Результат);
	КонецЕсли;
	
	Приемник.Вставить(КлючДополнительныхРеквизитов(), Результат);
	
КонецПроцедуры

#Область СериализацияИДесериализацияДополнительныхРеквизитов

Функция ДополнительныеРеквизитыВJSON(ДополнительныеРеквизиты) Экспорт
	
	ТипЗначения = ТипЗнч(ДополнительныеРеквизиты);
	
	Если ТипЗначения = Тип("Массив") Или ТипЗначения = Тип("ФиксированныйМассив") Или
		ТипЗначения = Тип("Структура") Или ТипЗначения = Тип("ФиксированнаяСтруктура") Или
		ТипЗначения = Тип("Соответствие") Или ТипЗначения = Тип("ФиксированноеСоответствие") Тогда
		
		ЗаписьJSON = Новый ЗаписьJSON();
		ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(, Символы.Таб);
		ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
		ЗаписатьJSON(ЗаписьJSON, ДополнительныеРеквизиты, , 
			"ПреобразованиеДанныхJSON", SUI_ДополнительныеРеквизитыТаблиц);
		
		Возврат ЗаписьJSON.Закрыть();
		
	ИначеЕсли ТипЗначения = Тип("Строка") И 
		(СтрНачинаетсяС(ДополнительныеРеквизиты, "[") Или СтрНачинаетсяС(ДополнительныеРеквизиты, "{")) И 
		(СтрЗаканчиваетсяНа(ДополнительныеРеквизиты, "]") Или СтрЗаканчиваетсяНа(ДополнительныеРеквизиты, "}")) Тогда
		Возврат ДополнительныеРеквизиты;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ДополнительныеРеквизитыИзJSON(Знач ДополнительныеРеквизитыJSON) Экспорт
	
	ДополнительныеРеквизитыJSON = ОбщегоНазначения.ОписаниеТипаСтрока(0).ПривестиЗначение(ДополнительныеРеквизитыJSON);
	
	Если (СтрНачинаетсяС(ДополнительныеРеквизитыJSON, "[") Или СтрНачинаетсяС(ДополнительныеРеквизитыJSON, "{")) И
		(СтрЗаканчиваетсяНа(ДополнительныеРеквизитыJSON, "]") Или СтрЗаканчиваетсяНа(ДополнительныеРеквизитыJSON, "}")) Тогда
		
		ЧтениеJSON = Новый ЧтениеJSON();
		ЧтениеJSON.УстановитьСтроку(ДополнительныеРеквизитыJSON);
		Возврат ПрочитатьJSON(ЧтениеJSON, Истина, , ФорматДатыJSON.ISO);
	
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ДополнительныеРеквизитыВXML(ДополнительныеРеквизиты) Экспорт
	
	Если ДополнительныеРеквизиты = Неопределено Или ДополнительныеРеквизиты = Null Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(ДополнительныеРеквизиты) = Тип("Строка") И
		СтрНачинаетсяС(ДополнительныеРеквизиты, "<") И СтрЗаканчиваетсяНа(ДополнительныеРеквизиты, ">") И
		СтрНайти(ДополнительныеРеквизиты, "xmlns=""http://v8.1c.ru/8.1/data/core"" xmlns:xs=""http://www.w3.org/2001/XMLSchema""") > 0 Тогда
		Возврат ДополнительныеРеквизиты;
	Иначе
		Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(ДополнительныеРеквизиты);
	КонецЕсли;
	
КонецФункции

Функция ДополнительныеРеквизитыИзXML(ДополнительныеРеквизитыXML) Экспорт
	
	Если ТипЗнч(ДополнительныеРеквизитыXML) = Тип("Строка") И
		СтрНачинаетсяС(ДополнительныеРеквизитыXML, "<") И СтрЗаканчиваетсяНа(ДополнительныеРеквизитыXML, ">") И
		СтрНайти(ДополнительныеРеквизитыXML, "xmlns=""http://v8.1c.ru/8.1/data/core"" xmlns:xs=""http://www.w3.org/2001/XMLSchema""") > 0 Тогда
		Возврат ОбщегоНазначения.ЗначениеИзСтрокиXML(ДополнительныеРеквизитыXML);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ИмяСобытия(ВложенноеСобытие = "") Экспорт
	Возврат НСтр("ru = 'Дополнительные реквизиты таблиц'") + ?(ЗначениеЗаполнено(ВложенноеСобытие), ". " + ВложенноеСобытие, "");
КонецФункции

Функция ПреобразованиеДанныхJSON(Свойство, Значение, ДополнительныеПараметры, Отказ) Экспорт
	
	ТипЗначения = ТипЗнч(Значение);
	Если ТипЗначения = Тип("Null") Или ТипЗначения = Тип("Неопределено") Тогда
		Возврат Неопределено;
	ИначеЕсли ТипЗначения <> Тип("Строка") И ТипЗначения <> Тип("Число") И 
		ТипЗначения <> Тип("Булево") И ТипЗначения <> Тип("Дата") И
		ТипЗначения <> Тип("Массив") И ТипЗначения <> Тип("ФиксированныйМассив") И
		ТипЗначения <> Тип("Соответствие") И ТипЗначения <> Тип("ФиксированноеСоответствие") И
		ТипЗначения <> Тип("Структура") И ТипЗначения <> Тип("ФиксированнаяСтруктура") Тогда
		Возврат Строка(Значение);
	КонецЕсли;
	
КонецФункции

#КонецОбласти
