
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДокументОбмена = Параметры.ДокументОбмена;
	НастройкаДокумента = Параметры.НастройкаДокумента;
	
	Элементы.РезультатПроверкиКомандаОК.Видимость = Параметры.КнопкаОК;
	Элементы.РезультатПроверкиОтмена.Видимость = Параметры.КнопкаОтмена;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("НачатьПроверку", 0.1, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьПроверку(Команда)
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПустая;
	ПодключитьОбработчикОжидания("НачатьПроверку", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	ЗакрытьПроверку();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НачатьПроверку() Экспорт
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаДлительнаяОперация;
	
	СтатусПроверки = "";
	РезультатПроверки.ПолучитьЭлементы().Очистить();
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("НачатьПроверкуЗавершение", ЭтотОбъект);
	
	ДлительнаяОперация = НачатьПроверкуНаСервере();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция НачатьПроверкуНаСервере()
	
	ПараметрыПроцедуры = Новый Структура();
	ПараметрыПроцедуры.Вставить("ДокументОбмена", ДокументОбмена);
	
	Если ЗначениеЗаполнено(НастройкаДокумента) Тогда
		ПараметрыПроцедуры.Вставить("НастройкаДокумента", НастройкаДокумента);
	КонецЕсли;
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Документы.SUI_ДокументОбмена.ВыполнитьПроверкуДокументаОбменаВФоне", 
		ПараметрыПроцедуры, ПараметрыВыполненияВФоне);
		
КонецФункции

&НаКлиенте
Процедура НачатьПроверкуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		ЗакрытьПроверку();
	Иначе
		
		Если Результат.Статус = "Выполнено" Тогда
			
			НачатьПроверкуЗавершениеНаСервере(Результат.АдресРезультата);
			
			Для Каждого ЭлементДерева Из РезультатПроверки.ПолучитьЭлементы() Цикл
				Элементы.РезультатПроверки.Развернуть(ЭлементДерева.ПолучитьИдентификатор(), Истина);
			КонецЦикла;
			
			Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаРезультат;
			
		ИначеЕсли Результат.Статус = "Ошибка" Тогда
			Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПустая;
			ПоказатьПредупреждение(, СтрШаблон(НСтр("ru = 'Возникла ошибка при удалении.
			|%1'"), Результат.КраткоеПредставлениеОшибки));
		Иначе
			Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПустая;
			ПоказатьПредупреждение(, НСтр("ru = 'Не удалось получить результат удаления.'"));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Результат.Сообщения) Тогда
			
			Для индекс = 0 По Результат.Сообщения Цикл
				ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.Сообщения[индекс]);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НачатьПроверкуЗавершениеНаСервере(АдресРезультата)
	
	Если ЭтоАдресВременногоХранилища(АдресРезультата) Тогда
		
		Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
		СтатусПроверки = Результат.СтатусПроверки;
		ЗначениеВРеквизитФормы(Результат.ДеревоРезультат, "РезультатПроверки");

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьПроверку()
	
	Закрыть(СтатусПроверки);
	
КонецПроцедуры

#КонецОбласти
