
#Область ПрограммныйИнтерфейс

// Создает массив и помещает в него переданные значения.
//
// Параметры:
//  Значение1 - Произвольный - любое значение.
//  Значение2 - Произвольный
//  Значение3 - Произвольный
//  Значение4 - Произвольный
//
// Возвращаемое значение:
//  Массив из Произвольный - Значения в массиве
//  
// Пример:
//   Результат = ОбщегоНазначенияКлиентСервер.МассивЗначений(1, 2, 3);
//
Функция МассивЗначений(Знач Значение1, Знач Значение2 = Неопределено, Знач Значение3 = Неопределено, Знач Значение4 = Неопределено) Экспорт
	
	Результат = Новый Массив();
	
	Результат.Добавить(Значение1);
	
	Если Значение2 <> Неопределено Тогда
		Результат.Добавить(Значение2);
	КонецЕсли;
	
	Если Значение3 <> Неопределено Тогда
		Результат.Добавить(Значение3);
	КонецЕсли;
	
	Если Значение4 <> Неопределено Тогда
		Результат.Добавить(Значение4);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Сравнить две строки версий. Сравнивает версии даже если версии не равны шаблону РР.{П|ПП}.ЗЗ.СС.
// см. ОбщегоНазначенияКлиентСервер.СравнитьВерсии
// 
// Параметры:
//  СтрокаВерсии1 - Строка - номер версии в формате РР.{П|ПП}.ЗЗ.СС.
//  СтрокаВерсии2 - Строка - второй сравниваемый номер версии.
// 
// Возвращаемое значение:
//  Число - больше 0, если СтрокаВерсии1 > СтрокаВерсии2; 0, если версии равны.
Функция СравнитьВерсии(Знач СтрокаВерсии1, Знач СтрокаВерсии2) Экспорт
	
	Версия1ДляБСП = МассивЗначений(0, 0, 0, 0);
	Версия2ДляБСП = МассивЗначений(0, 0, 0, 0);
	
	Версия1 = СтрРазделить(СтрокаВерсии1, ".");
	Если Версия1.Количество() < 4 Тогда
		
		ТекущийИндексДляБСП = Версия1ДляБСП.ВГраница();
		ТекущийИндекс = Версия1.ВГраница();
		Пока ТекущийИндекс >= 0 Цикл
			Версия1ДляБСП[ТекущийИндексДляБСП] = Версия1[ТекущийИндекс];
			ТекущийИндекс = ТекущийИндекс - 1;
			ТекущийИндексДляБСП = ТекущийИндексДляБСП - 1;
		КонецЦикла;
		
	ИначеЕсли Версия1.Количество() > 4 Тогда
		
		Для индекс = 0 По Версия1ДляБСП.ВГраница() Цикл
			Версия1ДляБСП[индекс] = Версия1[индекс];
		КонецЦикла;
		
	Иначе
		Версия1ДляБСП = Версия1;
	КонецЕсли;
	
	Версия2 = СтрРазделить(СтрокаВерсии2, ".");
	Если Версия2.Количество() < 4 Тогда
		
		ТекущийИндексДляБСП = Версия2ДляБСП.ВГраница();
		ТекущийИндекс = Версия2.ВГраница();
		Пока ТекущийИндекс >= 0 Цикл
			Версия2ДляБСП[ТекущийИндексДляБСП] = Версия2[ТекущийИндекс];
			ТекущийИндекс = ТекущийИндекс - 1;
			ТекущийИндексДляБСП = ТекущийИндексДляБСП - 1;
		КонецЦикла;
		
	ИначеЕсли Версия2.Количество() > 4 Тогда
		
		Для индекс = 0 По Версия2ДляБСП.ВГраница() Цикл
			Версия2ДляБСП[индекс] = Версия2[индекс];
		КонецЦикла;
		
	Иначе
		Версия2ДляБСП = Версия2;
	КонецЕсли;
	
	Возврат ОбщегоНазначенияКлиентСервер.СравнитьВерсии(
		СтрСоединить(Версия1ДляБСП, "."), СтрСоединить(Версия2ДляБСП, "."));
	
КонецФункции

#КонецОбласти
