
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыгрузитьНастройкиВФайл(Команда)
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("ОтключитьРежимЗагрузки", Истина);
	ПараметрыОткрытия.Вставить("ЗаполнитьВсеПриОткрытииВыгрузки", Истина);
	ПараметрыОткрытия.Вставить("ЗакрытьПослеВыгрузки", Истина);
	
	ОткрытьФормуВыгрузкиЗагрузкиНастроек(ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройкиИзФайла(Команда)
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("ОтключитьРежимВыгрузки", Истина);
	ПараметрыОткрытия.Вставить("ВыборФайлаПриОткрытииВыгрузки", Истина);
	ПараметрыОткрытия.Вставить("ЗакрытьПослеЗаписи", Истина);
	
	ОткрытьФормуВыгрузкиЗагрузкиНастроек(ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПредопределенныеНастройки(Команда)
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("ЗагрузкаПредопределенных", Истина);
	ПараметрыОткрытия.Вставить("ЗакрытьПослеЗаписи", Истина);
	
	ОткрытьФормуВыгрузкиЗагрузкиНастроек(ПараметрыОткрытия);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьФормуВыгрузкиЗагрузкиНастроек(ПараметрыОткрытия)
	
	ПараметрыОткрытия.Вставить("ОбластиНастроек", Новый СписокЗначений());
	
	// Области настроек
	ПараметрыОткрытия.ОбластиНастроек.Добавить("Documents");
	
	ОткрытьФорму("Обработка.SUI_ВыгрузкаЗагрузкаНастроек.Форма", ПараметрыОткрытия, ЭтотОбъект, 
		УникальныйИдентификатор, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти
