
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура Записать(МобильноеУстройство, ВерсияПриложения = Неопределено) Экспорт
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.МобильноеУстройство = МобильноеУстройство;
	МенеджерЗаписи.ВерсияПриложения = SUI_СтроковыеФункцииКлиентСервер.ОбработатьСтрокуВерсии(ВерсияПриложения);
	МенеджерЗаписи.Сеанс = НомерСеансаИнформационнойБазы();
	МенеджерЗаписи.ДатаСеанса = ТекущаяДатаСеанса();
	МенеджерЗаписи.МеткаВремени = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры

Функция СрокДействительностиСеансаВСекундах() Экспорт
	Возврат 60*60*24*3; // 3-ое суток
КонецФункции

#КонецОбласти

#КонецЕсли
