
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)

	Если Отказ Или ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Количество() > 0 Тогда
		
		Для Каждого Запись Из ЭтотОбъект Цикл
			Запись.ВерсияПриложения = ОбработатьСтрокуВерсии(Запись.ВерсияПриложения);
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбработатьСтрокуВерсии(Знач Версия)

	Версия = SUI_СтроковыеФункцииКлиентСервер.ПривестиСтрокуКРазрешеннымСимволам(СокрЛП(Версия), 
		SUI_СтроковыеФункцииКлиентСервер.АлфавитЦифры() + ".");
		
	РазрядыВерсии = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Версия, ".", Истина);
	
	ОсталосьДобавитьРазрядов = (4 - РазрядыВерсии.Количество());
	
	Если ОсталосьДобавитьРазрядов > 0 Тогда
		Для индекс = 1 По ОсталосьДобавитьРазрядов Цикл
			РазрядыВерсии.Добавить("0");
		КонецЦикла;
	КонецЕсли;
	
	ОбработанныеРазряды = Новый Массив();
	Для индекс = 0 По 3 Цикл
		Если индекс = 3 Тогда
			ОбработанныеРазряды.Добавить(СокрЛП(Лев(РазрядыВерсии[индекс], 4)));
		Иначе
			ОбработанныеРазряды.Добавить(СокрЛП(Лев(РазрядыВерсии[индекс], 3)));
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтрСоединить(ОбработанныеРазряды, ".");
	
КонецФункции

#КонецОбласти

#КонецЕсли
