
#Область ПрограммныйИнтерфейс

Функция ПараметрыОткрытияЖурналаРегистрации(ИмяСобытия = "", НачальнаяДата = Неопределено, КонечнаяДата = Неопределено, 
	Уровень = Неопределено, Сеанс = Неопределено, Данные = Неопределено) Экспорт 
	
	ПараметрыОткрытияЖР = Новый Структура("Событие", Новый Массив());
	
	ИменаСобытийОтбор = СтрРазделить(ИмяСобытия, ",", Истина);
	
	Если ИменаСобытийОтбор.Количество() = 0 Тогда
		СобытияОтбор = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(SUI_ЖурналРегистрацииКлиентСервер.ИмяСобытия());
	Иначе
		
		СобытияОтбор = Новый Массив();
		Для Индекс = 0 По ИменаСобытийОтбор.ВГраница() Цикл
			СобытияОтбор.Добавить(SUI_ЖурналРегистрацииКлиентСервер.ИмяСобытия(ИменаСобытийОтбор[Индекс]));
		КонецЦикла;
		
	КонецЕсли;
	
	Для Каждого Событие Из ПолучитьЗначенияОтбораЖурналаРегистрации("Событие").Событие Цикл
		
		Для Каждого СобытиеОтбор Из СобытияОтбор Цикл
			
			Если СтрНачинаетсяС(Событие.Ключ, СобытиеОтбор) Тогда
				ПараметрыОткрытияЖР.Событие.Добавить(Событие.Ключ);
			КонецЕсли;
		
		КонецЦикла;

	КонецЦикла;
	
	ПараметрыОткрытияЖР.Вставить("СобытиеЖурналаРегистрации", ПараметрыОткрытияЖР.Событие);
	
	Если ТипЗнч(НачальнаяДата) = Тип("Дата") И ЗначениеЗаполнено(НачальнаяДата) Тогда
		ПараметрыОткрытияЖР.Вставить("ДатаНачала", НачальнаяДата);
	КонецЕсли;
	
	Если ТипЗнч(КонечнаяДата) = Тип("Дата") И ЗначениеЗаполнено(КонечнаяДата) Тогда
		ПараметрыОткрытияЖР.Вставить("ДатаОкончания", КонечнаяДата);
	КонецЕсли;
	
	Если ТипЗнч(Уровень) = Тип("УровеньЖурналаРегистрации") Тогда
		ПараметрыОткрытияЖР.Вставить("Уровень", Уровень);
	КонецЕсли;
	
	Если Сеанс <> Неопределено Тогда
		
		Сеансы = Новый СписокЗначений;
		Если ТипЗнч(Сеанс) = Тип("Массив") Тогда
			Сеансы.ЗагрузитьЗначения(Сеанс);
		ИначеЕсли ТипЗнч(Сеанс) = Тип("СписокЗначений") Тогда 
			Сеансы = Сеанс;
		ИначеЕсли ТипЗнч(Сеанс) = Тип("Число") Тогда
			Сеансы.Добавить(Сеанс);
		КонецЕсли;
		
		Если Сеансы.Количество() > 0 Тогда
			ПараметрыОткрытияЖР.Вставить("Сеанс", Сеансы);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Данные <> Неопределено Тогда
		ПараметрыОткрытияЖР.Вставить("Данные", Данные);
	КонецЕсли;
	
	Возврат ПараметрыОткрытияЖР;
	
КонецФункции

Процедура ЗаписьВЖурналРегистрации(ИмяСобытия, Уровень = Неопределено, ОбъектМетаданных = Неопределено, 
	Данные = Неопределено, Комментарий = "") Экспорт 
	
	SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия, Уровень, ОбъектМетаданных, Данные, Комментарий);
	
КонецПроцедуры

#КонецОбласти
