#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, "ДокументСсылка");
	
	SUI_ОбщегоНазначенияКлиентСервер.Проверить((SUI_ОбщегоНазначения.ЭтоСсылкаДокумента(ДокументСсылка) И
		SUI_ОбщегоНазначения.СсылкаСуществует(ДокументСсылка)),
		НСтр("ru = 'Ссылка на объект не является ссылкой документа или не существует.'"));

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДанныеДокументаДополнительные();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ДанныеДокументаДополнительные()
	
	ПараметрыОперации = Новый Структура("ДокументСсылка", ДокументСсылка);
	
	ДлительнаяОперация = SUI_ДокументыОбменаВызовСервера.ДанныеДокументаДополнительные(ПараметрыОперации, УникальныйИдентификатор);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	
	ПараметрыОжидания.Заголовок 					= НСтр("ru = 'Получение данных документа обмена'");
	ПараметрыОжидания.ВыводитьПрогрессВыполнения 	= Истина;
	ПараметрыОжидания.ВыводитьСообщения 			= Истина;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ДанныеДокументаДополнительныеЗавершение", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеДокументаДополнительныеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Закрыть();
	КонецЕсли;
	
	ПараметрыОповещения = Новый Структура("АдресРезультата, Закрыть", "", Ложь);
	ПараметрыОповещения.Вставить("Сообщения", SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "Сообщения", Новый Массив()));
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ДанныеДокументаДополнительныеПродолжитьЗавершение", 
		ЭтотОбъект, ПараметрыОповещения);

	Статус = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "Статус", "");
	КраткоеПредставлениеОшибки = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "КраткоеПредставлениеОшибки", "");
	ПодробноеПредставлениеОшибки = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "ПодробноеПредставлениеОшибки", "");

	Если Статус = "Ошибка" Тогда
		ОповещениеОЗавершении.ДополнительныеПараметры.Вставить("Сообщение", ПодробноеПредставлениеОшибки);
		ОповещениеОЗавершении.ДополнительныеПараметры.Закрыть = Истина;
		ПоказатьПредупреждение(ОповещениеОЗавершении, КраткоеПредставлениеОшибки);
	Иначе
		
		ОповещениеОЗавершении.ДополнительныеПараметры.АдресРезультата = Результат.АдресРезультата;
		
		ДанныеДокументаДополнительныеПродолжитьЗавершение(ОповещениеОЗавершении.ДополнительныеПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеДокументаДополнительныеПродолжитьЗавершение(ПараметрыРезультата) Экспорт
	
	Если ПараметрыРезультата.Закрыть Тогда
		Если Открыта() Тогда
			Закрыть();
		КонецЕсли;
	КонецЕсли;

	Если Не ЗагрузитьДанныеДокументаДополнительные(ПараметрыРезультата.АдресРезультата) Тогда
		Если Открыта() Тогда
			Закрыть();
		КонецЕсли;
		ПараметрыРезультата.Вставить("Сообщение", НСтр("ru = 'Не удалось загрузить данные документа обмена на форму.'"));
	КонецЕсли;
	
	ОчиститьСообщения();

	Если ПараметрыРезультата.Свойство("Сообщение") Тогда
		SUI_ОбщегоНазначенияКлиент.СообщитьПользователю(ПараметрыРезультата.Сообщение);
	КонецЕсли;
	
	Если ПараметрыРезультата.Свойство("Сообщения") Тогда 

		Для Каждого Сообщение Из ПараметрыРезультата.Сообщения Цикл
			Сообщение.Сообщить();
		КонецЦикла;  
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ЗагрузитьДанныеДокументаДополнительные(АдресРезультата)
	
	Если Не ЗначениеЗаполнено(АдресРезультата) Или
		Не ЭтоАдресВременногоХранилища(АдресРезультата) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДанныеДокументаОбмена = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	ТабличныйДокументСерииКЗагрузке = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДокументаОбмена, "ТабличныйДокументСерии");
    ТабличныйДокументПересчетКЗагрузке = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДокументаОбмена, "ТабличныйДокументПересчет");
    ТабличныйДокументШтрихкодыКЗагрузке = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДокументаОбмена, "ТабличныйДокументШтрихкоды");
    ТабличныйДокументПотокКЗагрузке = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДокументаОбмена, "ТабличныйДокументПоток");
	
	ЕстьДанныеКОтображению = Ложь;
	Если ТабличныйДокументСерииКЗагрузке <> Неопределено Тогда
		ТабличныйДокументСерии = ТабличныйДокументСерииКЗагрузке;
		ЕстьДанныеКОтображению = Истина;
	Иначе
		Элементы.Серии.Видимость = Ложь;
	КонецЕсли;
	
	Если ТабличныйДокументПересчетКЗагрузке <> Неопределено Тогда
		ТабличныйДокументПересчет = ТабличныйДокументПересчетКЗагрузке;
		ЕстьДанныеКОтображению = Истина;
	Иначе
		Элементы.Пересчет.Видимость = Ложь;
	КонецЕсли;
	
	Если ТабличныйДокументШтрихкодыКЗагрузке <> Неопределено Тогда
		ТабличныйДокументШтрихкоды = ТабличныйДокументШтрихкодыКЗагрузке; 
		ЕстьДанныеКОтображению = Истина;
	Иначе
		Элементы.Штрихкоды.Видимость = Ложь;
	КонецЕсли;
	
	Если ТабличныйДокументПотокКЗагрузке <> Неопределено Тогда
		ТабличныйДокументПоток = ТабличныйДокументПотокКЗагрузке;
		ЕстьДанныеКОтображению = Истина;
	Иначе
		Элементы.Поток.Видимость = Ложь;
	КонецЕсли;
	
	Если ЕстьДанныеКОтображению Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

#КонецОбласти   
