
#Область ПрограммныйИнтерфейс

Функция ПолучитьПроизвольныйАлгоритмОбработкиСтрокДокумента(Параметры) Экспорт 
	
	ПроизвольныйАлгоритм = "";
	
	Если ТипЗнч(Параметры) <> Тип("Структура") Или Не Параметры.Свойство("ИмяОбъектаМетаданных") Тогда
		Возврат ПроизвольныйАлгоритм;
	КонецЕсли;
	
	Если НРег(Параметры.ИмяОбъектаМетаданных) = НРег("ПриобретениеТоваровУслуг") Тогда
		ПроизвольныйАлгоритм = АлгоритмОбработкиСтрокДокумента_ПриобретениеТоваровУслуг(Параметры);
	ИначеЕсли НРег(Параметры.ИмяОбъектаМетаданных) = НРег("ВозвратТоваровОтКлиента") Тогда
		ПроизвольныйАлгоритм = АлгоритмОбработкиСтрокДокумента_ВозвратТоваровОтКлиента(Параметры);
	ИначеЕсли НРег(Параметры.ИмяОбъектаМетаданных) = НРег("ВозвратТоваровПоставщику") Тогда
		ПроизвольныйАлгоритм = АлгоритмОбработкиСтрокДокумента_ВозвратТоваровПоставщику(Параметры); 	
	ИначеЕсли НРег(Параметры.ИмяОбъектаМетаданных) = НРег("ЗаказКлиента") Тогда
		ПроизвольныйАлгоритм = АлгоритмОбработкиСтрокДокумента_ЗаказКлиента(Параметры);
	ИначеЕсли НРег(Параметры.ИмяОбъектаМетаданных) = НРег("ЗаказПоставщику") Тогда
		ПроизвольныйАлгоритм = АлгоритмОбработкиСтрокДокумента_ЗаказПоставщику(Параметры);
	ИначеЕсли НРег(Параметры.ИмяОбъектаМетаданных) = НРег("ПеремещениеТоваров") Тогда
		ПроизвольныйАлгоритм = АлгоритмОбработкиСтрокДокумента_ПеремещениеТоваров(Параметры);
	ИначеЕсли НРег(Параметры.ИмяОбъектаМетаданных) = НРег("ПересчетТоваров") Тогда
		ПроизвольныйАлгоритм = АлгоритмОбработкиСтрокДокумента_ПересчетТоваров(Параметры);
	ИначеЕсли НРег(Параметры.ИмяОбъектаМетаданных) = НРег("ПриходныйОрдерНаТовары") Тогда
		ПроизвольныйАлгоритм = АлгоритмОбработкиСтрокДокумента_ПриходныйОрдерНаТовары(Параметры);
	ИначеЕсли НРег(Параметры.ИмяОбъектаМетаданных) = НРег("РасходныйОрдерНаТовары") Тогда
		ПроизвольныйАлгоритм = АлгоритмОбработкиСтрокДокумента_РасходныйОрдерНаТовары(Параметры);
	ИначеЕсли НРег(Параметры.ИмяОбъектаМетаданных) = НРег("РеализацияТоваровУслуг") Тогда
		ПроизвольныйАлгоритм = АлгоритмОбработкиСтрокДокумента_РеализацияТоваровУслуг(Параметры);
	ИначеЕсли НРег(Параметры.ИмяОбъектаМетаданных) = НРег("СборкаТоваров") Тогда
		ПроизвольныйАлгоритм = АлгоритмОбработкиСтрокДокумента_СборкаТоваров(Параметры);
	ИначеЕсли НРег(Параметры.ИмяОбъектаМетаданных) = НРег("ОтборРазмещениеТоваров") Тогда
		ПроизвольныйАлгоритм = АлгоритмОбработкиСтрокДокумента_ОтборРазмещениеТоваров(Параметры);
	КонецЕсли;
	
	Возврат ПроизвольныйАлгоритм;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ИмяСобытия(ВложенноеСобытие = "") Экспорт
	Возврат НСтр("ru = 'Настройки документов'") + ?(ЗначениеЗаполнено(ВложенноеСобытие), ". " + ВложенноеСобытие, "");
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область АлгоритмыОбработкиСтрокДокумента

Функция АлгоритмОбработкиСтрокДокумента_ПриобретениеТоваровУслуг(Параметры)
	
	Если Не Параметры.Свойство("ЭтоТовары") Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат "СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ДокументОбъект);
		|
		|СтруктураДействий = Новый Структура;
		|СтруктураДействий.Вставить(""ПроверитьЗаполнитьСклад"", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСкладаВСтрокеТЧ(ДокументОбъект, Ложь));
		|СтруктураДействий.Вставить(""ПересчитатьКоличествоЕдиниц"");
		|
		|СтруктураДействий.Вставить(""ЗаполнитьСтавкуНДС"", ОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСтавкиНДС(ДокументОбъект));
		|СтруктураДействий.Вставить(""ЗаполнитьСтавкуНДСВозвратнойТары"", ДокументОбъект.ВернутьМногооборотнуюТару);
		|СтруктураДействий.Вставить(""ПересчитатьСуммуНДС"", СтруктураПересчетаСуммы);
		|СтруктураДействий.Вставить(""ПересчитатьСуммуСНДС"", СтруктураПересчетаСуммы);
		|СтруктураДействий.Вставить(""ПересчитатьСумму"");
		|СтруктураДействий.Вставить(""ПересчитатьСуммуСУчетомРучнойСкидки"", Новый Структура(""Очищать"", Истина));
		|СтруктураДействий.Вставить(""ОчиститьСуммуВзаиморасчетов"");
		|СтруктураДействий.Вставить(""ЗаполнитьСлужебныеРеквизитыПоНазначению"");
		|	
		|ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, Неопределено);
		|
		|ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(ДокументОбъект, ОбщегоНазначения.ОбщийМодуль(""Документы.ПриобретениеТоваровУслуг""));
		|НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ДокументОбъект, ПараметрыУказанияСерий, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТекущаяСтрока));
		|
		|Если НоменклатураКлиентСервер.ВЭтомСтатусеСерииУказываютсяВТЧТовары(ТекущаяСтрока.СтатусУказанияСерий, ПараметрыУказанияСерий) Тогда
		|	НоменклатураКлиентСервер.ПересчитатьСтатусУказанияСерийПриОбработке(ПараметрыУказанияСерий, ТекущаяСтрока.СтатусУказанияСерий, 
		|		ЗначениеЗаполнено(ТекущаяСтрока.Серия), Неопределено, 
		|		?(ПараметрыУказанияСерий.ЭтоЗаказ, ТекущаяСтрока.ВариантОбеспечения, Неопределено), ТекущаяСтрока);
		|Иначе
		|	
		|	ПараметрыОтбора = Новый Структура(""Номенклатура,Характеристика,Склад"", 
		|		ТекущаяСтрока.Номенклатура, 
		|		ТекущаяСтрока.Характеристика,
		|		ТекущаяСтрока.Склад);
		|		
		|	КоличествоСерий = 0;
		|	Для Каждого СтрокаСерия Из ДокументОбъект.Серии.НайтиСтроки(ПараметрыОтбора) Цикл
		|		КоличествоСерий = КоличествоСерий + СтрокаСерия.Количество;
		|	КонецЦикла;
		|	
		|	ТекущаяСтрока.Серия = Неопределено;
		|
		|	НоменклатураКлиентСервер.ПересчитатьСтатусУказанияСерийПриОбработке(ПараметрыУказанияСерий, 
		|		ТекущаяСтрока.СтатусУказанияСерий, 
		|		(ЗначениеЗаполнено(ТекущаяСтрока.КоличествоУпаковок) И ТекущаяСтрока.КоличествоУпаковок = КоличествоСерий), 
		|		КоличествоСерий, 
		|		?(ПараметрыУказанияСерий.ЭтоЗаказ, ТекущаяСтрока.ВариантОбеспечения, Неопределено), ТекущаяСтрока);
		|
		|КонецЕсли;";
	
КонецФункции 

Функция АлгоритмОбработкиСтрокДокумента_ВозвратТоваровОтКлиента(Параметры)
	
	Если Не Параметры.Свойство("ЭтоТовары") Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат "СтруктураДействий = Новый Структура;
		|СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ДокументОбъект);
		|
		|СтруктураДействий.Вставить(""ПересчитатьКоличествоЕдиниц"");
		|СтруктураДействий.Вставить(""ПересчитатьСумму"");
		|СтруктураДействий.Вставить(""ПересчитатьСуммуНДС"", СтруктураПересчетаСуммы);
		|СтруктураДействий.Вставить(""ПересчитатьСуммуСНДС"", СтруктураПересчетаСуммы);
		|
		|ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, Неопределено);
		|
		|мсвСтроки = Новый Массив();
		|мсвСтроки.Добавить(ТекущаяСтрока);
		|ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(ДокументОбъект, ОбщегоНазначения.ОбщийМодуль(""Документы.ВозвратТоваровОтКлиента""));
		|НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ДокументОбъект, ПараметрыУказанияСерий, мсвСтроки);";
	
КонецФункции 

Функция АлгоритмОбработкиСтрокДокумента_ВозвратТоваровПоставщику(Параметры)
	
	Если Не Параметры.Свойство("ЭтоТовары") Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат "СтруктураДействий = Новый Структура;
		|СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ДокументОбъект);
		|
		|СтруктураДействий.Вставить(""ПересчитатьКоличествоЕдиниц"");
		|СтруктураДействий.Вставить(""ПересчитатьСуммуНДС"", СтруктураПересчетаСуммы);
		|СтруктураДействий.Вставить(""ПересчитатьСумму"");
		|СтруктураДействий.Вставить(""ПересчитатьСуммуСНДС"", СтруктураПересчетаСуммы);
		|
		|ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, Неопределено);
		|
		|мсвСтроки = Новый Массив();
		|мсвСтроки.Добавить(ТекущаяСтрока);
		|ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(ДокументОбъект, ОбщегоНазначения.ОбщийМодуль(""Документы.ВозвратТоваровПоставщику""));
		|НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ДокументОбъект, ПараметрыУказанияСерий, мсвСтроки);";
	
КонецФункции 

Функция АлгоритмОбработкиСтрокДокумента_ЗаказКлиента(Параметры)
	
	Если Не Параметры.Свойство("ЭтоТовары") Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат "СтруктураДействий = Новый Структура;
		|СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ДокументОбъект);
		|
		|СтруктураДействий.Вставить(""ПересчитатьКоличествоЕдиниц"");
		|СтруктураДействий.Вставить(""ПересчитатьСуммуНДС"", СтруктураПересчетаСуммы);
		|СтруктураДействий.Вставить(""ПересчитатьСуммуСНДС"", СтруктураПересчетаСуммы);
		|СтруктураДействий.Вставить(""ПересчитатьСумму"");
		|СтруктураДействий.Вставить(""ПересчитатьСуммуСУчетомРучнойСкидки"", Новый Структура(""Очищать"", Ложь));
		|СтруктураДействий.Вставить(""ПересчитатьСуммуСУчетомАвтоматическойСкидки"", Новый Структура(""Очищать"", Истина));
		|СтруктураДействий.Вставить(""ПересчитатьСуммуСУчетомСкидкиБонуснымиБаллами"");
		|
		|ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, Неопределено);
		|
		|мсвСтроки = Новый Массив();
		|мсвСтроки.Добавить(ТекущаяСтрока);
		|ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(ДокументОбъект, ОбщегоНазначения.ОбщийМодуль(""Документы.ЗаказКлиента""));
		|НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ДокументОбъект, ПараметрыУказанияСерий, мсвСтроки);";
	
КонецФункции

Функция АлгоритмОбработкиСтрокДокумента_ЗаказПоставщику(Параметры)
	
	Если Не Параметры.Свойство("ЭтоТовары") Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат "СтруктураДействий = Новый Структура;
		|СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ДокументОбъект);
		|
		|СтруктураДействий.Вставить(""ПересчитатьКоличествоЕдиниц"");
		|СтруктураДействий.Вставить(""ПересчитатьСуммуНДС"", СтруктураПересчетаСуммы);
		|СтруктураДействий.Вставить(""ПересчитатьСуммуСНДС"", СтруктураПересчетаСуммы);
		|СтруктураДействий.Вставить(""ПересчитатьСумму"");
		|СтруктураДействий.Вставить(""ПересчитатьСуммуСУчетомРучнойСкидки"", Новый Структура(""Очищать"", Ложь));
		|
		|ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, Неопределено);";
	
КонецФункции 

Функция АлгоритмОбработкиСтрокДокумента_ПеремещениеТоваров(Параметры)
	
	Если Не Параметры.Свойство("ЭтоТовары") И Не Параметры.Свойство("ЭтоОтбор") И Не Параметры.Свойство("ЭтоРазмещение") Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат "СтруктураДействий = Новый Структура;
		|СтруктураДействий.Вставить(""ПересчитатьКоличествоЕдиниц"");
		|
		|ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, Неопределено);";
	
КонецФункции 

Функция АлгоритмОбработкиСтрокДокумента_ПересчетТоваров(Параметры)
	
	Если Не Параметры.Свойство("ЭтоТовары") И Не Параметры.Свойство("ЭтоОтбор") И Не Параметры.Свойство("ЭтоРазмещение") Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат "СтруктураДействий = Новый Структура;
		|СтруктураДействий.Вставить(""ПересчитатьКоличествоЕдиницСуффикс"", ""Факт"");
		|
		|ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, Неопределено);";
	
КонецФункции 

Функция АлгоритмОбработкиСтрокДокумента_ПриходныйОрдерНаТовары(Параметры)
	
	Если Не Параметры.Свойство("ЭтоТовары") И Не Параметры.Свойство("ЭтоОтбор") И Не Параметры.Свойство("ЭтоРазмещение") Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат "СтруктураДействий = Новый Структура;
		|ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(ДокументОбъект, Документы.ПриходныйОрдерНаТовары));
		|
		|СтруктураДействий.Вставить(""ПересчитатьКоличествоЕдиниц"");
		|СтруктураДействий.Вставить(""ПроверитьСериюРассчитатьСтатус"", Новый Структура(""Склад, ПараметрыУказанияСерий"", ДокументОбъект.Склад, ПараметрыУказанияСерий));
		|
		|ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, Неопределено);";
	
КонецФункции 

Функция АлгоритмОбработкиСтрокДокумента_РасходныйОрдерНаТовары(Параметры)
	
	Если Не Параметры.Свойство("ЭтоТовары") И Не Параметры.Свойство("ЭтоОтбор") И Не Параметры.Свойство("ЭтоРазмещение") Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат "СтруктураДействий = Новый Структура;
		|ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(ДокументОбъект, Документы.РасходныйОрдерНаТовары));
		|
		|СтруктураДействий.Вставить(""ПересчитатьКоличествоЕдиниц"");
		|СтруктураДействий.Вставить(""ПроверитьСериюРассчитатьСтатус"", Новый Структура(""Склад, ПараметрыУказанияСерий"", ДокументОбъект.Склад, ПараметрыУказанияСерий.ОтгружаемыеТовары));
		|
		|ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, Неопределено);";
	
КонецФункции

Функция АлгоритмОбработкиСтрокДокумента_РеализацияТоваровУслуг(Параметры)
	
	Если Не Параметры.Свойство("ЭтоТовары") Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат "СтруктураДействий = Новый Структура;
             |СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ДокументОбъект);
             |СтруктураДействий.Вставить(""ПроверитьЗаполнитьСклад"", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСкладаВСтрокеТЧ(ДокументОбъект, Ложь));
             |СтруктураДействий.Вставить(""ПересчитатьКоличествоЕдиниц"");
             |СтруктураДействий.Вставить(""ЗаполнитьСтавкуНДС"", ОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСтавкиНДС(ДокументОбъект));
             |СтруктураДействий.Вставить(""ПересчитатьСуммуНДС"", СтруктураПересчетаСуммы);
             |СтруктураДействий.Вставить(""ПересчитатьСуммуСНДС"", СтруктураПересчетаСуммы);
             |СтруктураДействий.Вставить(""ПересчитатьСумму"");
             |СтруктураДействий.Вставить(""ПересчитатьСуммуСУчетомРучнойСкидки"", Новый Структура(""Очищать"", Ложь));
             |СтруктураДействий.Вставить(""ПересчитатьСуммуСУчетомАвтоматическойСкидки"", Новый Структура(""Очищать"", Истина));
             |СтруктураДействий.Вставить(""ПересчитатьСуммуСУчетомСкидкиБонуснымиБаллами"");
             |СтруктураДействий.Вставить(""ОчиститьСуммуВзаиморасчетов"");
             |ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, Неопределено);
             |
			|мсвСтроки = Новый Массив();
			|мсвСтроки.Добавить(ТекущаяСтрока);
			|ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(ДокументОбъект, ОбщегоНазначения.ОбщийМодуль(""Документы.РеализацияТоваровУслуг""));
			|НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ДокументОбъект, ПараметрыУказанияСерий, мсвСтроки);";
	
КонецФункции  

Функция АлгоритмОбработкиСтрокДокумента_СборкаТоваров(Параметры)
	
	Если Не Параметры.Свойство("ЭтоТовары") И Не Параметры.Свойство("ЭтоОтбор") И Не Параметры.Свойство("ЭтоРазмещение") Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат "СтруктураДействий = Новый Структура;
		|СтруктураДействий.Вставить(""ПересчитатьКоличествоЕдиниц"");
		|
		|ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, Неопределено);";
	
КонецФункции

Функция АлгоритмОбработкиСтрокДокумента_ОтборРазмещениеТоваров(Параметры)
	
	Если Не Параметры.Свойство("ЭтоОтбор") И Не Параметры.Свойство("ЭтоРазмещение") Тогда
		Возврат "";
	КонецЕсли;
	
	Если Параметры.Свойство("ЭтоОтбор") Тогда
		Возврат "ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(ДокументОбъект, Документы.ОтборРазмещениеТоваров);
        |
		|СтруктураДействий = Новый Структура;  
		|СтруктураДействий.Вставить(""ПроверитьСериюРассчитатьСтатус"", Новый Структура(""Склад, ПараметрыУказанияСерий"", ДокументОбъект.Склад, ПараметрыУказанияСерий.Отбор));
		|СтруктураДействий.Вставить(""ПересчитатьКоличествоЕдиниц"");
		|СтруктураДействий.Вставить(""ЗаполнитьСлужебныеРеквизитыПоНазначению"");
		|	
		|ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, Неопределено);";
	Иначе
		Возврат "ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(ДокументОбъект, Документы.ОтборРазмещениеТоваров);
        |
		|СтруктураДействий = Новый Структура;  
		|СтруктураДействий.Вставить(""ПроверитьСериюРассчитатьСтатус"", Новый Структура(""Склад, ПараметрыУказанияСерий"", ДокументОбъект.Склад, ПараметрыУказанияСерий.Размещение));
		|СтруктураДействий.Вставить(""ПересчитатьКоличествоЕдиниц"");
		|СтруктураДействий.Вставить(""ЗаполнитьСлужебныеРеквизитыПоНазначению"");
		|	
		|ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, Неопределено);";
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти
