
#Область ОписаниеПеременных

&НаКлиенте
Перем ВыполнитьЗакрытиеФормы;

&НаКлиенте
Перем ОперацияЗапущена;

&НаКлиенте
Перем ОтменаВыполненияОперации;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиентСервер.Проверить(Не Параметры.КлючРегламентногоЗадания.Пустая(),
		СтрШаблон(НСтр("ru = 'Не передан ключ регламентного задания %1'"), SUI_SimpleКлиентСервер.Представление()));
	
	Элементы.НадписьПредставлениеКлючаРегламентногоЗадания.Заголовок = Параметры.КлючРегламентногоЗадания;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВыполнитьЗакрытиеФормы = Ложь;
	ОтменаВыполненияОперации = Ложь;
	
	Элементы.Начало.Видимость = Ложь;
	Элементы.Конец.Видимость = Ложь;
	
	ПодключитьОбработчикОжидания("ЗапуститьРегламентноеЗадание", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Отказ Или ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ВыполнитьЗакрытиеФормы Тогда
		ВыполнитьЗакрытие();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтменитьВыполнениеОперации(Команда)
	
	ОтменаВыполненияОперации = Истина;
	
	СменитьСтраницу("Процесс", НСтр("ru = 'Выполняется отмена выполнения'"));
	
	ПараметрыОтменыВыполнения = Новый Структура();
	ПараметрыОтменыВыполнения.Вставить("КлючРегламентногоЗадания", Параметры.КлючРегламентногоЗадания);
	ПараметрыОтменыВыполнения.Вставить("ИдентификаторФоновогоЗадания", ИдентификаторФоновогоЗадания);
	ПараметрыОтменыВыполнения.Вставить("ИгнорироватьОшибкиВыполнения", Параметры.ИгнорироватьОшибкиВыполнения);
	
	ДлительнаяОперация = ОтменитьВыполнениеОперацииНаСервере(ПараметрыОтменыВыполнения, УникальныйИдентификатор);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОтменитьВыполнениеОперацииЗавершение", ЭтотОбъект);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СменитьСтраницу(Операция, Информация = Неопределено)
	
	Если Операция = "Процесс" Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаДлительнойОперации;
		Элементы.НадписьПроцессВыполнения.Заголовок = ?(Информация = Неопределено, НСтр("ru = 'Выполняется регламентное задание'"), Информация);
	ИначеЕсли Операция = "Выполнено" Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаЗавершение;
		Элементы.ГруппаСтраницыЗавершения.ТекущаяСтраница = Элементы.СтраницаЗавершениеУспешно;
		Элементы.НадписьУспешноеВыполнение.Заголовок = ?(Информация = Неопределено, НСтр("ru = 'Реглмантное задание выполнено'"), Информация);;
	ИначеЕсли Операция = "Ошибка" Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаЗавершение;
		Элементы.ГруппаСтраницыЗавершения.ТекущаяСтраница = Элементы.СтраницаЗавершениеОшибка;
		Элементы.НадписьОшибкаВыполнения.Заголовок = ?(Информация = Неопределено, НСтр("ru = 'Ошибка выполнения регламентного задания'"), Информация);;
	Иначе
		ВыполнитьЗакрытие();
		Возврат;
	КонецЕсли;
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаЗавершение Тогда
		
		Элементы.Конец.Видимость = Истина;
		Конец = ОбщегоНазначенияКлиент.ДатаСеанса();
		
		Если Элементы.ГруппаСтраницыЗавершения.ТекущаяСтраница = Элементы.СтраницаЗавершениеОшибка Тогда
			
			Если ПустаяСтрока(ОписаниеИнформацииОбОшибки) Тогда
				ОписаниеИнформацииОбОшибки = НСтр("ru = 'Отсутствует подробное описание ошибки'");
			КонецЕсли;
			
			Если Параметры.ЗакрытьПриОшибке Тогда
				ВыполнитьЗакрытие();
				Возврат;
			КонецЕсли;
			
		ИначеЕсли Элементы.ГруппаСтраницыЗавершения.ТекущаяСтраница = Элементы.СтраницаЗавершениеУспешно И Параметры.ЗакрытьПриУспешномЗавершении Тогда
			ВыполнитьЗакрытие();
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗакрытие()
	
	ВыполнитьЗакрытиеФормы = Истина;
	
	ПараметрыЗакрытия = SUI_РегламентныеЗаданияКлиент.РезультатЗапускаРегламентногоЗаданияВручную();
	ПараметрыЗакрытия.ЗаданиеЗапущено = ЗаданиеЗапущено;
	ПараметрыЗакрытия.ЗаданиеВыполнено = ЗаданиеВыполнено;
	
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьРегламентноеЗадание() Экспорт
	
	Если ОтменаВыполненияОперации Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Начало.Видимость = Истина;
	Начало = ОбщегоНазначенияКлиент.ДатаСеанса();
	
	ОперацияЗапущена = Истина;
	
	СменитьСтраницу("Процесс", НСтр("ru = 'Выполняется запуск регламентного задания'"));
	
	ПараметрыЗапуска = SUI_РегламентныеЗаданияКлиентСервер.ПараметрыЗапускаРегламентногоЗадания(Параметры.КлючРегламентногоЗадания);
	ПараметрыЗапуска.ИгнорироватьИспользование = Параметры.ИгнорироватьИспользование;
	ПараметрыЗапуска.ИгнорироватьОшибкиВыполнения = Параметры.ИгнорироватьОшибкиВыполнения;
	
	ДлительнаяОперация = ЗапуститьРегламентноеЗаданиеНаСервере(ПараметрыЗапуска, УникальныйИдентификатор);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗапуститьРегламентноеЗаданиеВручнуюЗавершение", ЭтотОбъект);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗапуститьРегламентноеЗаданиеНаСервере(ПараметрыЗапуска, ИдентификаторФормы)
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"SUI_РегламентныеЗадания.ЗапуститьРегламентноеЗаданиеВручную", 
		ПараметрыЗапуска, 
		ДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторФормы));
	
КонецФункции

&НаКлиенте
Процедура ЗапуститьРегламентноеЗаданиеВручнуюЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ИнформацияРезультат = Новый Структура("ЗаданиеВыполнено, Выполнено, Ошибка", Ложь);
	
	Если Результат = Неопределено Тогда
		ИнформацияРезультат.Ошибка = НСтр("ru = 'Не удалось получить результат запуска регламентного задания'");
	Иначе
		
		Если Результат.Статус = "Выполнено" Тогда
			
			РезультатВыполнения = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
			
			Если РезультатВыполнения.Запущено Тогда
				
				ЗаданиеЗапущено = Истина;
				ИдентификаторФоновогоЗадания = РезультатВыполнения.ИдентификаторФоновогоЗадания;
				
				Если РезультатВыполнения.Состояние = "Выполнено" Тогда
					ЗаданиеВыполнено = Истина;
					ИнформацияРезультат.ЗаданиеВыполнено = Истина;
					ИнформацияРезультат.Выполнено = НСтр("ru = 'Регламентное задание выполнено'");
				ИначеЕсли РезультатВыполнения.Состояние = "Выполняется" Тогда
					ИнформацияРезультат.Выполнено = НСтр("ru = 'Регламентное задание запущено'");
				ИначеЕсли РезультатВыполнения.Состояние = "Ошибка" Тогда
					ИнформацияРезультат.Ошибка = НСтр("ru = 'Выполнение регламентного задания завершено с ошибкой'");
				ИначеЕсли РезультатВыполнения.Состояние = "Отменено" Тогда
					ИнформацияРезультат.Ошибка = НСтр("ru = 'Выполнение регламентного задания отменено'");
				КонецЕсли;
				
			Иначе
				ИнформацияРезультат.Ошибка = НСтр("ru = 'Не удалось запустить регламентное задание'");
			КонецЕсли;
			
			ОписаниеИнформацииОбОшибки = РезультатВыполнения.ОписаниеИнформацииОбОшибке;
			
		ИначеЕсли Результат.Статус = "Ошибка" Тогда
			
			Если ЗначениеЗаполнено(Результат.ПодробноеПредставлениеОшибки) Тогда
				ОписаниеИнформацииОбОшибки = Результат.КраткоеПредставлениеОшибки;
			ИначеЕсли ЗначениеЗаполнено(Результат.КраткоеПредставлениеОшибки) Тогда
				ОписаниеИнформацииОбОшибки = Результат.КраткоеПредставлениеОшибки;
			КонецЕсли;
			
			ИнформацияРезультат.Ошибка = НСтр("ru = 'При запуске реглмантного задания возникла ошибка'");
			
		ИначеЕсли Результат.Статус = "Отменено" Тогда
			ИнформацияРезультат.Ошибка = НСтр("ru = 'Запуск реглмантного задания был отменен'");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИнформацияРезультат.Ошибка <> Неопределено Тогда
		СменитьСтраницу("Ошибка", ИнформацияРезультат.Ошибка);
	ИначеЕсли ИнформацияРезультат.ЗаданиеВыполнено Или Не Параметры.ОжидатьЗавершения Тогда
		СменитьСтраницу("Выполнено", ИнформацияРезультат.Выполнено);
	Иначе
		ПодключитьОбработчикОжидания("ЗапуститьОбработкуОжиданияЗавершенияЗадания", 0.2, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьОбработкуОжиданияЗавершенияЗадания() Экспорт
	
	Если ОтменаВыполненияОперации Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторФоновогоЗадания) Тогда
		
		ОперацияЗапущена = Истина;
		
		СменитьСтраницу("Процесс", НСтр("ru = 'Ожидание завершения регламентного задания'"));
		
		ПараметрыЗапуска = Новый Структура();
		ПараметрыЗапуска.Вставить("КлючРегламентногоЗадания", Параметры.КлючРегламентногоЗадания);
		ПараметрыЗапуска.Вставить("ИдентификаторФоновогоЗадания", ИдентификаторФоновогоЗадания);
		ПараметрыЗапуска.Вставить("ИгнорироватьОшибкиВыполнения", Параметры.ИгнорироватьОшибкиВыполнения);
		
		ДлительнаяОперация = ЗапуститьОбработкуОжиданияЗавершенияЗаданияНаСервере(ПараметрыЗапуска, УникальныйИдентификатор);
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗапуститьОбработкуОжиданияЗавершенияЗаданияЗавершение", ЭтотОбъект);
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
		
	Иначе
		СменитьСтраницу(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗапуститьОбработкуОжиданияЗавершенияЗаданияНаСервере(ПараметрыЗапуска, ИдентификаторФормы)
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"SUI_РегламентныеЗадания.ПолучитьРезультатВыполненияФоновогоЗаданияРегламентногоЗадания", 
		ПараметрыЗапуска, 
		ДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторФормы));
	
КонецФункции

&НаКлиенте
Процедура ЗапуститьОбработкуОжиданияЗавершенияЗаданияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ИнформацияРезультат = Новый Структура("Выполнено, Ошибка");
	
	Если Результат = Неопределено Тогда
		ИнформацияРезультат.Ошибка = НСтр("ru = 'Не удалось получить результат завершения выполнения регламентного задания'");
	Иначе
		
		Если Результат.Статус = "Выполнено" Тогда
			
			РезультатВыполнения = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
			
			Если РезультатВыполнения.Состояние = "Выполнено" Тогда
				ЗаданиеВыполнено = Истина;
				ИнформацияРезультат.Выполнено = НСтр("ru = 'Регламентное задание выполнено'");
			ИначеЕсли РезультатВыполнения.Состояние = "Выполняется" Тогда
				
				ИдентификаторФоновогоЗадания = РезультатВыполнения.ИдентификаторФоновогоЗадания;
				
				Если ЗначениеЗаполнено(ИдентификаторФоновогоЗадания) Тогда
					ПодключитьОбработчикОжидания("ЗапуститьОбработкуОжиданияЗавершенияЗадания", 2, Истина);
					Возврат;
				Иначе
					ИнформацияРезультат.Ошибка = НСтр("ru = 'Ошибка получения идентификатора фонового задания регламентного задания'");
				КонецЕсли;
				
			ИначеЕсли РезультатВыполнения.Состояние = "Ошибка" Тогда
				ИнформацияРезультат.Ошибка = НСтр("ru = 'Выполнение регламентного задания завершено с ошибкой'");
			ИначеЕсли РезультатВыполнения.Состояние = "Отменено" Тогда
				ИнформацияРезультат.Ошибка = НСтр("ru = 'Выполнение регламентного задания отменено'");
			Иначе
				ИнформацияРезультат.Ошибка = НСтр("ru = 'Не удалось получить результат выполенения регламентного задания'");
			КонецЕсли;
			
			ОписаниеИнформацииОбОшибки = РезультатВыполнения.ОписаниеИнформацииОбОшибке;
			
		ИначеЕсли Результат.Статус = "Ошибка" Тогда
			
			Если ЗначениеЗаполнено(Результат.ПодробноеПредставлениеОшибки) Тогда
				ОписаниеИнформацииОбОшибки = Результат.КраткоеПредставлениеОшибки;
			ИначеЕсли ЗначениеЗаполнено(Результат.КраткоеПредставлениеОшибки) Тогда
				ОписаниеИнформацииОбОшибки = Результат.КраткоеПредставлениеОшибки;
			КонецЕсли;
			
			ИнформацияРезультат.Ошибка = НСтр("ru = 'При получении результата выполнения регламентного задания возникла ошибка'");
			
		ИначеЕсли Результат.Статус = "Отменено" Тогда
			ИнформацияРезультат.Ошибка = НСтр("ru = 'Получении результата выполнения регламентного задания было отменено'");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИнформацияРезультат.Выполнено <> Неопределено Тогда
		СменитьСтраницу("Выполнено", ИнформацияРезультат.Выполнено);
	Иначе
		СменитьСтраницу("Ошибка", ИнформацияРезультат.Ошибка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОтменитьВыполнениеОперацииНаСервере(ПараметрыОтменыВыполнения, ИдентификаторФормы)
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"SUI_РегламентныеЗадания.ОстановитьРегламентноеЗадание", 
		ПараметрыОтменыВыполнения, 
		ДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторФормы));
	
КонецФункции

&НаКлиенте
Процедура ОтменитьВыполнениеОперацииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ИнформацияРезультат = Новый Структура("Выполнено, Ошибка");
	
	Если Результат = Неопределено Тогда
		ИнформацияРезультат.Ошибка = НСтр("ru = 'Не удалось получить результат отмены выполнения регламентного задания'");
	Иначе
		
		Если Результат.Статус = "Выполнено" Тогда
			
			РезультатОтменыВыполнения = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
			
			Если РезультатОтменыВыполнения Тогда
				ИнформацияРезультат.Выполнено = НСтр("ru = 'Регламентное задание было отменено'");
			Иначе
				ИнформацияРезультат.Ошибка = НСтр("ru = 'Не удалось отменить выполнение регламентного задания'");
			КонецЕсли;
			
		ИначеЕсли Результат.Статус = "Ошибка" Тогда
			
			Если ЗначениеЗаполнено(Результат.ПодробноеПредставлениеОшибки) Тогда
				ОписаниеИнформацииОбОшибки = Результат.КраткоеПредставлениеОшибки;
			ИначеЕсли ЗначениеЗаполнено(Результат.КраткоеПредставлениеОшибки) Тогда
				ОписаниеИнформацииОбОшибки = Результат.КраткоеПредставлениеОшибки;
			КонецЕсли;
			
			ИнформацияРезультат.Ошибка = НСтр("ru = 'При попытке отменить выполнение регламентного задания возникла ошибка'");
			
		ИначеЕсли Результат.Статус = "Отменено" Тогда
			ИнформацияРезультат.Ошибка = НСтр("ru = 'Попытка отмены выполнения регламентного задания была отменена'");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИнформацияРезультат.Выполнено <> Неопределено Тогда
		СменитьСтраницу(Неопределено);
	Иначе
		СменитьСтраницу("Ошибка", ИнформацияРезультат.Ошибка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
