
#Область ПрограммныйИнтерфейс

Функция ЗагрузитьДанныеДокументов(МобильноеУстройство, ДанныеДокументов) Экспорт
	
	РезультатЗагрузки = Новый Структура();
	РезультатЗагрузки.Вставить("total", 1);
	РезультатЗагрузки.Вставить("quantity_uploaded", 0);
	РезультатЗагрузки.Вставить("result", Ложь);
	
	ТипЗначенияДанныеДокументов = ТипЗнч(ДанныеДокументов);
	
	Если ПолучитьФункциональнуюОпцию("SUI_ОнлайнОбмен") И ТипЗначенияДанныеДокументов = Тип("Строка") Тогда
		
		ДанныеДокументов = SUI_СообщенияОбменаДанными.ВосстановитьСжатуюСтроку(ДанныеДокументов);
		Если Не ПустаяСтрока(ДанныеДокументов) Тогда
			ДанныеДокументов = SUI_ОбщегоНазначенияКлиентСервер.ДанныеИзСтрокиJSON(ДанныеДокументов, Ложь, , ,
				"ВосстановлениеДанныхJSON_ДанныеДокумента", SUI_ОбменДаннымиСервер);
			ТипЗначенияДанныеДокументов = ТипЗнч(ДанныеДокументов);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗначенияДанныеДокументов <> Тип("Структура") Тогда
		
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Тип данных документов должен быть типом ""Структура"".
		|Полученный тип: ""%1""'"), ТипЗначенияДанныеДокументов);
		ОбщегоНазначенияКлиентСервер.Проверить(Ложь, ТекстОшибки,
			"SUI_ОбменДаннымиСерверПереопределяемый.ЗагрузитьДанныеДокументов");
		
	КонецЕсли;
	
	ИдентификаторДокумента = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ДанныеДокументов, "id_doc", "", Тип("Строка"));
	
	Если Не SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(ИдентификаторДокумента) Тогда
		
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Передан неизвестный идентификатор документа ""%1""'"), ИдентификаторДокумента);
		ОбщегоНазначенияКлиентСервер.Проверить(Ложь, ТекстОшибки,
			"SUI_ОбменДаннымиСерверПереопределяемый.ЗагрузитьДанныеДокументов");
		
	КонецЕсли;
	
	ДанныеДляЗагрузки = РегистрыСведений.SUI_docs.ДанныеДляЗагрузкиИзМобильногоУстройства(
		ИдентификаторДокумента, МобильноеУстройство);
	
	Если ДанныеДокументов.Свойство("RS_docs_table") Тогда
		ДанныеДляЗагрузки.Таблицы.Товары = ДанныеДокументов.RS_docs_table;
	ИначеЕсли ДанныеДокументов.Свойство("RS_adr_docs_table") Тогда
		ДанныеДляЗагрузки.Таблицы.Товары = ДанныеДокументов.RS_adr_docs_table;
	КонецЕсли;
	
	Если ДанныеДокументов.Свойство("RS_docs_series") Тогда
		ДанныеДляЗагрузки.Таблицы.Серии = ДанныеДокументов.RS_docs_series;
	КонецЕсли;
	
	Если ДанныеДокументов.Свойство("RS_docs_barcodes") Тогда
		ДанныеДляЗагрузки.Таблицы.ШтрихкодыУпаковок = ДанныеДокументов.RS_docs_barcodes;
	КонецЕсли;
	
	Если ДанныеДокументов.Свойство("RS_barc_flow") Тогда
		ДанныеДляЗагрузки.Таблицы.ПотокШтрихкодов = ДанныеДокументов.RS_barc_flow;
	КонецЕсли;
	
	Если ДанныеДляЗагрузки.Таблицы.Количество() > 0 Тогда
		
		Результат = РегистрыСведений.SUI_docs.ЗагрузитьИзМобильногоУстройства(ДанныеДляЗагрузки);
		
		Если Результат Тогда
			
			РезультатЗагрузки.quantity_uploaded = 1;
			РезультатЗагрузки.result = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат РезультатЗагрузки;
	
КонецФункции

#КонецОбласти
