
#Область ПрограммныйИнтерфейс

// Установить признак заполнености ячейки.
// 
// Параметры:
//  МобильноеУстройство - ПланОбменаСсылка.SUI_МобильныеУстройства - Мобильное устройство
//  Ячейка - СправочникСсылка.уатСкладскиеЯчейки - Ячейка
//  Заполнено - Булево - Признак заполненности
// 
// Возвращаемое значение:
//  Структура - см. SUI_HTTPСервис.РезультатУспех
Функция УстановитьПризнакЗаполненностиЯчейки(МобильноеУстройство, Ячейка, Заполнено) Экспорт
	
	МодульСкладскиеЯчейки = SUI_ОбщегоНазначения.ОбщийМодуль("SUAT_СкладскиеЯчейки");
	РезультатЗаполнено = МодульСкладскиеЯчейки.УстановитьПризнакЗаполненностиЯчейки(Ячейка, Заполнено);
	
	Результат = Новый Структура();
	Результат.Вставить("result", Истина);
	Результат.Вставить("current_filled", РезультатЗаполнено);
	
	//@skip-check constructor-function-return-section
	Возврат SUI_HTTPСервис.РезультатУспех(Результат);
	
КонецФункции

#КонецОбласти
