
#Область ПрограммныйИнтерфейс

// Установить признак заполнености ячейки.
// 
// Параметры:
//  МобильноеУстройство - ПланОбменаСсылка.SUI_МобильныеУстройства - Мобильное устройство
//  Ячейка - СправочникСсылка.уатСкладскиеЯчейки - Ячейка
// 
// Возвращаемое значение:
//  Структура - см. SUI_HTTPСервис.РезультатУспех
Функция УстановитьПризнакЗаполненностиЯчейки(МобильноеУстройство, Ячейка) Экспорт
	
	МодульСкладскиеЯчейки = SUI_ОбщегоНазначения.ОбщийМодуль("SUAT_СкладскиеЯчейки");
	МодульСкладскиеЯчейки.УстановитьПризнакЗаполненностиЯчейки(Ячейка, Истина);
	
	Результат = Новый Структура();
	Результат.Вставить("result", Истина);
	
	//@skip-check constructor-function-return-section
	Возврат SUI_HTTPСервис.РезультатУспех(Результат);
	
КонецФункции

#КонецОбласти
