
#Область СлужебныйПрограммныйИнтерфейс

Функция ИмяСобытия() Экспорт
	Возврат НСтр("ru = 'Штрихкоды номенклатуры'");
КонецФункции

Функция ПредопределенныеАлгоритмыСозданияШтрихкодаНоменклатуры() Экспорт
	
	ПредопределенныеАлгоритмы = Новый СписокЗначений();
	ПредопределенныеАлгоритмы.Добавить(
		ПредопределенныеАлгоритмыСозданияШтрихкодаНоменклатурыТорговлей11(),
		ПредопределенноеЗначение("Перечисление.SUI_ПредопределенныеНастройкиПодсистемы.УправлениеТорговлей11"));
	ПредопределенныеАлгоритмы.Добавить(
		ПредопределенныеАлгоритмыСозданияШтрихкодаНоменклатурыТорговлей11(),
		ПредопределенноеЗначение("Перечисление.SUI_ПредопределенныеНастройкиПодсистемы.Розница23"));
	ПредопределенныеАлгоритмы.Добавить(
		ПредопределенныеАлгоритмыСозданияШтрихкодаНоменклатурыУНФ(),
		ПредопределенноеЗначение("Перечисление.SUI_ПредопределенныеНастройкиПодсистемы.УправлениеНашейФирмой"));
	ПредопределенныеАлгоритмы.Добавить(
		ПредопределенныеАлгоритмыСозданияШтрихкодаНоменклатурыУНФ(),
		ПредопределенноеЗначение("Перечисление.SUI_ПредопределенныеНастройкиПодсистемы.Розница30"));

	Возврат ПредопределенныеАлгоритмы;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПредопределенныеАлгоритмыСозданияШтрихкодаНоменклатурыТорговлей11()
	
	Возврат "МенеджерЗаписи = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();
	|
	|МенеджерЗаписи.Штрихкод 		= Штрихкод;
	|МенеджерЗаписи.Номенклатура 	= Номенклатура;
	|МенеджерЗаписи.Характеристика 	= Характеристика;
	|МенеджерЗаписи.Упаковка 		= Упаковка;
	|
	|МенеджерЗаписи.Записать(Истина);";
	
КонецФункции

Функция ПредопределенныеАлгоритмыСозданияШтрихкодаНоменклатурыУНФ()
	
	Возврат "МенеджерЗаписи = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();
	|
	|МенеджерЗаписи.Штрихкод 		= Штрихкод;
	|МенеджерЗаписи.Номенклатура 	= Номенклатура;
	|МенеджерЗаписи.Характеристика 	= Характеристика;
	|МенеджерЗаписи.ЕдиницаИзмерения = Упаковка;
	|
	|МенеджерЗаписи.Записать(Истина);";
	
КонецФункции

#КонецОбласти
