
#Область ПрограммныйИнтерфейс

Функция ПредопределенныйАлгоритмСозданияШтрихкодаНоменклатуры() Экспорт
	
	Алгоритм = "";
	
//	Если КонфигурацияНастройки = ПредопределенноеЗначение("Перечисление.SUI_ПредопределенныеНастройкиПодсистемы.УправлениеТорговлей11") Или
//		КонфигурацияНастройки = ПредопределенноеЗначение("Перечисление.SUI_ПредопределенныеНастройкиПодсистемы.Розница23") Тогда
		Алгоритм = "МенеджерЗаписи = ОбщегоНазначения.ОбщийМодуль(""РегистрыСведений.ШтрихкодыНоменклатуры"").СоздатьМенеджерЗаписи();
		|
		|МенеджерЗаписи.Штрихкод 		= Штрихкод;
		|МенеджерЗаписи.Номенклатура 	= Номенклатура;
		|МенеджерЗаписи.Характеристика 	= Характеристика;
		|МенеджерЗаписи.Упаковка 		= Упаковка;
		|
		|МенеджерЗаписи.Записать(Истина);";
//	ИначеЕсли КонфигурацияНастройки = ПредопределенноеЗначение("Перечисление.SUI_ПредопределенныеНастройкиПодсистемы.Розница30") Или
//		КонфигурацияНастройки = ПредопределенноеЗначение("Перечисление.SUI_ПредопределенныеНастройкиПодсистемы.УправлениеНашейФирмой") Тогда
//		Алгоритм = "МенеджерЗаписи = ОбщегоНазначения.ОбщийМодуль(""РегистрыСведений.ШтрихкодыНоменклатуры"").СоздатьМенеджерЗаписи();
//		|
//		|МенеджерЗаписи.Штрихкод 		= Штрихкод;
//		|МенеджерЗаписи.Номенклатура 	= Номенклатура;
//		|МенеджерЗаписи.Характеристика 	= Характеристика;
//		|МенеджерЗаписи.ЕдиницаИзмерения = Упаковка;
//		|
//		|МенеджерЗаписи.Записать(Истина);";
//	КонецЕсли;
	
	Возврат Алгоритм;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ИмяСобытия() Экспорт
	Возврат НСтр("ru = 'Штрихкоды номенклатуры'");
КонецФункции

#КонецОбласти
