
#Область ПрограммныйИнтерфейс

Процедура ИнициализироватьКаталогБиблиотекиSimple(ОповещениеОЗавершении, ИмяБиблиотеки, Перезаписать = Ложь) Экспорт
	
	ОбщегоНазначенияКлиентСервер.Проверить(Не ПустаяСтрока(ИмяБиблиотеки),
		НСтр("ru = 'Не передано имя библиотеки'"),
		"SUI_ФайловаяСистемаКлиент.ИнициализироватьКаталогБиблиотекиSimple");
	
	Контекст = Новый Структура();
	Контекст.Вставить("ОповещениеОЗавершении", ОповещениеОЗавершении);
	Контекст.Вставить("ИмяБиблиотеки", ИмяБиблиотеки);
	Контекст.Вставить("Перезаписать", Перезаписать);
	
	Оповещение = Новый ОписаниеОповещения("ИнициализироватьКаталогБиблиотекиSimpleПродолжить", ЭтотОбъект, Контекст);
	
	ИнициализацияФайловойСистемыSimple(Неопределено, Новый Структура("ОповещениеОЗавершении", Оповещение));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриЗавершенииРаботыСистемы() Экспорт
	
	ПутьФайловойСистемыSimple = ПолучитьПутьФайловойСистемыSimple();
	
	Если ЗначениеЗаполнено(ПутьФайловойСистемыSimple) Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеУдаленияКаталогаФайловойСистемыSimple", ЭтотОбъект);
		НачатьУдалениеФайлов(ОписаниеОповещения, ПутьФайловойСистемыSimple);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция КлючВПараметрахПриложения()
	
	Возврат "ФАЙЛОВАЯ_СИСТЕМА_SIMPLE";
	
КонецФункции

Функция ИмяКаталогаФайловойСистемыSimple()
	
	Возврат "simple";
	
КонецФункции

Функция ПолучитьПутьФайловойСистемыSimple()
	
	Возврат SUI_SimpleКлиент.ПолучитьПараметрПриложения(КлючВПараметрахПриложения());
	
КонецФункции

Процедура ИнициализацияФайловойСистемыSimple(Результат, Контекст) Экспорт
	
	РезультатИнициализации = Новый Структура();
	РезультатИнициализации.Вставить("Выполнено", Ложь);
	РезультатИнициализации.Вставить("Сообщение", "");
	//РезультатИнициализации = Ложь;
	
	Если Не Контекст.Свойство("ТекущееДействие") Тогда
		
		Контекст.Вставить("ТекущееДействие", "ПодключитьРасширениеДляРаботыСФайлами");
		
		Оповещение = Новый ОписаниеОповещения("ИнициализацияФайловойСистемыSimple", ЭтотОбъект, Контекст);
		ФайловаяСистемаКлиент.ПодключитьРасширениеДляРаботыСФайлами(Оповещение, , Ложь);
		
	ИначеЕсли Контекст.ТекущееДействие = "ПодключитьРасширениеДляРаботыСФайлами" Тогда
		
		Если Не Результат Тогда
			Контекст.Удалить("ТекущееДействие");
			РезультатИнициализации.Сообщение = НСтр("ru = 'Не подключено расширение для работы с файлами.'");
		Иначе
			
			ПутьФайловойСистемы = ПолучитьПутьФайловойСистемыSimple();
			
			Если ПутьФайловойСистемы = Неопределено Тогда
				
				Контекст.ТекущееДействие = "ПолучениеРабочегоКаталогаДанныхПользователя";
				
				Оповещение = Новый ОписаниеОповещения("ИнициализацияФайловойСистемыSimple", ЭтотОбъект, Контекст);
				НачатьПолучениеРабочегоКаталогаДанныхПользователя(Оповещение);
				
			Иначе
				
				Контекст.ТекущееДействие = "ПроверкаСуществованияКаталогаФайловойСистемы";
				Контекст.Вставить("ПутьФайловойСистемы", ПутьФайловойСистемы);
				
				Оповещение = Новый ОписаниеОповещения("ИнициализацияФайловойСистемыSimple", ЭтотОбъект, Контекст);
				 
				ФайлНаДиске = Новый Файл(Контекст.ПутьФайловойСистемы);
				ФайлНаДиске.НачатьПроверкуСуществования(Оповещение);
		
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли Контекст.ТекущееДействие = "ПолучениеРабочегоКаталогаДанныхПользователя" Или
		Контекст.ТекущееДействие = "СозданиеКаталогаФайловойСистемы" Тогда
		
		Если Не ЗначениеЗаполнено(Результат) Тогда
			
			Контекст.Удалить("ТекущееДействие");
			
			Если Истина Тогда
				РезультатИнициализации.Сообщение = НСтр("ru = 'Не удалось инициализировать рабочий каталог данных.'");
			Иначе
				РезультатИнициализации.Сообщение = НСтр("ru = 'Не удалось создать каталог файловой системы Simple.'");
			КонецЕсли;
			
		Иначе
			
			Если Контекст.ТекущееДействие = "СозданиеКаталогаФайловойСистемы" Тогда
				ПутьФайловойСистемы = Результат;
				Контекст.Вставить("ПослеСозданияКаталога");
			Иначе
				ПутьФайловойСистемы = SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(
					Результат, ИмяКаталогаФайловойСистемыSimple());
			КонецЕсли;
			
			Контекст.Вставить("ПутьФайловойСистемы", ПутьФайловойСистемы);
			
			Контекст.ТекущееДействие = "ПроверкаСуществованияКаталогаФайловойСистемы";
			
			Оповещение = Новый ОписаниеОповещения("ИнициализацияФайловойСистемыSimple", ЭтотОбъект, Контекст);
			 
			ФайлНаДиске = Новый Файл(Контекст.ПутьФайловойСистемы);
			ФайлНаДиске.НачатьПроверкуСуществования(Оповещение);
			
		КонецЕсли;
		
	ИначеЕсли Контекст.ТекущееДействие = "ПроверкаСуществованияКаталогаФайловойСистемы" Тогда
		
		Если Результат Тогда
			
			SUI_SimpleКлиент.УстановитьПараметрПриложения(КлючВПараметрахПриложения(), Контекст.ПутьФайловойСистемы);
			
			Контекст.Удалить("ТекущееДействие");
			
			РезультатИнициализации.Выполнено = Истина;
			
		ИначеЕсли Не Контекст.Свойство("ПослеСозданияКаталога") Тогда
			
			Контекст.ТекущееДействие = "СозданиеКаталогаФайловойСистемы";
			
			Оповещение = Новый ОписаниеОповещения("ИнициализацияФайловойСистемыSimple", ЭтотОбъект, Контекст);
			НачатьСозданиеКаталога(Оповещение, Контекст.ПутьФайловойСистемы);
			
		Иначе
			Контекст.Удалить("ТекущееДействие");
			РезультатИнициализации.Сообщение = НСтр("ru = 'Не удалось инициализировать каталог файловой системы Simple после создания.'");
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не Контекст.Свойство("ТекущееДействие") И Контекст.Свойство("ОповещениеОЗавершении") Тогда
		ВыполнитьОбработкуОповещения(Контекст.ОповещениеОЗавершении, РезультатИнициализации);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗавершениеУдаленияКаталогаФайловойСистемыSimple(Контекст) Экспорт
	
	//
	
КонецПроцедуры

#Область ИнициализацияКаталогаБиблиотеки

Процедура ИнициализироватьКаталогБиблиотекиSimpleПродолжить(РезультатИнициализацииФС, Контекст) Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("Путь");
	Результат.Вставить("Ошибка");
	
	Контекст.Вставить("Результат", Результат);
	
	Если Не РезультатИнициализацииФС.Выполнено Тогда
		
		Если ПустаяСтрока(РезультатИнициализацииФС.Сообщение) Тогда
			Контекст.Результат.Ошибка = НСтр("ru = 'Не удалось инициализировать каталог файловой системы Simple.'");
		Иначе
			Контекст.Результат.Ошибка = РезультатИнициализацииФС.Сообщение;
		КонецЕсли;
		
		ВыполнитьОбработкуОповещения(Контекст.ОповещениеОЗавершении, Контекст.Результат);
		
	Иначе
		
		ПутьФайловойСистемы = ПолучитьПутьФайловойСистемыSimple();
		
		ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(ПутьФайловойСистемы),
			НСтр("ru = 'Не удалось получить путь к каталогу файловой системы Simple после инициализации.'"),
			"SUI_ФайловаяСистемаКлиент.ИнициализироватьКаталогБиблиотекиSimpleПродолжить");
		
		Контекст.Вставить("КаталогБиблиотеки", SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(
			ПутьФайловойСистемы, "lib", Контекст.ИмяБиблиотеки));
		
		Оповещение = Новый ОписаниеОповещения("ИнициализироватьКаталогБиблиотекиSimpleПослеПроверкиСуществования", 
			ЭтотОбъект, Контекст);
		 
		ФайлНаДиске = Новый Файл(Контекст.КаталогБиблиотеки);
		ФайлНаДиске.НачатьПроверкуСуществования(Оповещение);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ИнициализироватьКаталогБиблиотекиSimpleПослеПроверкиСуществования(Существует, Контекст) Экспорт
	
	Если Существует Тогда
		
		Контекст.Результат.Путь = Контекст.КаталогБиблиотеки;
		
		Если Контекст.Перезаписать И Не Контекст.Свойство("СозданКаталог") Тогда
			
			Контекст.Перезаписать = Ложь;
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ИнициализироватьКаталогБиблиотекиSimpleПослеПерезаписи", 
				ЭтотОбъект, Контекст);
			НачатьУдалениеФайлов(ОписаниеОповещения, Контекст.КаталогБиблиотеки);
			
		Иначе
			ВыполнитьОбработкуОповещения(Контекст.ОповещениеОЗавершении, Контекст.Результат);
		КонецЕсли;
		
	ИначеЕсли Не Контекст.Свойство("СозданКаталог") Тогда
		
		Оповещение = Новый ОписаниеОповещения("ИнициализироватьКаталогБиблиотекиSimpleПослеСоздания", ЭтотОбъект, Контекст);
		НачатьСозданиеКаталога(Оповещение, Контекст.КаталогБиблиотеки);
		
	Иначе
		
		Контекст.Результат.Ошибка = СтрШаблон(НСтр("ru = 'Не удалось инициализировать каталог библиотеки ""%1"".'"), 
			Контекст.ИмяБиблиотеки);
		
		ВыполнитьОбработкуОповещения(Контекст.ОповещениеОЗавершении, Контекст.Результат);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ИнициализироватьКаталогБиблиотекиSimpleПослеСоздания(ИмяКаталога, Контекст) Экспорт
	
	Контекст.Вставить("СозданКаталог");
	
	Оповещение = Новый ОписаниеОповещения("ИнициализироватьКаталогБиблиотекиSimpleПослеПроверкиСуществования", 
		ЭтотОбъект, Контекст);
	
	ФайлНаДиске = Новый Файл(Контекст.КаталогБиблиотеки);
	ФайлНаДиске.НачатьПроверкуСуществования(Оповещение);
	
КонецПроцедуры

Процедура ИнициализироватьКаталогБиблиотекиSimpleПослеПерезаписи(Контекст) Экспорт
	
	Оповещение = Новый ОписаниеОповещения("ИнициализироватьКаталогБиблиотекиSimpleПослеСоздания", ЭтотОбъект, Контекст);
	НачатьСозданиеКаталога(Оповещение, Контекст.КаталогБиблиотеки);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
