
#Область ПрограммныйИнтерфейс

Процедура ИнициализироватьКаталогБиблиотекиSimple(ОповещениеОЗавершении, ИмяБиблиотеки, Перезаписать = Ложь) Экспорт
	
	ОбщегоНазначенияКлиентСервер.Проверить(Не ПустаяСтрока(ИмяБиблиотеки),
		НСтр("ru = 'Не передано имя библиотеки'"),
		"SUI_ФайловаяСистемаКлиент.ИнициализироватьКаталогБиблиотекиSimple");
	
	Контекст = Новый Структура();
	Контекст.Вставить("ОповещениеОЗавершении", ОповещениеОЗавершении);
	Контекст.Вставить("ИмяБиблиотеки", ИмяБиблиотеки);
	Контекст.Вставить("Перезаписать", Перезаписать);
	
	Оповещение = Новый ОписаниеОповещения("ИнициализироватьКаталогБиблиотекиSimpleПродолжить", ЭтотОбъект, Контекст);
	
	SUI_ФайловаяСистемаСлужебныйКлиент.НачатьИнициализациюФайловойСистемы(Оповещение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияКаталогаБиблиотеки

Процедура ИнициализироватьКаталогБиблиотекиSimpleПродолжить(РезультатИнициализацииФС, Контекст) Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("Путь");
	Результат.Вставить("Ошибка");
	
	Контекст.Вставить("Результат", Результат);
	
	Если ПустаяСтрока(РезультатИнициализацииФС.Ошибка) Тогда
		
		Контекст.Вставить("КаталогБиблиотеки", SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(
			РезультатИнициализацииФС.РабочийКаталогSimple, "lib", Контекст.ИмяБиблиотеки));
		
		Оповещение = Новый ОписаниеОповещения("ИнициализироватьКаталогБиблиотекиSimpleПослеПроверкиСуществования", 
			ЭтотОбъект, Контекст);
		 
		ФайлНаДиске = Новый Файл(Контекст.КаталогБиблиотеки);
		ФайлНаДиске.НачатьПроверкуСуществования(Оповещение);
		
	Иначе
		
		Контекст.Результат.Ошибка = РезультатИнициализацииФС.Ошибка;
		ВыполнитьОбработкуОповещения(Контекст.ОповещениеОЗавершении, Контекст.Результат);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ИнициализироватьКаталогБиблиотекиSimpleПослеПроверкиСуществования(Существует, Контекст) Экспорт
	
	Если Существует Тогда
		
		Контекст.Результат.Путь = Контекст.КаталогБиблиотеки;
		
		Если Контекст.Перезаписать И Не Контекст.Свойство("СозданКаталог") Тогда
			
			Контекст.Перезаписать = Ложь;
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ИнициализироватьКаталогБиблиотекиSimpleПослеПерезаписи", 
				ЭтотОбъект, Контекст);
			НачатьУдалениеФайлов(ОписаниеОповещения, Контекст.КаталогБиблиотеки);
			
		Иначе
			ВыполнитьОбработкуОповещения(Контекст.ОповещениеОЗавершении, Контекст.Результат);
		КонецЕсли;
		
	ИначеЕсли Не Контекст.Свойство("СозданКаталог") Тогда
		
		Оповещение = Новый ОписаниеОповещения("ИнициализироватьКаталогБиблиотекиSimpleПослеСоздания", ЭтотОбъект, Контекст);
		НачатьСозданиеКаталога(Оповещение, Контекст.КаталогБиблиотеки);
		
	Иначе
		
		Контекст.Результат.Ошибка = СтрШаблон(НСтр("ru = 'Не удалось инициализировать каталог библиотеки ""%1"".'"), 
			Контекст.ИмяБиблиотеки);
		
		ВыполнитьОбработкуОповещения(Контекст.ОповещениеОЗавершении, Контекст.Результат);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ИнициализироватьКаталогБиблиотекиSimpleПослеСоздания(ИмяКаталога, Контекст) Экспорт
	
	Контекст.Вставить("СозданКаталог");
	
	Оповещение = Новый ОписаниеОповещения("ИнициализироватьКаталогБиблиотекиSimpleПослеПроверкиСуществования", 
		ЭтотОбъект, Контекст);
	
	ФайлНаДиске = Новый Файл(Контекст.КаталогБиблиотеки);
	ФайлНаДиске.НачатьПроверкуСуществования(Оповещение);
	
КонецПроцедуры

Процедура ИнициализироватьКаталогБиблиотекиSimpleПослеПерезаписи(Контекст) Экспорт
	
	Оповещение = Новый ОписаниеОповещения("ИнициализироватьКаталогБиблиотекиSimpleПослеСоздания", ЭтотОбъект, Контекст);
	НачатьСозданиеКаталога(Оповещение, Контекст.КаталогБиблиотеки);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
