
#Область ПрограммныйИнтерфейс

Функция ВнешнееИмяРеквизита(ИмяОбъекта, ИмяРеквизита) Экспорт
	
	Если ВРег(ИмяОбъекта) = ВРег("Номенклатура") Тогда
		Возврат ВнешнееИмяРеквизита_Номенклатура(ИмяРеквизита);
	ИначеЕсли ВРег(ИмяОбъекта) = ВРег("ВидыЦен") Тогда
		Возврат ВнешнееИмяРеквизита_ВидыЦен(ИмяРеквизита);
	ИначеЕсли ВРег(ИмяОбъекта) = ВРег("ЕдиницыИзмерения") Тогда
		Возврат ВнешнееИмяРеквизита_ЕдиницыИзмерения(ИмяРеквизита);
	ИначеЕсли ВРег(ИмяОбъекта) = ВРег("УпаковкиНоменклатуры") Тогда
		Возврат ВнешнееИмяРеквизита_УпаковкиНоменклатуры(ИмяРеквизита);
	ИначеЕсли ВРег(ИмяОбъекта) = ВРег("Контрагенты") Тогда
		Возврат ВнешнееИмяРеквизита_Контрагенты(ИмяРеквизита);
	ИначеЕсли ВРег(ИмяОбъекта) = ВРег("СерииНоменклатуры") Тогда
		Возврат ВнешнееИмяРеквизита_СерииНоменклатуры(ИмяРеквизита);
	ИначеЕсли ВРег(ИмяОбъекта) = ВРег("ХарактеристикиНоменклатуры") Тогда
		Возврат ВнешнееИмяРеквизита_ХарактеристикиНоменклатуры(ИмяРеквизита);
	ИначеЕсли ВРег(ИмяОбъекта) = ВРег("ЦеныНоменклатуры") Тогда
		Возврат ВнешнееИмяРеквизита_ЦеныНоменклатуры(ИмяРеквизита);
	ИначеЕсли ВРег(ИмяОбъекта) = ВРег("ШтрихкодыНоменклатуры") Тогда
		Возврат ВнешнееИмяРеквизита_ШтрихкодыНоменклатуры(ИмяРеквизита);
	ИначеЕсли ВРег(ИмяОбъекта) = ВРег("ШтрихкодыУпаковокТоваров") Тогда
		Возврат ВнешнееИмяРеквизита_ШтрихкодыУпаковокТоваров(ИмяРеквизита);
	ИначеЕсли ВРег(ИмяОбъекта) = ВРег("Склады") Тогда
		Возврат ВнешнееИмяРеквизита_Склады(ИмяРеквизита);
	ИначеЕсли ВРег(ИмяОбъекта) = ВРег("СкладскиеЯчейки") Тогда
		Возврат ВнешнееИмяРеквизита_СкладскиеЯчейки(ИмяРеквизита);
	Иначе
		Возврат ИмяРеквизита;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьОписаниеНастройки(ИмяНастройки) Экспорт
	
	Если ВРег(ИмяНастройки) = ВРег("Номенклатура") Тогда
		Возврат СформироватьОписаниеНастройки_Номенклатура();
	ИначеЕсли ВРег(ИмяНастройки) = ВРег("ВидыЦен") Тогда
		Возврат СформироватьОписаниеНастройки_ВидыЦен();
	ИначеЕсли ВРег(ИмяНастройки) = ВРег("ЕдиницыИзмерения") Тогда
		Возврат СформироватьОписаниеНастройки_ЕдиницыИзмерения();
	ИначеЕсли ВРег(ИмяНастройки) = ВРег("УпаковкиНоменклатуры") Тогда
		Возврат СформироватьОписаниеНастройки_УпаковкиНоменклатуры();
	ИначеЕсли ВРег(ИмяНастройки) = ВРег("Контрагенты") Тогда
		Возврат СформироватьОписаниеНастройки_Контрагенты();
	ИначеЕсли ВРег(ИмяНастройки) = ВРег("СерииНоменклатуры") Тогда
		Возврат СформироватьОписаниеНастройки_СерииНоменклатуры();
	ИначеЕсли ВРег(ИмяНастройки) = ВРег("ХарактеристикиНоменклатуры") Тогда
		Возврат СформироватьОписаниеНастройки_ХарактеристикиНоменклатуры();
	ИначеЕсли ВРег(ИмяНастройки) = ВРег("ЦеныНоменклатуры") Тогда
		Возврат СформироватьОписаниеНастройки_ЦеныНоменклатуры();
	ИначеЕсли ВРег(ИмяНастройки) = ВРег("ШтрихкодыНоменклатуры") Тогда
		Возврат СформироватьОписаниеНастройки_ШтрихкодыНоменклатуры();
	ИначеЕсли ВРег(ИмяНастройки) = ВРег("ШтрихкодыУпаковокТоваров") Тогда
		Возврат СформироватьОписаниеНастройки_ШтрихкодыУпаковокТоваров();
	ИначеЕсли ВРег(ИмяНастройки) = ВРег("Склады") Тогда
		Возврат СформироватьОписаниеНастройки_Склады();
	ИначеЕсли ВРег(ИмяНастройки) = ВРег("СкладскиеЯчейки") Тогда
		Возврат СформироватьОписаниеНастройки_СкладскиеЯчейки();
	КонецЕсли;
	
КонецФункции

Функция ПолучитьОбязательныеРеквизиты(ИмяНастройки, ПолучитьСОписанием = Ложь) Экспорт
	
	Если ВРег(ИмяНастройки) = ВРег("Номенклатура") Тогда
		Возврат СформироватьОбязательныеРеквизиты_Номенклатура(ПолучитьСОписанием);
	ИначеЕсли ВРег(ИмяНастройки) = ВРег("ВидыЦен") Тогда
		Возврат СформироватьОбязательныеРеквизиты_ВидыЦен(ПолучитьСОписанием);
	ИначеЕсли ВРег(ИмяНастройки) = ВРег("ЕдиницыИзмерения") Тогда
		Возврат СформироватьОбязательныеРеквизиты_ЕдиницыИзмерения(ПолучитьСОписанием);
	ИначеЕсли ВРег(ИмяНастройки) = ВРег("УпаковкиНоменклатуры") Тогда
		Возврат СформироватьОбязательныеРеквизиты_УпаковкиНоменклатуры(ПолучитьСОписанием);
	ИначеЕсли ВРег(ИмяНастройки) = ВРег("Контрагенты") Тогда
		Возврат СформироватьОбязательныеРеквизиты_Контрагенты(ПолучитьСОписанием);
	ИначеЕсли ВРег(ИмяНастройки) = ВРег("СерииНоменклатуры") Тогда
		Возврат СформироватьОбязательныеРеквизиты_СерииНоменклатуры(ПолучитьСОписанием);
	ИначеЕсли ВРег(ИмяНастройки) = ВРег("ХарактеристикиНоменклатуры") Тогда
		Возврат СформироватьОбязательныеРеквизиты_ХарактеристикиНоменклатуры(ПолучитьСОписанием);
	ИначеЕсли ВРег(ИмяНастройки) = ВРег("ЦеныНоменклатуры") Тогда
		Возврат СформироватьОбязательныеРеквизиты_ЦеныНоменклатуры(ПолучитьСОписанием);
	ИначеЕсли ВРег(ИмяНастройки) = ВРег("ШтрихкодыНоменклатуры") Тогда
		Возврат СформироватьОбязательныеРеквизиты_ШтрихкодыНоменклатуры(ПолучитьСОписанием);
	ИначеЕсли ВРег(ИмяНастройки) = ВРег("ШтрихкодыУпаковокТоваров") Тогда
		Возврат СформироватьОбязательныеРеквизиты_ШтрихкодыУпаковокТоваров(ПолучитьСОписанием);
	ИначеЕсли ВРег(ИмяНастройки) = ВРег("Склады") Тогда
		Возврат СформироватьОбязательныеРеквизиты_Склады(ПолучитьСОписанием);
	ИначеЕсли ВРег(ИмяНастройки) = ВРег("СкладскиеЯчейки") Тогда
		Возврат СформироватьОбязательныеРеквизиты_СкладскиеЯчейки(ПолучитьСОписанием);
	КонецЕсли;
	
КонецФункции

Процедура ВставитьПользовательскоеПолеВыборкиЗапроса(СтруктураПолей, Заголовок, Поле = "", Выражение = "", Параметры = Неопределено) Экспорт
	
	СтруктураПоля = Новый Структура("Поле, Выражение");
	
	Если ЗначениеЗаполнено(Поле) Тогда
		СтруктураПоля.Поле = Поле;
	ИначеЕсли ЗначениеЗаполнено(Выражение) Тогда
		
		Если СтрНайти(Выражение, "&") > 0 Тогда
			
			Если ТипЗнч(Параметры) = Тип("Структура") И Параметры.Количество() > 0 Тогда
				СтруктураПоля.Выражение = Выражение;
				СтруктураПоля.Вставить("Параметры", Параметры);
			КонецЕсли;
			
		Иначе
			СтруктураПоля.Выражение = Выражение;
		КонецЕсли;

	КонецЕсли;

	Если Не ЗначениеЗаполнено(СтруктураПоля.Поле) И Не ЗначениеЗаполнено(СтруктураПоля.Выражение) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПолей.Вставить(Заголовок, СтруктураПоля);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ФормированиеВнешнегоИмениРеквизитов

Функция ВнешнееИмяРеквизита_Номенклатура(ИмяРеквизита)
	
	Если ВРег(ИмяРеквизита) = ВРег("Ссылка") Тогда
		Возврат "id";
	ИначеЕсли ВРег(ИмяРеквизита) = ВРег("Код") Тогда
		Возврат "code";
	ИначеЕсли ВРег(ИмяРеквизита) = ВРег("Наименование") Тогда
		Возврат "name";
	ИначеЕсли ВРег(ИмяРеквизита) = ВРег("Артикул") Тогда
		Возврат "art";
	ИначеЕсли ВРег(ИмяРеквизита) = ВРег("Единицаизмерения") Тогда
		Возврат "unit";
	ИначеЕсли ВРег(ИмяРеквизита) = ВРег("ВидНоменклатуры") Тогда
		Возврат "type_good";
	Иначе
		Возврат ИмяРеквизита;
	КонецЕсли;
	
КонецФункции

Функция ВнешнееИмяРеквизита_ВидыЦен(ИмяРеквизита)
	
	Если ВРег(ИмяРеквизита) = ВРег("Ссылка") Тогда
		Возврат "id";
	ИначеЕсли ВРег(ИмяРеквизита) = ВРег("Наименование") Тогда
		Возврат "name";
	Иначе
		Возврат ИмяРеквизита;
	КонецЕсли;
	
КонецФункции

Функция ВнешнееИмяРеквизита_ЕдиницыИзмерения(ИмяРеквизита)
	
	Если ВРег(ИмяРеквизита) = ВРег("Ссылка") Тогда
		Возврат "id";
	ИначеЕсли ВРег(ИмяРеквизита) = ВРег("Код") Тогда
		Возврат "code";
	ИначеЕсли ВРег(ИмяРеквизита) = ВРег("Наименование") Тогда
		Возврат "name";
	Иначе
		Возврат ИмяРеквизита;
	КонецЕсли;
	
КонецФункции

Функция ВнешнееИмяРеквизита_УпаковкиНоменклатуры(ИмяРеквизита)
	
	Если ВРег(ИмяРеквизита) = ВРег("Ссылка") Тогда
		Возврат "id";
	ИначеЕсли ВРег(ИмяРеквизита) = ВРег("Код") Тогда
		Возврат "code";
	ИначеЕсли ВРег(ИмяРеквизита) = ВРег("Наименование") Тогда
		Возврат "name";
	ИначеЕсли ВРег(ИмяРеквизита) = ВРег("МеждународноеСокращение") Тогда
		Возврат "int_reduction";
	ИначеЕсли ВРег(ИмяРеквизита) = ВРег("Числитель") Тогда
		Возврат "nominator";
	ИначеЕсли ВРег(ИмяРеквизита) = ВРег("Знаменатель") Тогда
		Возврат "denominator"; 
	ИначеЕсли ВРег(ИмяРеквизита) = ВРег("Владелец") Тогда
		Возврат "id_owner";
	Иначе
		Возврат ИмяРеквизита;
	КонецЕсли;
	
КонецФункции

Функция ВнешнееИмяРеквизита_Контрагенты(ИмяРеквизита)
	
	Если ВРег(ИмяРеквизита) = ВРег("Ссылка") Тогда
		Возврат "id";
	ИначеЕсли ВРег(ИмяРеквизита) = ВРег("Наименование") Тогда
		Возврат "name";
	ИначеЕсли ВРег(ИмяРеквизита) = ВРег("НаименованиеПолное") Тогда
		Возврат "full_name";
	ИначеЕсли ВРег(ИмяРеквизита) = ВРег("ИНН") Тогда
		Возврат "inn";
	ИначеЕсли ВРег(ИмяРеквизита) = ВРег("КПП") Тогда
		Возврат "kpp";
	Иначе
		Возврат ИмяРеквизита;
	КонецЕсли;
	
КонецФункции

Функция ВнешнееИмяРеквизита_СерииНоменклатуры(ИмяРеквизита)
	
	Если ВРег(ИмяРеквизита) = ВРег("Ссылка") Тогда
		Возврат "id";
	ИначеЕсли ВРег(ИмяРеквизита) = ВРег("Наименование") Тогда
		Возврат "name";
	ИначеЕсли ВРег(ИмяРеквизита) = ВРег("ДатаПроизводства") Тогда
		Возврат "production_date";
	ИначеЕсли ВРег(ИмяРеквизита) = ВРег("Номер") Тогда
		Возврат "number";
	ИначеЕсли ВРег(ИмяРеквизита) = ВРег("ВидНоменклатуры") Тогда
		Возврат "type_goods";
	Иначе
		Возврат ИмяРеквизита;
	КонецЕсли;
	
КонецФункции

Функция ВнешнееИмяРеквизита_ХарактеристикиНоменклатуры(ИмяРеквизита)
	
	Если ВРег(ИмяРеквизита) = ВРег("Ссылка") Тогда
		Возврат "id";
	ИначеЕсли ВРег(ИмяРеквизита) = ВРег("Наименование") Тогда
		Возврат "name";
	ИначеЕсли ВРег(ИмяРеквизита) = ВРег("Владелец") Тогда
		Возврат "id_owner";
	Иначе
		Возврат ИмяРеквизита;
	КонецЕсли;
	
КонецФункции

Функция ВнешнееИмяРеквизита_ЦеныНоменклатуры(ИмяРеквизита)
	
	Если ВРег(ИмяРеквизита) = ВРег("Номенклатура") Тогда
		Возврат "id_goods";
	ИначеЕсли ВРег(ИмяРеквизита) = ВРег("Характеристика") Тогда
		Возврат "id_properties";
	ИначеЕсли ВРег(ИмяРеквизита) = ВРег("ВидЦены") Тогда
		Возврат "id_price_types";
	ИначеЕсли ВРег(ИмяРеквизита) = ВРег("Цена") Тогда
		Возврат "price";
	ИначеЕсли ВРег(ИмяРеквизита) = ВРег("Упаковка") Тогда
		Возврат "id_unit";
	Иначе
		Возврат ИмяРеквизита;
	КонецЕсли;
	
КонецФункции

Функция ВнешнееИмяРеквизита_ШтрихкодыНоменклатуры(ИмяРеквизита)
	
	Если ВРег(ИмяРеквизита) = ВРег("Номенклатура") Тогда
		Возврат "id_good";
	ИначеЕсли ВРег(ИмяРеквизита) = ВРег("Характеристика") Тогда
		Возврат "id_property";
	ИначеЕсли ВРег(ИмяРеквизита) = ВРег("Штрихкод") Тогда
		Возврат "barcode";
	ИначеЕсли ВРег(ИмяРеквизита) = ВРег("Упаковка") Тогда
		Возврат "id_unit";
	ИначеЕсли ВРег(ИмяРеквизита) = ВРег("Серия") Тогда
		Возврат "id_series";
	ИначеЕсли ВРег(ИмяРеквизита) = ВРег("ЧислительУпаковки") Тогда
		Возврат "ratio";
	Иначе
		Возврат ИмяРеквизита;
	КонецЕсли;
	
КонецФункции

Функция ВнешнееИмяРеквизита_ШтрихкодыУпаковокТоваров(ИмяРеквизита)
	
	Если ВРег(ИмяРеквизита) = ВРег("Ссылка") Тогда
		Возврат "id";
	ИначеЕсли ВРег(ИмяРеквизита) = ВРег("Номенклатура") Тогда
		Возврат "id_good";
	ИначеЕсли ВРег(ИмяРеквизита) = ВРег("Характеристика") Тогда
		Возврат "id_property";
	ИначеЕсли ВРег(ИмяРеквизита) = ВРег("Серия") Тогда
		Возврат "id_series";
	ИначеЕсли ВРег(ИмяРеквизита) = ВРег("ЗначениеШтрихкода") Тогда
		Возврат "mark_code";
	ИначеЕсли ВРег(ИмяРеквизита) = ВРег("Упаковка") Тогда
		Возврат "id_unit";
	Иначе
		Возврат ИмяРеквизита;
	КонецЕсли;
	
КонецФункции

Функция ВнешнееИмяРеквизита_Склады(ИмяРеквизита)
	
	Если ВРег(ИмяРеквизита) = ВРег("Ссылка") Тогда
		Возврат "id";
	ИначеЕсли ВРег(ИмяРеквизита) = ВРег("Наименование") Тогда
		Возврат "name";
	Иначе
		Возврат ИмяРеквизита;
	КонецЕсли;
	
КонецФункции

Функция ВнешнееИмяРеквизита_СкладскиеЯчейки(ИмяРеквизита)

	Если ВРег(ИмяРеквизита) = ВРег("Ссылка") Тогда
		Возврат "id";
	ИначеЕсли ВРег(ИмяРеквизита) = ВРег("Код") Тогда
		Возврат "barcode";
	ИначеЕсли ВРег(ИмяРеквизита) = ВРег("Наименование") Тогда
		Возврат "name";
	Иначе
		Возврат ИмяРеквизита;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ОбязательныеРеквизиты

Процедура ДобавитьОбязательныйРеквизитВКоллекцию(Коллекция, ИмяРеквизита, ОписаниеРеквизита = Неопределено)
	
	ТипКоллекции = ТипЗнч(Коллекция);
	
	Если ТипКоллекции = Тип("Массив") Или ТипКоллекции = Тип("СписокЗначений") Тогда
		Коллекция.Добавить(ИмяРеквизита);
	ИначеЕсли ТипКоллекции = Тип("Структура") Или ТипКоллекции = Тип("Соответствие") Тогда
		//@skip-check wrong-type-expression
		Коллекция.Вставить(ИмяРеквизита, ОписаниеРеквизита);
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьОбязательныеРеквизиты_Номенклатура(ПолучитьСОписанием)
	
	ИмяОбъекта = "Номенклатура";
	
	Если ПолучитьСОписанием Тогда
		ОбязательныеРеквизиты = Новый Соответствие();
	Иначе
		ОбязательныеРеквизиты = Новый Массив();
	КонецЕсли;
	
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "Ссылка"), 
		НСтр("ru = 'Ссылка номенклатуры'"));
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "Код"), 
		НСтр("ru = 'Реквизит ""Код"" номенклатуры'"));
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "Наименование"), 
		НСтр("ru = 'Реквизит ""Наименование"" номенклатуры'"));
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "Артикул"), 
		НСтр("ru = 'Реквизит ""Артикул"" номенклатуры'"));
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "ЕдиницаИзмерения"), 
		НСтр("ru = 'Реквизит ""Единица измерения"" номенклатуры'"));
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "ВидНоменклатуры"), 
		НСтр("ru = 'Реквизит ""Вид номенклатуры"" номенклатуры'"));
		
	Возврат ОбязательныеРеквизиты;
	
КонецФункции

Функция СформироватьОбязательныеРеквизиты_ВидыЦен(ПолучитьСОписанием)
	
	ИмяОбъекта = "ВидыЦен";
	
	Если ПолучитьСОписанием Тогда
		ОбязательныеРеквизиты = Новый Соответствие();
	Иначе
		ОбязательныеРеквизиты = Новый Массив();
	КонецЕсли;
	
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "Ссылка"), 
		НСтр("ru = 'Ссылка вида цен'"));
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "Наименование"), 
		НСтр("ru = 'Реквизит ""Наименование"" вида цен'"));
	
	Возврат ОбязательныеРеквизиты;
	
КонецФункции

Функция СформироватьОбязательныеРеквизиты_ЕдиницыИзмерения(ПолучитьСОписанием)
	
	ИмяОбъекта = "ЕдиницыИзмерения";
	
	Если ПолучитьСОписанием Тогда
		ОбязательныеРеквизиты = Новый Соответствие();
	Иначе
		ОбязательныеРеквизиты = Новый Массив();
	КонецЕсли;
	
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "Ссылка"), 
		НСтр("ru = 'Ссылка единицы измерения'"));
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "Код"), 
		НСтр("ru = 'Реквизит ""Код"" единицы измерения'"));
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "Наименование"), 
		НСтр("ru = 'Реквизит ""Наименование"" единицы измерения'"));
	
	Возврат ОбязательныеРеквизиты;
	
КонецФункции

Функция СформироватьОбязательныеРеквизиты_УпаковкиНоменклатуры(ПолучитьСОписанием)
	
	ИмяОбъекта = "УпаковкиНоменклатуры";
	
	Если ПолучитьСОписанием Тогда
		ОбязательныеРеквизиты = Новый Соответствие();
	Иначе
		ОбязательныеРеквизиты = Новый Массив();
	КонецЕсли;
	
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "Ссылка"), 
		НСтр("ru = 'Ссылка упаковки номенклатуры'"));
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "Код"), 
		НСтр("ru = 'Реквизит ""Код"" упаковки номенклатуры'"));
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "Наименование"), 
		НСтр("ru = 'Реквизит ""Наименование"" упаковки номенклатуры'"));
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "МеждународноеСокращение"), 
		НСтр("ru = 'Реквизит ""Международное сокращение"" упаковки номенклатуры'"));
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "Числитель"), 
		НСтр("ru = 'Реквизит ""Числитель"" упаковки номенклатуры'"));
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "Знаменатель"), 
		НСтр("ru = 'Реквизит ""Знаменатель"" упаковки номенклатуры'"));
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "Владелец"), 
		НСтр("ru = 'Реквизит ""Владелец"" упаковки номенклатуры'"));
		
	Возврат ОбязательныеРеквизиты;
	
КонецФункции

Функция СформироватьОбязательныеРеквизиты_Контрагенты(ПолучитьСОписанием)
	
	ИмяОбъекта = "Контрагенты";
	
	Если ПолучитьСОписанием Тогда
		ОбязательныеРеквизиты = Новый Соответствие();
	Иначе
		ОбязательныеРеквизиты = Новый Массив();
	КонецЕсли;
	
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "Ссылка"), 
		НСтр("ru = 'Ссылка контрагента'"));
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "Наименование"), 
		НСтр("ru = 'Реквизит ""Наименование"" контрагента'"));
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "НаименованиеПолное"), 
		НСтр("ru = 'Реквизит ""Наименование полное"" контрагента'"));
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "ИНН"), 
		НСтр("ru = 'Реквизит ""ИНН"" контрагента'"));
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "КПП"), 
		НСтр("ru = 'Реквизит ""КПП"" контрагента'"));
	
	Возврат ОбязательныеРеквизиты;
	
КонецФункции

Функция СформироватьОбязательныеРеквизиты_СерииНоменклатуры(ПолучитьСОписанием)
	
	ИмяОбъекта = "СерииНоменклатуры";
	
	Если ПолучитьСОписанием Тогда
		ОбязательныеРеквизиты = Новый Соответствие();
	Иначе
		ОбязательныеРеквизиты = Новый Массив();
	КонецЕсли;
	
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "Ссылка"), 
		НСтр("ru = 'Ссылка серии номенклатуры'"));
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "Наименование"), 
		НСтр("ru = 'Реквизит ""Наименование"" серии номенклатуры'"));
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "ДатаПроизводства"), 
		НСтр("ru = 'Реквизит ""Дата производства"" серии номенклатуры'"));
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "Номер"), 
		НСтр("ru = 'Реквизит ""Номер"" серии номенклатуры'"));
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "ВидНоменклатуры"), 
		НСтр("ru = 'Реквизит ""Вид номенклатуры"" серии номенклатуры'"));
	
	Возврат ОбязательныеРеквизиты;
	
КонецФункции

Функция СформироватьОбязательныеРеквизиты_ХарактеристикиНоменклатуры(ПолучитьСОписанием)
	
	ИмяОбъекта = "ХарактеристикиНоменклатуры";
	
	Если ПолучитьСОписанием Тогда
		ОбязательныеРеквизиты = Новый Соответствие();
	Иначе
		ОбязательныеРеквизиты = Новый Массив();
	КонецЕсли;
	
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "Ссылка"), 
		НСтр("ru = 'Ссылка характеристики номенклатуры'"));
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "Наименование"), 
		НСтр("ru = 'Реквизит ""Наименование"" характеристики номенклатуры'"));
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "Владелец"), 
		НСтр("ru = 'Реквизит ""Владелец"" характеристики номенклатуры'"));
	
	Возврат ОбязательныеРеквизиты;
	
КонецФункции

Функция СформироватьОбязательныеРеквизиты_ЦеныНоменклатуры(ПолучитьСОписанием)
	
	ИмяОбъекта = "ЦеныНоменклатуры";
	
	Если ПолучитьСОписанием Тогда
		ОбязательныеРеквизиты = Новый Соответствие();
	Иначе
		ОбязательныеРеквизиты = Новый Массив();
	КонецЕсли;
	
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "Номенклатура"), 
		НСтр("ru = 'Ссылка номенклатуры'"));
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "Характеристика"), 
		НСтр("ru = 'Ссылка характеристики'"));
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "Упаковка"), 
		НСтр("ru = 'Ссылка упаковки'"));
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "ВидЦены"), 
		НСтр("ru = 'Ссылка вида цен'"));
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "Цена"), 
		НСтр("ru = 'Реквизит ""Цена""'"));
	
	Возврат ОбязательныеРеквизиты;
	
КонецФункции

Функция СформироватьОбязательныеРеквизиты_ШтрихкодыНоменклатуры(ПолучитьСОписанием)
	
	ИмяОбъекта = "ШтрихкодыНоменклатуры";
	
	Если ПолучитьСОписанием Тогда
		ОбязательныеРеквизиты = Новый Соответствие();
	Иначе
		ОбязательныеРеквизиты = Новый Массив();
	КонецЕсли;
	
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "Номенклатура"), 
		НСтр("ru = 'Ссылка номенклатуры'"));
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "Характеристика"), 
		НСтр("ru = 'Ссылка характеристики'"));
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "Упаковка"), 
		НСтр("ru = 'Ссылка упаковки'"));
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "Серия"), 
		НСтр("ru = 'Ссылка серии'"));
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "Штрихкод"), 
		НСтр("ru = 'Реквизит ""Штрихкод""'"));
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "ЧислительУпаковки"), 
		НСтр("ru = 'Реквизит ""Коэффициент упаковки""'"));
		
	Возврат ОбязательныеРеквизиты;
	
КонецФункции

Функция СформироватьОбязательныеРеквизиты_ШтрихкодыУпаковокТоваров(ПолучитьСОписанием)
	
	ИмяОбъекта = "ШтрихкодыУпаковокТоваров";
	
	Если ПолучитьСОписанием Тогда
		ОбязательныеРеквизиты = Новый Соответствие();
	Иначе
		ОбязательныеРеквизиты = Новый Массив();
	КонецЕсли;
	
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "Ссылка"), 
		НСтр("ru = 'Ссылка штрихкода упаковки товара'"));
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "Номенклатура"), 
		НСтр("ru = 'Реквизит ссылка ""Номенклатура"" штрихкода упаковки товара'"));
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "Характеристика"), 
		НСтр("ru = 'Реквизит ссылка ""Характеристика"" штрихкода упаковки товара'"));
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "Серия"), 
		НСтр("ru = 'Реквизит ссылка ""Серия"" штрихкода упаковки товара'"));
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "Упаковка"), 
		НСтр("ru = 'Реквизит ссылка ""Упаковка"" штрихкода упаковки товара'"));
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "ЗначениеШтрихкода"), 
		НСтр("ru = 'Реквизит ""Значение штрихкода"" штрихкода упаковки товара'"));
	
	Возврат ОбязательныеРеквизиты;
	
КонецФункции

Функция СформироватьОбязательныеРеквизиты_Склады(ПолучитьСОписанием)
	
	ИмяОбъекта = "Склады";
	
	Если ПолучитьСОписанием Тогда
		ОбязательныеРеквизиты = Новый Соответствие();
	Иначе
		ОбязательныеРеквизиты = Новый Массив();
	КонецЕсли;
	
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "Ссылка"), 
		НСтр("ru = 'Ссылка склада'"));
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "Наименование"), 
		НСтр("ru = 'Реквизит ""Наименование"" склада'"));
	
	Возврат ОбязательныеРеквизиты;
	
КонецФункции

Функция СформироватьОбязательныеРеквизиты_СкладскиеЯчейки(ПолучитьСОписанием)
	
	ИмяОбъекта = "СкладскиеЯчейки";
	
	Если ПолучитьСОписанием Тогда
		ОбязательныеРеквизиты = Новый Соответствие();
	Иначе
		ОбязательныеРеквизиты = Новый Массив();
	КонецЕсли;
	
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "Ссылка"), 
		НСтр("ru = 'Ссылка складской ячейки'"));
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "Код"), 
		НСтр("ru = 'Реквизит ""Код"" складской ячейки'"));
	ДобавитьОбязательныйРеквизитВКоллекцию(ОбязательныеРеквизиты, ВнешнееИмяРеквизита(ИмяОбъекта, "Наименование"), 
		НСтр("ru = 'Реквизит ""Наименование"" складской ячейки'"));
	
	Возврат ОбязательныеРеквизиты;
	
КонецФункции

#КонецОбласти

#Область ОписаниеНастройки

Функция ПолучитьПустуюСтрукутуруОписанияНастройки()
	
	СтруктураОписанияНастройки = Новый Структура();
	
	СтруктураОписанияНастройки.Вставить("Описание");
	СтруктураОписанияНастройки.Вставить("ОписаниеРеквизитов", Новый Соответствие());
	
	Возврат СтруктураОписанияНастройки;
	
КонецФункции

Функция СформироватьОписаниеНастройки_Номенклатура()
	
	ОписаниеНастройки = ПолучитьПустуюСтрукутуруОписанияНастройки();
	
	ОписаниеНастройки.Описание = НСтр("ru = 'Настройка сопоставления метаданных объекта ""Номенклатуры""'");
	ОписаниеНастройки.ОписаниеРеквизитов = ПолучитьОбязательныеРеквизиты("Номенклатура", Истина);
	
	Возврат ОписаниеНастройки;
	
КонецФункции

Функция СформироватьОписаниеНастройки_ВидыЦен()
	
	ОписаниеНастройки = ПолучитьПустуюСтрукутуруОписанияНастройки();
	
	ОписаниеНастройки.Описание = НСтр("ru = 'Настройка сопоставления метаданных объекта ""Виды цен""'");
	ОписаниеНастройки.ОписаниеРеквизитов = ПолучитьОбязательныеРеквизиты("ВидыЦен", Истина);
	
	Возврат ОписаниеНастройки;
	
КонецФункции

Функция СформироватьОписаниеНастройки_ЕдиницыИзмерения()
	
	ОписаниеНастройки = ПолучитьПустуюСтрукутуруОписанияНастройки();
	
	ОписаниеНастройки.Описание = НСтр("ru = 'Настройка сопоставления метаданных объекта ""Единицы измерения""'");
	ОписаниеНастройки.ОписаниеРеквизитов = ПолучитьОбязательныеРеквизиты("ЕдиницыИзмерения", Истина);
	
	Возврат ОписаниеНастройки;
	
КонецФункции

Функция СформироватьОписаниеНастройки_УпаковкиНоменклатуры()
	
	ОписаниеНастройки = ПолучитьПустуюСтрукутуруОписанияНастройки();
	
	ОписаниеНастройки.Описание = НСтр("ru = 'Настройка сопоставления метаданных объекта ""Упаковки номенклатуры""'");
	ОписаниеНастройки.ОписаниеРеквизитов = ПолучитьОбязательныеРеквизиты("УпаковкиНоменклатуры", Истина);
	
	Возврат ОписаниеНастройки;
	
КонецФункции

Функция СформироватьОписаниеНастройки_Контрагенты()
	
	ОписаниеНастройки = ПолучитьПустуюСтрукутуруОписанияНастройки();
	
	ОписаниеНастройки.Описание = НСтр("ru = 'Настройка сопоставления метаданных объекта ""Контрагенты""'");
	ОписаниеНастройки.ОписаниеРеквизитов = ПолучитьОбязательныеРеквизиты("Контрагенты", Истина);
	
	Возврат ОписаниеНастройки;
	
КонецФункции

Функция СформироватьОписаниеНастройки_СерииНоменклатуры()
	
	ОписаниеНастройки = ПолучитьПустуюСтрукутуруОписанияНастройки();
	
	ОписаниеНастройки.Описание = НСтр("ru = 'Настройка сопоставления метаданных объекта ""Серии номенклатуры""'");
	ОписаниеНастройки.ОписаниеРеквизитов = ПолучитьОбязательныеРеквизиты("СерииНоменклатуры", Истина);
	
	Возврат ОписаниеНастройки;
	
КонецФункции

Функция СформироватьОписаниеНастройки_ХарактеристикиНоменклатуры()
	
	ОписаниеНастройки = ПолучитьПустуюСтрукутуруОписанияНастройки();
	
	ОписаниеНастройки.Описание = НСтр("ru = 'Настройка сопоставления метаданных объекта ""Характеристики номенклатуры""'");
	ОписаниеНастройки.ОписаниеРеквизитов = ПолучитьОбязательныеРеквизиты("ХарактеристикиНоменклатуры", Истина);
	
	Возврат ОписаниеНастройки;
	
КонецФункции

Функция СформироватьОписаниеНастройки_ЦеныНоменклатуры()
	
	ОписаниеНастройки = ПолучитьПустуюСтрукутуруОписанияНастройки();
	
	ОписаниеНастройки.Описание = НСтр("ru = 'Настройка сопоставления метаданных объекта ""Цены номенклатуры""'");
	ОписаниеНастройки.ОписаниеРеквизитов = ПолучитьОбязательныеРеквизиты("ЦеныНоменклатуры", Истина);
	
	Возврат ОписаниеНастройки;
	
КонецФункции

Функция СформироватьОписаниеНастройки_ШтрихкодыНоменклатуры()
	
	ОписаниеНастройки = ПолучитьПустуюСтрукутуруОписанияНастройки();
	
	ОписаниеНастройки.Описание = НСтр("ru = 'Настройка сопоставления метаданных объекта ""Штрихкоды номенклатуры""'");
	ОписаниеНастройки.ОписаниеРеквизитов = ПолучитьОбязательныеРеквизиты("ШтрихкодыНоменклатуры", Истина);
	
	Возврат ОписаниеНастройки;
	
КонецФункции

Функция СформироватьОписаниеНастройки_ШтрихкодыУпаковокТоваров()
	
	ОписаниеНастройки = ПолучитьПустуюСтрукутуруОписанияНастройки();
	
	ОписаниеНастройки.Описание = НСтр("ru = 'Настройка сопоставления метаданных объекта ""Штрихкоды упаковок товаров""'");
	ОписаниеНастройки.ОписаниеРеквизитов = ПолучитьОбязательныеРеквизиты("ШтрихкодыУпаковокТоваров", Истина);
	
	Возврат ОписаниеНастройки;
	
КонецФункции

Функция СформироватьОписаниеНастройки_Склады()
	
	ОписаниеНастройки = ПолучитьПустуюСтрукутуруОписанияНастройки();
	
	ОписаниеНастройки.Описание = НСтр("ru = 'Настройка сопоставления метаданных объекта ""Склады""'");
	ОписаниеНастройки.ОписаниеРеквизитов = ПолучитьОбязательныеРеквизиты("Склады", Истина);
	
	Возврат ОписаниеНастройки;
	
КонецФункции

Функция СформироватьОписаниеНастройки_СкладскиеЯчейки()
	
	ОписаниеНастройки = ПолучитьПустуюСтрукутуруОписанияНастройки();
	
	ОписаниеНастройки.Описание = НСтр("ru = 'Настройка сопоставления метаданных объекта ""Складские ячейки""'");
	ОписаниеНастройки.ОписаниеРеквизитов = ПолучитьОбязательныеРеквизиты("СкладскиеЯчейки", Истина);
	
	Возврат ОписаниеНастройки;
	
КонецФункции

#КонецОбласти

#КонецОбласти
