
#Область ОписаниеПеременных

&НаКлиенте
Перем ДанныеПакетаСообщенияМодифицированы;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Запись.ВидДанных = Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.JSON Тогда
		Элементы.Сворачивать.ТолькоПросмотр = Истина;
	ИначеЕсли Запись.ВидДанных = Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.Значение Тогда
		Элементы.ФормаРазрешитьРедактирование.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ДанныеПакетаСообщенияМодифицированы = Ложь;
	
	НачатьСборкуПакетовСообщения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Отказ Или ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если Окно.Содержимое.Количество() > 1 Тогда
		Окно.Содержимое[Окно.Содержимое.ВГраница()].Закрыть();
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Запись.Отправитель = Запись.Получатель Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Отправитель не может быть равен получателю'"), , 
			"Отправитель", , Отказ);
	КонецЕсли;
	
	Если Запись.ВидДанных = Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.JSON Тогда
		
		Если ПакетыСообщения.Количество() <> 1 Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Вид сообщений %1 должен содержать только один пакет данных.'"), , , , Отказ);
		ИначеЕсли ПустаяСтрока(ПакетыСообщения[0].Значение) Или 
			ПакетыСообщения[0].Значение = "{}" Или
			ПакетыСообщения[0].Значение = "[]" Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Пустое сообщение'"), , , , Отказ);
		ИначеЕсли Запись.ВидДанных = Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.JSON Тогда
			
			Попытка
				Результат = SUI_СообщенияОбменаДанными.ДанныеСообщенияИзJSON(ПакетыСообщения[0].Значение);
				Если Результат = Неопределено Тогда 
					ВызватьИсключение НСтр("ru = 'Синтетический тест'");
				КонецЕсли;
			Исключение
				ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Данные сообщения JSON невалидны'"), , , , Отказ);
			КонецПопытки;
			
		КонецЕсли;
		
		Если Запись.Сворачивать Тогда
			ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон(НСтр("ru = 'Сообщения %1 не могут сворачиваться'"), Запись.ВидДанных), , "Сворачивать", , Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ПараметрыЗаписи.Вставить("ДанныеПакетаСообщенияМодифицированы", ДанныеПакетаСообщенияМодифицированы);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.ДанныеПакетаСообщенияМодифицированы И
		Запись.ВидДанных = Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.JSON Тогда
		ТекущийОбъект.Данные = Новый ХранилищеЗначения(ПакетыСообщения[0].Значение, Новый СжатиеДанных(9));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ДанныеПакетаСообщенияМодифицированы = Ложь;
	Модифицированность = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РазрешитьРедактирование(Команда)
	
	Элементы.ФормаРазрешитьРедактирование.Пометка = Не Элементы.ФормаРазрешитьРедактирование.Пометка;
	
	Элементы.Получатель.ТолькоПросмотр = Не Элементы.ФормаРазрешитьРедактирование.Пометка;
	Элементы.Отправитель.ТолькоПросмотр = Не Элементы.ФормаРазрешитьРедактирование.Пометка;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказатьДанные(Команда)
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("Заголовок", НСтр("ru = 'Данные сообщения обмена'"));
	ПараметрыОткрытия.Вставить("СохранятьРезультат", Элементы.ФормаРазрешитьРедактирование.Пометка);
	ПараметрыОткрытия.Вставить("РежимПросмотраПриОткрытии", Не Элементы.ФормаРазрешитьРедактирование.Пометка);
	ПараметрыОткрытия.Вставить("СтрокиJSON", ПакетыСообщения);
	
	Оповещение = Новый ОписаниеОповещения("ОткрытьРедакторJSONЗавершение", ЭтотОбъект);
	
	#Если ВебКлиент Тогда
		ОткрытьФорму("Обработка.SUI_РедакторJSON.Форма", ПараметрыОткрытия, ЭтотОбъект, УникальныйИдентификатор, , , 
			Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	#Иначе
		ОткрытьФорму("Обработка.SUI_РедакторJSON.Форма", ПараметрыОткрытия, ЭтотОбъект, УникальныйИдентификатор, Окно, , 
			Оповещение);
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НачатьСборкуПакетовСообщения()
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("НачатьСборкуПакетовСообщенияЗавершение", ЭтотОбъект);

	Результат = НачатьСборкуПакетовСобщенияНаСервере();
	
	Если Результат.Свойство("ДлительнаяОперация") Тогда
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.Заголовок = НСтр("ru = 'Сборка пакетов данных сообщения обмена'");
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(Результат.ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
		
	ИначеЕсли ЗначениеЗаполнено(Результат) Тогда
		ВыполнитьОбработкуОповещения(ОповещениеОЗавершении, Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НачатьСборкуПакетовСобщенияНаСервере()
	
	Результат = Новый Структура();
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	SUI_СообщенияОбменаДанными.Данные
		|ИЗ
		|	РегистрСведений.SUI_СообщенияОбменаДанными КАК SUI_СообщенияОбменаДанными
		|ГДЕ
		|	SUI_СообщенияОбменаДанными.ID = &ID
		|	И SUI_СообщенияОбменаДанными.Отправитель = &Отправитель
		|	И SUI_СообщенияОбменаДанными.Получатель = &Получатель";
	
	Запрос.УстановитьПараметр("ID", Запись.ID);
	Запрос.УстановитьПараметр("Отправитель", Запись.Отправитель);
	Запрос.УстановитьПараметр("Получатель", Запись.Получатель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
	
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Данные = Выборка.Данные.Получить();
		
		Если Запись.ВидДанных = Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.JSON Тогда
			
			Данные = SUI_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Данные);
			
			Результат.Вставить("Статус", "Выполнено");
			Результат.Вставить("АдресРезультата", ПоместитьВоВременноеХранилище(Данные, УникальныйИдентификатор));
			
		Иначе
			
			Если SUI_СообщенияОбменаДанными.ЭтоСообщениеОперации(Данные) Тогда
				
				Данные = SUI_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
					SUI_СообщенияОбменаДанными.ПредставлениеСодержимогоСообщенияОперации(Данные));
			
				Результат.Вставить("Статус", "Выполнено");
				Результат.Вставить("АдресРезультата", ПоместитьВоВременноеХранилище(Данные, УникальныйИдентификатор));
				
			Иначе
				
				ПараметрыСборки = SUI_ПакетыДанных.ПараметрыСборкиСообщенийПакетаДанныхИзКоллекции(Данные);
				ЗаполнитьЗначенияСвойств(ПараметрыСборки, Запись);
				ПараметрыСборки.ВидДанных = Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.JSON;
				
				ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне("SUI_ПакетыДанных.СобратьСообщениеПакетаДанныхИзКоллекции",
					ПараметрыСборки, 
					ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор));
				
				Результат.Вставить("ДлительнаяОперация", ДлительнаяОперация);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура НачатьСборкуПакетовСообщенияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Свойство("КраткоеПредставлениеОшибки") И ЗначениеЗаполнено(Результат.КраткоеПредставлениеОшибки) Тогда
		ПоказатьПредупреждение(, Результат.КраткоеПредставлениеОшибки);
		Если Результат.Свойство("ПодробноеПредставлениеОшибки") И ЗначениеЗаполнено(Результат.ПодробноеПредставлениеОшибки) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
		КонецЕсли;
	КонецЕсли;
	
	Если Результат.Свойство("Сообщения") И ЗначениеЗаполнено(Результат.Сообщения) Тогда
		
		Для Каждого Сообщение Из Результат.Сообщения Цикл
			Сообщение.Сообщить();
		КонецЦикла;
		
	КонецЕсли;
	
	ПакетыСообщения.Очистить();
	
	Если Результат.Статус = "Выполнено" Тогда
		
		ОписаниеТипаМассив = Новый ОписаниеТипов("Массив");
		ПакетыРезультат = ОписаниеТипаМассив.ПривестиЗначение(ПолучитьИзВременногоХранилища(Результат.АдресРезультата));
		
		Для индекс = 0 По ПакетыРезультат.ВГраница() Цикл
			ПакетыСообщения.Добавить(ПакетыРезультат[индекс], СтрШаблон(НСтр("ru = 'Пакет %1'"), Формат(индекс, "ЧГ=0;")));
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРедакторJSONЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		ПакетыСообщения.Очистить();
		Для Каждого СтрокаJSONРезультат Из Результат Цикл
			ПакетыСообщения.Добавить(СтрокаJSONРезультат.Значение, СтрокаJSONРезультат.Представление);
		КонецЦикла;
		
		ДанныеПакетаСообщенияМодифицированы = Истина;
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
