
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Запись.ВидДанных = Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.Значение И 
		Не Запись.Получатель = ПланыОбмена.SUI_МобильныеУстройства.ЭтотУзел() Тогда
		Элементы.ФормаРазрешитьРедактирование.Видимость = Ложь;
	КонецЕсли;
	
	Если Запись.Получатель = ПланыОбмена.SUI_МобильныеУстройства.ЭтотУзел() Или
		Запись.ВидДанных = Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.JSON Тогда
		Элементы.Сворачивать.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запись.Обработано) Тогда
		
		Элементы.Страницы.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
		
		Запрос = Новый Запрос();
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	СообщенияОбменаДанными.СообщенияОбработки
			|ИЗ
			|	РегистрСведений.SUI_СообщенияОбменаДанными КАК СообщенияОбменаДанными
			|ГДЕ
			|	СообщенияОбменаДанными.ID = &ID
			|	И СообщенияОбменаДанными.Отправитель = &Отправитель
			|	И СообщенияОбменаДанными.Получатель = &Получатель";
		
		Запрос.УстановитьПараметр("ID", Запись.ID);
		Запрос.УстановитьПараметр("Отправитель", Запись.Отправитель);
		Запрос.УстановитьПараметр("Получатель", Запись.Получатель);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			СообщенияОбработки = Выборка.СообщенияОбработки.Получить();
			
		КонецЕсли;
		
		ОписаниеТипаМассив = Новый ОписаниеТипов("ФиксированныйМассив");
		СообщенияОбработки = ОписаниеТипаМассив.ПривестиЗначение(СообщенияОбработки);
		
		Если СообщенияОбработки.Количество() = 0 Тогда
			Элементы.ПредставлениеСообщенийОбработки.Заголовок = НСтр("ru = 'Сообщения пользователю отсутствуют'");
			Элементы.ПредставлениеСообщенийОбработки.Гиперссылка = Ложь;
		Иначе
			Элементы.ПредставлениеСообщенийОбработки.Заголовок = СтрШаблон(
				Элементы.ПредставлениеСообщенийОбработки.Заголовок, СообщенияОбработки.Количество());
		КонецЕсли;
		
		Если ПустаяСтрока(Запись.ОшибкаОбработки) Тогда
			Элементы.ПредставлениеОшибкиОбработки.Заголовок = НСтр("ru = 'Ошибки отсутствуют'");
			Элементы.ПредставлениеОшибкиОбработки.Гиперссылка = Ложь;
		Иначе
			Элементы.СтраницаРезультатОбработки.Картинка = БиблиотекаКартинок.SUI_Остановить;
			Элементы.ПредставлениеОшибкиОбработки.ЦветТекста = WebЦвета.Красный;
		КонецЕсли;
		
	Иначе
		Элементы.Страницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РазрешитьРедактированиеПриИзменении();
	
	НачатьСборкуПакетовСообщения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Отказ Или ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если Окно.Содержимое.Количество() > 1 Тогда
		Окно.Содержимое[Окно.Содержимое.ВГраница()].Закрыть();
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Запись.Отправитель = Запись.Получатель Тогда
		SUI_ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Отправитель не может быть равен получателю'"), , 
			"Отправитель", , Отказ);
	ИначеЕсли ДанныеПакетаСообщенияМодифицированы Тогда
		
		Если ПакетыСообщения.Количество() <> 1 Тогда
			
			ТекстСообщения = НСтр("ru = 'Сообщение не может содержать более 1 пакета.'");
			SUI_ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
			
		ИначеЕсли Запись.Сворачивать И
			(Запись.ВидДанных = Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.JSON Или
			(Запись.Получатель = ПланыОбмена.SUI_МобильныеУстройства.ЭтотУзел() И
			Запись.ВидДанных = Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.Значение)) Тогда
			
			ТекстСообщения = НСтр("ru = 'Сообщения не могут сворачиваться.'");
			SUI_ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Сворачивать", , Отказ);
			
		ИначеЕсли Запись.ВидДанных = Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.JSON Или
			(Запись.Получатель = ПланыОбмена.SUI_МобильныеУстройства.ЭтотУзел() И
			Запись.ВидДанных = Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.Значение) Тогда
			
			Попытка
				
				Если Запись.ВидДанных = Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.JSON Тогда
					РезультатЧтения = SUI_СообщенияОбменаДанными.ДанныеСообщенияИзJSON(ПакетыСообщения[0].Значение);
				Иначе
					РезультатЧтения = SUI_ОбщегоНазначения.ЗначениеИзСтрокиXML(ПакетыСообщения[0].Значение);
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(РезультатЧтения) Тогда
					
					ТекстСообщения = НСтр("ru = 'Отсутствуют данные сообщения!'");
					SUI_ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
					
				КонецЕсли;
				
			Исключение
				Ошибка = ИнформацияОбОшибке();
				ТекстСообщения = НСтр("ru = 'Данные сообщения содержат ошибки!
				|%1'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.КраткоеПредставлениеОшибки(Ошибка));
				SUI_ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
			КонецПопытки;
			
		Иначе
			ДанныеПакетаСообщенияМодифицированы = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не Отказ И Модифицированность И ДанныеПакетаСообщенияМодифицированы Тогда
		
		Попытка
			
			Если Запись.Получатель = ПланыОбмена.SUI_МобильныеУстройства.ЭтотУзел() Тогда
				ДанныеПакетаКЗаписи = SUI_ОбщегоНазначения.ЗначениеИзСтрокиXML(ПакетыСообщения[0].Значение);
			ИначеЕсли Запись.ВидДанных = Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.JSON Тогда
				ДанныеПакетаКЗаписи = ПакетыСообщения[0].Значение;
			Иначе
				ДанныеПакетаКЗаписи = Неопределено;
			КонецЕсли;
			
			Если ДанныеПакетаКЗаписи <> Неопределено Тогда
				ТекущийОбъект.Данные = Новый ХранилищеЗначения(ДанныеПакетаКЗаписи, Новый СжатиеДанных(9));
			КонецЕсли;
			
		Исключение
			ТекстОшибки = НСтр("ru = 'Содержимое сообщения содержит ошибки!'");
			ВызватьИсключение(ТекстОшибки, , , , ИнформацияОбОшибке())
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ДанныеПакетаСообщенияМодифицированы = Ложь;
	Модифицированность = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПредставлениеСообщенийОбработкиНажатие(Элемент)
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("СообщенияПользователю", СообщенияОбработки);
	ПараметрыОткрытия.Вставить("Заголовок", СтрШаблон(НСтр("ru = 'Сообщение обмена %1'"), Запись.ID));
	
	ОткрытьФорму("ОбщаяФорма.SUI_ПросмотрСообщений", ПараметрыОткрытия, ЭтотОбъект, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеОшибкиОбработкиНажатие(Элемент)
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("КраткоеПредставлениеОшибки", Запись.ОшибкаОбработки);
	ПараметрыОткрытия.Вставить("Заголовок", СтрШаблон(НСтр("ru = 'Сообщение обмена %1'"), Запись.ID));
	
	ОткрытьФорму("ОбщаяФорма.SUI_ПросмотрОшибки", ПараметрыОткрытия, ЭтотОбъект, УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РазрешитьРедактирование(Команда)
	
	Элементы.ФормаРазрешитьРедактирование.Пометка = Не Элементы.ФормаРазрешитьРедактирование.Пометка;
	
	РазрешитьРедактированиеПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДанные(Команда)
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("Заголовок", НСтр("ru = 'Данные сообщения обмена'"));
	ПараметрыОткрытия.Вставить("СохранятьРезультат", Элементы.ФормаРазрешитьРедактирование.Пометка);
	ПараметрыОткрытия.Вставить("РежимПросмотраПриОткрытии", Не Элементы.ФормаРазрешитьРедактирование.Пометка);
	ПараметрыОткрытия.Вставить("СтрокиJSON", ПакетыСообщения);
	
	Оповещение = Новый ОписаниеОповещения("ОткрытьРедакторJSONЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Обработка.SUI_РедакторJSON.Форма", ПараметрыОткрытия, ЭтотОбъект, УникальныйИдентификатор, , , 
		Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДляПовторнойОбработки(Команда)
	
	Если Модифицированность Или ДанныеПакетаСообщенияМодифицированы Тогда
		ТекстПредупреждения = НСтр("ru = 'Перед открытием сообщения для повторной обработки необходимо записать данные!'");
		ПоказатьПредупреждение(, ТекстПредупреждения);
	Иначе
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ОткрытьДляПовторнойОбработкиЗавершение", ЭтотОбъект);
		SUI_СообщенияОбменаДаннымиКлиент.ОткрытьСообщениеДляПовторнойОбработки(Запись.ИсходныйКлючЗаписи, ОповещениеОЗавершении);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НачатьСборкуПакетовСообщения()
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("НачатьСборкуПакетовСообщенияЗавершение", ЭтотОбъект);

	Результат = НачатьСборкуПакетовСобщенияНаСервере();
	
	Если Результат.Свойство("ДлительнаяОперация") Тогда
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.Заголовок = НСтр("ru = 'Сборка пакетов данных сообщения обмена'");
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(Результат.ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
		
	ИначеЕсли ЗначениеЗаполнено(Результат) Тогда
		ВыполнитьОбработкуОповещения(ОповещениеОЗавершении, Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НачатьСборкуПакетовСобщенияНаСервере()
	
	Результат = Новый Структура();
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	SUI_СообщенияОбменаДанными.Данные
		|ИЗ
		|	РегистрСведений.SUI_СообщенияОбменаДанными КАК SUI_СообщенияОбменаДанными
		|ГДЕ
		|	SUI_СообщенияОбменаДанными.ID = &ID
		|	И SUI_СообщенияОбменаДанными.Отправитель = &Отправитель
		|	И SUI_СообщенияОбменаДанными.Получатель = &Получатель";
	
	Запрос.УстановитьПараметр("ID", Запись.ID);
	Запрос.УстановитьПараметр("Отправитель", Запись.Отправитель);
	Запрос.УстановитьПараметр("Получатель", Запись.Получатель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
	
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Данные = Выборка.Данные.Получить();
		
		Если Запись.Получатель = ПланыОбмена.SUI_МобильныеУстройства.ЭтотУзел() Тогда
			
			Данные = SUI_ОбщегоНазначения.ЗначениеВСтрокуXML(Данные);
			Данные = SUI_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Данные);
			
			Результат.Вставить("Статус", "Выполнено");
			Результат.Вставить("АдресРезультата", ПоместитьВоВременноеХранилище(Данные, УникальныйИдентификатор));
			
		ИначеЕсли Запись.ВидДанных = Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.JSON Тогда
			
			Данные = SUI_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Данные);
			
			Результат.Вставить("Статус", "Выполнено");
			Результат.Вставить("АдресРезультата", ПоместитьВоВременноеХранилище(Данные, УникальныйИдентификатор));
			
		Иначе
			
			ПараметрыСборки = SUI_ПакетыДанных.ПараметрыСборкиСообщенийПакетаДанныхИзКоллекции(Данные);
			ЗаполнитьЗначенияСвойств(ПараметрыСборки, Запись);
			ПараметрыСборки.ВидДанных = Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.JSON;
			
			ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне("SUI_ПакетыДанных.СобратьСообщениеПакетаДанныхИзКоллекции",
				ПараметрыСборки, 
				ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор));
			
			Результат.Вставить("ДлительнаяОперация", ДлительнаяОперация);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура НачатьСборкуПакетовСообщенияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Свойство("КраткоеПредставлениеОшибки") И ЗначениеЗаполнено(Результат.КраткоеПредставлениеОшибки) Тогда
		ПоказатьПредупреждение(, Результат.КраткоеПредставлениеОшибки);
		Если Результат.Свойство("ПодробноеПредставлениеОшибки") И ЗначениеЗаполнено(Результат.ПодробноеПредставлениеОшибки) Тогда
			SUI_ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
		КонецЕсли;
	КонецЕсли;
	
	Если Результат.Свойство("Сообщения") И ЗначениеЗаполнено(Результат.Сообщения) Тогда
		
		Для Каждого Сообщение Из Результат.Сообщения Цикл
			Сообщение.Сообщить();
		КонецЦикла;
		
	КонецЕсли;
	
	ПакетыСообщения.Очистить();
	
	Если Результат.Статус = "Выполнено" Тогда
		
		ОписаниеТипаМассив = Новый ОписаниеТипов("Массив");
		ПакетыРезультат = ОписаниеТипаМассив.ПривестиЗначение(ПолучитьИзВременногоХранилища(Результат.АдресРезультата));
		
		Для индекс = 0 По ПакетыРезультат.ВГраница() Цикл
			ПакетыСообщения.Добавить(ПакетыРезультат[индекс], СтрШаблон(НСтр("ru = 'Пакет %1'"), Формат(индекс, "ЧГ=0;")));
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРедакторJSONЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		ПакетыСообщения.Очистить();
		Для Каждого СтрокаJSONРезультат Из Результат Цикл
			ПакетыСообщения.Добавить(СтрокаJSONРезультат.Значение, СтрокаJSONРезультат.Представление);
		КонецЦикла;
		
		ДанныеПакетаСообщенияМодифицированы = Истина;
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДляПовторнойОбработкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Или Не Результат Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеПакетаСообщенияМодифицированы = Ложь;
	Модифицированность = Ложь;
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура РазрешитьРедактированиеПриИзменении()
	
	Элементы.Сворачивать.ТолькоПросмотр = Не Элементы.ФормаРазрешитьРедактирование.Пометка;
	Элементы.Приоритет.ТолькоПросмотр = Не Элементы.ФормаРазрешитьРедактирование.Пометка;
	Элементы.Ключи.РедактированиеТекста = Элементы.ФормаРазрешитьРедактирование.Пометка;
	
КонецПроцедуры

#КонецОбласти
