
#Область ПрограммныйИнтерфейс

Функция СтрокуТаблицыЗначенийВСоответствие(Знач СтрокаТаблицыЗначений, Знач СоответствиеПолей = "") Экспорт
	
	Соответствие = Новый Соответствие;
	
	Если ТипЗнч(СоответствиеПолей) <> Тип("Соответствие") Тогда 
		
		Если ТипЗнч(СоответствиеПолей) <> Тип("Строка") Тогда
			СоответствиеПолей = "";
		КонецЕсли;
		
		Если ПустаяСтрока(СоответствиеПолей) Тогда
			Для Каждого Колонка Из СтрокаТаблицыЗначений.Владелец().Колонки Цикл 
				СоответствиеПолей = СоответствиеПолей + ?(ПустаяСтрока(СоответствиеПолей), "", ",") + Колонка.Имя + "=" + Колонка.Имя;
			КонецЦикла;	
		КонецЕсли;      
		
		СоответствиеПолей = SUI_СтроковыеФункцииКлиентСервер.РазобратьСтрокуВСоответствие(СоответствиеПолей);
		
	КонецЕсли;
	            
	Для Каждого Колонка Из СтрокаТаблицыЗначений.Владелец().Колонки Цикл
		
		Ключ = СоответствиеПолей.Получить(Колонка.Имя);     
		
		Если Ключ = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		Соответствие.Вставить(Ключ, СтрокаТаблицыЗначений[Колонка.Имя]);
		
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции

// Получить имена колонок результата запроса.
// 
// Параметры:
//  РезультатЗапроса - РезультатЗапроса - Результат запроса
//  ИсключитьКолонки - Строка - Исключить колонки
//  ВернутьСтрокой - Булево - Вернуть строкой
// 
// Возвращаемое значение:
//  Строка, Массив из Строка - Получить имена колонок результата запроса
Функция ПолучитьИменаКолонокРезультатаЗапроса(РезультатЗапроса, ИсключитьКолонки = "", ВернутьСтрокой = Истина) Экспорт

	ИменаКолонок = Новый Массив();
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		ИменаКолонок.Добавить(Колонка.Имя);
	КонецЦикла;
	
	ИменаКолонок = ОбщегоНазначенияКлиентСервер.РазностьМассивов(ИменаКолонок, 
		СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИсключитьКолонки, ",", Истина, Истина));

	Если ВернутьСтрокой Тогда
		ИменаКолонок = СтрСоединить(ИменаКолонок, ",")
	КонецЕсли;
	
	Возврат ИменаКолонок;
	
КонецФункции

// Колонки результата запроса в строку.
// 
// Параметры:
//  РезультатЗапроса	 - РезультатЗапроса - Результат запроса
//  СписокКолонок	 	 - Строка 			- Список имен колонок добавляемых в структуру
//  ИсключитьКолонки	 - Строка 			- Список имен колонок исключаемых из структуры
//  ВключитьНачинаетсяС	 - Строка 			- Список имен колонок добавляемых в структуру начинающихся со строки
//  ИсключитьНачинаетсяС - Строка 			- Список имен колонок исключаемых из структуры начинающихся со строки
// 
// Возвращаемое значение:
//  Строка - Колонки результата запроса в строку
Функция КолонкиРезультатаЗапросаВСтроку(РезультатЗапроса, Знач СписокКолонок = "", Знач ИсключитьКолонки = "", 
	Знач ВключитьНачинаетсяС = "", Знач ИсключитьНачинаетсяС = "") Экспорт
	
	СтруктураРЗ = КолонкиРезультатаЗапросаВСтруктуру(РезультатЗапроса, СписокКолонок, ИсключитьКолонки, 
		ВключитьНачинаетсяС, ИсключитьНачинаетсяС);
	
	СвойстваСтруктуры = Новый Массив();
	Для Каждого КлючЗначение Из СтруктураРЗ Цикл
		СвойстваСтруктуры.Добавить(КлючЗначение.Ключ);
	КонецЦикла;
	
	Возврат ?(СвойстваСтруктуры.Количество() = 0, "", СтрСоединить(СвойстваСтруктуры, ","));
	
КонецФункции

// Функция - Колонки выборки в структуру
//
// Параметры:
//  РезультатЗапроса	 - РезультатЗапроса - Результат запроса
//  СписокКолонок	 	 - Строка 			- Список имен колонок добавляемых в структуру
//  ИсключитьКолонки	 - Строка 			- Список имен колонок исключаемых из структуры
//  ВключитьНачинаетсяС	 - Строка 			- Список имен колонок добавляемых в структуру начинающихся со строки
//  ИсключитьНачинаетсяС - Строка 			- Список имен колонок исключаемых из структуры начинающихся со строки
// 
// Возвращаемое значение:
//  Структура - Структура колонок выборки результата запроса
//
Функция КолонкиРезультатаЗапросаВСтруктуру(РезультатЗапроса, Знач СписокКолонок = "", Знач ИсключитьКолонки = "", 
	Знач ВключитьНачинаетсяС = "", Знач ИсключитьНачинаетсяС = "") Экспорт 
	
	СтруктураКолонок = Новый Структура();
	
	ВыполнятьПроверку = Ложь;
	
	Если ПустаяСтрока(СписокКолонок) Тогда
		СписокКолонок = Новый Массив();
	Иначе
		ВыполнятьПроверку = Истина;
		СписокКолонок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СписокКолонок, ",", Истина, Истина);
	КонецЕсли;
	
	Если ПустаяСтрока(ИсключитьКолонки) Тогда
		ИсключитьКолонки = Новый Массив();
	Иначе
		ВыполнятьПроверку = Истина;
		ИсключитьКолонки = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИсключитьКолонки, ",", Истина, Истина);
	КонецЕсли;
	
	Если ПустаяСтрока(ВключитьНачинаетсяС) Тогда
		ВключитьНачинаетсяС = Новый Массив();
	Иначе
		ВыполнятьПроверку = Истина;
		ВключитьНачинаетсяС = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВключитьНачинаетсяС, ",", Истина, Истина);
	КонецЕсли;
	
	Если ПустаяСтрока(ИсключитьНачинаетсяС) Тогда
		ИсключитьНачинаетсяС = Новый Массив();
	Иначе
		ВыполнятьПроверку = Истина;
		ИсключитьНачинаетсяС = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИсключитьНачинаетсяС, ",", Истина, Истина);
	КонецЕсли;
	
	Если СписокКолонок.Количество() > 0 Тогда
		СписокКолонок = ОбщегоНазначенияКлиентСервер.РазностьМассивов(СписокКолонок, ИсключитьКолонки);
		ИсключитьКолонки = Неопределено;
	Иначе
		СписокКолонок = Неопределено;
	КонецЕсли;
	
	Если ВключитьНачинаетсяС.Количество() > 0 Тогда
		ВключитьНачинаетсяС = ОбщегоНазначенияКлиентСервер.РазностьМассивов(ВключитьНачинаетсяС, ИсключитьНачинаетсяС);
		ИсключитьНачинаетсяС = Неопределено;
	Иначе
		ВключитьНачинаетсяС = Неопределено;
	КонецЕсли;
	
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		
		Если ВыполнятьПроверку Тогда
			
			Пропустить = Ложь;
			
			Если СписокКолонок <> Неопределено И СписокКолонок.Найти(Колонка.Имя) = Неопределено Тогда
				Пропустить = Истина;
			КонецЕсли;
			
			Если Не Пропустить И ИсключитьКолонки <> Неопределено И ИсключитьКолонки.Найти(Колонка.Имя) <> Неопределено Тогда
				Пропустить = Истина;
			КонецЕсли;
			
			Если Не Пропустить И ВключитьНачинаетсяС <> Неопределено Тогда
				Для Индекс = 0 По ВключитьНачинаетсяС.ВГраница() Цикл
					Если Не СтрНачинаетсяС(Колонка.Имя, ВключитьНачинаетсяС[Индекс]) Тогда
						Пропустить = Истина;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Если Не Пропустить И ИсключитьНачинаетсяС <> Неопределено Тогда
				Для Индекс = 0 По ИсключитьНачинаетсяС.ВГраница() Цикл
					Если СтрНачинаетсяС(Колонка.Имя, ИсключитьНачинаетсяС[Индекс]) Тогда
						Пропустить = Истина;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Если Пропустить Тогда
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		
		СтруктураКолонок.Вставить(Колонка.Имя);
		
	КонецЦикла;
	
	Возврат СтруктураКолонок;
	
КонецФункции

// Останавливает выполнение кода на заданное время.
//
// Параметры:
//  Секунд - Число - время ожидания в секундах.
//
Процедура Пауза(Знач Секунд) Экспорт
	
	Секунд = ОбщегоНазначения.ОписаниеТипаЧисло(2, , ДопустимыйЗнак.Неотрицательный).ПривестиЗначение(Секунд);
	Если Секунд > 30 Тогда
		Секунд = 30;
	КонецЕсли;
	
	ТекущийСеансИнформационнойБазы = ПолучитьТекущийСеансИнформационнойБазы();
	ФоновоеЗадание = ТекущийСеансИнформационнойБазы.ПолучитьФоновоеЗадание();
	
	Если ФоновоеЗадание = Неопределено Тогда
		Параметры = Новый Массив;
		Параметры.Добавить(Секунд);
		ФоновоеЗадание = ФоновыеЗадания.Выполнить("SUI_ОбщегоНазначения.Пауза", Параметры);
	КонецЕсли;
	
	ФоновоеЗадание.ОжидатьЗавершенияВыполнения(Секунд);
	
КонецПроцедуры

// Возвращает ссылку предопределенного элемента по его полному имени.
// Предопределенные элементы могут содержаться только в следующих объектах:
//   - справочники;
//   - планы видов характеристик;
//   - планы счетов;
//   - планы видов расчета.
// После изменения состава предопределенных следует выполнить метод
// ОбновитьПовторноИспользуемыеЗначения(), который сбросит кэш ПовтИсп в текущем сеансе.
//
// Параметры:
//   ПолноеИмяПредопределенного - Строка - полный путь к предопределенному элементу, включая его имя.
//     Формат аналогичен функции глобального контекста ПредопределенноеЗначение().
//     Например:
//       "Справочник.ВидыКонтактнойИнформации.EmailПользователя"
//       "ПланСчетов.Хозрасчетный.Материалы"
//       "ПланВидовРасчета.Начисления.ОплатаПоОкладу".
//
// Возвращаемое значение: 
//   ЛюбаяСсылка - ссылка на предопределенный элемент.
//   Неопределено - если предопределенный элемент есть в метаданных, но не создан в ИБ.
//
Функция ПредопределенныйЭлемент(ПолноеИмяПредопределенного) Экспорт
	
	СтандартнаяОбработка = ОбщегоНазначенияСлужебныйКлиентСервер.ИспользоватьСтандартнуюФункциюПолученияПредопределенного(
		ПолноеИмяПредопределенного);
	
	Если СтандартнаяОбработка Тогда 
		Возврат ПредопределенноеЗначение(ПолноеИмяПредопределенного);
	КонецЕсли;
	
	ПоляПредопределенного = ОбщегоНазначенияСлужебныйКлиентСервер.ИмяПредопределенногоПоПолям(ПолноеИмяПредопределенного);
	
	ОписаниеТипаФиксированноеСоответствие = Новый ОписаниеТипов("ФиксированноеСоответствие");

	ПредопределенныеЗначения = ОписаниеТипаФиксированноеСоответствие.ПривестиЗначение(
		СтандартныеПодсистемыПовтИсп.СсылкиПоИменамПредопределенных(ПоляПредопределенного.ПолноеИмяОбъектаМетаданных));
	
	Возврат ПредопределенныеЗначения.Получить(ПоляПредопределенного.ИмяПредопределенного);
	
КонецФункции

// Строка таблицы значений в структуру.
// 
// Параметры:
//  СтрокаТаблицыЗначений - СтрокаТаблицыЗначений - Строка таблицы значений
//  СтруктураПриемник - Неопределено - Структура приемник
// 
// Возвращаемое значение:
//  Структура, Неопределено - Строка таблицы значений в структуру
Функция СтрокаТаблицыЗначенийВСтруктуру(СтрокаТаблицыЗначений, СтруктураПриемник = Неопределено) Экспорт
	
	СтруктураРезультат = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаТаблицыЗначений);
	
	Если СтруктураПриемник = Неопределено Тогда
		Возврат СтруктураРезультат;
	Иначе
		
		Для Каждого КлючЗначение Из СтруктураРезультат Цикл
			СтруктураПриемник.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
		КонецЦикла;

		Возврат СтруктураПриемник;
		
	КонецЕсли;
	
КонецФункции

// Проверяет, что переданное значение имеет ссылочный тип данных.
//
// Параметры:
//  Значение - Произвольный - проверяемое значение.
//
// Возвращаемое значение:
//  Булево - Истина, если тип значения ссылочный.
//
Функция ЗначениеСсылочногоТипа(Значение) Экспорт
	
	Возврат ЭтоСсылка(ТипЗнч(Значение));
	
КонецФункции

// Проверка того, что переданный тип является ссылочным типом данных.
// Для типа Неопределено возвращается Ложь.
//
// Параметры:
//  ПроверяемыйТип - Тип - для проверки на ссылочный тип данных.
//
// Возвращаемое значение:
//  Булево - Истина, если это ссылка.
//
Функция ЭтоСсылка(ПроверяемыйТип) Экспорт
	
	ПроверяемыйТипСсылка = Ложь;
	
	Если ТипЗнч(ПроверяемыйТип) = Тип("ОписаниеТипов") Тогда
		ПроверяемыеТипы = Новый ОписаниеТипов(ПроверяемыйТип);
	Иначе
		ПроверяемыеТипы = Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПроверяемыйТип));
	КонецЕсли;
	
	Для Каждого Тип Из ПроверяемыеТипы.Типы() Цикл
		
		Если Тип <> Тип("Неопределено") Тогда
			
			ТипXML = XMLТип(Тип);
			Если ТипXML <> Неопределено Тогда
				
				ЧастьИмениТипа = СтрРазделить(ТипXML.ИмяТипа, ".", Ложь);
				ЧастьИмениТипа = ?(ЧастьИмениТипа.Количество() > 1, ЧастьИмениТипа[0], "");
				ПроверяемыйТипСсылка = (СтрДлина(ЧастьИмениТипа) > 3 И Прав(ЧастьИмениТипа, 3) = "Ref");
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ПроверяемыйТипСсылка Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПроверяемыйТипСсылка;

КонецФункции

// Функция - Проверяет ссылку на принадлежность к метаданным документов
//
// Параметры:
//  ПроверяемаяСсылка	 - ЛюбаяСсылка - Проверяемая ссылка
// 
// Возвращаемое значение:
//  Булево - Истина, если ссылка принадлежит метаданным документов
//
Функция ЭтоСсылкаДокумента(ПроверяемаяСсылка) Экспорт
	
	ТипXML = XMLТип(ТипЗнч(ПроверяемаяСсылка));
	Если ТипXML <> Неопределено Тогда
		XMLИмяТипа = ТипXML.ИмяТипа;
		Если СтрНачинаетсяС(XMLИмяТипа, "DocumentRef.") Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Возвращает имя вида объектов метаданных по типу объекта.
// Ограничение: не обрабатываются точки маршрутов бизнес-процессов.
// См. так же ВидОбъектаПоСсылке.
//
// Параметры:
//  ТипОбъекта - Тип - тип прикладного объекта, определенный в конфигурации.
//
// Возвращаемое значение:
//  Строка - имя вида объектов метаданных. Например: "Справочник", "Документ".
// 
Функция ВидОбъектаПоТипу(ТипОбъекта) Экспорт
	
	ИмяТипа = XMLТип(ТипОбъекта).ИмяТипа;
	
	Если СтрНачинаетсяС(ИмяТипа, "CatalogRef.") Тогда
		Возврат "Справочник";
	ИначеЕсли СтрНачинаетсяС(ИмяТипа, "DocumentRef.") Тогда
		Возврат "Документ";
	ИначеЕсли СтрНачинаетсяС(ИмяТипа, "BusinessProcessRef.") Тогда
		Возврат "БизнесПроцесс";
	ИначеЕсли СтрНачинаетсяС(ИмяТипа, "ChartOfCharacteristicTypesRef.") Тогда
		Возврат "ПланВидовХарактеристик";
	ИначеЕсли СтрНачинаетсяС(ИмяТипа, "ChartOfAccountsRef.") Тогда
		Возврат "ПланСчетов";
	ИначеЕсли ПланыВидовРасчета.ТипВсеСсылки().СодержитТип(ТипОбъекта) Тогда
		Возврат "ПланВидовРасчета";
	ИначеЕсли СтрНачинаетсяС(ИмяТипа, "TaskRef.") Тогда
		Возврат "Задача";
	ИначеЕсли СтрНачинаетсяС(ИмяТипа, "ExchangePlanRef.") Тогда
		Возврат "ПланОбмена";
	ИначеЕсли СтрНачинаетсяС(ИмяТипа, "EnumRef.") Тогда
		Возврат "Перечисление";
	ИначеЕсли СтрНачинаетсяС(ИмяТипа, "InformationRegisterRecordSet.") Тогда
		Возврат "РегистрСведений";
	Иначе
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Неверный тип значения параметра (%1)'"), Строка(ТипОбъекта));
	КонецЕсли;
	
КонецФункции

// Возвращает имя вида объектов метаданных по ссылке на объект.
// Ограничение: не обрабатываются точки маршрутов бизнес-процессов.
// См. так же ВидОбъектаПоТипу.
//
// Параметры:
//  Ссылка - ЛюбаяСсылка - объект, вид которого требуется получить.
//
// Возвращаемое значение:
//  Строка - имя вида объектов метаданных. Например: "Справочник", "Документ".
// 
Функция ВидОбъектаПоСсылке(Ссылка) Экспорт
	
	Возврат ВидОбъектаПоТипу(ТипЗнч(Ссылка));
	
КонецФункции

// Возвращает строковое представление типа. 
// Для ссылочных типов возвращает в формате "СправочникСсылка.ИмяОбъекта" или "ДокументСсылка.ИмяОбъекта".
// Для остальных типов приводит тип к строке, например "Число".
//
// Параметры:
//  Тип - Тип - для которого надо получить представление.
//
// Возвращаемое значение:
//  Строка - представление типа.
//
Функция СтроковоеПредставлениеТипа(Тип) Экспорт
	
	Представление = "";
	
	ТипЗначенияТипа = ТипЗнч(Тип);
	
	Если ТипЗначенияТипа = Тип("ОписаниеТипов") Тогда
		
		ПредставленияТипов = Новый Массив();
		
		Типы = Тип.Типы();
		
		Для индекс = 0 По Типы.ВГраница() Цикл
			_Представление = СтроковоеПредставлениеТипа(Типы[индекс]);
			Если Не ПустаяСтрока(_Представление) Тогда
				ПредставленияТипов.Добавить(_Представление);
			КонецЕсли;
		КонецЦикла;
		
		Если ПредставленияТипов.Количество() = 1 Тогда
			Представление = ПредставленияТипов[0];
		ИначеЕсли ПредставленияТипов.Количество() > 1 Тогда
			Представление = СтрСоединить(ПредставленияТипов, "; ");
		КонецЕсли;
	
	ИначеЕсли ТипЗначенияТипа = Тип("Тип") Тогда
		
		ТипXML = XMLТип(Тип);
		Если ТипXML <> Неопределено И СтрНайти(ТипXML.ИмяТипа, ".") > 0 Тогда
		
			ЧастиТипа = СтрРазделить(ТипXML.ИмяТипа, ".");
			
			Если СтрНачинаетсяС(ЧастиТипа[0], "Catalog") Тогда
				Представление = "Справочник";
			ИначеЕсли СтрНачинаетсяС(ЧастиТипа[0], "Document") Тогда
				Представление = "Документ";
			ИначеЕсли СтрНачинаетсяС(ЧастиТипа[0], "Enum") Тогда
				Представление = "Перечисление";
			ИначеЕсли СтрНачинаетсяС(ЧастиТипа[0], "ExchangePlan") Тогда
				Представление = "ПланОбмена";
			КонецЕсли;
			
			Если СтрЗаканчиваетсяНа(ЧастиТипа[0], "Ref") Тогда
				Представление = Представление + "Ссылка.";
			ИначеЕсли СтрЗаканчиваетсяНа(ЧастиТипа[0], "Object") Тогда
				Представление = Представление + "Объект.";
			Иначе
				Представление = "";
			КонецЕсли;
			
			Если Не ПустаяСтрока(Представление) Тогда
				Представление = Представление + ЧастиТипа[1];
			КонецЕсли;
		
		КонецЕсли;
		
		Если ПустаяСтрока(Представление) Тогда
			Представление = ОбщегоНазначения.СтроковоеПредставлениеТипа(Тип);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПустаяСтрока(Представление) И ТипЗначенияТипа = Тип("Строка") Тогда
		Представление = Тип;
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

// Возвращает ОбъектМетаданных, быстро найденный по полному имени.
// Более производительный аналог метода платформы Метаданные.НайтиПоПолномуИмени
// для корневых объектов метаданных.
//
// Параметры:
//  ПолноеИмя - Строка - полное имя объекта метаданных, например, Справочник.Организации
//
// Возвращаемое значение:
//  ОбъектМетаданных - когда найден
//  Неопределено - когда не найден
//
Функция ОбъектМетаданныхПоПолномуИмени(ПолноеИмя) Экспорт
	
	ПозицияТочки = СтрНайти(ПолноеИмя, ".");
	ИмяБазовогоТипа = Лев(ПолноеИмя, ПозицияТочки - 1);
	
	ИменаКоллекций = ИменаКоллекцийПоИменамБазовыхТипов();
	Коллекция = ИменаКоллекций.Получить(ВРег(ИмяБазовогоТипа));
	
	Если Коллекция <> Неопределено Тогда
		Если Коллекция <> "Подсистемы" Тогда
			ИмяОбъекта = Сред(ПолноеИмя, ПозицияТочки + 1);
			ОбъектМетаданных = Метаданные[Коллекция].Найти(ИмяОбъекта);
		Иначе
			ИменаПодсистем = СтрРазделить(ВРег(ПолноеИмя), ".");
			Количество = ИменаПодсистем.Количество();
			Подсистема = Метаданные;
			ОбъектМетаданных = Неопределено;
			Индекс = 0;
			Пока Истина Цикл
				Индекс = Индекс + 1;
				Если Индекс >= Количество Тогда
					Прервать;
				КонецЕсли;
				ИмяПодсистемы = ИменаПодсистем[Индекс];
				Подсистема = Подсистема.Подсистемы.Найти(ИмяПодсистемы);
				Если Подсистема = Неопределено Тогда
					Прервать;
				КонецЕсли;
				Индекс = Индекс + 1;
				Если Индекс = Количество Тогда
					ОбъектМетаданных = Подсистема;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Если ОбъектМетаданных = Неопределено Тогда
		ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ПолноеИмя);
	КонецЕсли;
	
	Возврат ОбъектМетаданных;
	
КонецФункции

Функция ИменаКоллекцийПоИменамБазовыхТипов() Экспорт
	
	ИменаКоллекций = Новый Соответствие;
	ИменаКоллекций.Вставить(ВРег("Подсистема"), "Подсистемы");
	ИменаКоллекций.Вставить(ВРег("ОбщийМодуль"), "ОбщиеМодули");
	ИменаКоллекций.Вставить(ВРег("ПараметрСеанса"), "ПараметрыСеанса");
	ИменаКоллекций.Вставить(ВРег("Роль"), "Роли");
	ИменаКоллекций.Вставить(ВРег("ОбщийРеквизит"), "ОбщиеРеквизиты");
	ИменаКоллекций.Вставить(ВРег("ПланОбмена"), "ПланыОбмена");
	ИменаКоллекций.Вставить(ВРег("КритерийОтбора"), "КритерииОтбора");
	ИменаКоллекций.Вставить(ВРег("ПодпискаНаСобытие"), "ПодпискиНаСобытия");
	ИменаКоллекций.Вставить(ВРег("РегламентноеЗадание"), "РегламентныеЗадания");
	ИменаКоллекций.Вставить(ВРег("ФункциональнаяОпция"), "ФункциональныеОпции");
	ИменаКоллекций.Вставить(ВРег("ПараметрФункциональныхОпций"), "ПараметрыФункциональныхОпций");
	ИменаКоллекций.Вставить(ВРег("ОпределяемыйТип"), "ОпределяемыеТипы");
	ИменаКоллекций.Вставить(ВРег("ХранилищеНастроек"), "ХранилищаНастроек");
	ИменаКоллекций.Вставить(ВРег("ОбщаяФорма"), "ОбщиеФормы");
	ИменаКоллекций.Вставить(ВРег("ОбщаяКоманда"), "ОбщиеКоманды");
	ИменаКоллекций.Вставить(ВРег("ГруппаКоманд"), "ГруппыКоманд");
	ИменаКоллекций.Вставить(ВРег("ОбщийМакет"), "ОбщиеМакеты");
	ИменаКоллекций.Вставить(ВРег("ОбщаяКартинка"), "ОбщиеКартинки");
	ИменаКоллекций.Вставить(ВРег("ПакетXDTO"), "ПакетыXDTO");
	ИменаКоллекций.Вставить(ВРег("WebСервис"), "WebСервисы");
	ИменаКоллекций.Вставить(ВРег("HTTPСервис"), "HTTPСервисы");
	ИменаКоллекций.Вставить(ВРег("WSСсылка"), "WSСсылки");
	ИменаКоллекций.Вставить(ВРег("СервисИнтеграции"), "СервисыИнтеграции");
	ИменаКоллекций.Вставить(ВРег("ЭлементСтиля"), "ЭлементыСтиля");
	ИменаКоллекций.Вставить(ВРег("Стиль"), "Стили");
	ИменаКоллекций.Вставить(ВРег("Язык"), "Языки");
	ИменаКоллекций.Вставить(ВРег("Константа"), "Константы");
	ИменаКоллекций.Вставить(ВРег("Справочник"), "Справочники");
	ИменаКоллекций.Вставить(ВРег("Документ"), "Документы");
	ИменаКоллекций.Вставить(ВРег("Последовательность"), "Последовательности");
	ИменаКоллекций.Вставить(ВРег("ЖурналДокументов"), "ЖурналыДокументов");
	ИменаКоллекций.Вставить(ВРег("Перечисление"), "Перечисления");
	ИменаКоллекций.Вставить(ВРег("Отчет"), "Отчеты");
	ИменаКоллекций.Вставить(ВРег("Обработка"), "Обработки");
	ИменаКоллекций.Вставить(ВРег("ПланВидовХарактеристик"), "ПланыВидовХарактеристик");
	ИменаКоллекций.Вставить(ВРег("ПланСчетов"), "ПланыСчетов");
	ИменаКоллекций.Вставить(ВРег("ПланВидовРасчета"), "ПланыВидовРасчета");
	ИменаКоллекций.Вставить(ВРег("РегистрСведений"), "РегистрыСведений");
	ИменаКоллекций.Вставить(ВРег("РегистрНакопления"), "РегистрыНакопления");
	ИменаКоллекций.Вставить(ВРег("РегистрБухгалтерии"), "РегистрыБухгалтерии");
	ИменаКоллекций.Вставить(ВРег("РегистрРасчета"), "РегистрыРасчета");
	ИменаКоллекций.Вставить(ВРег("БизнесПроцесс"), "БизнесПроцессы");
	ИменаКоллекций.Вставить(ВРег("Задача"), "Задачи");
	ИменаКоллекций.Вставить(ВРег("ВнешниеИсточникиДанных"), "ВнешнийИсточникДанных");
	
	Возврат Новый ФиксированноеСоответствие(ИменаКоллекций);
	
КонецФункции

#Область СериализацияXML

// Преобразует (сериализует) любое значение в XML-строку.
// Преобразованы в могут быть только те объекты, для которых в синтакс-помощнике указано, что они сериализуются.
// См. также ЗначениеИзСтрокиXML.
//
// Параметры:
//  Значение - Произвольный - значение, которое необходимо сериализовать в XML-строку.
//
// Возвращаемое значение:
//  Строка - XML-строка.
//
Функция ЗначениеВСтрокуXML(Значение) Экспорт
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Значение, НазначениеТипаXML.Явное);
	
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции

// Выполняет преобразование (десериализацию) XML-строки в значение.
// См. также ЗначениеВСтрокуXML.
//
// Параметры:
//  СтрокаXML - Строка - XML-строка, с сериализованным объектом..
//
// Возвращаемое значение:
//  Произвольный - значение, полученное из переданной XML-строки.
//
Функция ЗначениеИзСтрокиXML(СтрокаXML) Экспорт
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаXML);
	
	Возврат СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
	
КонецФункции

#КонецОбласти

#Область ХранилищеОбщихНастроек

// Сохранить настройку по ключу в общих настройках Simple.
// 
// Параметры:
//  КлючНастройки - Строка - Ключ
//  Настройка - Произвольный - Настройка
//  ИмяПользователя - Строка, Неопределено - Имя пользователя настройки
Процедура ХранилищеОбщихНастроекСохранить(КлючНастройки, Настройка, ИмяПользователя = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ХранилищеОбщихНастроек.Сохранить(
		ПолучитьКлючОбъектаОбщихНастроек(), 
		СократитьКлючОбщихНастроек(КлючНастройки), 
		Настройка,
		,
		ИмяПользователя);
	
КонецПроцедуры

// Сохранить коллекцию настроек в общих настройках Simple.
// 
// Параметры:
//  КоллекцияНастроек - Соответствие из Произвольный - Коллекция настроек:
//  	* Ключ - Строка - Ключ
//  	* Значение - Произвольный - Настройка
//  ИмяПользователя - Неопределено - Имя пользователя
Процедура ХранилищеОбщихНастроекСохранитьНастройки(КоллекцияНастроек, ИмяПользователя = Неопределено) Экспорт
	
	Для Каждого ЭлементКоллекцииНастроек Из КоллекцияНастроек Цикл
		ХранилищеОбщихНастроекСохранить(ЭлементКоллекцииНастроек.Ключ, ЭлементКоллекцииНастроек.Значение, ИмяПользователя);
	КонецЦикла;
	
КонецПроцедуры

// Загрузить настройку по ключу из общих настроек Simple.
// 
// Параметры:
//  КлючНастройки - Строка - Ключ
//  ЗначениеПоУмолчанию - Произвольный - Значение по умолчанию
//  ИмяПользователя - Строка, Неопределено - Имя пользователя настройки
//	ПривестиКТипуПоУмолчанию - Булево - Привести результат к типу по умолчанию, 
//										если найдено и значение по умолчанию не равно Неопределено
// 
// Возвращаемое значение:
//  Произвольный, Неопределено - Значение настройки из общих настроек Simple по ключу.
Функция ХранилищеОбщихНастроекЗагрузить(КлючНастройки, ЗначениеПоУмолчанию = Неопределено, ИмяПользователя = Неопределено,
	ПривестиКТипуПоУмолчанию = Истина) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Неопределено;
	
	Результат = ХранилищеОбщихНастроек.Загрузить(
		ПолучитьКлючОбъектаОбщихНастроек(),
		СократитьКлючОбщихНастроек(КлючНастройки), 
		, 
		ИмяПользователя);
	
	Если Результат = Неопределено Или ОчиститьНесуществующиеСсылки(Результат) Тогда
		Результат = ЗначениеПоУмолчанию;
	ИначеЕсли ЗначениеПоУмолчанию <> Неопределено И ПривестиКТипуПоУмолчанию Тогда
		
		МассивТипов = Новый Массив();
		МассивТипов.Добавить(ТипЗнч(ЗначениеПоУмолчанию));
		ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
		
		Результат = ОписаниеТипа.ПривестиЗначение(Результат);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Загрузить значения настроек из общих настроек Simple в коллекцию настроек.
// 
// Параметры:
//  КоллекцияНастроек - Соответствие из Произвольный - Коллекция настроек:
//  	* Ключ - Строка - Ключ
//  	* Значение - Произвольный - Значение по умолчанию, если настройка по ключу не найдена.
//  ИмяПользователя - Строка, Неопределено - Имя пользователя настройки
//	ПривестиКТипуПоУмолчанию - Булево - Привести результат к типу по умолчанию, 
//										если найдено и значение по умолчанию не равно Неопределено
Процедура ХранилищеОбщихНастроекЗагрузитьНастройки(КоллекцияНастроек, ИмяПользователя = Неопределено,
	ПривестиКТипуПоУмолчанию = Истина) Экспорт
	
	Для Каждого ЭлементКоллекцииНастроек Из КоллекцияНастроек Цикл
		
		Результат = ХранилищеОбщихНастроекЗагрузить(
			ЭлементКоллекцииНастроек.Ключ, ЭлементКоллекцииНастроек.Значение, ИмяПользователя, ПривестиКТипуПоУмолчанию);
		
		КоллекцияНастроек.Вставить(ЭлементКоллекцииНастроек.Ключ, Результат);
		
	КонецЦикла;
	
КонецПроцедуры

// Удалить настройку по ключу в общих настройках Simple.
// 
// Параметры:
//  КлючНастройки - Строка - Ключ
//  ИмяПользователя - Строка, Неопределено - Имя пользователя настройки
Процедура ХранилищеОбщихНастроекУдалить(КлючНастройки, ИмяПользователя = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ХранилищеОбщихНастроек.Удалить(
		ПолучитьКлючОбъектаОбщихНастроек(), 
		СократитьКлючОбщихНастроек(КлючНастройки), 
		ИмяПользователя);
	
КонецПроцедуры

// Хранилище общих настроек удалить настройки.
// 
// Параметры:
//  КоллекцияНастроек - Соответствие из Произвольный - Коллекция настроек:
//  	* Ключ - Строка - Ключ
//  	* Значение - Произвольный - 
//  ИмяПользователя - Неопределено - Имя пользователя
Процедура ХранилищеОбщихНастроекУдалитьНастройки(КоллекцияНастроек, ИмяПользователя = Неопределено) Экспорт
	
	Для Каждого ЭлементКоллекцииНастроек Из КоллекцияНастроек Цикл
		ХранилищеОбщихНастроекУдалить(ЭлементКоллекцииНастроек.Ключ, ИмяПользователя);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СериализацияJSON

// Cм. метод глобального контекста - ЗаписатьJSON, параметр ИмяФункцииПреобразования.
// 
// Параметры:
//  Свойство - Строка - 
//  Значение - Произвольный - 
//  ДополнительныеПараметры - Произвольный - 
//  Отказ - Булево - 
// 
// Возвращаемое значение:
//  Строка - Преобразование данных JSON
Функция ПреобразованиеДанныхJSON(Свойство, Значение, ДополнительныеПараметры, Отказ) Экспорт
	
	ТипЗначения = ТипЗнч(Значение);
	Если ТипЗначения = Тип("Null") Тогда
		Возврат Неопределено;
	ИначеЕсли ЭтоСсылка(ТипЗначения) Тогда
		Возврат SUI_ИнтеграцияВКонфигурацию.ИдентификаторSimpleПоСсылке(Значение);
	ИначеЕсли ТипЗначения = Тип("УникальныйИдентификатор") Тогда
		Возврат Строка(Значение);
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

Функция ВосстановлениеДанныхJSON_ВосстановитьДату(ДатаДляВосстановления) Экспорт
	
	// Проверка стандартных значений 2018-01-01T00:00:00, 2018-01-01T00:00:00Z, 2018-01-01T00:00:00+0000
	Если СтрДлина(ДатаДляВосстановления) <= 24 И 
		Сред(ДатаДляВосстановления, 5, 1) = "-" И 
		Сред(ДатаДляВосстановления, 8, 1) = "-" И 
		Сред(ДатаДляВосстановления, 11, 1) = "T" Тогда
		Возврат XMLЗначение(Тип("Дата"), ДатаДляВосстановления);
	КонецЕсли; 
	
	// Восстановление даты в формате дд.ММ.гггг
	ЧастиЗначенияДаты = СтрРазделить(ДатаДляВосстановления, ".");
	Если ЧастиЗначенияДаты.Количество() >= 3 Тогда
		Возврат Дата(Число(ЧастиЗначенияДаты[2]), Число(ЧастиЗначенияДаты[1]), Число(ЧастиЗначенияДаты[0]));
	КонецЕсли;
	
	// Восстановление даты в формате ММ/дд/гггг
	ЧастиЗначенияДаты = СтрРазделить(ДатаДляВосстановления, "/");
	Если ЧастиЗначенияДаты.Количество() >= 3 Тогда
		Возврат Дата(Число(ЧастиЗначенияДаты[2]), Число(ЧастиЗначенияДаты[0]), Число(ЧастиЗначенияДаты[1]));
	КонецЕсли; 
	
	Возврат ДатаДляВосстановления;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ХранилищеОбщихНастроек

Функция ПолучитьКлючОбъектаОбщихНастроек()
	
	Возврат "SUI_ОбщиеНастройкиSimple";
	
КонецФункции

Функция СократитьКлючОбщихНастроек(КлючНастроек)
	
	МаксимальнаяДлинаКлюча = 128;
	Результат = КлючНастроек;
	
	Если СтрДлина(КлючНастроек) > МаксимальнаяДлинаКлюча Тогда
		
		Результат = Лев(КлючНастроек, МаксимальнаяДлинаКлюча - 32);
		
		ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.MD5);
		ХешированиеДанных.Добавить(Сред(КлючНастроек, МаксимальнаяДлинаКлюча - 32 + 1));
		
		Результат = Результат + СтрЗаменить(ХешированиеДанных.ХешСумма, " ", "");
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

Функция ОчиститьНесуществующиеСсылки(Значение)
	
	Тип = ТипЗнч(Значение);
	Если Тип = Тип("Неопределено")
		Или Тип = Тип("Булево")
		Или Тип = Тип("Строка")
		Или Тип = Тип("Число")
		Или Тип = Тип("Дата") Тогда
		
		Возврат Ложь;
		
	ИначеЕсли Тип = Тип("Массив") Тогда
		
		Количество = Значение.Количество();
		Для Номер = 1 По Количество Цикл
			
			ОбратныйИндекс = Количество - Номер;
			
			Если ОчиститьНесуществующиеСсылки(Значение[ОбратныйИндекс]) Тогда
				Значение.Удалить(ОбратныйИндекс);
			КонецЕсли;
			
		КонецЦикла;
		
		Возврат Ложь;
		
	ИначеЕсли Тип = Тип("Структура") Или Тип = Тип("Соответствие") Тогда
		
		Для Каждого КлючИЗначение Из Значение Цикл
			
			Если ОчиститьНесуществующиеСсылки(КлючИЗначение.Значение) Тогда
				Значение.Вставить(КлючИЗначение.Ключ, Неопределено);
			КонецЕсли;
			
		КонецЦикла;
		
		Возврат Ложь;
		
	ИначеЕсли ЭтоСсылка(Тип) Тогда
		
		Если Значение.Пустая() Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Значение, "Ссылка") = Неопределено;
		
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
