
#Область ПрограммныйИнтерфейс

Функция СтрокуТаблицыЗначенийВСоответствие(Знач СтрокаТаблицыЗначений, Знач СоответствиеПолей = "") Экспорт
	
	Соответствие = Новый Соответствие;
	
	Если ТипЗнч(СоответствиеПолей) <> Тип("Соответствие") Тогда 
		
		Если ТипЗнч(СоответствиеПолей) <> Тип("Строка") Тогда
			СоответствиеПолей = "";
		КонецЕсли;
		
		Если ПустаяСтрока(СоответствиеПолей) Тогда
			Для Каждого Колонка Из СтрокаТаблицыЗначений.Владелец().Колонки Цикл 
				СоответствиеПолей = СоответствиеПолей + ?(ПустаяСтрока(СоответствиеПолей), "", ",") + Колонка.Имя + "=" + Колонка.Имя;
			КонецЦикла;	
		КонецЕсли;      
		
		СоответствиеПолей = SUI_СтроковыеФункцииКлиентСервер.РазобратьСтрокуВСоответствие(СоответствиеПолей);
		
	КонецЕсли;
	            
	Для Каждого Колонка Из СтрокаТаблицыЗначений.Владелец().Колонки Цикл
		
		Ключ = СоответствиеПолей.Получить(Колонка.Имя);     
		
		Если Ключ = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		Соответствие.Вставить(Ключ, СтрокаТаблицыЗначений[Колонка.Имя]);
		
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции

// Получить имена колонок результата запроса.
// 
// Параметры:
//  РезультатЗапроса - РезультатЗапроса - Результат запроса
//  ИсключитьКолонки - Строка - Исключить колонки
//  ВернутьСтрокой - Булево - Вернуть строкой
// 
// Возвращаемое значение:
//  Строка, Массив из Строка - Получить имена колонок результата запроса
Функция ПолучитьИменаКолонокРезультатаЗапроса(РезультатЗапроса, ИсключитьКолонки = "", ВернутьСтрокой = Истина) Экспорт

	ИменаКолонок = Новый Массив();
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		ИменаКолонок.Добавить(Колонка.Имя);
	КонецЦикла;
	
	ИменаКолонок = ОбщегоНазначенияКлиентСервер.РазностьМассивов(ИменаКолонок, 
		СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИсключитьКолонки, ",", Истина, Истина));

	Если ВернутьСтрокой Тогда
		ИменаКолонок = СтрСоединить(ИменаКолонок, ",")
	КонецЕсли;
	
	Возврат ИменаКолонок;
	
КонецФункции

// Колонки результата запроса в строку.
// 
// Параметры:
//  РезультатЗапроса	 - РезультатЗапроса - Результат запроса
//  СписокКолонок	 	 - Строка 			- Список имен колонок добавляемых в структуру
//  ИсключитьКолонки	 - Строка 			- Список имен колонок исключаемых из структуры
//  ВключитьНачинаетсяС	 - Строка 			- Список имен колонок добавляемых в структуру начинающихся со строки
//  ИсключитьНачинаетсяС - Строка 			- Список имен колонок исключаемых из структуры начинающихся со строки
// 
// Возвращаемое значение:
//  Строка - Колонки результата запроса в строку
Функция КолонкиРезультатаЗапросаВСтроку(РезультатЗапроса, Знач СписокКолонок = "", Знач ИсключитьКолонки = "", 
	Знач ВключитьНачинаетсяС = "", Знач ИсключитьНачинаетсяС = "") Экспорт
	
	СтруктураРЗ = КолонкиРезультатаЗапросаВСтруктуру(РезультатЗапроса, СписокКолонок, ИсключитьКолонки, 
		ВключитьНачинаетсяС, ИсключитьНачинаетсяС);
	
	СвойстваСтруктуры = Новый Массив();
	Для Каждого КлючЗначение Из СтруктураРЗ Цикл
		СвойстваСтруктуры.Добавить(КлючЗначение.Ключ);
	КонецЦикла;
	
	Возврат ?(СвойстваСтруктуры.Количество() = 0, "", СтрСоединить(СвойстваСтруктуры, ","));
	
КонецФункции

// Функция - Колонки выборки в структуру
//
// Параметры:
//  РезультатЗапроса	 - РезультатЗапроса - Результат запроса
//  СписокКолонок	 	 - Строка 			- Список имен колонок добавляемых в структуру
//  ИсключитьКолонки	 - Строка 			- Список имен колонок исключаемых из структуры
//  ВключитьНачинаетсяС	 - Строка 			- Список имен колонок добавляемых в структуру начинающихся со строки
//  ИсключитьНачинаетсяС - Строка 			- Список имен колонок исключаемых из структуры начинающихся со строки
// 
// Возвращаемое значение:
//  Структура - Структура колонок выборки результата запроса
//
Функция КолонкиРезультатаЗапросаВСтруктуру(РезультатЗапроса, Знач СписокКолонок = "", Знач ИсключитьКолонки = "", 
	Знач ВключитьНачинаетсяС = "", Знач ИсключитьНачинаетсяС = "") Экспорт 
	
	СтруктураКолонок = Новый Структура();
	
	ВыполнятьПроверку = Ложь;
	
	Если ПустаяСтрока(СписокКолонок) Тогда
		СписокКолонок = Новый Массив();
	Иначе
		ВыполнятьПроверку = Истина;
		СписокКолонок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СписокКолонок, ",", Истина, Истина);
	КонецЕсли;
	
	Если ПустаяСтрока(ИсключитьКолонки) Тогда
		ИсключитьКолонки = Новый Массив();
	Иначе
		ВыполнятьПроверку = Истина;
		ИсключитьКолонки = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИсключитьКолонки, ",", Истина, Истина);
	КонецЕсли;
	
	Если ПустаяСтрока(ВключитьНачинаетсяС) Тогда
		ВключитьНачинаетсяС = Новый Массив();
	Иначе
		ВыполнятьПроверку = Истина;
		ВключитьНачинаетсяС = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВключитьНачинаетсяС, ",", Истина, Истина);
	КонецЕсли;
	
	Если ПустаяСтрока(ИсключитьНачинаетсяС) Тогда
		ИсключитьНачинаетсяС = Новый Массив();
	Иначе
		ВыполнятьПроверку = Истина;
		ИсключитьНачинаетсяС = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИсключитьНачинаетсяС, ",", Истина, Истина);
	КонецЕсли;
	
	Если СписокКолонок.Количество() > 0 Тогда
		СписокКолонок = ОбщегоНазначенияКлиентСервер.РазностьМассивов(СписокКолонок, ИсключитьКолонки);
		ИсключитьКолонки = Неопределено;
	Иначе
		СписокКолонок = Неопределено;
	КонецЕсли;
	
	Если ВключитьНачинаетсяС.Количество() > 0 Тогда
		ВключитьНачинаетсяС = ОбщегоНазначенияКлиентСервер.РазностьМассивов(ВключитьНачинаетсяС, ИсключитьНачинаетсяС);
		ИсключитьНачинаетсяС = Неопределено;
	Иначе
		ВключитьНачинаетсяС = Неопределено;
	КонецЕсли;
	
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		
		Если ВыполнятьПроверку Тогда
			
			Пропустить = Ложь;
			
			Если СписокКолонок <> Неопределено И СписокКолонок.Найти(Колонка.Имя) = Неопределено Тогда
				Пропустить = Истина;
			КонецЕсли;
			
			Если Не Пропустить И ИсключитьКолонки <> Неопределено И ИсключитьКолонки.Найти(Колонка.Имя) <> Неопределено Тогда
				Пропустить = Истина;
			КонецЕсли;
			
			Если Не Пропустить И ВключитьНачинаетсяС <> Неопределено Тогда
				Для Индекс = 0 По ВключитьНачинаетсяС.ВГраница() Цикл
					Если Не СтрНачинаетсяС(Колонка.Имя, ВключитьНачинаетсяС[Индекс]) Тогда
						Пропустить = Истина;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Если Не Пропустить И ИсключитьНачинаетсяС <> Неопределено Тогда
				Для Индекс = 0 По ИсключитьНачинаетсяС.ВГраница() Цикл
					Если СтрНачинаетсяС(Колонка.Имя, ИсключитьНачинаетсяС[Индекс]) Тогда
						Пропустить = Истина;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Если Пропустить Тогда
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		
		СтруктураКолонок.Вставить(Колонка.Имя);
		
	КонецЦикла;
	
	Возврат СтруктураКолонок;
	
КонецФункции

// Останавливает выполнение кода на заданное время.
//
// Параметры:
//  Секунд - Число - время ожидания в секундах.
//
Процедура Пауза(Знач Секунд) Экспорт
	
	Секунд = ОбщегоНазначения.ОписаниеТипаЧисло(2, , ДопустимыйЗнак.Неотрицательный).ПривестиЗначение(Секунд);
	Если Секунд > 30 Тогда
		Секунд = 30;
	КонецЕсли;
	
	ТекущийСеансИнформационнойБазы = ПолучитьТекущийСеансИнформационнойБазы();
	ФоновоеЗадание = ТекущийСеансИнформационнойБазы.ПолучитьФоновоеЗадание();
	
	Если ФоновоеЗадание = Неопределено Тогда
		Параметры = Новый Массив;
		Параметры.Добавить(Секунд);
		ФоновоеЗадание = ФоновыеЗадания.Выполнить("SUI_ОбщегоНазначения.Пауза", Параметры);
	КонецЕсли;
	
	ФоновоеЗадание.ОжидатьЗавершенияВыполнения(Секунд);
	
КонецПроцедуры

#Область ХранилищеОбщихНастроек

// Сохранить настройку по ключу в общих настройках Simple.
// 
// Параметры:
//  КлючНастройки - Строка - Ключ
//  Настройка - Произвольный - Настройка
//  ИмяПользователя - Строка, Неопределено - Имя пользователя настройки
Процедура ХранилищеОбщихНастроекСохранить(КлючНастройки, Настройка, ИмяПользователя = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ХранилищеОбщихНастроек.Сохранить(
		ПолучитьКлючОбъектаОбщихНастроек(), 
		СократитьКлючОбщихНастроек(КлючНастройки), 
		Настройка,
		,
		ИмяПользователя);
	
КонецПроцедуры

// Сохранить коллекцию настроек в общих настройках Simple.
// 
// Параметры:
//  КоллекцияНастроек - Соответствие из Произвольный - Коллекция настроек:
//  	* Ключ - Строка - Ключ
//  	* Значение - Произвольный - Настройка
//  ИмяПользователя - Неопределено - Имя пользователя
Процедура ХранилищеОбщихНастроекСохранитьНастройки(КоллекцияНастроек, ИмяПользователя = Неопределено) Экспорт
	
	Для Каждого ЭлементКоллекцииНастроек Из КоллекцияНастроек Цикл
		ХранилищеОбщихНастроекСохранить(ЭлементКоллекцииНастроек.Ключ, ЭлементКоллекцииНастроек.Значение, ИмяПользователя);
	КонецЦикла;
	
КонецПроцедуры

// Загрузить настройку по ключу из общих настроек Simple.
// 
// Параметры:
//  КлючНастройки - Строка - Ключ
//  ЗначениеПоУмолчанию - Произвольный - Значение по умолчанию
//  ИмяПользователя - Строка, Неопределено - Имя пользователя настройки
//	ПривестиКТипуПоУмолчанию - Булево - Привести результат к типу по умолчанию, 
//										если найдено и значение по умолчанию не равно Неопределено
// 
// Возвращаемое значение:
//  Произвольный, Неопределено - Значение настройки из общих настроек Simple по ключу.
Функция ХранилищеОбщихНастроекЗагрузить(КлючНастройки, ЗначениеПоУмолчанию = Неопределено, ИмяПользователя = Неопределено,
	ПривестиКТипуПоУмолчанию = Истина) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Неопределено;
	
	Результат = ХранилищеОбщихНастроек.Загрузить(
		ПолучитьКлючОбъектаОбщихНастроек(),
		СократитьКлючОбщихНастроек(КлючНастройки), 
		, 
		ИмяПользователя);
	
	Если Результат = Неопределено Или ОчиститьНесуществующиеСсылки(Результат) Тогда
		Результат = ЗначениеПоУмолчанию;
	ИначеЕсли ЗначениеПоУмолчанию <> Неопределено И ПривестиКТипуПоУмолчанию Тогда
		
		МассивТипов = Новый Массив();
		МассивТипов.Добавить(ТипЗнч(ЗначениеПоУмолчанию));
		ОписаниеТипа = Новый ОписаниеТипов(МассивТипов);
		
		Результат = ОписаниеТипа.ПривестиЗначение(Результат);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Загрузить значения настроек из общих настроек Simple в коллекцию настроек.
// 
// Параметры:
//  КоллекцияНастроек - Соответствие из Произвольный - Коллекция настроек:
//  	* Ключ - Строка - Ключ
//  	* Значение - Произвольный - Значение по умолчанию, если настройка по ключу не найдена.
//  ИмяПользователя - Строка, Неопределено - Имя пользователя настройки
//	ПривестиКТипуПоУмолчанию - Булево - Привести результат к типу по умолчанию, 
//										если найдено и значение по умолчанию не равно Неопределено
Процедура ХранилищеОбщихНастроекЗагрузитьНастройки(КоллекцияНастроек, ИмяПользователя = Неопределено,
	ПривестиКТипуПоУмолчанию = Истина) Экспорт
	
	Для Каждого ЭлементКоллекцииНастроек Из КоллекцияНастроек Цикл
		
		Результат = ХранилищеОбщихНастроекЗагрузить(
			ЭлементКоллекцииНастроек.Ключ, ЭлементКоллекцииНастроек.Значение, ИмяПользователя, ПривестиКТипуПоУмолчанию);
		
		КоллекцияНастроек.Вставить(ЭлементКоллекцииНастроек.Ключ, Результат);
		
	КонецЦикла;
	
КонецПроцедуры

// Удалить настройку по ключу в общих настройках Simple.
// 
// Параметры:
//  КлючНастройки - Строка - Ключ
//  ИмяПользователя - Строка, Неопределено - Имя пользователя настройки
Процедура ХранилищеОбщихНастроекУдалить(КлючНастройки, ИмяПользователя = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ХранилищеОбщихНастроек.Удалить(
		ПолучитьКлючОбъектаОбщихНастроек(), 
		СократитьКлючОбщихНастроек(КлючНастройки), 
		ИмяПользователя);
	
КонецПроцедуры

// Хранилище общих настроек удалить настройки.
// 
// Параметры:
//  КоллекцияНастроек - Соответствие из Произвольный - Коллекция настроек:
//  	* Ключ - Строка - Ключ
//  	* Значение - Произвольный - 
//  ИмяПользователя - Неопределено - Имя пользователя
Процедура ХранилищеОбщихНастроекУдалитьНастройки(КоллекцияНастроек, ИмяПользователя = Неопределено) Экспорт
	
	Для Каждого ЭлементКоллекцииНастроек Из КоллекцияНастроек Цикл
		ХранилищеОбщихНастроекУдалить(ЭлементКоллекцииНастроек.Ключ, ИмяПользователя);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СериализацияJSON

// Cм. метод глобального контекста - ЗаписатьJSON, параметр ИмяФункцииПреобразования.
// 
// Параметры:
//  Свойство - Строка - 
//  Значение - Произвольный - 
//  ДополнительныеПараметры - Произвольный - 
//  Отказ - Булево - 
// 
// Возвращаемое значение:
//  Строка - Преобразование данных JSON
Функция ПреобразованиеДанныхJSON(Свойство, Значение, ДополнительныеПараметры, Отказ) Экспорт
	
	ТипЗначения = ТипЗнч(Значение);
	Если ТипЗначения = Тип("Null") Тогда
		Возврат Неопределено;
	ИначеЕсли SUI_ОбщегоНазначенияПереопределяемый.ЭтоСсылка(ТипЗначения) Тогда
		Возврат SUI_ИнтеграцияВКонфигурацию.ИдентификаторSimpleПоСсылке(Значение);
	ИначеЕсли ТипЗначения = Тип("УникальныйИдентификатор") Тогда
		Возврат Строка(Значение);
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

Функция ВосстановлениеДанныхJSON_ВосстановитьДату(ДатаДляВосстановления) Экспорт
	
	// Проверка стандартных значений 2018-01-01T00:00:00, 2018-01-01T00:00:00Z, 2018-01-01T00:00:00+0000
	Если СтрДлина(ДатаДляВосстановления) <= 24 И 
		Сред(ДатаДляВосстановления, 5, 1) = "-" И 
		Сред(ДатаДляВосстановления, 8, 1) = "-" И 
		Сред(ДатаДляВосстановления, 11, 1) = "T" Тогда
		Возврат XMLЗначение(Тип("Дата"), ДатаДляВосстановления);
	КонецЕсли; 
	
	// Восстановление даты в формате дд.ММ.гггг
	ЧастиЗначенияДаты = СтрРазделить(ДатаДляВосстановления, ".");
	Если ЧастиЗначенияДаты.Количество() >= 3 Тогда
		Возврат Дата(Число(ЧастиЗначенияДаты[2]), Число(ЧастиЗначенияДаты[1]), Число(ЧастиЗначенияДаты[0]));
	КонецЕсли;
	
	// Восстановление даты в формате ММ/дд/гггг
	ЧастиЗначенияДаты = СтрРазделить(ДатаДляВосстановления, "/");
	Если ЧастиЗначенияДаты.Количество() >= 3 Тогда
		Возврат Дата(Число(ЧастиЗначенияДаты[2]), Число(ЧастиЗначенияДаты[0]), Число(ЧастиЗначенияДаты[1]));
	КонецЕсли; 
	
	Возврат ДатаДляВосстановления;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ХранилищеОбщихНастроек

Функция ПолучитьКлючОбъектаОбщихНастроек()
	
	Возврат "SUI_ОбщиеНастройкиSimple";
	
КонецФункции

Функция СократитьКлючОбщихНастроек(КлючНастроек)
	
	МаксимальнаяДлинаКлюча = 128;
	Результат = КлючНастроек;
	
	Если СтрДлина(КлючНастроек) > МаксимальнаяДлинаКлюча Тогда
		
		Результат = Лев(КлючНастроек, МаксимальнаяДлинаКлюча - 32);
		
		ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.MD5);
		ХешированиеДанных.Добавить(Сред(КлючНастроек, МаксимальнаяДлинаКлюча - 32 + 1));
		
		Результат = Результат + СтрЗаменить(ХешированиеДанных.ХешСумма, " ", "");
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

Функция ОчиститьНесуществующиеСсылки(Значение)
	
	Тип = ТипЗнч(Значение);
	Если Тип = Тип("Неопределено")
		Или Тип = Тип("Булево")
		Или Тип = Тип("Строка")
		Или Тип = Тип("Число")
		Или Тип = Тип("Дата") Тогда
		
		Возврат Ложь;
		
	ИначеЕсли Тип = Тип("Массив") Тогда
		
		Количество = Значение.Количество();
		Для Номер = 1 По Количество Цикл
			
			ОбратныйИндекс = Количество - Номер;
			
			Если ОчиститьНесуществующиеСсылки(Значение[ОбратныйИндекс]) Тогда
				Значение.Удалить(ОбратныйИндекс);
			КонецЕсли;
			
		КонецЦикла;
		
		Возврат Ложь;
		
	ИначеЕсли Тип = Тип("Структура") Или Тип = Тип("Соответствие") Тогда
		
		Для Каждого КлючИЗначение Из Значение Цикл
			
			Если ОчиститьНесуществующиеСсылки(КлючИЗначение.Значение) Тогда
				Значение.Вставить(КлючИЗначение.Ключ, Неопределено);
			КонецЕсли;
			
		КонецЦикла;
		
		Возврат Ложь;
		
	ИначеЕсли SUI_ОбщегоНазначенияПереопределяемый.ЭтоСсылка(Тип) Тогда
		
		Если Значение.Пустая() Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Значение, "Ссылка") = Неопределено;
		
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
