
#Область ПрограммныйИнтерфейс

Функция СтрокуТаблицыЗначенийВСоответствие(Знач СтрокаТаблицыЗначений, Знач СоответствиеПолей = "") Экспорт
	
	Соответствие = Новый Соответствие;
	
	Если ТипЗнч(СоответствиеПолей) <> Тип("Соответствие") Тогда 
		
		Если ТипЗнч(СоответствиеПолей) <> Тип("Строка") Тогда
			СоответствиеПолей = "";
		КонецЕсли;
		
		Если ПустаяСтрока(СоответствиеПолей) Тогда
			Для Каждого Колонка Из СтрокаТаблицыЗначений.Владелец().Колонки Цикл 
				СоответствиеПолей = СоответствиеПолей + ?(ПустаяСтрока(СоответствиеПолей), "", ",") + Колонка.Имя + "=" + Колонка.Имя;
			КонецЦикла;	
		КонецЕсли;      
		
		СоответствиеПолей = SUI_СтроковыеФункцииКлиентСервер.РазобратьСтрокуВСоответствие(СоответствиеПолей);
		
	КонецЕсли;
	            
	Для Каждого Колонка Из СтрокаТаблицыЗначений.Владелец().Колонки Цикл
		
		Ключ = СоответствиеПолей.Получить(Колонка.Имя);     
		
		Если Ключ = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		Соответствие.Вставить(Ключ, СтрокаТаблицыЗначений[Колонка.Имя]);
		
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции

// Получить имена колонок результата запроса.
// 
// Параметры:
//  РезультатЗапроса - РезультатЗапроса - Результат запроса
//  ИсключитьКолонки - Строка - Исключить колонки
//  ВернутьСтрокой - Булево - Вернуть строкой
// 
// Возвращаемое значение:
//  Строка, Массив из Строка - Получить имена колонок результата запроса
Функция ПолучитьИменаКолонокРезультатаЗапроса(РезультатЗапроса, ИсключитьКолонки = "", ВернутьСтрокой = Истина) Экспорт

	ИменаКолонок = Новый Массив();
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		ИменаКолонок.Добавить(Колонка.Имя);
	КонецЦикла;
	
	ИменаКолонок = ОбщегоНазначенияКлиентСервер.РазностьМассивов(ИменаКолонок, 
		СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИсключитьКолонки, ",", Истина, Истина));

	Если ВернутьСтрокой Тогда
		ИменаКолонок = СтрСоединить(ИменаКолонок, ",")
	КонецЕсли;
	
	Возврат ИменаКолонок;
	
КонецФункции

// Колонки результата запроса в строку.
// 
// Параметры:
//  РезультатЗапроса	 - РезультатЗапроса - Результат запроса
//  СписокКолонок	 	 - Строка 			- Список имен колонок добавляемых в структуру
//  ИсключитьКолонки	 - Строка 			- Список имен колонок исключаемых из структуры
//  ВключитьНачинаетсяС	 - Строка 			- Список имен колонок добавляемых в структуру начинающихся со строки
//  ИсключитьНачинаетсяС - Строка 			- Список имен колонок исключаемых из структуры начинающихся со строки
// 
// Возвращаемое значение:
//  Строка - Колонки результата запроса в строку
Функция КолонкиРезультатаЗапросаВСтроку(РезультатЗапроса, Знач СписокКолонок = "", Знач ИсключитьКолонки = "", 
	Знач ВключитьНачинаетсяС = "", Знач ИсключитьНачинаетсяС = "") Экспорт
	
	СтруктураРЗ = КолонкиРезультатаЗапросаВСтруктуру(РезультатЗапроса, СписокКолонок, ИсключитьКолонки, 
		ВключитьНачинаетсяС, ИсключитьНачинаетсяС);
	
	СвойстваСтруктуры = Новый Массив();
	Для Каждого КлючЗначение Из СтруктураРЗ Цикл
		СвойстваСтруктуры.Добавить(КлючЗначение.Ключ);
	КонецЦикла;
	
	Возврат ?(СвойстваСтруктуры.Количество() = 0, "", СтрСоединить(СвойстваСтруктуры, ","));
	
КонецФункции

// Функция - Колонки выборки в структуру
//
// Параметры:
//  РезультатЗапроса	 - РезультатЗапроса - Результат запроса
//  СписокКолонок	 	 - Строка 			- Список имен колонок добавляемых в структуру
//  ИсключитьКолонки	 - Строка 			- Список имен колонок исключаемых из структуры
//  ВключитьНачинаетсяС	 - Строка 			- Список имен колонок добавляемых в структуру начинающихся со строки
//  ИсключитьНачинаетсяС - Строка 			- Список имен колонок исключаемых из структуры начинающихся со строки
// 
// Возвращаемое значение:
//  Структура - Структура колонок выборки результата запроса
//
Функция КолонкиРезультатаЗапросаВСтруктуру(РезультатЗапроса, Знач СписокКолонок = "", Знач ИсключитьКолонки = "", 
	Знач ВключитьНачинаетсяС = "", Знач ИсключитьНачинаетсяС = "") Экспорт 
	
	СтруктураКолонок = Новый Структура();
	
	ВыполнятьПроверку = Ложь;
	
	Если ПустаяСтрока(СписокКолонок) Тогда
		СписокКолонок = Новый Массив();
	Иначе
		ВыполнятьПроверку = Истина;
		СписокКолонок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СписокКолонок, ",", Истина, Истина);
	КонецЕсли;
	
	Если ПустаяСтрока(ИсключитьКолонки) Тогда
		ИсключитьКолонки = Новый Массив();
	Иначе
		ВыполнятьПроверку = Истина;
		ИсключитьКолонки = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИсключитьКолонки, ",", Истина, Истина);
	КонецЕсли;
	
	Если ПустаяСтрока(ВключитьНачинаетсяС) Тогда
		ВключитьНачинаетсяС = Новый Массив();
	Иначе
		ВыполнятьПроверку = Истина;
		ВключитьНачинаетсяС = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВключитьНачинаетсяС, ",", Истина, Истина);
	КонецЕсли;
	
	Если ПустаяСтрока(ИсключитьНачинаетсяС) Тогда
		ИсключитьНачинаетсяС = Новый Массив();
	Иначе
		ВыполнятьПроверку = Истина;
		ИсключитьНачинаетсяС = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИсключитьНачинаетсяС, ",", Истина, Истина);
	КонецЕсли;
	
	Если СписокКолонок.Количество() > 0 Тогда
		СписокКолонок = ОбщегоНазначенияКлиентСервер.РазностьМассивов(СписокКолонок, ИсключитьКолонки);
		ИсключитьКолонки = Неопределено;
	Иначе
		СписокКолонок = Неопределено;
	КонецЕсли;
	
	Если ВключитьНачинаетсяС.Количество() > 0 Тогда
		ВключитьНачинаетсяС = ОбщегоНазначенияКлиентСервер.РазностьМассивов(ВключитьНачинаетсяС, ИсключитьНачинаетсяС);
		ИсключитьНачинаетсяС = Неопределено;
	Иначе
		ВключитьНачинаетсяС = Неопределено;
	КонецЕсли;
	
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		
		Если ВыполнятьПроверку Тогда
			
			Пропустить = Ложь;
			
			Если СписокКолонок <> Неопределено И СписокКолонок.Найти(Колонка.Имя) = Неопределено Тогда
				Пропустить = Истина;
			КонецЕсли;
			
			Если Не Пропустить И ИсключитьКолонки <> Неопределено И ИсключитьКолонки.Найти(Колонка.Имя) <> Неопределено Тогда
				Пропустить = Истина;
			КонецЕсли;
			
			Если Не Пропустить И ВключитьНачинаетсяС <> Неопределено Тогда
				Для Индекс = 0 По ВключитьНачинаетсяС.ВГраница() Цикл
					Если Не СтрНачинаетсяС(Колонка.Имя, ВключитьНачинаетсяС[Индекс]) Тогда
						Пропустить = Истина;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Если Не Пропустить И ИсключитьНачинаетсяС <> Неопределено Тогда
				Для Индекс = 0 По ИсключитьНачинаетсяС.ВГраница() Цикл
					Если СтрНачинаетсяС(Колонка.Имя, ИсключитьНачинаетсяС[Индекс]) Тогда
						Пропустить = Истина;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Если Пропустить Тогда
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		
		СтруктураКолонок.Вставить(Колонка.Имя);
		
	КонецЦикла;
	
	Возврат СтруктураКолонок;
	
КонецФункции

// Останавливает выполнение кода на заданное время.
//
// Параметры:
//  Секунд - Число - время ожидания в секундах.
//
Процедура Пауза(Знач Секунд) Экспорт
	
	Секунд = ОбщегоНазначения.ОписаниеТипаЧисло(2, , ДопустимыйЗнак.Неотрицательный).ПривестиЗначение(Секунд);
	Если Секунд > 30 Тогда
		Секунд = 30;
	КонецЕсли;
	
	ТекущийСеансИнформационнойБазы = ПолучитьТекущийСеансИнформационнойБазы();
	ФоновоеЗадание = ТекущийСеансИнформационнойБазы.ПолучитьФоновоеЗадание();
	
	Если ФоновоеЗадание = Неопределено Тогда
		Параметры = Новый Массив;
		Параметры.Добавить(Секунд);
		ФоновоеЗадание = ФоновыеЗадания.Выполнить("SUI_ОбщегоНазначения.Пауза", Параметры);
	КонецЕсли;
	
	ФоновоеЗадание.ОжидатьЗавершенияВыполнения(Секунд);
	
КонецПроцедуры

Функция ЭтоОбъект(ПроверяемоеЗначение) Экспорт
	
	ПроверяемыйТип = XMLТип(ТипЗнч(ПроверяемоеЗначение));
	
	Если ПроверяемыйТип <> Неопределено Тогда
		ПроверяемыйТип = СтрРазделить(ПроверяемыйТип.ИмяТипа, ".");
		Если ПроверяемыйТип.Количество() > 1 И Прав(ПроверяемыйТип[0], 6) = "Object" Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Объект XDTO из строки JSON.
// 
// Параметры:
//  СтрокаJSON - Строка - Строка JSON
//  ТипОбъектаXDTO - ТипЗначенияXDTO, ТипОбъектаXDTO - Тип элемента данных XDTO. Если тип не указан, то будет сделана попытка определить тип данных по текущему состоянию объекта ЧтениеJSON.
//  ИмяФункцииВосстановления - Строка - Имя функции восстановления значения. Функция должна иметь следующие параметры: <Свойство> - значение типа Строка, <Тип> - значение типа ТипОбъектаXDTO, <Значение> - значение допустимого для сериализации типа, <ДополнительныеПараметры>.
// 	МодульФункцииВосстановления - ОбщийМодуль, КомандаКомандногоИнтерфейса, ФормаКлиентскогоПриложения, Неопределено - Указывает модуль, процедура которого будет использована для восстановления значения.
// 	ДополнительныеПараметрыФункцииВосстановления - Произвольный - Дополнительные параметры функции восстановления
// 	ТипыДляОбработкиВосстановления - Массив из ТипОбъектаXDTO - (Массив объектов ТипОбъектаXDTO, соответствующих типам XDTO, для которых требуется вызвать функцию восстановления. Если функция восстановления не задана, то параметры <ТипыДляОбработкиВосстановления> и <ИменаСвойствДляВосстановления> игнорируются.
//	ИменаСвойствДляВосстановления - Массив из Строка - Имена свойств, для которых нужно вызвать функцию восстановления. Если функция восстановления не задана, то параметры <ТипыДляОбработкиВосстановления> и <ИменаСвойствДляВосстановления> игнорируются.
// 
// Возвращаемое значение:
//  ОбъектXDTO - Объект XDTO из строки JSON.
//@skip-check method-too-many-params
Функция ОбъектXDTOИзСтрокиJSON(СтрокаJSON, ТипОбъектаXDTO = Неопределено, ИмяФункцииВосстановления = Неопределено, МодульФункцииВосстановления = Неопределено,
	ДополнительныеПараметрыФункцииВосстановления = Неопределено, ТипыДляОбработкиВосстановления = Неопределено, ИменаСвойствДляВосстановления = Неопределено) Экспорт
	
	Чтение = Новый ЧтениеJSON();
	Чтение.УстановитьСтроку(СтрокаJSON);
	Результат = ФабрикаXDTO.ПрочитатьJSON(Чтение, ТипОбъектаXDTO, ИмяФункцииВосстановления, МодульФункцииВосстановления,
		ДополнительныеПараметрыФункцииВосстановления, ТипыДляОбработкиВосстановления, ИменаСвойствДляВосстановления);
	Чтение.Закрыть();
	
	Возврат Результат;
	
КонецФункции

Функция ОбъектXDTOВСтрокуJSON(ОбъектXDTO, Знач Фабрика = Неопределено) Экспорт
	
	ОбъектXDTO.Проверить();
	
	Если Фабрика = Неопределено Тогда
		Фабрика = ФабрикаXDTO;
	КонецЕсли;
	
	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(, Символы.Таб);
	
	Запись = Новый ЗаписьJSON();
	Запись.УстановитьСтроку(ПараметрыЗаписи);
	Фабрика.ЗаписатьJSON(Запись, ОбъектXDTO);
	Возврат Запись.Закрыть();
	
КонецФункции

Процедура ПередВыполнениемПроизвольногоАлгоритма() Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.БазоваяФункциональность") Тогда
		МодульРаботаВМоделиСервиса = ОбщегоНазначения.ОбщийМодуль("РаботаВМоделиСервиса");
		МассивРазделителей = МодульРаботаВМоделиСервиса.РазделителиКонфигурации();
	Иначе
		МассивРазделителей = Новый Массив();
	КонецЕсли;
	
	Для Каждого ИмяРазделителя Из МассивРазделителей Цикл
		
		УстановитьБезопасныйРежимРазделенияДанных(ИмяРазделителя, Истина);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСсылочныеТипыИзОписанияТипов(Описание) Экспорт
	
	СсылочныеТипы = Новый Массив();
	
	Если ТипЗнч(Описание) = Тип("ОписаниеТипов") Тогда
		
		Для Каждого Тип Из Описание.Типы() Цикл
			
			Если SUI_ОбщегоНазначенияПереопределяемый.ЭтоСсылка(Тип) Тогда
				СсылочныеТипы.Добавить(Тип);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат СсылочныеТипы;
	
КонецФункции

Функция ПолучитьПервыйСсылочныеТипВОписанииТипов(Описание) Экспорт
	
	СсылочныеТипы = ПолучитьСсылочныеТипыИзОписанияТипов(Описание);
	
	Возврат ?(СсылочныеТипы.Количество() > 0, СсылочныеТипы[0], Неопределено);
	
КонецФункции

#Область СериализацияJSON

// Cм. метод глобального контекста - ЗаписатьJSON, параметр ИмяФункцииПреобразования.
// 
// Параметры:
//  Свойство - Строка - 
//  Значение - Произвольный - 
//  ДополнительныеПараметры - Произвольный - 
//  Отказ - Булево - 
// 
// Возвращаемое значение:
//  Строка - Преобразование данных JSON
Функция ПреобразованиеДанныхJSON(Свойство, Значение, ДополнительныеПараметры, Отказ) Экспорт
	
	ТипЗначения = ТипЗнч(Значение);
	Если ТипЗначения = Тип("Null") Тогда
		Возврат Неопределено;
	ИначеЕсли SUI_ОбщегоНазначенияПереопределяемый.ЭтоСсылка(ТипЗначения) Тогда
		Возврат SUI_ИнтеграцияВКонфигурацию.ИдентификаторSimpleПоСсылке(Значение);
	ИначеЕсли ТипЗначения = Тип("УникальныйИдентификатор") Тогда
		Возврат Строка(Значение);
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

Функция ВосстановлениеДанныхJSON_ВосстановитьДату(ДатаДляВосстановления) Экспорт
	
	// Проверка стандартных значений 2018-01-01T00:00:00, 2018-01-01T00:00:00Z, 2018-01-01T00:00:00+0000
	Если СтрДлина(ДатаДляВосстановления) <= 24 И 
		Сред(ДатаДляВосстановления, 5, 1) = "-" И 
		Сред(ДатаДляВосстановления, 8, 1) = "-" И 
		Сред(ДатаДляВосстановления, 11, 1) = "T" Тогда
		Возврат XMLЗначение(Тип("Дата"), ДатаДляВосстановления);
	КонецЕсли; 
	
	// Восстановление даты в формате дд.ММ.гггг
	ЧастиЗначенияДаты = СтрРазделить(ДатаДляВосстановления, ".");
	Если ЧастиЗначенияДаты.Количество() >= 3 Тогда
		Возврат Дата(Число(ЧастиЗначенияДаты[2]), Число(ЧастиЗначенияДаты[1]), Число(ЧастиЗначенияДаты[0]));
	КонецЕсли;
	
	// Восстановление даты в формате ММ/дд/гггг
	ЧастиЗначенияДаты = СтрРазделить(ДатаДляВосстановления, "/");
	Если ЧастиЗначенияДаты.Количество() >= 3 Тогда
		Возврат Дата(Число(ЧастиЗначенияДаты[2]), Число(ЧастиЗначенияДаты[0]), Число(ЧастиЗначенияДаты[1]));
	КонецЕсли; 
	
	Возврат ДатаДляВосстановления;
	
КонецФункции

#КонецОбласти

#КонецОбласти
