
#Область ПрограммныйИнтерфейс

// Выполнить запрос состава кодов маркировки.
// 
// Параметры:
//  Штрихкоды - Массив из Строка - Штрихкоды кодов маркировки к запросу состава
// 
// Возвращаемое значение:
//  Массив из Структура - Результат выполнения запроса состава КМ. Описание в интеграционной обработке
Функция ВыполнитьЗапросСоставаКодовМаркировки(Штрихкоды) Экспорт
	
	SUI_ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		"SUI_ИнтеграцияГИСМТ.ВыполнитьЗапросСоставаКодовМаркировки",
		"Штрихкоды", Штрихкоды, Тип("Массив"));
	
	ПараметрыКоманды = Новый Структура();
	ПараметрыКоманды.Вставить("Штрихкоды", Штрихкоды);
	
	РезультатВыполнения = ВыполнитьКомандуИнтеграционнойОбработки("ЗапросСоставаКодовМаркировки", ПараметрыКоманды);
	
	Возврат РезультатВыполнения.СоставКодовМаркировки;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИмяВнешнейИнтеграционнойОбработки()
	
	Возврат "SimpleИнтеграцияГИСМТ";
	
КонецФункции

Функция ПолучитьПодключеннуюИнтеграционнуюОбработку()
	
	SUI_ОбщегоНазначенияКлиентСервер.Проверить(
		SUI_ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки"),
		НСтр("ru = 'Отсутствует подсистема ""СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки"".'"));
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту("ИмяОбъекта", ИмяВнешнейИнтеграционнойОбработки());
	
КонецФункции

Функция ВыполнитьКомандуИнтеграционнойОбработки(ИдентификаторКоманды, ПараметрыКоманды = Неопределено)
	
	ИмяТекущейФункции = "SUI_ИнтеграцияГИСМТ.ВыполнитьКомандуВнешнейОбработки";
	
	ВнешняяОбработкаСсылка = ПолучитьПодключеннуюИнтеграционнуюОбработку();
	
	SUI_ОбщегоНазначенияКлиентСервер.Проверить(Не ВнешняяОбработкаСсылка.Пустая(),
		НСтр("ru = 'Не подключена интеграционная обработка ГИС МТ.'"));
	
	SUI_ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(ИмяТекущейФункции, 
		"ИдентификаторКоманды", ИдентификаторКоманды, Тип("Строка"));
	
	ПараметрыКомандыОбработки = Новый Структура;
	ПараметрыКомандыОбработки.Вставить("ДополнительнаяОбработкаСсылка", ВнешняяОбработкаСсылка);
	ПараметрыКомандыОбработки.Вставить("ИдентификаторКоманды", ИдентификаторКоманды);
	ПараметрыКомандыОбработки.Вставить("ОбъектыНазначения", Новый Массив());
	
	Если ПараметрыКоманды <> Неопределено Тогда
		
		ТипыСтруктуры = Новый Массив();
		ТипыСтруктуры.Добавить(Тип("Структура"));
		ТипыСтруктуры.Добавить(Тип("ФиксированнаяСтруктура"));
		
		SUI_ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(ИмяТекущейФункции, 
			"ПараметрыКоманды", ПараметрыКоманды, ТипыСтруктуры);
		
		Для Каждого ПараметрКоманды Из ПараметрыКоманды Цикл
			ПараметрыКомандыОбработки.Вставить(ПараметрКоманды.Ключ, ПараметрКоманды.Значение);
		КонецЦикла;
		
	КонецЕсли;
	
	МодульДополнительныеОтчетыИОбработки = SUI_ОбщегоНазначения.ОбщийМодуль("ДополнительныеОтчетыИОбработки");
	РезультатВыполнения = МодульДополнительныеОтчетыИОбработки.ВыполнитьКоманду(ПараметрыКомандыОбработки);
	
	Возврат РезультатВыполнения;
	
КонецФункции

#КонецОбласти
