
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если Отказ Или ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.Проверить(
		Отбор.МобильноеУстройство.Значение <> ПланыОбмена.SUI_МобильныеУстройства.ЭтотУзел(),
		НСтр("ru = 'Установка состояния главного узла недопустима'"));
	
	ДатаОбновления = ТекущаяДатаСеанса();
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		Запись.ДатаОбновления = ДатаОбновления;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
