
#Область ПрограммныйИнтерфейс

Функция ИмяСобытия(ВложенноеСобытие = "") Экспорт 
	Возврат НСтр("ru = 'Документы обмена'") + ?(ПустаяСтрока(ВложенноеСобытие), "", ". " + ВложенноеСобытие);	
КонецФункции

Функция СформироватьИдентификаторСтрокиТабличнойЧастиДокументаОбмена(ТабличнаяЧасть) Экспорт
	
	ИдентификаторСтроки = Новый УникальныйИдентификатор();
	
	Пока ТабличнаяЧасть.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки)).Количество() > 0 Цикл
		ИдентификаторСтроки = Новый УникальныйИдентификатор();
	КонецЦикла;
	
	Возврат ИдентификаторСтроки;
	
КонецФункции

#КонецОбласти
