
#Область ПрограммныйИнтерфейс

Функция ИмяСобытия(ВложенноеСобытие = "") Экспорт 
	Возврат НСтр("ru = 'Документы обмена'") + ?(ПустаяСтрока(ВложенноеСобытие), "", ". " + ВложенноеСобытие);	
КонецФункции

Функция ИмяСобытияЗадание(ВложенноеСобытие = "") Экспорт 
	Возврат ИмяСобытия(НСтр("ru = 'Фоновое задание'")) + ?(ПустаяСтрока(ВложенноеСобытие), "", ". " + ВложенноеСобытие);	
КонецФункции

Функция ПараметрыОткрытияЖурналаРегистрации(ДокументСсылка = Неопределено, Уровень = Неопределено, Период = Неопределено) Экспорт 
	
	Перем НачальнаяДата, КонечнаяДата;
	
	Если ТипЗнч(Период) = Тип("СтандартныйПериод") Тогда
		
		Если ЗначениеЗаполнено(Период.ДатаНачала) Тогда
			НачальнаяДата = Период.ДатаНачала;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
			КонечнаяДата = Период.ДатаОкончания;
		КонецЕсли;

	КонецЕсли;
	
	Возврат SUI_ЖурналРегистрацииВызовСервера.ПараметрыОткрытияЖурналаРегистрации(ИмяСобытия(), 
		НачальнаяДата, КонечнаяДата, Уровень, , ДокументСсылка);
	
КонецФункции

Функция ДополнительныеНастройки_КлючАлгоритмыПризнакаМаркировки() Экспорт
	Возврат "АлгоритмыПолученияПризнакаМаркировки";
КонецФункции

Функция ДополнительныеНастройки_КлючАлгоритмыДополнительныхРеквизитов() Экспорт
	Возврат "АлгоритмыПолученияДополнительныхРеквизитов";
КонецФункции

Функция ДополнительныеНастройки_КлючАлгоритмыПолученияСтатусаУказанияСерии() Экспорт
	Возврат "АлгоритмыПолученияСтатусаУказанияСерии";
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция КлючиРегламентныхЗаданий() Экспорт
	
	Ключи = Новый Структура();
	Ключи.Вставить("ВыполнитьОчисткуОбработанныхДокументов", "Simple2cbe97c585a6e49e65fe289379387be9");
	
	Возврат Новый ФиксированнаяСтруктура(Ключи);
	
КонецФункции

#КонецОбласти
