
#Область ПрограммныйИнтерфейс

// Возвращает имя объекта метаданных по типу.
//
// Параметры:
//  Источник - Тип - объект.
//
// Возвращаемое значение:
//   Строка
//
Функция ИмяОбъектаМетаданных(Тип) Экспорт
	ОбъектМетаданных = Метаданные.НайтиПоТипу(Тип);
	Если ОбъектМетаданных = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат ОбъектМетаданных.Имя;
КонецФункции

// Устарела. см. SUI_ОбщегоНазначенияВызовСервера.ДанныеВСтрокуJSON
//
Функция СтрокаJSON(Данные) Экспорт
	Возврат ДанныеВСтрокуJSON(Данные, , "ПреобразованиеДанныхJSON", SUI_ОбщегоНазначения);
КонецФункции

Функция ИменаПодсистем() Экспорт
	
	Возврат SUI_СтандартныеПодсистемыПовтИсп.ИменаПодсистем();
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// см. SUI_ОбщегоНазначенияКлиентСервер.ДанныеВСтрокуJSON
//@skip-check method-too-many-params
//@skip-check doc-comment-parameter-section
//@skip-check doc-comment-export-function-return-section
Функция ДанныеВСтрокуJSON(Значение, НастройкиСериализации = Неопределено, ИмяФункцииПреобразования = "", 
	МодульФункцииПреобразования = Неопределено, ДополнительныеПараметрыФункцииПреобразования = Неопределено) Экспорт
	
	Возврат SUI_ОбщегоНазначенияКлиентСервер.ДанныеВСтрокуJSON(Значение, НастройкиСериализации, 
		ИмяФункцииПреобразования, МодульФункцииПреобразования, ДополнительныеПараметрыФункцииПреобразования);
		
КонецФункции

// см. SUI_ОбщегоНазначенияКлиентСервер.ДанныеИзСтрокиJSON
//@skip-check method-too-many-params
//@skip-check doc-comment-parameter-section
//@skip-check doc-comment-export-function-return-section
Функция ДанныеИзСтрокиJSON(СтрокаJSON, ПрочитатьВСоответствие = Истина, ИменаСвойствСоЗначениямиДата = "", 
	ОжидаемыйФорматДаты = Неопределено, ИмяФункцииВосстановления = Неопределено, 
	МодульФункцииВосстановления = Неопределено, ДополнительныеПараметрыФункцииВосстановления = Неопределено, 
	ИменаСвойствДляОбработкиВосстановления = Неопределено) Экспорт
	
	Возврат SUI_ОбщегоНазначенияКлиентСервер.ДанныеИзСтрокиJSON(СтрокаJSON, ПрочитатьВСоответствие, 
		ИменаСвойствСоЗначениямиДата, ОжидаемыйФорматДаты, ИмяФункцииВосстановления, МодульФункцииВосстановления,
		ДополнительныеПараметрыФункцииВосстановления, ИменаСвойствДляОбработкиВосстановления);
		
КонецФункции

#КонецОбласти
