
#Область ПрограммныйИнтерфейс

Процедура ВыгрузитьЗаписиЛогированияHTTPЗапросов(ФормаВладелец, ОповещениеОЗавершении, ПараметрыВыгрузки) Экспорт 

	Контекст = Новый Структура("ОповещениеОЗавершении", ОповещениеОЗавершении);

	Оповещение = Новый ОписаниеОповещения("ВыгрузитьЗаписиЛогированияHTTPЗапросовПродолжить", ЭтотОбъект, Контекст);
	
	ДлительнаяОперация = SUI_ЛогированиеHTTPЗапросовВызовСервера.ВыгрузитьЛогированиеHTTPЗапросовВФайл(ПараметрыВыгрузки);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ФормаВладелец);
	
	ПараметрыОжидания.Заголовок 					= НСтр("ru = 'Выгрузка записей логирования HTTP запросов'");
	ПараметрыОжидания.ВыводитьПрогрессВыполнения 	= Истина;
	ПараметрыОжидания.ВыводитьСообщения 			= Истина;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ВыгрузитьЗаписиЛогированияHTTPЗапросовПродолжить(Результат, Контекст) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Результат.Сообщения) Тогда
		
		Для индекс = 0 По Результат.Сообщения.ВГраница() Цикл
			Результат.Сообщения[индекс].Сообщить();
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Результат.КраткоеПредставлениеОшибки) Тогда
		ПоказатьПредупреждение(, Результат.КраткоеПредставлениеОшибки);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Результат.ПодробноеПредставлениеОшибки) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда

		ИмяФайла = СтрШаблон("%1_logging_%2.zip", 
			SUI_SimpleКлиентСервер.ИмяРасширения(), Формат(ОбщегоНазначенияКлиент.ДатаСеанса(), "ДФ=yyyyMMdd_HHmmss;"));
 
		Оповещение = Новый ОписаниеОповещения("ВыгрузитьЗаписиЛогированияHTTPЗапросовЗавершение", ЭтотОбъект, Контекст);
		
		ПараметрыСохранения = ФайловаяСистемаКлиент.ПараметрыСохраненияФайла();
		ПараметрыСохранения.Диалог.Заголовок = СтрШаблон(НСтр("ru = 'Сохранить логирование HTTP запросов %1'"), SUI_SimpleКлиентСервер.Представление());
		ПараметрыСохранения.Диалог.Фильтр = СтрШаблон("Логирование HTTP запросов %1 (*.zip)|*.zip", SUI_SimpleКлиентСервер.Представление());
		
		ФайловаяСистемаКлиент.СохранитьФайл(Оповещение, Результат.АдресРезультата, ИмяФайла, ПараметрыСохранения);
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыгрузитьЗаписиЛогированияHTTPЗапросовЗавершение(ВыгруженныеФайлы, Контекст) Экспорт

	Если Не ЗначениеЗаполнено(ВыгруженныеФайлы) Тогда
		Возврат;
	КонецЕсли;

	ФайловаяСистемаКлиент.ОткрытьПроводник(ВыгруженныеФайлы[0].ПолноеИмя);

	Если ТипЗнч(Контекст.ОповещениеОЗавершении) = Тип("ОписаниеОповещения") Тогда
		ВыполнитьОбработкуОповещения(Контекст.ОповещениеОЗавершении, Новый Структура("ПутьКФайлу", ВыгруженныеФайлы[0].ПолноеИмя));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти