
#Область ПрограммныйИнтерфейс

Процедура СоздатьШтрихкодНоменклатуры(Алгоритм, Штрихкод, Номенклатура, Характеристика, Упаковка) Экспорт
	
	ПараметрыМетода = SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.МассивЗначений(
		Штрихкод, Номенклатура, Характеристика, Упаковка);
	
	Обработки.SUI_РедакторКода.ВыполнитьКодЧерезМетодКонфигурации(
		"SUI_ШтрихкодыНоменклатуры.СоздатьШтрихкодНоменклатурыПоАлгоритму",
		Алгоритм, ПараметрыМетода, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура СоздатьШтрихкодНоменклатурыПоАлгоритму(Алгоритм, Штрихкод, Номенклатура, Характеристика, Упаковка) Экспорт
	
	Если ЗначениеЗаполнено(Алгоритм) Тогда
		
		Попытка
			УстановитьБезопасныйРежим(Истина);
			SUI_ОбщегоНазначения.ПередВыполнениемПроизвольногоАлгоритма();
			Выполнить(Алгоритм);
			УстановитьБезопасныйРежим(Ложь);
		Исключение
			ШаблонСообщения = НСтр("ru = 'Ошибка выполнения алгоритма создания штрихкода номенклатуры.
			|Проверьте алгоритм в настройках штрихкодов номенклатуры подсистемы %1.
			|
			|%2'");
			ВызватьИсключение СтрШаблон(ШаблонСообщения, SUI_SimpleКлиентСервер.Представление(), 
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	Иначе
		Штрихкод = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
