
#Область ПрограммныйИнтерфейс

Функция СоздатьШтрихкодНоменклатуры(Алгоритм, Штрихкод, Номенклатура, Характеристика, Упаковка) Экспорт

	Если ЗначениеЗаполнено(Алгоритм) Тогда
		
		Попытка
			УстановитьБезопасныйРежим(Истина);
			Выполнить(Алгоритм);
		Исключение
			SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(SUI_ШтрихкодыНоменклатурыКлиентСервер.ИмяСобытия(), , 
				Метаданные.ОбщиеМодули.SUI_ШтрихкодыНоменклатуры, Алгоритм, ИнформацияОбОшибке());
			ВызватьИсключение СтрШаблон(НСтр("ru = 'При выполнении алгоритма ""Создания штрихкода номенклатуры"" возникла исключительная ошибка:
			|%1.
			|Проверьте алгоритм создания штрихкода номенклатуры в настройках подсистемы Simple.'"), 
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
		Возврат Истина;
		
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
