
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьТаблицуЭталон() Экспорт
	
	Таблица = Новый ТаблицаЗначений();
	
	Для Каждого Колонка Из SUI_ДокументыОбменаПовтИсп.КолонкиТаблицыШтрихкодыУпаковокДокументовОбмена() Цикл
		Таблица.Колонки.Добавить(Колонка.Имя, Колонка.Тип, Колонка.Заголовок);
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

Процедура ЗагрузитьОтсканированныеШтрихкоды(ИдентификаторДокументаОбмена, ЗагружаемаяТаблица) Экспорт
	
	Если ЗагружаемаяТаблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИдентификаторДокументаОбмена", ИдентификаторДокументаОбмена);
	Запрос.УстановитьПараметр("ЗагружаемаяТаблица", ЗагружаемаяТаблица);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗагружаемаяТаблица.hash,
		|	ЗагружаемаяТаблица.barcode,
		|	ЗагружаемаяТаблица.id_barcode
		|ПОМЕСТИТЬ втЗагружаемаяТаблица
		|ИЗ
		|	&ЗагружаемаяТаблица КАК ЗагружаемаяТаблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ШтрихкодыУпаковок.sid_doc, &ИдентификаторДокументаОбмена) КАК sid_doc,
		|	втЗагружаемаяТаблица.hash,
		|	втЗагружаемаяТаблица.barcode,
		|	втЗагружаемаяТаблица.id_barcode,
		|	ЕСТЬNULL(ШтрихкодыУпаковок.additional_details, """") КАК additional_details,
		|	ЕСТЬNULL(ШтрихкодыУпаковок.ДатаЗаписи, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаЗаписи
		|ИЗ
		|	втЗагружаемаяТаблица КАК втЗагружаемаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.SUI_ШтрихкодыУпаковокДокументовОбмена КАК ШтрихкодыУпаковок
		|		ПО ШтрихкодыУпаковок.sid_doc = &ИдентификаторДокументаОбмена
		|		И втЗагружаемаяТаблица.hash = ШтрихкодыУпаковок.hash";
	
	Попытка
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Запись = СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			
			Если ЗначениеЗаполнено(Запись.ДатаЗаписи) Тогда
				Запись.ДатаОбновления = ТекущаяДатаСеанса();
			Иначе
				Запись.ДатаЗаписи = ТекущаяДатаСеанса();
			КонецЕсли;
			
			Запись.Записать();
			
		КонецЦикла;
		
	Исключение
		ТекстОшибки = НСтр("ru = 'Не удалось записать обработанные штрихкоды упаковок документа обмена (%1)!'");
		ТекстОшибки = СтрШаблон(ТекстОшибки, ИдентификаторДокументаОбмена);
		ВызватьИсключение(ТекстОшибки, , , , ИнформацияОбОшибке());
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьШтрихкодыУпаковок(Отбор = Неопределено, Первые = 0) Экспорт
	
	Запрос = СформироватьЗапросОтсканированныеШтрихкоды(Отбор, Первые);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьЗапросОтсканированныеШтрихкоды(Отбор = Неопределено, Первые = 0, ПоместитьВ = "", МенеджерВТ = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ШтрихкодыУпаковок.sid_doc,
		|	ШтрихкодыУпаковок.hash,
		|	ШтрихкодыУпаковок.barcode,
		|	ШтрихкодыУпаковок.id_barcode,
		|	ШтрихкодыУпаковок.additional_details,
		|	ШтрихкодыУпаковок.ДатаЗаписи,
		|	ШтрихкодыУпаковок.ДатаОбновления
		|ИЗ
		|	РегистрСведений.SUI_ШтрихкодыУпаковокДокументовОбмена КАК ШтрихкодыУпаковок";
	
	ПерезагрузитьТекстЗапроса = Ложь;
	
	СхемаЗапроса = Новый СхемаЗапроса();
	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
	
	ЗапросПакета = СхемаЗапроса.ПакетЗапросов[СхемаЗапроса.ПакетЗапросов.Количество() - 1];
	ОператорыПакета = ЗапросПакета.Операторы[0];
	
	Если Первые > 0 Тогда
		
		ОператорыПакета.КоличествоПолучаемыхЗаписей = Первые;
		ПерезагрузитьТекстЗапроса = Истина;
		
	КонецЕсли;
	
	Если Отбор <> Неопределено Тогда
		
		ИмяФункцииВызова = "РегистрыСведений.SUI_ШтрихкодыУпаковокДокументовОбмена.СформироватьЗапросОтсканированныеШтрихкоды";
		
		ПроверяемыеТипыОтбора = Новый Массив();
		ПроверяемыеТипыОтбора.Добавить(Тип("Структура"));
		ПроверяемыеТипыОтбора.Добавить(Тип("ФиксированнаяСтруктура"));
		ПроверяемыеТипыОтбора.Добавить(Тип("Соответствие"));
		ПроверяемыеТипыОтбора.Добавить(Тип("ФиксированнаяСтруктура"));
		
		SUI_ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(ИмяФункцииВызова, "Отбор", Отбор, 
			Новый ОписаниеТипов(ПроверяемыеТипыОтбора));
		
		Для Каждого КлючЗначение Из Отбор Цикл
		
			ТипЗначения = ТипЗнч(КлючЗначение.Значение);
			КлючПараметра = СтрЗаменить(КлючЗначение.Ключ, ".", "_");
			
			Если ТипЗначения = Тип("Массив") Или 
				ТипЗначения = Тип("ФиксированныйМассив") Или
				ТипЗначения = Тип("СписокЗначений") Тогда
				
				ОператорыПакета.Отбор.Добавить(СтрШаблон("%1 В (&%2)", КлючЗначение.Ключ, КлючПараметра));
				
			Иначе
				ОператорыПакета.Отбор.Добавить(СтрШаблон("%1 = &%2", КлючЗначение.Ключ, КлючПараметра));
			КонецЕсли;
			
			Запрос.УстановитьПараметр(КлючПараметра, КлючЗначение.Значение);
			
			ПерезагрузитьТекстЗапроса = Истина;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Не ПустаяСтрока(ПоместитьВ) Тогда
		
		Если МенеджерВТ = Неопределено Тогда
			Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
		Иначе
			Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
		КонецЕсли;
		
		ЗапросПакета.ТаблицаДляПомещения = ПоместитьВ;
		ПерезагрузитьТекстЗапроса = Истина;
		
	КонецЕсли;
	
	Если ПерезагрузитьТекстЗапроса Тогда
		Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	КонецЕсли;
	
	Возврат Запрос;
	
КонецФункции

#КонецОбласти

#КонецЕсли
