
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьТаблицуЭталон() Экспорт
	
	Таблица = Новый ТаблицаЗначений();
	
	Для Каждого Колонка Из SUI_ДокументыОбменаПовтИсп.КолонкиТаблицыШтрихкодыУпаковокДокументовОбмена() Цикл
		Таблица.Колонки.Добавить(Колонка.Имя, Колонка.Тип, Колонка.Заголовок);
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

Процедура ЗагрузитьОтсканированныеШтрихкоды(ИдентификаторДокументаОбмена, ЗагружаемаяТаблица) Экспорт
	
	Если ЗагружаемаяТаблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИдентификаторДокументаОбмена", ИдентификаторДокументаОбмена);
	Запрос.УстановитьПараметр("ЗагружаемаяТаблица", ЗагружаемаяТаблица);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗагружаемаяТаблица.hash,
		|	ЗагружаемаяТаблица.barcode,
		|	ЗагружаемаяТаблица.id_barcode
		|ПОМЕСТИТЬ втЗагружаемаяТаблица
		|ИЗ
		|	&ЗагружаемаяТаблица КАК ЗагружаемаяТаблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&ИдентификаторДокументаОбмена КАК sid_doc,
		|	втЗагружаемаяТаблица.hash,
		|	втЗагружаемаяТаблица.barcode,
		|	втЗагружаемаяТаблица.id_barcode,
		|	ЕСТЬNULL(ШтрихкодыУпаковок.additional_details, """") КАК additional_details,
		|	ЕСТЬNULL(ШтрихкодыУпаковок.ДатаЗаписи, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаЗаписи
		|ИЗ
		|	втЗагружаемаяТаблица КАК втЗагружаемаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.SUI_ШтрихкодыУпаковокДокументовОбмена КАК ШтрихкодыУпаковок
		|		ПО ШтрихкодыУпаковок.sid_doc = &ИдентификаторДокументаОбмена
		|		И втЗагружаемаяТаблица.hash = ШтрихкодыУпаковок.hash";
	
	ЗаписатьШтрихкодыПоРезультатуЗапроса(Запрос.Выполнить());
	
КонецПроцедуры

Функция ПолучитьШтрихкодыУпаковок(Отбор = Неопределено, Первые = 0) Экспорт
	
	Запрос = СформироватьЗапросОтсканированныеШтрихкоды(Отбор, Первые);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция ПодготовитьТаблицуВыгрузкиИзДокумента1С(РезультатЗапросаДанных, АлгоритмДопРеквизитов, РезультатВыборкиТЧ) Экспорт
	
	ТаблицаДанных = ПолучитьТаблицуЭталон();
	
	Если РезультатЗапросаДанных.Пустой() Тогда
		Возврат ТаблицаДанных;
	КонецЕсли;
	
	ТаблицаДанных.Колонки.Добавить("НомерСтроки", SUI_ОбщегоНазначения.ОписаниеТипаЧисло(6));
	ТаблицаДанных.Колонки.Добавить("ПредставлениеШтрихкода", ТаблицаДанных.Колонки["barcode"].ТипЗначения);
	
	Выборка = РезультатЗапросаДанных.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаТаблицаДанных = ТаблицаДанных.Добавить();
		СтрокаТаблицаДанных.НомерСтроки = Выборка.НомерСтроки;
		СтрокаТаблицаДанных.id_barcode = SUI_ИнтеграцияВКонфигурацию.ИдентификаторSimpleПоСсылке(Выборка.id, Истина);
		СтрокаТаблицаДанных.ПредставлениеШтрихкода = Строка(Выборка.id);
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаДанных", ТаблицаДанных);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаДанных.id_barcode КАК id_barcode,
		|	ТаблицаДанных.НомерСтроки,
		|	ТаблицаДанных.ПредставлениеШтрихкода
		|ПОМЕСТИТЬ втТаблицаДанных
		|ИЗ
		|	&ТаблицаДанных КАК ТаблицаДанных
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	id_barcode
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТаблицаДанных.НомерСтроки,
		|	втТаблицаДанных.id_barcode,
		|	ЕСТЬNULL(ШтрихкодыУпаковок.mark_code, втТаблицаДанных.ПредставлениеШтрихкода) КАК barcode
		|ИЗ
		|	втТаблицаДанных КАК втТаблицаДанных
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.SUI_tbl_marking_codes КАК ШтрихкодыУпаковок
		|		ПО втТаблицаДанных.id_barcode = ШтрихкодыУпаковок.id";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаДанных = ПолучитьТаблицуЭталон();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ХешСтроки = SUI_Штрихкодирование.РасчитатьХешШтрихкода(Выборка.barcode);
		
		Если ПустаяСтрока(ХешСтроки) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТаблицаДанных = ТаблицаДанных.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицаДанных, Выборка);
		СтрокаТаблицаДанных.hash = ХешСтроки;
		
		Если ЗначениеЗаполнено(АлгоритмДопРеквизитов) И РезультатВыборкиТЧ <> Неопределено Тогда
			
			ПараметрыАлгоритма = Неопределено;
			
			ОтборВВыборкеТЧ = Новый Структура();
			ОтборВВыборкеТЧ.Вставить("НомерСтроки", Выборка.НомерСтроки);
			
			РезультатВыборкиТЧ.Выборка.Сбросить();
			
			Если РезультатВыборкиТЧ.Выборка.НайтиСледующий(ОтборВВыборкеТЧ) Тогда
				
				ПараметрыАлгоритма = Новый Структура();
				ПараметрыАлгоритма.Вставить("ДанныеСтроки", Новый Структура(РезультатВыборкиТЧ.Колонки));
				
				ЗаполнитьЗначенияСвойств(ПараметрыАлгоритма.ДанныеСтроки, РезультатВыборкиТЧ.Выборка);
				
			КонецЕсли;
			
			// Дополнительные реквизиты Начало
			ПриемникДопРеквизитов = Новый Структура();
			SUI_ДополнительныеРеквизитыТаблиц.ДобавитьДополнительныеРеквизитыВПриемник(ПриемникДопРеквизитов, 
				АлгоритмДопРеквизитов, ПараметрыАлгоритма);
			// Дополнительные реквизиты Конец
			
			Если ПриемникДопРеквизитов.Свойство("additional_details") Тогда
				СтрокаТаблицаДанных.additional_details = ПриемникДопРеквизитов.additional_details;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаДанных;
	
КонецФункции

Функция ЗагрузитьТаблицуВыгрузкиИзДокумента1С(ИдентификаторДокументаОбмена, ЗагружаемаяТаблица) Экспорт
	
	Если ЗагружаемаяТаблица.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗагружаемаяТаблица", ЗагружаемаяТаблица);
	Запрос.УстановитьПараметр("ИдентификаторДокументаОбмена", ИдентификаторДокументаОбмена);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗагружаемаяТаблица.hash,
		|	ЗагружаемаяТаблица.id_barcode,
		|	ЗагружаемаяТаблица.barcode,
		|	ЗагружаемаяТаблица.additional_details
		|ПОМЕСТИТЬ втЗагружаемаяТаблица
		|ИЗ
		|	&ЗагружаемаяТаблица КАК ЗагружаемаяТаблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&ИдентификаторДокументаОбмена КАК sid_doc,
		|	втЗагружаемаяТаблица.hash,
		|	втЗагружаемаяТаблица.barcode,
		|	втЗагружаемаяТаблица.id_barcode,
		|	втЗагружаемаяТаблица.additional_details КАК additional_details,
		|	ЕСТЬNULL(ШтрихкодыУпаковок.ДатаЗаписи, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаЗаписи
		|ИЗ
		|	втЗагружаемаяТаблица КАК втЗагружаемаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.SUI_ШтрихкодыУпаковокДокументовОбмена КАК ШтрихкодыУпаковок
		|		ПО ШтрихкодыУпаковок.sid_doc = &ИдентификаторДокументаОбмена
		|		И втЗагружаемаяТаблица.hash = ШтрихкодыУпаковок.hash";
	
	ЗаписатьШтрихкодыПоРезультатуЗапроса(Запрос.Выполнить());
	
	Возврат Истина;
	
КонецФункции

#Область Обновление

Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия 			= "1.0.5.19";
	Обработчик.Процедура 		= "РегистрыСведений.SUI_ШтрихкодыУпаковокДокументовОбмена.ПеренестиШтрихкодыУпаковокПриОбновлении_1_0_5_19";
	Обработчик.РежимВыполнения 	= "Оперативно";
	Обработчик.Комментарий 		= НСтр("ru = 'Обновление записией штрихкодов упаковок документов обмена'");
	
КонецПроцедуры

Процедура ПеренестиШтрихкодыУпаковокПриОбновлении_1_0_5_19() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ШаблонИдентификатораSimple", SUI_ИнтеграцияВКонфигурациюКлиентСервер.ШаблонИдентификатораSimple());
	Запрос.Текст =
		"ВЫБРАТЬ
		|	SUI_docs.sid,
		|	АВТОНОМЕРЗАПИСИ() КАК ПорядковыйНомер
		|ПОМЕСТИТЬ ИдентификаторыДокументовОбмена
		|ИЗ
		|	РегистрСведений.SUI_docs КАК SUI_docs
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ЕСТЬNULL(ИдентификаторыДокументовОбмена.ПорядковыйНомер, -1) КАК ПорядковыйНомер,
		|	ШтрихкодыУпаковокУстаревший.sid,
		|	ШтрихкодыУпаковокУстаревший.sid_doc,
		|	ШтрихкодыУпаковокУстаревший.mark_code КАК barcode,
		|	ШтрихкодыУпаковокУстаревший.barcode_from_scanner КАК barcode_full,
		|	ШтрихкодыУпаковокУстаревший.ШтрихкодBase64 КАК barcode_base64,
		|	ШтрихкодыУпаковокУстаревший.id_marking_code КАК id_barcode,
		|	ШтрихкодыУпаковокУстаревший.id_good,
		|	ШтрихкодыУпаковокУстаревший.id_property,
		|	ШтрихкодыУпаковокУстаревший.id_unit,
		|	ШтрихкодыУпаковокУстаревший.id_cell,
		|	ШтрихкодыУпаковокУстаревший.id_series,
		|	ШтрихкодыУпаковокУстаревший.id_cell,
		|	ШтрихкодыУпаковокУстаревший.series_number,
		|	ШтрихкодыУпаковокУстаревший.additional_details,
		|	ШтрихкодыУпаковокУстаревший.SSCC КАК barcode_owner,
		|	ШтрихкодыУпаковокУстаревший.id_SSCC КАК id_barcode_owner,
		|	ШтрихкодыУпаковокУстаревший.SSCCBase64 КАК barcode_owner_base64,
		|	ШтрихкодыУпаковокУстаревший.ЗагруженоИзМобильногоУстройства
		|ИЗ
		|	РегистрСведений.Удалить_SUI_docs_tbl_barcodes КАК ШтрихкодыУпаковокУстаревший
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИдентификаторыДокументовОбмена КАК ИдентификаторыДокументовОбмена
		|		ПО ШтрихкодыУпаковокУстаревший.sid_doc = ИдентификаторыДокументовОбмена.sid
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПорядковыйНомер";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Пока Не РезультатЗапроса.Пустой() Цикл
		
		Выборка = РезультатЗапроса.Выбрать();
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.Удалить_SUI_docs_tbl_barcodes");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("sid_doc", "sid_doc");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("sid", "sid");
			Блокировка.Заблокировать();
			
			ТаблицаШтрихкодыУпаковок = ПолучитьТаблицуЭталон();
			ТаблицаОтсканированныеШтрихкоды = РегистрыСведений.SUI_ОтсканированныеШтрихкодыУпаковокДокументовОбмена
				.ПолучитьТаблицуЭталон();
			
			Пока Выборка.Следующий() Цикл
				
				Если Выборка.ПорядковыйНомер > -1 Тогда
					
					Если Не ПустаяСтрока(Выборка.barcode) Тогда
						
						СтрокаУпаковкиДобавлена = Ложь;
						
						Если SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(Выборка.id_barcode) Тогда
							
							СтрокаШтрихкодУпаковок = ТаблицаШтрихкодыУпаковок.Добавить();
							СтрокаШтрихкодУпаковок.sid_doc = Выборка.sid_doc;
							СтрокаШтрихкодУпаковок.additional_details = Выборка.additional_details;
							СтрокаШтрихкодУпаковок.id_barcode = Выборка.id_barcode;
							СтрокаШтрихкодУпаковок.barcode = Выборка.barcode;
							СтрокаШтрихкодУпаковок.hash = SUI_Штрихкодирование.РасчитатьХешШтрихкода(
								СтрокаШтрихкодУпаковок.barcode);
							
							Если ПустаяСтрока(СтрокаШтрихкодУпаковок.hash) Тогда
								ТаблицаШтрихкодыУпаковок.Удалить(СтрокаШтрихкодУпаковок);
							Иначе
								СтрокаУпаковкиДобавлена = Истина;
							КонецЕсли;
							
						КонецЕсли;
						
						Если Не ПустаяСтрока(Выборка.barcode_base64) Тогда
							
							СтрокаОтсканированныйШтрихкод = ТаблицаОтсканированныеШтрихкоды.Добавить();
							СтрокаОтсканированныйШтрихкод.sid_doc = Выборка.sid_doc;
							СтрокаОтсканированныйШтрихкод.Обработано = СтрокаУпаковкиДобавлена;
							СтрокаОтсканированныйШтрихкод.barcode_full = Выборка.barcode_full;
							СтрокаОтсканированныйШтрихкод.barcode_base64 = Выборка.barcode_base64;
							СтрокаОтсканированныйШтрихкод.id_good = Выборка.id_good;
							СтрокаОтсканированныйШтрихкод.id_property = Выборка.id_property;
							СтрокаОтсканированныйШтрихкод.id_unit = Выборка.id_unit;
							СтрокаОтсканированныйШтрихкод.id_series = Выборка.id_series;
							СтрокаОтсканированныйШтрихкод.series_number = Выборка.series_number;
							
							СтрокаОтсканированныйШтрихкод.barcode = Выборка.barcode;
							СтрокаОтсканированныйШтрихкод.hash = SUI_Штрихкодирование.РасчитатьХешШтрихкода(
								СтрокаОтсканированныйШтрихкод.barcode);
							
							Если ПустаяСтрока(СтрокаОтсканированныйШтрихкод.hash) Тогда
								ТаблицаОтсканированныеШтрихкоды.Удалить(СтрокаОтсканированныйШтрихкод);
							Иначе
								
								Если ПустаяСтрока(СтрокаОтсканированныйШтрихкод.barcode_full) Тогда
									СтрокаОтсканированныйШтрихкод.barcode_full = СтрокаОтсканированныйШтрихкод.barcode;
								КонецЕсли;
								
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;
					
					Если Не ПустаяСтрока(Выборка.barcode_owner) Тогда
						
						СтрокаУпаковкиДобавлена = Ложь;
						
						Если SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(Выборка.id_barcode_owner) Тогда
							
							СтрокаШтрихкодУпаковок = ТаблицаШтрихкодыУпаковок.Добавить();
							СтрокаШтрихкодУпаковок.sid_doc = Выборка.sid_doc;
							СтрокаШтрихкодУпаковок.additional_details = Выборка.additional_details;
							СтрокаШтрихкодУпаковок.id_barcode = Выборка.id_barcode_owner;
							СтрокаШтрихкодУпаковок.barcode = Выборка.barcode_owner;
							СтрокаШтрихкодУпаковок.hash = SUI_Штрихкодирование.РасчитатьХешШтрихкода(
								СтрокаШтрихкодУпаковок.barcode);
							
							Если ПустаяСтрока(СтрокаШтрихкодУпаковок.hash) Тогда
								ТаблицаШтрихкодыУпаковок.Удалить(СтрокаШтрихкодУпаковок);
							Иначе
								СтрокаУпаковкиДобавлена = Истина;
							КонецЕсли;
							
						КонецЕсли;
						
						Если Не ПустаяСтрока(Выборка.barcode_owner_base64) Тогда
							
							СтрокаОтсканированныйШтрихкод = ТаблицаОтсканированныеШтрихкоды.Добавить();
							СтрокаОтсканированныйШтрихкод.sid_doc = Выборка.sid_doc;
							СтрокаОтсканированныйШтрихкод.Обработано = СтрокаУпаковкиДобавлена;
							СтрокаОтсканированныйШтрихкод.barcode_base64 = Выборка.barcode_owner_base64;
							СтрокаОтсканированныйШтрихкод.id_good = Выборка.id_good;
							СтрокаОтсканированныйШтрихкод.id_property = Выборка.id_property;
							СтрокаОтсканированныйШтрихкод.id_unit = Выборка.id_unit;
							СтрокаОтсканированныйШтрихкод.id_series = Выборка.id_series;
							СтрокаОтсканированныйШтрихкод.series_number = Выборка.series_number;
							
							СтрокаОтсканированныйШтрихкод.barcode = Выборка.barcode_owner;
							СтрокаОтсканированныйШтрихкод.hash = SUI_Штрихкодирование.РасчитатьХешШтрихкода(
								СтрокаОтсканированныйШтрихкод.barcode);
							
							Если ПустаяСтрока(СтрокаОтсканированныйШтрихкод.hash) Тогда
								ТаблицаОтсканированныеШтрихкоды.Удалить(СтрокаОтсканированныйШтрихкод);
							Иначе
								
								Если ПустаяСтрока(СтрокаОтсканированныйШтрихкод.barcode_full) Тогда
									СтрокаОтсканированныйШтрихкод.barcode_full = СтрокаОтсканированныйШтрихкод.barcode;
								КонецЕсли;
								
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
				НаборЗаписей = РегистрыСведений.Удалить_SUI_docs_tbl_barcodes.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.sid.Установить(Выборка.sid);
				НаборЗаписей.Отбор.sid_doc.Установить(Выборка.sid_doc);
				
				НаборЗаписей.ОбменДанными.Загрузка = Истина;
				НаборЗаписей.Записать(Истина);
				
			КонецЦикла;
			
			Если ТаблицаШтрихкодыУпаковок.Количество() > 0 Тогда
				
				Блокировка = Новый БлокировкаДанных;
				ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.SUI_ШтрихкодыУпаковокДокументовОбмена");
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
				ЭлементБлокировки.ИсточникДанных = ТаблицаШтрихкодыУпаковок;
				ЭлементБлокировки.ИспользоватьИзИсточникаДанных("sid_doc", "sid_doc");
				ЭлементБлокировки.ИспользоватьИзИсточникаДанных("hash", "hash");
				Блокировка.Заблокировать();
				
			КонецЕсли;
			
			Если ТаблицаОтсканированныеШтрихкоды.Количество() > 0 Тогда
				
				Блокировка = Новый БлокировкаДанных;
				ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.SUI_ОтсканированныеШтрихкодыУпаковокДокументовОбмена");
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
				ЭлементБлокировки.ИсточникДанных = ТаблицаОтсканированныеШтрихкоды;
				ЭлементБлокировки.ИспользоватьИзИсточникаДанных("sid_doc", "sid_doc");
				ЭлементБлокировки.ИспользоватьИзИсточникаДанных("hash", "hash");
				Блокировка.Заблокировать();
				
			КонецЕсли;
			
			Для Каждого СтрокаТаблицы Из ТаблицаШтрихкодыУпаковок Цикл
				
				Запись = СоздатьМенеджерЗаписи();
				Запись.sid_doc = СтрокаТаблицы.sid_doc;
				Запись.hash = СтрокаТаблицы.hash;
				
				Запись.Прочитать();
				
				ЗаполнитьЗначенияСвойств(Запись, СтрокаТаблицы);
				
				Если Запись.Выбран() Тогда
					Запись.ДатаОбновления = ТекущаяДатаСеанса();
				Иначе
					Запись.ДатаЗаписи = ТекущаяДатаСеанса();
				КонецЕсли;
				
				Запись.Записать(Истина);
				
			КонецЦикла;
			
			Для Каждого СтрокаТаблицы Из ТаблицаОтсканированныеШтрихкоды Цикл
				
				Запись = РегистрыСведений.SUI_ОтсканированныеШтрихкодыУпаковокДокументовОбмена.СоздатьМенеджерЗаписи();
				Запись.sid_doc = СтрокаТаблицы.sid_doc;
				Запись.hash = СтрокаТаблицы.hash;
				
				Запись.Прочитать();
				
				ЗаполнитьЗначенияСвойств(Запись, СтрокаТаблицы);
				
				Если Запись.Выбран() Тогда
					Запись.ДатаОбновления = ТекущаяДатаСеанса();
				Иначе
					Запись.ДатаЗаписи = ТекущаяДатаСеанса();
				КонецЕсли;
				
				Запись.Записать(Истина);
				
			КонецЦикла;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
		
		//@skip-check query-in-loop
		РезультатЗапроса = Запрос.Выполнить();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьЗапросОтсканированныеШтрихкоды(Отбор = Неопределено, Первые = 0, ПоместитьВ = "", МенеджерВТ = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ШтрихкодыУпаковок.sid_doc,
		|	ШтрихкодыУпаковок.hash,
		|	ШтрихкодыУпаковок.barcode,
		|	ШтрихкодыУпаковок.id_barcode,
		|	ШтрихкодыУпаковок.additional_details,
		|	ШтрихкодыУпаковок.ДатаЗаписи,
		|	ШтрихкодыУпаковок.ДатаОбновления
		|ИЗ
		|	РегистрСведений.SUI_ШтрихкодыУпаковокДокументовОбмена КАК ШтрихкодыУпаковок";
	
	ПерезагрузитьТекстЗапроса = Ложь;
	
	СхемаЗапроса = Новый СхемаЗапроса();
	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
	
	ЗапросПакета = СхемаЗапроса.ПакетЗапросов[СхемаЗапроса.ПакетЗапросов.Количество() - 1];
	ОператорыПакета = ЗапросПакета.Операторы[0];
	
	Если Первые > 0 Тогда
		
		ОператорыПакета.КоличествоПолучаемыхЗаписей = Первые;
		ПерезагрузитьТекстЗапроса = Истина;
		
	КонецЕсли;
	
	Если Отбор <> Неопределено Тогда
		
		ИмяФункцииВызова = "РегистрыСведений.SUI_ШтрихкодыУпаковокДокументовОбмена.СформироватьЗапросОтсканированныеШтрихкоды";
		
		ПроверяемыеТипыОтбора = Новый Массив();
		ПроверяемыеТипыОтбора.Добавить(Тип("Структура"));
		ПроверяемыеТипыОтбора.Добавить(Тип("ФиксированнаяСтруктура"));
		ПроверяемыеТипыОтбора.Добавить(Тип("Соответствие"));
		ПроверяемыеТипыОтбора.Добавить(Тип("ФиксированнаяСтруктура"));
		
		SUI_ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(ИмяФункцииВызова, "Отбор", Отбор, 
			Новый ОписаниеТипов(ПроверяемыеТипыОтбора));
		
		Для Каждого КлючЗначение Из Отбор Цикл
		
			ТипЗначения = ТипЗнч(КлючЗначение.Значение);
			КлючПараметра = СтрЗаменить(КлючЗначение.Ключ, ".", "_");
			
			Если ТипЗначения = Тип("Массив") Или 
				ТипЗначения = Тип("ФиксированныйМассив") Или
				ТипЗначения = Тип("СписокЗначений") Тогда
				
				ОператорыПакета.Отбор.Добавить(СтрШаблон("%1 В (&%2)", КлючЗначение.Ключ, КлючПараметра));
				
			Иначе
				ОператорыПакета.Отбор.Добавить(СтрШаблон("%1 = &%2", КлючЗначение.Ключ, КлючПараметра));
			КонецЕсли;
			
			Запрос.УстановитьПараметр(КлючПараметра, КлючЗначение.Значение);
			
			ПерезагрузитьТекстЗапроса = Истина;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Не ПустаяСтрока(ПоместитьВ) Тогда
		
		Если МенеджерВТ = Неопределено Тогда
			Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
		Иначе
			Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
		КонецЕсли;
		
		ЗапросПакета.ТаблицаДляПомещения = ПоместитьВ;
		ПерезагрузитьТекстЗапроса = Истина;
		
	КонецЕсли;
	
	Если ПерезагрузитьТекстЗапроса Тогда
		Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	КонецЕсли;
	
	Возврат Запрос;
	
КонецФункции

Процедура ЗаписатьШтрихкодыПоРезультатуЗапроса(РезультатЗапроса)
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.SUI_ШтрихкодыУпаковокДокументовОбмена");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("sid_doc", "sid_doc");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("hash", "hash");
		Блокировка.Заблокировать();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Запись = СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			
			Если ЗначениеЗаполнено(Запись.ДатаЗаписи) Тогда
				Запись.ДатаОбновления = ТекущаяДатаСеанса();
			Иначе
				Запись.ДатаЗаписи = ТекущаяДатаСеанса();
			КонецЕсли;
			
			Запись.Записать();
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		Ошибка = ИнформацияОбОшибке();
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(SUI_ШтрихкодыУпаковокКлиентСервер.ИмяСобытия(), , , , Ошибка);
		ТекстОшибки = НСтр("ru = 'Не удалось записать штрихкоды упаковок документа обмена!'");
		ВызватьИсключение(ТекстОшибки, , , , Ошибка);
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
