#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	ТЗВывод = Новый ТаблицаЗначений;
	ТЗВывод.Колонки.Добавить("Документ");
	ТЗВывод.Колонки.Добавить("Состояние");
	ТЗВывод.Колонки.Добавить("Сотрудник");
	ТЗВывод.Колонки.Добавить("Количество");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ SUI_docs.sid) КАК Количество,
	               |	SUI_docs.id_doc КАК Документ,
	               |	SUI_docs.МобильныйКлиент КАК Сотрудник,
	               |	SUI_docs.Состояние КАК Состояние
	               |ИЗ
	               |	РегистрСведений.SUI_docs КАК SUI_docs
	               |ГДЕ
	               |	SUI_docs.МобильныйКлиент.Наименование <> """"
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	SUI_docs.МобильныйКлиент,
	               |	SUI_docs.Состояние,
	               |	SUI_docs.id_doc";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
	
	Для Каждого СтрокаВыгрузки Из ВыборкаДетальныеЗаписи Цикл 
		
		СтруктураПриемник = Новый Структура; 
		
		SUI_ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаВыгрузки,СтруктураПриемник);   		
		SUI_ИнтеграцияВКонфигурацию.ВосстановитьСсылкиИдентификаторовSimple(СтруктураПриемник, ,Ложь);  
				
		ЗаполнитьЗначенияСвойств(ТЗВывод.Добавить(), СтруктураПриемник);
		
	КонецЦикла;
		
	Настройки = КомпоновщикНастроек.ПолучитьНастройки(); 
 
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных; 
 
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);	
	
	ВнешнийНаборДанных = Новый Структура("ТаблицаЗначений", ТЗВывод); 
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных; 
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешнийНаборДанных, ДанныеРасшифровки); 
	
	ДокументРезультат.Очистить();
	
 	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент; 
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат); 
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли