
#Область ПрограммныйИнтерфейс

// Возвращает ссылку предопределенного элемента по его полному имени.
// Предопределенные элементы могут содержаться только в следующих объектах:
//   - справочники;
//   - планы видов характеристик;
//   - планы счетов;
//   - планы видов расчета.
// После изменения состава предопределенных следует выполнить метод
// ОбновитьПовторноИспользуемыеЗначения(), который сбросит кэш ПовтИсп в текущем сеансе.
//
// Параметры:
//   ПолноеИмяПредопределенного - Строка - полный путь к предопределенному элементу, включая его имя.
//     Формат аналогичен функции глобального контекста ПредопределенноеЗначение().
//     Например:
//       "Справочник.ВидыКонтактнойИнформации.EmailПользователя"
//       "ПланСчетов.Хозрасчетный.Материалы"
//       "ПланВидовРасчета.Начисления.ОплатаПоОкладу".
//
// Возвращаемое значение: 
//   ЛюбаяСсылка - ссылка на предопределенный элемент.
//   Неопределено - если предопределенный элемент есть в метаданных, но не создан в ИБ.
//
Функция ПредопределенныйЭлемент(ПолноеИмяПредопределенного) Экспорт
	
	СтандартнаяОбработка = ОбщегоНазначенияСлужебныйКлиентСервер.ИспользоватьСтандартнуюФункциюПолученияПредопределенного(
		ПолноеИмяПредопределенного);
	
	Если СтандартнаяОбработка Тогда 
		Возврат ПредопределенноеЗначение(ПолноеИмяПредопределенного);
	КонецЕсли;
	
	ПоляПредопределенного = ОбщегоНазначенияСлужебныйКлиентСервер.ИмяПредопределенногоПоПолям(ПолноеИмяПредопределенного);
	
	ОписаниеТипаФиксированноеСоответствие = Новый ОписаниеТипов("ФиксированноеСоответствие");

	ПредопределенныеЗначения = ОписаниеТипаФиксированноеСоответствие.ПривестиЗначение(
		СтандартныеПодсистемыПовтИсп.СсылкиПоИменамПредопределенных(ПоляПредопределенного.ПолноеИмяОбъектаМетаданных));
	
	Возврат ПредопределенныеЗначения.Получить(ПоляПредопределенного.ИмяПредопределенного);
	
КонецФункции

// Строка таблицы значений в структуру.
// 
// Параметры:
//  СтрокаТаблицыЗначений - СтрокаТаблицыЗначений - Строка таблицы значений
//  СтруктураПриемник - Неопределено - Структура приемник
// 
// Возвращаемое значение:
//  Структура, Неопределено - Строка таблицы значений в структуру
Функция СтрокаТаблицыЗначенийВСтруктуру(СтрокаТаблицыЗначений, СтруктураПриемник = Неопределено) Экспорт
	
	СтруктураРезультат = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаТаблицыЗначений);
	
	Если СтруктураПриемник = Неопределено Тогда
		Возврат СтруктураРезультат;
	Иначе
		
		Для Каждого КлючЗначение Из СтруктураРезультат Цикл
			СтруктураПриемник.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
		КонецЦикла;

		Возврат СтруктураПриемник;
		
	КонецЕсли;
	
КонецФункции

// Проверяет, что переданное значение имеет ссылочный тип данных.
//
// Параметры:
//  Значение - Произвольный - проверяемое значение.
//
// Возвращаемое значение:
//  Булево - Истина, если тип значения ссылочный.
//
Функция ЗначениеСсылочногоТипа(Значение) Экспорт
	
	Возврат ЭтоСсылка(ТипЗнч(Значение));
	
КонецФункции

// Проверка того, что переданный тип является ссылочным типом данных.
// Для типа Неопределено возвращается Ложь.
//
// Параметры:
//  ПроверяемыйТип - Тип - для проверки на ссылочный тип данных.
//
// Возвращаемое значение:
//  Булево - Истина, если это ссылка.
//
Функция ЭтоСсылка(ПроверяемыйТип) Экспорт
	
	ПроверяемыйТипСсылка = Ложь;
	
	Если ТипЗнч(ПроверяемыйТип) = Тип("ОписаниеТипов") Тогда
		ПроверяемыеТипы = Новый ОписаниеТипов(ПроверяемыйТип);
	Иначе
		ПроверяемыеТипы = Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПроверяемыйТип));
	КонецЕсли;
	
	Для Каждого Тип Из ПроверяемыеТипы.Типы() Цикл
		
		Если Тип <> Тип("Неопределено") Тогда
			
			ТипXML = XMLТип(Тип);
			Если ТипXML <> Неопределено Тогда
				
				ЧастьИмениТипа = СтрРазделить(ТипXML.ИмяТипа, ".", Ложь);
				ЧастьИмениТипа = ?(ЧастьИмениТипа.Количество() > 1, ЧастьИмениТипа[0], "");
				ПроверяемыйТипСсылка = (СтрДлина(ЧастьИмениТипа) > 3 И Прав(ЧастьИмениТипа, 3) = "Ref");
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ПроверяемыйТипСсылка Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПроверяемыйТипСсылка;

КонецФункции

// Функция - Проверяет ссылку на принадлежность к метаданным документов
//
// Параметры:
//  ПроверяемаяСсылка	 - ЛюбаяСсылка - Проверяемая ссылка
// 
// Возвращаемое значение:
//  Булево - Истина, если ссылка принадлежит метаданным документов
//
Функция ЭтоСсылкаДокумента(ПроверяемаяСсылка) Экспорт
	
	ТипXML = XMLТип(ТипЗнч(ПроверяемаяСсылка));
	Если ТипXML <> Неопределено Тогда
		XMLИмяТипа = ТипXML.ИмяТипа;
		Если СтрНачинаетсяС(XMLИмяТипа, "DocumentRef.") Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Возвращает имя вида объектов метаданных по типу объекта.
// Ограничение: не обрабатываются точки маршрутов бизнес-процессов.
// См. так же ВидОбъектаПоСсылке.
//
// Параметры:
//  ТипОбъекта - Тип - тип прикладного объекта, определенный в конфигурации.
//
// Возвращаемое значение:
//  Строка - имя вида объектов метаданных. Например: "Справочник", "Документ".
// 
Функция ВидОбъектаПоТипу(ТипОбъекта) Экспорт
	
	ИмяТипа = XMLТип(ТипОбъекта).ИмяТипа;
	
	Если СтрНачинаетсяС(ИмяТипа, "CatalogRef.") Тогда
		Возврат "Справочник";
	ИначеЕсли СтрНачинаетсяС(ИмяТипа, "DocumentRef.") Тогда
		Возврат "Документ";
	ИначеЕсли СтрНачинаетсяС(ИмяТипа, "BusinessProcessRef.") Тогда
		Возврат "БизнесПроцесс";
	ИначеЕсли СтрНачинаетсяС(ИмяТипа, "ChartOfCharacteristicTypesRef.") Тогда
		Возврат "ПланВидовХарактеристик";
	ИначеЕсли СтрНачинаетсяС(ИмяТипа, "ChartOfAccountsRef.") Тогда
		Возврат "ПланСчетов";
	ИначеЕсли ПланыВидовРасчета.ТипВсеСсылки().СодержитТип(ТипОбъекта) Тогда
		Возврат "ПланВидовРасчета";
	ИначеЕсли СтрНачинаетсяС(ИмяТипа, "TaskRef.") Тогда
		Возврат "Задача";
	ИначеЕсли СтрНачинаетсяС(ИмяТипа, "ExchangePlanRef.") Тогда
		Возврат "ПланОбмена";
	ИначеЕсли СтрНачинаетсяС(ИмяТипа, "EnumRef.") Тогда
		Возврат "Перечисление";
	ИначеЕсли СтрНачинаетсяС(ИмяТипа, "InformationRegisterRecordSet.") Тогда
		Возврат "РегистрСведений";
	Иначе
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Неверный тип значения параметра (%1)'"), Строка(ТипОбъекта));
	КонецЕсли;
	
КонецФункции

// Возвращает имя вида объектов метаданных по ссылке на объект.
// Ограничение: не обрабатываются точки маршрутов бизнес-процессов.
// См. так же ВидОбъектаПоТипу.
//
// Параметры:
//  Ссылка - ЛюбаяСсылка - объект, вид которого требуется получить.
//
// Возвращаемое значение:
//  Строка - имя вида объектов метаданных. Например: "Справочник", "Документ".
// 
Функция ВидОбъектаПоСсылке(Ссылка) Экспорт
	
	Возврат ВидОбъектаПоТипу(ТипЗнч(Ссылка));
	
КонецФункции

// Возвращает строковое представление типа. 
// Для ссылочных типов возвращает в формате "СправочникСсылка.ИмяОбъекта" или "ДокументСсылка.ИмяОбъекта".
// Для остальных типов приводит тип к строке, например "Число".
//
// Параметры:
//  Тип - Тип - для которого надо получить представление.
//
// Возвращаемое значение:
//  Строка - представление типа.
//
Функция СтроковоеПредставлениеТипа(Тип) Экспорт
	
	Представление = "";
	
	ТипЗначенияТипа = ТипЗнч(Тип);
	
	Если ТипЗначенияТипа = Тип("ОписаниеТипов") Тогда
		
		ПредставленияТипов = Новый Массив();
		
		Типы = Тип.Типы();
		
		Для индекс = 0 По Типы.ВГраница() Цикл
			_Представление = СтроковоеПредставлениеТипа(Типы[индекс]);
			Если Не ПустаяСтрока(_Представление) Тогда
				ПредставленияТипов.Добавить(_Представление);
			КонецЕсли;
		КонецЦикла;
		
		Если ПредставленияТипов.Количество() = 1 Тогда
			Представление = ПредставленияТипов[0];
		ИначеЕсли ПредставленияТипов.Количество() > 1 Тогда
			Представление = СтрСоединить(ПредставленияТипов, "; ");
		КонецЕсли;
	
	ИначеЕсли ТипЗначенияТипа = Тип("Тип") Тогда
		
		ТипXML = XMLТип(Тип);
		Если ТипXML <> Неопределено И СтрНайти(ТипXML.ИмяТипа, ".") > 0 Тогда
		
			ЧастиТипа = СтрРазделить(ТипXML.ИмяТипа, ".");
			
			Если СтрНачинаетсяС(ЧастиТипа[0], "Catalog") Тогда
				Представление = "Справочник";
			ИначеЕсли СтрНачинаетсяС(ЧастиТипа[0], "Document") Тогда
				Представление = "Документ";
			ИначеЕсли СтрНачинаетсяС(ЧастиТипа[0], "Enum") Тогда
				Представление = "Перечисление";
			ИначеЕсли СтрНачинаетсяС(ЧастиТипа[0], "ExchangePlan") Тогда
				Представление = "ПланОбмена";
			КонецЕсли;
			
			Если СтрЗаканчиваетсяНа(ЧастиТипа[0], "Ref") Тогда
				Представление = Представление + "Ссылка.";
			ИначеЕсли СтрЗаканчиваетсяНа(ЧастиТипа[0], "Object") Тогда
				Представление = Представление + "Объект.";
			Иначе
				Представление = "";
			КонецЕсли;
			
			Если Не ПустаяСтрока(Представление) Тогда
				Представление = Представление + ЧастиТипа[1];
			КонецЕсли;
		
		КонецЕсли;
		
		Если ПустаяСтрока(Представление) Тогда
			Представление = ОбщегоНазначения.СтроковоеПредставлениеТипа(Тип);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПустаяСтрока(Представление) И ТипЗначенияТипа = Тип("Строка") Тогда
		Представление = Тип;
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

// Возвращает ОбъектМетаданных, быстро найденный по полному имени.
// Более производительный аналог метода платформы Метаданные.НайтиПоПолномуИмени
// для корневых объектов метаданных.
//
// Параметры:
//  ПолноеИмя - Строка - полное имя объекта метаданных, например, Справочник.Организации
//
// Возвращаемое значение:
//  ОбъектМетаданных - когда найден
//  Неопределено - когда не найден
//
Функция ОбъектМетаданныхПоПолномуИмени(ПолноеИмя) Экспорт
	
	ПозицияТочки = СтрНайти(ПолноеИмя, ".");
	ИмяБазовогоТипа = Лев(ПолноеИмя, ПозицияТочки - 1);
	
	ИменаКоллекций = ИменаКоллекцийПоИменамБазовыхТипов();
	Коллекция = ИменаКоллекций.Получить(ВРег(ИмяБазовогоТипа));
	
	Если Коллекция <> Неопределено Тогда
		Если Коллекция <> "Подсистемы" Тогда
			ИмяОбъекта = Сред(ПолноеИмя, ПозицияТочки + 1);
			ОбъектМетаданных = Метаданные[Коллекция].Найти(ИмяОбъекта);
		Иначе
			ИменаПодсистем = СтрРазделить(ВРег(ПолноеИмя), ".");
			Количество = ИменаПодсистем.Количество();
			Подсистема = Метаданные;
			ОбъектМетаданных = Неопределено;
			Индекс = 0;
			Пока Истина Цикл
				Индекс = Индекс + 1;
				Если Индекс >= Количество Тогда
					Прервать;
				КонецЕсли;
				ИмяПодсистемы = ИменаПодсистем[Индекс];
				Подсистема = Подсистема.Подсистемы.Найти(ИмяПодсистемы);
				Если Подсистема = Неопределено Тогда
					Прервать;
				КонецЕсли;
				Индекс = Индекс + 1;
				Если Индекс = Количество Тогда
					ОбъектМетаданных = Подсистема;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Если ОбъектМетаданных = Неопределено Тогда
		ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ПолноеИмя);
	КонецЕсли;
	
	Возврат ОбъектМетаданных;
	
КонецФункции

Функция ИменаКоллекцийПоИменамБазовыхТипов() Экспорт
	
	ИменаКоллекций = Новый Соответствие;
	ИменаКоллекций.Вставить(ВРег("Подсистема"), "Подсистемы");
	ИменаКоллекций.Вставить(ВРег("ОбщийМодуль"), "ОбщиеМодули");
	ИменаКоллекций.Вставить(ВРег("ПараметрСеанса"), "ПараметрыСеанса");
	ИменаКоллекций.Вставить(ВРег("Роль"), "Роли");
	ИменаКоллекций.Вставить(ВРег("ОбщийРеквизит"), "ОбщиеРеквизиты");
	ИменаКоллекций.Вставить(ВРег("ПланОбмена"), "ПланыОбмена");
	ИменаКоллекций.Вставить(ВРег("КритерийОтбора"), "КритерииОтбора");
	ИменаКоллекций.Вставить(ВРег("ПодпискаНаСобытие"), "ПодпискиНаСобытия");
	ИменаКоллекций.Вставить(ВРег("РегламентноеЗадание"), "РегламентныеЗадания");
	ИменаКоллекций.Вставить(ВРег("ФункциональнаяОпция"), "ФункциональныеОпции");
	ИменаКоллекций.Вставить(ВРег("ПараметрФункциональныхОпций"), "ПараметрыФункциональныхОпций");
	ИменаКоллекций.Вставить(ВРег("ОпределяемыйТип"), "ОпределяемыеТипы");
	ИменаКоллекций.Вставить(ВРег("ХранилищеНастроек"), "ХранилищаНастроек");
	ИменаКоллекций.Вставить(ВРег("ОбщаяФорма"), "ОбщиеФормы");
	ИменаКоллекций.Вставить(ВРег("ОбщаяКоманда"), "ОбщиеКоманды");
	ИменаКоллекций.Вставить(ВРег("ГруппаКоманд"), "ГруппыКоманд");
	ИменаКоллекций.Вставить(ВРег("ОбщийМакет"), "ОбщиеМакеты");
	ИменаКоллекций.Вставить(ВРег("ОбщаяКартинка"), "ОбщиеКартинки");
	ИменаКоллекций.Вставить(ВРег("ПакетXDTO"), "ПакетыXDTO");
	ИменаКоллекций.Вставить(ВРег("WebСервис"), "WebСервисы");
	ИменаКоллекций.Вставить(ВРег("HTTPСервис"), "HTTPСервисы");
	ИменаКоллекций.Вставить(ВРег("WSСсылка"), "WSСсылки");
	ИменаКоллекций.Вставить(ВРег("СервисИнтеграции"), "СервисыИнтеграции");
	ИменаКоллекций.Вставить(ВРег("ЭлементСтиля"), "ЭлементыСтиля");
	ИменаКоллекций.Вставить(ВРег("Стиль"), "Стили");
	ИменаКоллекций.Вставить(ВРег("Язык"), "Языки");
	ИменаКоллекций.Вставить(ВРег("Константа"), "Константы");
	ИменаКоллекций.Вставить(ВРег("Справочник"), "Справочники");
	ИменаКоллекций.Вставить(ВРег("Документ"), "Документы");
	ИменаКоллекций.Вставить(ВРег("Последовательность"), "Последовательности");
	ИменаКоллекций.Вставить(ВРег("ЖурналДокументов"), "ЖурналыДокументов");
	ИменаКоллекций.Вставить(ВРег("Перечисление"), "Перечисления");
	ИменаКоллекций.Вставить(ВРег("Отчет"), "Отчеты");
	ИменаКоллекций.Вставить(ВРег("Обработка"), "Обработки");
	ИменаКоллекций.Вставить(ВРег("ПланВидовХарактеристик"), "ПланыВидовХарактеристик");
	ИменаКоллекций.Вставить(ВРег("ПланСчетов"), "ПланыСчетов");
	ИменаКоллекций.Вставить(ВРег("ПланВидовРасчета"), "ПланыВидовРасчета");
	ИменаКоллекций.Вставить(ВРег("РегистрСведений"), "РегистрыСведений");
	ИменаКоллекций.Вставить(ВРег("РегистрНакопления"), "РегистрыНакопления");
	ИменаКоллекций.Вставить(ВРег("РегистрБухгалтерии"), "РегистрыБухгалтерии");
	ИменаКоллекций.Вставить(ВРег("РегистрРасчета"), "РегистрыРасчета");
	ИменаКоллекций.Вставить(ВРег("БизнесПроцесс"), "БизнесПроцессы");
	ИменаКоллекций.Вставить(ВРег("Задача"), "Задачи");
	ИменаКоллекций.Вставить(ВРег("ВнешниеИсточникиДанных"), "ВнешнийИсточникДанных");
	
	Возврат Новый ФиксированноеСоответствие(ИменаКоллекций);
	
КонецФункции

#КонецОбласти
