
#Область ПрограммныйИнтерфейс

// Возвращает ссылку предопределенного элемента по его полному имени.
// Предопределенные элементы могут содержаться только в следующих объектах:
//   - справочники;
//   - планы видов характеристик;
//   - планы счетов;
//   - планы видов расчета.
// После изменения состава предопределенных следует выполнить метод
// ОбновитьПовторноИспользуемыеЗначения(), который сбросит кэш ПовтИсп в текущем сеансе.
//
// Параметры:
//   ПолноеИмяПредопределенного - Строка - полный путь к предопределенному элементу, включая его имя.
//     Формат аналогичен функции глобального контекста ПредопределенноеЗначение().
//     Например:
//       "Справочник.ВидыКонтактнойИнформации.EmailПользователя"
//       "ПланСчетов.Хозрасчетный.Материалы"
//       "ПланВидовРасчета.Начисления.ОплатаПоОкладу".
//
// Возвращаемое значение: 
//   ЛюбаяСсылка - ссылка на предопределенный элемент.
//   Неопределено - если предопределенный элемент есть в метаданных, но не создан в ИБ.
//
Функция ПредопределенныйЭлемент(ПолноеИмяПредопределенного) Экспорт
	
	СтандартнаяОбработка = ОбщегоНазначенияСлужебныйКлиентСервер.ИспользоватьСтандартнуюФункциюПолученияПредопределенного(
		ПолноеИмяПредопределенного);
	
	Если СтандартнаяОбработка Тогда 
		Возврат ПредопределенноеЗначение(ПолноеИмяПредопределенного);
	КонецЕсли;
	
	ПоляПредопределенного = ОбщегоНазначенияСлужебныйКлиентСервер.ИмяПредопределенногоПоПолям(ПолноеИмяПредопределенного);
	
	ОписаниеТипаФиксированноеСоответствие = Новый ОписаниеТипов("ФиксированноеСоответствие");

	ПредопределенныеЗначения = ОписаниеТипаФиксированноеСоответствие.ПривестиЗначение(
		СтандартныеПодсистемыПовтИсп.СсылкиПоИменамПредопределенных(ПоляПредопределенного.ПолноеИмяОбъектаМетаданных));
	
	Возврат ПредопределенныеЗначения.Получить(ПоляПредопределенного.ИмяПредопределенного);
	
КонецФункции

// Строка таблицы значений в структуру.
// 
// Параметры:
//  СтрокаТаблицыЗначений - СтрокаТаблицыЗначений - Строка таблицы значений
//  СтруктураПриемник - Неопределено - Структура приемник
// 
// Возвращаемое значение:
//  Структура, Неопределено - Строка таблицы значений в структуру
Функция СтрокаТаблицыЗначенийВСтруктуру(СтрокаТаблицыЗначений, СтруктураПриемник = Неопределено) Экспорт
	
	СтруктураРезультат = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаТаблицыЗначений);
	
	Если СтруктураПриемник = Неопределено Тогда
		Возврат СтруктураРезультат;
	Иначе
		
		Для Каждого КлючЗначение Из СтруктураРезультат Цикл
			СтруктураПриемник.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
		КонецЦикла;

		Возврат СтруктураПриемник;
		
	КонецЕсли;
	
КонецФункции

// Проверяет, что переданное значение имеет ссылочный тип данных.
//
// Параметры:
//  Значение - Произвольный - проверяемое значение.
//
// Возвращаемое значение:
//  Булево - Истина, если тип значения ссылочный.
//
Функция ЗначениеСсылочногоТипа(Значение) Экспорт
	
	Возврат ЭтоСсылка(ТипЗнч(Значение));
	
КонецФункции

// Проверка того, что переданный тип является ссылочным типом данных.
// Для типа Неопределено возвращается Ложь.
//
// Параметры:
//  ПроверяемыйТип - Тип - для проверки на ссылочный тип данных.
//
// Возвращаемое значение:
//  Булево - Истина, если это ссылка.
//
Функция ЭтоСсылка(ПроверяемыйТип) Экспорт
	
	ПроверяемыйТипСсылка = Ложь;
	
	Если ТипЗнч(ПроверяемыйТип) = Тип("ОписаниеТипов") Тогда
		ПроверяемыеТипы = ПроверяемыйТип;
	Иначе
		ПроверяемыеТипы = Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПроверяемыйТип));
	КонецЕсли;
	
	Для Каждого Тип Из ПроверяемыеТипы.Типы() Цикл
		
		Если ОбщегоНазначения.ЭтоСсылка(Тип) Тогда
			ПроверяемыйТипСсылка = Истина;
			Прервать;
		Иначе
			
			ТипXML = XMLТип(Тип);
			Если ТипXML <> Неопределено Тогда
				
				XMLИмяТипа = ТипXML.ИмяТипа;
				Если СтрНачинаетсяС(XMLИмяТипа, "CatalogRef.") Или 
					СтрНачинаетсяС(XMLИмяТипа, "DocumentRef.") Или
					СтрНачинаетсяС(XMLИмяТипа, "BusinessProcessRef.") Или
					СтрНачинаетсяС(XMLИмяТипа, "ChartOfCharacteristicTypesRef.") Или
					СтрНачинаетсяС(XMLИмяТипа, "ChartOfAccountsRef.") Или
					СтрНачинаетсяС(XMLИмяТипа, "TaskRef.") Или
					СтрНачинаетсяС(XMLИмяТипа, "ExchangePlanRef.") Или
					СтрНачинаетсяС(XMLИмяТипа, "EnumRef.") Тогда
					ПроверяемыйТипСсылка = Истина;
					Прервать;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПроверяемыйТипСсылка;

КонецФункции

// Функция - Проверяет ссылку на принадлежность к метаданным документов
//
// Параметры:
//  ПроверяемаяСсылка	 - ЛюбаяСсылка - Проверяемая ссылка
// 
// Возвращаемое значение:
//  Булево - Истина, если ссылка принадлежит метаданным документов
//
Функция ЭтоСсылкаДокумента(ПроверяемаяСсылка) Экспорт
	
	ТипXML = XMLТип(ТипЗнч(ПроверяемаяСсылка));
	Если ТипXML <> Неопределено Тогда
		XMLИмяТипа = ТипXML.ИмяТипа;
		Если СтрНачинаетсяС(XMLИмяТипа, "DocumentRef.") Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Возвращает имя вида объектов метаданных по типу объекта.
// Ограничение: не обрабатываются точки маршрутов бизнес-процессов.
// См. так же ВидОбъектаПоСсылке.
//
// Параметры:
//  ТипОбъекта - Тип - тип прикладного объекта, определенный в конфигурации.
//
// Возвращаемое значение:
//  Строка - имя вида объектов метаданных. Например: "Справочник", "Документ".
// 
Функция ВидОбъектаПоТипу(ТипОбъекта) Экспорт
	
	ИмяТипа = XMLТип(ТипОбъекта).ИмяТипа;
	
	Если СтрНачинаетсяС(ИмяТипа, "CatalogRef.") Тогда
		Возврат "Справочник";
	ИначеЕсли СтрНачинаетсяС(ИмяТипа, "DocumentRef.") Тогда
		Возврат "Документ";
	ИначеЕсли СтрНачинаетсяС(ИмяТипа, "BusinessProcessRef.") Тогда
		Возврат "БизнесПроцесс";
	ИначеЕсли СтрНачинаетсяС(ИмяТипа, "ChartOfCharacteristicTypesRef.") Тогда
		Возврат "ПланВидовХарактеристик";
	ИначеЕсли СтрНачинаетсяС(ИмяТипа, "ChartOfAccountsRef.") Тогда
		Возврат "ПланСчетов";
	ИначеЕсли ПланыВидовРасчета.ТипВсеСсылки().СодержитТип(ТипОбъекта) Тогда
		Возврат "ПланВидовРасчета";
	ИначеЕсли СтрНачинаетсяС(ИмяТипа, "TaskRef.") Тогда
		Возврат "Задача";
	ИначеЕсли СтрНачинаетсяС(ИмяТипа, "ExchangePlanRef.") Тогда
		Возврат "ПланОбмена";
	ИначеЕсли СтрНачинаетсяС(ИмяТипа, "EnumRef.") Тогда
		Возврат "Перечисление";
	ИначеЕсли СтрНачинаетсяС(ИмяТипа, "InformationRegisterRecordSet.") Тогда
		Возврат "РегистрСведений";
	Иначе
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Неверный тип значения параметра (%1)'"), Строка(ТипОбъекта));
	КонецЕсли;
	
КонецФункции

// Возвращает имя вида объектов метаданных по ссылке на объект.
// Ограничение: не обрабатываются точки маршрутов бизнес-процессов.
// См. так же ВидОбъектаПоТипу.
//
// Параметры:
//  Ссылка - ЛюбаяСсылка - объект, вид которого требуется получить.
//
// Возвращаемое значение:
//  Строка - имя вида объектов метаданных. Например: "Справочник", "Документ".
// 
Функция ВидОбъектаПоСсылке(Ссылка) Экспорт
	
	Возврат ВидОбъектаПоТипу(ТипЗнч(Ссылка));
	
КонецФункции

// Возвращает строковое представление типа. 
// Для ссылочных типов возвращает в формате "СправочникСсылка.ИмяОбъекта" или "ДокументСсылка.ИмяОбъекта".
// Для остальных типов приводит тип к строке, например "Число".
//
// Параметры:
//  Тип - Тип - для которого надо получить представление.
//
// Возвращаемое значение:
//  Строка - представление типа.
//
Функция СтроковоеПредставлениеТипа(Тип) Экспорт
	
	Представление = "";
	
	ТипЗначенияТипа = ТипЗнч(Тип);
	
	Если ТипЗначенияТипа = Тип("ОписаниеТипов") Тогда
		
		ПредставленияТипов = Новый Массив();
		
		Типы = Тип.Типы();
		
		Для индекс = 0 По Типы.ВГраница() Цикл
			_Представление = СтроковоеПредставлениеТипа(Типы[индекс]);
			Если Не ПустаяСтрока(_Представление) Тогда
				ПредставленияТипов.Добавить(_Представление);
			КонецЕсли;
		КонецЦикла;
		
		Если ПредставленияТипов.Количество() = 1 Тогда
			Представление = ПредставленияТипов[0];
		ИначеЕсли ПредставленияТипов.Количество() > 1 Тогда
			Представление = СтрСоединить(ПредставленияТипов, "; ");
		КонецЕсли;
	
	ИначеЕсли ТипЗначенияТипа = Тип("Тип") Тогда
		
		ТипXML = XMLТип(Тип);
		Если ТипXML <> Неопределено И СтрНайти(ТипXML.ИмяТипа, ".") > 0 Тогда
		
			ЧастиТипа = СтрРазделить(ТипXML.ИмяТипа, ".");
			
			Если СтрНачинаетсяС(ЧастиТипа[0], "Catalog") Тогда
				Представление = "Справочник";
			ИначеЕсли СтрНачинаетсяС(ЧастиТипа[0], "Document") Тогда
				Представление = "Документ";
			ИначеЕсли СтрНачинаетсяС(ЧастиТипа[0], "Enum") Тогда
				Представление = "Перечисление";
			ИначеЕсли СтрНачинаетсяС(ЧастиТипа[0], "ExchangePlan") Тогда
				Представление = "ПланОбмена";
			КонецЕсли;
			
			Если СтрЗаканчиваетсяНа(ЧастиТипа[0], "Ref") Тогда
				Представление = Представление + "Ссылка.";
			ИначеЕсли СтрЗаканчиваетсяНа(ЧастиТипа[0], "Object") Тогда
				Представление = Представление + "Объект.";
			Иначе
				Представление = "";
			КонецЕсли;
			
			Если Не ПустаяСтрока(Представление) Тогда
				Представление = Представление + ЧастиТипа[1];
			КонецЕсли;
		
		КонецЕсли;
		
		Если ПустаяСтрока(Представление) Тогда
			Представление = ОбщегоНазначения.СтроковоеПредставлениеТипа(Тип);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПустаяСтрока(Представление) И ТипЗначенияТипа = Тип("Строка") Тогда
		Представление = Тип;
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

#КонецОбласти
