
#Область СлужебныеПроцедурыИФункции

// Задает вопрос о продолжении действия, влекущего к потере изменений.
//
Процедура SUI_ПодтвердитьЗакрытиеФормыСейчас() Экспорт
	
	SUI_ОбщегоНазначенияСлужебныйКлиент.ПодтвердитьЗакрытиеФормы();
	
КонецПроцедуры

// Задает вопрос о продолжении действия, ведущего к закрытию формы.
//
Процедура SUI_ПодтвердитьЗакрытиеПроизвольнойФормыСейчас() Экспорт
	
	SUI_ОбщегоНазначенияСлужебныйКлиент.ПодтвердитьЗакрытиеПроизвольнойФормы();
	
КонецПроцедуры

#КонецОбласти
