
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура Добавить(Таблица) Экспорт
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Таблица = Таблица;
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры

Функция ПолучитьТаблицыКПерезаписиВМУ(МобильноеУстройство, УдалятьРегистрацию = Истина) Экспорт
	
	ТаблицыКПерезаписи = Новый Соответствие();

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	SUI_ТаблицыКПерезаписиВМУИзменения.Таблица
		|ИЗ
		|	РегистрСведений.SUI_ТаблицыКПерезаписиВМУ.Изменения КАК SUI_ТаблицыКПерезаписиВМУИзменения
		|ГДЕ
		|	SUI_ТаблицыКПерезаписиВМУИзменения.Узел = &МобильноеУстройство";
	
	Запрос.УстановитьПараметр("МобильноеУстройство", МобильноеУстройство);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
	
		НачатьТранзакцию();
		
		Попытка
			
			Пока Выборка.Следующий() Цикл
				
				ИмяТаблицыМУ = SUI_НастройкиМетаданныхСервер.ПолучитьИмяТаблицыМобильногоУстройства(Выборка.Таблица);
				Если ИмяТаблицыМУ <> Неопределено Тогда
					ТаблицыКПерезаписи.Вставить(Выборка.Таблица, ИмяТаблицыМУ);
				КонецЕсли;
				
				Если УдалятьРегистрацию Тогда
					УдалитьРегистрациюТаблицы(МобильноеУстройство, Выборка.Таблица);
				КонецЕсли;

			КонецЦикла;
	
			ЗафиксироватьТранзакцию();
		
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
		
	КонецЕсли;

	Возврат ТаблицыКПерезаписи;
	
КонецФункции

Процедура УдалитьРегистрациюТаблицы(МобильноеУстройство, Таблица) Экспорт
	
	ОписаниеТипаТаблица = Новый ОписаниеТипов("ПеречислениеСсылка.SUI_ТаблицыИнтеграции");
	Если ОписаниеТипаТаблица.ПривестиЗначение(Таблица).Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Таблица.Установить(Таблица);
	
	ПланыОбмена.УдалитьРегистрациюИзменений(МобильноеУстройство, НаборЗаписей);
					
КонецПроцедуры

#КонецОбласти

#КонецЕсли
