
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если Отказ Или ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Количество() = 0 Тогда
		
		Если ОбменДанными.Получатели.Количество() > 0 Тогда
			//@skip-check wrong-type-expression
			ПланыОбмена.УдалитьРегистрациюИзменений(ОбменДанными.Получатели, ЭтотОбъект);
			ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
			ОбменДанными.Получатели.Очистить();
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(Отбор.Таблица) И
		SUI_НастройкиМетаданныхПовтИсп.ТаблицыДоступныеКПерезаписи().Найти(Отбор.Таблица) = Неопределено Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Перезапись для таблицы %1 не требуется'"), Отбор.Таблица);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
