
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если Отказ Или ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Количество() = 0 Тогда
		
		Если ОбменДанными.Получатели.Количество() > 0 Тогда
			//@skip-check wrong-type-expression
			ПланыОбмена.УдалитьРегистрациюИзменений(ОбменДанными.Получатели, ЭтотОбъект);
			ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
			ОбменДанными.Получатели.Очистить();
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(Отбор.Таблица.Значение) И
		SUI_НастройкиМетаданныхПовтИсп.ТаблицыДоступныеКПерезаписи().Найти(Отбор.Таблица.Значение) = Неопределено Тогда
			
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Перезапись в мобильном устройстве для таблицы %1 не требуется'"), 
			Отбор.Таблица.Значение);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
