
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ИнформацияОписание = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Описание");
	Элементы.ГруппаОписание.Видимость = Не ПустаяСтрока(ИнформацияОписание);
	
	ВходныеДанныеИзПараметра = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ВходныеДанные");
	ВходныеДанныеИзПараметра = ВходныеДанныеПоПараметру(ВходныеДанныеИзПараметра);
	ЗагрузитьДеревоВходныхДанных(ВходныеДанныеИзПараметра, Параметры.ВыполнениеЧерезМетодКонфигурации);
	
	КодАлгоритма = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Алгоритм");
	
	ЗаголовокИзПараметров = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Заголовок", "", Тип("Строка"));
	Если Не ПустаяСтрока(ЗаголовокИзПараметров) Тогда
		Заголовок = Заголовок + ": " + ЗаголовокИзПараметров;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Отказ Или ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		
		Оповещение = Новый ОписаниеОповещения("ПередЗакрытиемПодтверждениеСохранения", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Данные были модифицированы. Сохранить изменения?'"), РежимДиалогаВопрос.ДаНетОтмена);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КодПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаСохранитьИЗакрыть(Команда)
	ЗакрытьКонсоль();
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗакрыть(Команда)
	Модифицированность = Ложь;
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьДеревоВходныхДанных(ВходныеДанныеИзПараметра, ВыполнениеЧерезМетодКонфигурации = Ложь)
	
	ОписаниеВходныхДанных = РеквизитФормыВЗначение("ВходныеДанные", Тип("ДеревоЗначений"));
	
	Если ВыполнениеЧерезМетодКонфигурации Тогда
		Элементы.ИнформацияРезультат.Видимость = Ложь;
		СтрокаРодитель = ОписаниеВходныхДанных;
	Иначе
		
		СтрокаРодитель = ОписаниеВходныхДанных.Строки.Добавить();
		СтрокаРодитель.Ключ = "Параметры";
		СтрокаРодитель.Тип = Строка(Тип("Структура"));
		СтрокаРодитель.Описание = НСтр("ru = 'Параметры алгоритма'");
		
	КонецЕсли;
	
	Если ТипЗнч(ВходныеДанныеИзПараметра) = Тип("ДеревоЗначений") Тогда
		
		СкопироватьСтрокиДереваВходныхДанных(СтрокаРодитель, ВходныеДанныеИзПараметра);
		
		Если Не ВыполнениеЧерезМетодКонфигурации Тогда
			
			СтрокаРезультат = СтрокаРодитель.Строки.НайтиСтроки(Новый Структура("Ключ", "Результат"));
			Для индекс = 0 По СтрокаРезультат.ВГраница() Цикл
				СтрокаРодитель.Строки.Удалить(СтрокаРезультат[индекс]);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ВыполнениеЧерезМетодКонфигурации Тогда
		
		СтрокаРезультат = СтрокаРодитель.Строки.Добавить();
		СтрокаРезультат.Ключ = "Результат";
		СтрокаРезультат.Тип = "Произвольный";
		СтрокаРезультат.Описание = НСтр("ru = 'Результат выполнения алгоритма'");
	
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ОписаниеВходныхДанных, "ВходныеДанные");
	
КонецПроцедуры

&НаСервере
Функция ВходныеДанныеПоПараметру(Знач Данные)
	
	ТипЗначенияДанных = ТипЗнч(Данные);
	
	Если ТипЗначенияДанных = Тип("Строка") И ЭтоАдресВременногоХранилища(Данные) Тогда
		Данные = ПолучитьИзВременногоХранилища(Данные);
		ТипЗначенияДанных = ТипЗнч(Данные);
	КонецЕсли;
	
	Если ТипЗначенияДанных = Тип("ДеревоЗначений") Тогда
		
		Для Каждого КолонкаДанных Из Данные.Колонки Цикл
			
			Если (КолонкаДанных.Имя <> "Ключ" И КолонкаДанных.Имя <> "Тип" И КолонкаДанных.Имя <> "Описание") Или
				Не КолонкаДанных.ТипЗначения.СодержитТип(Тип("Строка")) Тогда
				Данные.Колонки.Удалить(КолонкаДанных);
			КонецЕсли;
			
		КонецЦикла;
		
		ОписаниеВходныхДанных = Данные;
		
	Иначе
		
		ОписаниеТипаСтрока = ОбщегоНазначения.ОписаниеТипаСтрока(0);
		
		ОписаниеВходныхДанных = РеквизитФормыВЗначение("ВходныеДанные", Тип("ДеревоЗначений"));
		
		Если ТипЗначенияДанных = Тип("Структура") Или ТипЗначенияДанных = Тип("ФиксированнаяСтруктура") Или
			ТипЗначенияДанных = Тип("Соответствие") Или ТипЗначенияДанных = Тип("ФиксированноеСоответствие") Тогда
			
			Для Каждого ЭлементДанных Из Данные Цикл
				
				КлючСтрокой = Строка(ЭлементДанных.Ключ);
				
				Если ПустаяСтрока(КлючСтрокой) Тогда
					Продолжить;
				КонецЕсли;
				
				Если ОписаниеВходныхДанных.Строки.Найти(КлючСтрокой, "Ключ", Истина) <> Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				НоваяСтрока = ОписаниеВходныхДанных.Строки.Добавить();
				НоваяСтрока.Ключ = КлючСтрокой;
				НоваяСтрока.Тип = ОписаниеТипаСтрока.ПривестиЗначение(ЭлементДанных.Значение);
				
			КонецЦикла;
			
		ИначеЕсли ТипЗначенияДанных = Тип("Массив") Или 
			ТипЗначенияДанных = Тип("ФиксированныйМассив") Тогда
			
			Для Каждого ЭлементДанных Из Данные Цикл
				
				КлючСтрокой = Строка(ЭлементДанных);
				
				Если ПустаяСтрока(КлючСтрокой) Тогда
					Продолжить;
				КонецЕсли;
				
				Если ОписаниеВходныхДанных.Строки.Найти(КлючСтрокой, "Ключ", Истина) <> Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				НоваяСтрока = ОписаниеВходныхДанных.Строки.Добавить();
				НоваяСтрока.Ключ = КлючСтрокой;
				
			КонецЦикла;
		
		ИначеЕсли ТипЗначенияДанных = Тип("СписокЗначений") Тогда
			
			Для Каждого ЭлементДанных Из Данные Цикл
				
				КлючСтрокой = Строка(ЭлементДанных.Значение);
				
				Если ПустаяСтрока(КлючСтрокой) Тогда
					Продолжить;
				КонецЕсли;
				
				Если ОписаниеВходныхДанных.Строки.Найти(КлючСтрокой, "Ключ", Истина) <> Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				НоваяСтрока = ОписаниеВходныхДанных.Строки.Добавить();
				НоваяСтрока.Ключ = КлючСтрокой;
				НоваяСтрока.Тип = ЭлементДанных.Представление;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОписаниеВходныхДанных.Колонки.Количество() = 0 Или ОписаниеВходныхДанных.Строки.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОписаниеВходныхДанных;
	
КонецФункции

&НаСервереБезКонтекста
Процедура СкопироватьСтрокиДереваВходныхДанных(Приемник, Источник)
	
	Для Каждого СтрокаИсточника Из Источник.Строки Цикл
		
		СтрокаПриемника = Приемник.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаПриемника, СтрокаИсточника);
		
		Если СтрокаИсточника.Строки.Количество() > 0 Тогда
			СкопироватьСтрокиДереваВходныхДанных(СтрокаПриемника, СтрокаИсточника);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемПодтверждениеСохранения(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗакрытьКонсоль();
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
		ЗакрытьКонсоль(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьКонсоль(СРезультатом = Истина)
	
	Модифицированность = Ложь;
	
	Если СРезультатом Тогда
		Закрыть(КодАлгоритма);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
