
#Область СлужебныйПрограммныйИнтерфейс

Функция СоответствиеТаблицИнтеграцииВКонфигурации() Экспорт
	
	СоответствиеТаблиц = Новый Соответствие();
	
	СоответствиеТаблиц.Вставить(Перечисления.SUI_ТаблицыИнтеграции.Контрагенты, 
		Метаданные.РегистрыСведений.SUI_tbl_countragents.ПолноеИмя());
	СоответствиеТаблиц.Вставить(Перечисления.SUI_ТаблицыИнтеграции.Склады, 
		Метаданные.РегистрыСведений.SUI_tbl_warehouses.ПолноеИмя());
	СоответствиеТаблиц.Вставить(Перечисления.SUI_ТаблицыИнтеграции.Ячейки, 
		Метаданные.РегистрыСведений.SUI_tbl_cells.ПолноеИмя());
	СоответствиеТаблиц.Вставить(Перечисления.SUI_ТаблицыИнтеграции.Номенклатура, 
		Метаданные.РегистрыСведений.SUI_tbl_goods.ПолноеИмя());
	СоответствиеТаблиц.Вставить(Перечисления.SUI_ТаблицыИнтеграции.ХарактеристикиНоменклатуры, 
		Метаданные.РегистрыСведений.SUI_tbl_properties.ПолноеИмя());
	СоответствиеТаблиц.Вставить(Перечисления.SUI_ТаблицыИнтеграции.СерииНоменклатуры, 
		Метаданные.РегистрыСведений.SUI_tbl_series.ПолноеИмя());
	СоответствиеТаблиц.Вставить(Перечисления.SUI_ТаблицыИнтеграции.УпаковкиНоменклатуры, 
		Метаданные.РегистрыСведений.SUI_tbl_units.ПолноеИмя());
	СоответствиеТаблиц.Вставить(Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыНоменклатуры, 
		Метаданные.РегистрыСведений.SUI_tbl_barcodes.ПолноеИмя());
	СоответствиеТаблиц.Вставить(Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыУпаковок, 
		Метаданные.РегистрыСведений.SUI_tbl_marking_codes.ПолноеИмя());
	СоответствиеТаблиц.Вставить(Перечисления.SUI_ТаблицыИнтеграции.Документы, 
		Метаданные.РегистрыСведений.SUI_docs.ПолноеИмя());
	СоответствиеТаблиц.Вставить(Перечисления.SUI_ТаблицыИнтеграции.ТоварыДокументов, 
		Метаданные.РегистрыСведений.SUI_docs_tbl_goods.ПолноеИмя());
	СоответствиеТаблиц.Вставить(Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыУпаковокДокументов, 
		Метаданные.РегистрыСведений.SUI_ШтрихкодыУпаковокДокументовОбмена.ПолноеИмя());
	СоответствиеТаблиц.Вставить(Перечисления.SUI_ТаблицыИнтеграции.СерииДокументов, 
		Метаданные.РегистрыСведений.SUI_docs_tbl_series.ПолноеИмя());
	СоответствиеТаблиц.Вставить(Перечисления.SUI_ТаблицыИнтеграции.ДокументыАдресногоХранения, 
		Метаданные.РегистрыСведений.SUI_docs.ПолноеИмя());
	СоответствиеТаблиц.Вставить(Перечисления.SUI_ТаблицыИнтеграции.ТоварыДокументовАдресногоХранения, 
		Метаданные.РегистрыСведений.SUI_docs_tbl_goods.ПолноеИмя());
	СоответствиеТаблиц.Вставить(Перечисления.SUI_ТаблицыИнтеграции.НастройкиДокументов, 
		Метаданные.Справочники.SUI_НастройкиДокументов.ПолноеИмя());
	СоответствиеТаблиц.Вставить(Перечисления.SUI_ТаблицыИнтеграции.ШаблоныЭтикеток,
		Метаданные.РегистрыСведений.SUI_tbl_label_templates.ПолноеИмя());
	СоответствиеТаблиц.Вставить(Перечисления.SUI_ТаблицыИнтеграции.ПользователиТСД,
		Метаданные.Справочники.SUI_ПользователиТСД.ПолноеИмя());
	СоответствиеТаблиц.Вставить(SUI_ПакетыДанныхКлиентСервер.КлючТаблицы_Сообщения(),
		Метаданные.РегистрыСведений.SUI_СообщенияМобильныхУстройств.ПолноеИмя());
	
	Возврат Новый ФиксированноеСоответствие(СоответствиеТаблиц);
	
КонецФункции

Функция СоответсвиеКонстантТаблицИнтеграции() Экспорт

	СоответсвиеКонстант = Новый Соответствие();
	
	СоответсвиеКонстант.Вставить(Перечисления.SUI_ТаблицыИнтеграции.Контрагенты, 
		Константы.SUI_ИспользоватьТаблицу_Контрагенты);
	СоответсвиеКонстант.Вставить(Перечисления.SUI_ТаблицыИнтеграции.Склады, 
		Константы.SUI_ИспользоватьТаблицу_Склады);
	СоответсвиеКонстант.Вставить(Перечисления.SUI_ТаблицыИнтеграции.Ячейки, 
		Константы.SUI_ИспользоватьТаблицу_Ячейки);
	СоответсвиеКонстант.Вставить(Перечисления.SUI_ТаблицыИнтеграции.Номенклатура, 
		Константы.SUI_ИспользоватьТаблицу_Номенклатура);
	СоответсвиеКонстант.Вставить(Перечисления.SUI_ТаблицыИнтеграции.ХарактеристикиНоменклатуры, 
		Константы.SUI_ИспользоватьТаблицу_ХарактеристикиНоменклатуры);
	СоответсвиеКонстант.Вставить(Перечисления.SUI_ТаблицыИнтеграции.СерииНоменклатуры, 
		Константы.SUI_ИспользоватьТаблицу_СерииНоменклатуры);
	СоответсвиеКонстант.Вставить(Перечисления.SUI_ТаблицыИнтеграции.УпаковкиНоменклатуры, 
		Константы.SUI_ИспользоватьТаблицу_УпаковкиНоменклатуры);
	СоответсвиеКонстант.Вставить(Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыНоменклатуры, 
		Константы.SUI_ИспользоватьТаблицу_ШтрихкодыНоменклатуры);
	СоответсвиеКонстант.Вставить(Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыУпаковок, 
		Константы.SUI_ИспользоватьТаблицу_ШтрихкодыУпаковок);
	СоответсвиеКонстант.Вставить(Перечисления.SUI_ТаблицыИнтеграции.ШаблоныЭтикеток, 
		Константы.SUI_ИспользоватьТаблицу_ШаблоныЭтикеток);
	СоответсвиеКонстант.Вставить(Перечисления.SUI_ТаблицыИнтеграции.ПользователиТСД, 
		Константы.SUI_ИспользоватьТаблицу_ПользователиТСД);
	
	Возврат Новый ФиксированноеСоответствие(СоответсвиеКонстант);
	
КонецФункции

Функция СоответсвиеФункциональныхОпцийТаблицИнтеграции() Экспорт
	
	СоответсвиеФункциональныхОпций = Новый Соответствие();
	
	СоответсвиеФункциональныхОпций.Вставить(Перечисления.SUI_ТаблицыИнтеграции.Контрагенты, 
		"SUI_ИспользоватьТаблицу_Контрагенты");
	СоответсвиеФункциональныхОпций.Вставить(Перечисления.SUI_ТаблицыИнтеграции.Склады, 
		"SUI_ИспользоватьТаблицу_Склады");
	СоответсвиеФункциональныхОпций.Вставить(Перечисления.SUI_ТаблицыИнтеграции.Ячейки, 
		"SUI_ИспользоватьТаблицу_Ячейки");
	СоответсвиеФункциональныхОпций.Вставить(Перечисления.SUI_ТаблицыИнтеграции.Номенклатура, 
		"SUI_ИспользоватьТаблицу_Номенклатура");
	СоответсвиеФункциональныхОпций.Вставить(Перечисления.SUI_ТаблицыИнтеграции.ХарактеристикиНоменклатуры, 
		"SUI_ИспользоватьТаблицу_ХарактеристикиНоменклатуры");
	СоответсвиеФункциональныхОпций.Вставить(Перечисления.SUI_ТаблицыИнтеграции.СерииНоменклатуры, 
		"SUI_ИспользоватьТаблицу_СерииНоменклатуры");
	СоответсвиеФункциональныхОпций.Вставить(Перечисления.SUI_ТаблицыИнтеграции.УпаковкиНоменклатуры, 
		"SUI_ИспользоватьТаблицу_УпаковкиНоменклатуры");
	СоответсвиеФункциональныхОпций.Вставить(Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыНоменклатуры, 
		"SUI_ИспользоватьТаблицу_ШтрихкодыНоменклатуры");
	СоответсвиеФункциональныхОпций.Вставить(Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыУпаковок, 
		"SUI_ИспользоватьТаблицу_ШтрихкодыУпаковок");
	СоответсвиеФункциональныхОпций.Вставить(Перечисления.SUI_ТаблицыИнтеграции.ШаблоныЭтикеток, 
		"SUI_ИспользоватьТаблицу_ШаблоныЭтикеток");
	СоответсвиеФункциональныхОпций.Вставить(Перечисления.SUI_ТаблицыИнтеграции.ПользователиТСД, 
		"SUI_ИспользоватьТаблицу_ПользователиТСД");
	
	Возврат Новый ФиксированноеСоответствие(СоответсвиеФункциональныхОпций);
	
КонецФункции

Функция ТаблицыИнтеграции() Экспорт
	
	ТаблицыИнтеграции = Новый СписокЗначений();

	ТаблицыИнтеграции.Добавить(Перечисления.SUI_ТаблицыИнтеграции.Контрагенты, 
		Перечисления.SUI_ТаблицыИнтеграции.Контрагенты);
	ТаблицыИнтеграции.Добавить(Перечисления.SUI_ТаблицыИнтеграции.Склады, 
		Перечисления.SUI_ТаблицыИнтеграции.Склады);
	ТаблицыИнтеграции.Добавить(Перечисления.SUI_ТаблицыИнтеграции.Ячейки, 
		Перечисления.SUI_ТаблицыИнтеграции.Ячейки);
	ТаблицыИнтеграции.Добавить(Перечисления.SUI_ТаблицыИнтеграции.Номенклатура, 
		Перечисления.SUI_ТаблицыИнтеграции.Номенклатура);
	ТаблицыИнтеграции.Добавить(Перечисления.SUI_ТаблицыИнтеграции.ХарактеристикиНоменклатуры, 
		Перечисления.SUI_ТаблицыИнтеграции.ХарактеристикиНоменклатуры);
	ТаблицыИнтеграции.Добавить(Перечисления.SUI_ТаблицыИнтеграции.СерииНоменклатуры, 
		Перечисления.SUI_ТаблицыИнтеграции.СерииНоменклатуры);
	ТаблицыИнтеграции.Добавить(Перечисления.SUI_ТаблицыИнтеграции.УпаковкиНоменклатуры, 
		Перечисления.SUI_ТаблицыИнтеграции.УпаковкиНоменклатуры);
	ТаблицыИнтеграции.Добавить(Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыНоменклатуры, 
		Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыНоменклатуры);
	ТаблицыИнтеграции.Добавить(Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыУпаковок, 
		Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыУпаковок);
	ТаблицыИнтеграции.Добавить(Перечисления.SUI_ТаблицыИнтеграции.ШаблоныЭтикеток, 
		Перечисления.SUI_ТаблицыИнтеграции.ШаблоныЭтикеток);
	// TODO: Сандалов: Временное отключениеВременно убрать до реализации авторизации на ТСД	
	//ТаблицыИнтеграции.Добавить(Перечисления.SUI_ТаблицыИнтеграции.ПользователиТСД, 
	//	Перечисления.SUI_ТаблицыИнтеграции.ПользователиТСД);
		
	Возврат ТаблицыИнтеграции;

КонецФункции

Функция ТаблицыИнтеграцииВКонфигурации() Экспорт
	
	Таблицы = Новый Массив();
	
	Таблицы.Добавить(Метаданные.РегистрыСведений.SUI_tbl_countragents.ПолноеИмя());
	Таблицы.Добавить(Метаданные.РегистрыСведений.SUI_tbl_warehouses.ПолноеИмя());
	Таблицы.Добавить(Метаданные.РегистрыСведений.SUI_tbl_cells.ПолноеИмя());
	Таблицы.Добавить(Метаданные.РегистрыСведений.SUI_tbl_goods.ПолноеИмя());
	Таблицы.Добавить(Метаданные.РегистрыСведений.SUI_tbl_properties.ПолноеИмя());
	Таблицы.Добавить(Метаданные.РегистрыСведений.SUI_tbl_series.ПолноеИмя());
	Таблицы.Добавить(Метаданные.РегистрыСведений.SUI_tbl_units.ПолноеИмя());
	Таблицы.Добавить(Метаданные.РегистрыСведений.SUI_tbl_barcodes.ПолноеИмя());
	Таблицы.Добавить(Метаданные.РегистрыСведений.SUI_tbl_marking_codes.ПолноеИмя());
	Таблицы.Добавить(Метаданные.РегистрыСведений.SUI_tbl_label_templates.ПолноеИмя());
	
	Возврат Новый ФиксированныйМассив(Таблицы);
	
КонецФункции

Функция ТаблицыДоступныеКПерезаписи() Экспорт
	
	Таблицы = Новый Массив();
	
	ПараметрыВыбора = Метаданные.РегистрыСведений.SUI_ТаблицыКПерезаписиВМУ.Измерения.Таблица.ПараметрыВыбора;
	
	Для Каждого ПараметрВыбора Из ПараметрыВыбора Цикл
		
		Если ПараметрВыбора.Имя <> "Отбор.Ссылка" Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(ПараметрВыбора.Значение) = Тип("ФиксированныйМассив") Тогда
			Таблицы = SUI_ОбщегоНазначения.СкопироватьРекурсивно(ПараметрВыбора.Значение, Ложь);
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Новый ФиксированныйМассив(Таблицы);
	
КонецФункции

Функция ТаблицыДополнительныхНастроек() Экспорт
	
	Таблицы = Новый Массив();
	
	ПараметрыВыбора = Метаданные.РегистрыСведений.SUI_ДополнительныеНастройкиТаблицИнтеграции
		.Измерения.ТаблицаИнтеграции.ПараметрыВыбора;
	
	Для Каждого ПараметрВыбора Из ПараметрыВыбора Цикл
		
		Если ПараметрВыбора.Имя <> "Отбор.Ссылка" Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(ПараметрВыбора.Значение) = Тип("ФиксированныйМассив") Тогда
			Таблицы = SUI_ОбщегоНазначения.СкопироватьРекурсивно(ПараметрВыбора.Значение, Ложь);
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Новый ФиксированныйМассив(Таблицы);
	
КонецФункции

#КонецОбласти
