
#Область ПрограммныйИнтерфейс

Функция ПолучитьНастройкиДляВыгрузки(АдресРезультата = Неопределено) Экспорт
	Возврат SUI_НастройкиМетаданныхСервер.ПолучитьНастройкиДляВыгрузкиВФайл(АдресРезультата);
КонецФункции

Функция ЗагрузитьНастройкиИзФайла(Настройки, ИдентификаторФормы = Неопределено) Экспорт

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторФормы);
	Возврат ДлительныеОперации.ВыполнитьВФоне("SUI_НастройкиМетаданныхСервер.ЗагрузитьНастройкиИзФайла", 
		Настройки, ПараметрыВыполнения);
		
КонецФункции

Функция ПолучитьПользовательскийЗапрос() Экспорт
	Возврат SUI_НастройкиМетаданныхСервер.ПолучитьПользовательскийЗапрос();
КонецФункции

Процедура СохранитьПользовательскийЗапрос(ДанныеКонструктора) Экспорт
	SUI_НастройкиМетаданныхСервер.СохранитьПользовательскийЗапрос(ДанныеКонструктора);
КонецПроцедуры

#КонецОбласти
