
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ПолучитьКоличествоИзменений(Параметры, АдресРезультата) Экспорт

	СписокТаблиц = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "СписокТаблиц");
	СписокМобильныхУстройств = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "СписокМобильныхУстройств");

	Результат = Новый ТаблицаЗначений;
	Колонки = Результат.Колонки;
	Колонки.Добавить("ПолноеИмяМетаданных");
	Колонки.Добавить("МобильноеУстройство");
	Колонки.Добавить("КоличествоИзменений");

	Результат.Индексы.Добавить("ПолноеИмяМетаданных");
	Результат.Индексы.Добавить("МобильноеУстройство");

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокМобильныхУстройств", СписокМобильныхУстройств);
	
	// На входе или массив или структура/соответствие со многими массивами
	Если СписокТаблиц <> Неопределено И ЗначениеЗаполнено(СписокМобильныхУстройств) Тогда
		
		Если ТипЗнч(СписокТаблиц) = Тип("Массив") Тогда
			Источник = Новый Структура("_", СписокТаблиц);
		Иначе
			Источник = СписокТаблиц;
		КонецЕсли;
	
		// Пачками по 200 таблиц в запросе
		Текст = "";
		Номер = 0;
		Для Каждого КлючЗначение Из Источник Цикл
			
			Если ТипЗнч(КлючЗначение.Значение) <> Тип("Массив") Тогда
				Продолжить;
			КонецЕсли;
	
			Для Каждого Элемент Из КлючЗначение.Значение Цикл
				
				Если ПустаяСтрока(Элемент) Тогда
					Продолжить;
				КонецЕсли;
	
				Текст = Текст + ?(Текст = "", "", "ОБЪЕДИНИТЬ ВСЕ") + " 
				|ВЫБРАТЬ 
				|	""" + Элемент + """ КАК ПолноеИмяМетаданных,
				|	Узел                КАК МобильноеУстройство,
				|	КОЛИЧЕСТВО(*)              КАК КоличествоИзменений
				|ИЗ
				|	" + Элемент + ".Изменения
				|ГДЕ
				|	Узел В (&СписокМобильныхУстройств)
				|СГРУППИРОВАТЬ ПО
				|	Узел
				|";
	
				Номер = Номер + 1;
				Если Номер = 200 Тогда
					Запрос.Текст = Текст;
					//@skip-check query-in-loop
					Выборка = Запрос.Выполнить().Выбрать();
					Пока Выборка.Следующий() Цикл
						ЗаполнитьЗначенияСвойств(Результат.Добавить(), Выборка);
					КонецЦикла;
					Текст = "";
					Номер = 0;
				КонецЕсли;
	
			КонецЦикла;
		КонецЦикла;
		
		// Дочитываем хвосты
		Если Текст <> "" Тогда
			Запрос.Текст = Текст;
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(Результат.Добавить(), Выборка);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	
КонецПроцедуры

Функция ПараметрыВыполненияДействияНаУзлах(МобильноеУстройство, РегистрацияИзменений) Экспорт
	
	ПараметрыВыполнения = Новый Структура();
	
	ПараметрыВыполнения.Вставить("МобильноеУстройство", МобильноеУстройство);
	
	Если РегистрацияИзменений Тогда
		ПараметрыВыполнения.Вставить("ЗарегистрироватьИзменения");
	Иначе
		ПараметрыВыполнения.Вставить("УдалитьРегистрациюИзменений");
	КонецЕсли;
	
	ПараметрыВыполнения.Вставить("МетаданныеВыбранныхЗначений");
	ПараметрыВыполнения.Вставить("ВыбранныеЗначения");
	ПараметрыВыполнения.Вставить("ВыбранныеМетаданные");
	
	Возврат ПараметрыВыполнения;
	
КонецФункции

Процедура ВыполнитьДействиеНаУзлах(ПараметрыВыполнения, АдресРезультата) Экспорт

	РезультатВыполнения = Ложь;
	
	Результат = ПодготовитьДанныеДляВыполненияДействия(ПараметрыВыполнения);	

	Если Результат.Метаданные.Количество() > 0 Или Результат.Значения.Количество() > 0 Тогда

		Для индекс = 0 По Результат.Метаданные.ВГраница() Цикл
			
			НачатьТранзакцию();
		
			Попытка
				
				Если Результат.ЗарегистрироватьИзменения Тогда
					ПланыОбмена.ЗарегистрироватьИзменения(Результат.МобильноеУстройство, Результат.Метаданные[индекс]);
				ИначеЕсли Результат.УдалитьРегистрациюИзменений Тогда
					ПланыОбмена.УдалитьРегистрациюИзменений(Результат.МобильноеУстройство, Результат.Метаданные[индекс]);
				КонецЕсли;
				
				РезультатВыполнения = Истина;
				
				ЗафиксироватьТранзакцию();
				
			Исключение
				ОтменитьТранзакцию();
				ВызватьИсключение;
			КонецПопытки;
				
		КонецЦикла;
		
		НачатьТранзакцию();
		
		Попытка
	
			Для индекс = 0 По Результат.Значения.ВГраница() Цикл
				
				Если Результат.ЗарегистрироватьИзменения Тогда
					ПланыОбмена.ЗарегистрироватьИзменения(Результат.МобильноеУстройство, Результат.Значения[индекс]);
				ИначеЕсли Результат.УдалитьРегистрациюИзменений Тогда
					ПланыОбмена.УдалитьРегистрациюИзменений(Результат.МобильноеУстройство, Результат.Значения[индекс]);
				КонецЕсли;
				
			КонецЦикла;
			
			РезультатВыполнения = Истина;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
		
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресРезультата);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПодготовитьДанныеДляВыполненияДействия(Знач ПараметрыВыполнения)
	
	Результат = Новый Структура();
	Результат.Вставить("МобильноеУстройство");
	Результат.Вставить("ЗарегистрироватьИзменения", 	Ложь);
	Результат.Вставить("УдалитьРегистрациюИзменений", 	Ложь);
	Результат.Вставить("Метаданные", 					Новый Массив());
	Результат.Вставить("Значения", 						Новый Массив());
	
	ОписаниеТипаМУ = Новый ОписаниеТипов("ПланОбменаСсылка.SUI_МобильныеУстройства");
	Результат.МобильноеУстройство = ОписаниеТипаМУ.ПривестиЗначение(ПараметрыВыполнения.МобильноеУстройство);
	
	ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(Результат.МобильноеУстройство),
		НСтр("ru = 'Для выполнения действия не передано значение ""МобильноеУстройство""'"));
		
	Если ПараметрыВыполнения.Свойство("ЗарегистрироватьИзменения") Тогда
		Результат.ЗарегистрироватьИзменения 	= Истина;
		Результат.УдалитьРегистрациюИзменений 	= Ложь;
	ИначеЕсли ПараметрыВыполнения.Свойство("УдалитьРегистрациюИзменений") Тогда
		Результат.ЗарегистрироватьИзменения 	= Ложь;
		Результат.УдалитьРегистрациюИзменений 	= Истина;
	Иначе
		ВызватьИсключение НСтр("ru = 'Для выполнения действия не передано имя действия'");
	КонецЕсли;
	
	Если SUI_ОбщегоНазначенияПереопределяемый.ЭтоСсылка(ТипЗнч(ПараметрыВыполнения.ВыбранныеЗначения)) Тогда
		ПараметрыВыполнения.ВыбранныеЗначения = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
			Новый Структура("Ссылка", ПараметрыВыполнения.ВыбранныеЗначения));
	КонецЕсли;
	
	ОписаниеТипаМассив = Новый ОписаниеТипов("Массив");
	ПараметрыВыполнения.ВыбранныеЗначения = ОписаниеТипаМассив.ПривестиЗначение(ПараметрыВыполнения.ВыбранныеЗначения);
	ПараметрыВыполнения.ВыбранныеМетаданные = ОписаниеТипаМассив.ПривестиЗначение(ПараметрыВыполнения.ВыбранныеМетаданные);

	ПараметрыВыполнения.МетаданныеВыбранныхЗначений = ОбщегоНазначения.ОписаниеТипаСтрока(0).ПривестиЗначение(
		ПараметрыВыполнения.МетаданныеВыбранныхЗначений);
		
	Если ПустаяСтрока(ПараметрыВыполнения.МетаданныеВыбранныхЗначений) Или 
		Не ЗначениеЗаполнено(ПараметрыВыполнения.ВыбранныеЗначения) Тогда
		ПараметрыВыполнения.МетаданныеВыбранныхЗначений = Неопределено;
		ПараметрыВыполнения.ВыбранныеЗначения = Неопределено;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрыВыполнения.ВыбранныеМетаданные) Тогда
		ПараметрыВыполнения.ВыбранныеМетаданные = Неопределено;
	КонецЕсли;

	Если ПараметрыВыполнения.ВыбранныеЗначения <> Неопределено Тогда
		
		МетаданныеВыбранныхЗначений = Метаданные.НайтиПоПолномуИмени(ПараметрыВыполнения.МетаданныеВыбранныхЗначений);
		
		Если ОбщегоНазначения.ЭтоСправочник(МетаданныеВыбранныхЗначений) Или
			ОбщегоНазначения.ЭтоДокумент(МетаданныеВыбранныхЗначений) Тогда
			
			Для индекс = 0 По ПараметрыВыполнения.ВыбранныеЗначения.ВГраница() Цикл
				
				Если ПараметрыВыполнения.ВыбранныеЗначения[индекс].Свойство("Ссылка") И
					ЗначениеЗаполнено(ПараметрыВыполнения.ВыбранныеЗначения[индекс].Ссылка) Тогда
					Результат.Значения.Добавить(ПараметрыВыполнения.ВыбранныеЗначения[индекс].Ссылка);
				КонецЕсли;
				
			КонецЦикла;
			
		ИначеЕсли ОбщегоНазначения.ЭтоРегистр(МетаданныеВыбранныхЗначений) Тогда
		
			Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(МетаданныеВыбранныхЗначений.ПолноеИмя());
			
			Для индекс = 0 По ПараметрыВыполнения.ВыбранныеЗначения.ВГраница() Цикл
				
				Если Не ЗначениеЗаполнено(ПараметрыВыполнения.ВыбранныеЗначения[индекс]) Тогда
					Продолжить;
				КонецЕсли;
				
				ОтборУстановлен = Ложь;
				НаборЗаписей = Менеджер.СоздатьНаборЗаписей();
				
				Для Каждого КлючЗначение Из ПараметрыВыполнения.ВыбранныеЗначения[индекс] Цикл
					
					Если ЗначениеЗаполнено(КлючЗначение.Значение) Тогда
						НаборЗаписей.Отбор[КлючЗначение.Ключ].Установить(КлючЗначение.Значение);
						ОтборУстановлен = Истина;
					КонецЕсли;
					
				КонецЦикла;
				
				Если ОтборУстановлен Тогда
					Результат.Значения.Добавить(НаборЗаписей);
				КонецЕсли;

			КонецЦикла;
		
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПараметрыВыполнения.ВыбранныеМетаданные <> Неопределено Тогда
		
		Для Каждого ИмяВыбранныхМетаданных Из ПараметрыВыполнения.ВыбранныеМетаданные Цикл
			МетаданныеВыбранные = Метаданные.НайтиПоПолномуИмени(ИмяВыбранныхМетаданных);
			Если МетаданныеВыбранные <> Неопределено Тогда
				Результат.Метаданные.Добавить(МетаданныеВыбранные);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
