
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ИмяСобытия(ВложенноеСобытие = "") Экспорт
	Возврат НСтр("ru = 'Импорт экспорт настроек'") + ?(ПустаяСтрока(ВложенноеСобытие), "", "." + ВложенноеСобытие);
КонецФункции

Функция ИндексКартинкиКаталога() Экспорт
	Возврат 2;
КонецФункции

Функция ИндексКартинкиФайла() Экспорт
	Возврат 10;
КонецФункции

// Области настроек.
// 
// Возвращаемое значение:
//  ФиксированныйМассив из Строка - Области настроек
Функция ОбластиНастроек() Экспорт
	
	Области = Новый Массив();
	Области.Добавить("Настройки документов");
	Области.Добавить("Настройки подсистемы");
	
	Возврат Новый ФиксированныйМассив(Области);
	
КонецФункции

Функция ПреобразованиеДанныхJSON(Свойство, Значение, ДополнительныеПараметры, Отказ) Экспорт
	
	Если Значение <> Неопределено Тогда
	
		ТипЗначения = XMLТипЗнч(Значение).ИмяТипа;
		
		Если СтрНайти(ТипЗначения, "Ref.") > 0 Или ТипЗначения = "UUID" Тогда
			Возврат XMLСтрока(Значение);
		КонецЕсли;

	КонецЕсли;

КонецФункции

Процедура ЗаполнитьДеревоНастроек(Параметры, АдресРезультата) Экспорт
	
	НомерОбластиНастройки = ОбластиНастроек().Найти(Параметры.Область);
	
	ОбщегоНазначенияКлиентСервер.Проверить(НомерОбластиНастройки <> Неопределено,
		СтрШаблон(НСтр("ru = 'Неизвестная область настроек (%1).'"), Параметры.Область));
	
	Параметры.НастройкиДерево.Строки.Очистить();
	
	Если Параметры.Свойство("ДанныеФайла") Тогда
		
		Если Параметры.Свойство("КаталогВОбласти") Тогда
			КаталогВОбласти = Параметры.КаталогВОбласти;
		Иначе
			КаталогВОбласти = "";
		КонецЕсли;
		
		ЗаполнитьДеревоНастроек_ИзФайлаВыгрузки(
			Параметры.НастройкиДерево, 
			Параметры.ДанныеФайла, 
			Параметры.Область,
			КаталогВОбласти);
			
	ИначеЕсли Параметры.Свойство("ДанныеСхемы") Тогда
		
		ЗаполнитьДеревоНастроек_ИзСхемы(
			Параметры.НастройкиДерево, 
			Параметры.Область, 
			Параметры.Конфигурация, 
			Параметры.ДанныеСхемы);
		
	ИначеЕсли Параметры.Свойство("ЭтоВыгрузка") Тогда
		
		Если НомерОбластиНастройки = 0 Тогда
			ЗаполнитьДеревоНастроек_НастройкиДокументов(Параметры.НастройкиДерево);
		ИначеЕсли НомерОбластиНастройки = 1 Тогда
			ЗаполнитьДеревоНастроек_НастройкиПодсистемы(Параметры.НастройкиДерево);
		КонецЕсли;
		
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(Параметры.НастройкиДерево, АдресРезультата);
	
КонецПроцедуры

Процедура ВыгрузитьВФайл(Параметры, АдресРезультата, АдресДополнительногоРезультата) Экспорт
	
	НомерОбластиНастройки = ОбластиНастроек().Найти(Параметры.Область);
	
	ОбщегоНазначенияКлиентСервер.Проверить(НомерОбластиНастройки <> Неопределено,
		СтрШаблон(НСтр("ru = 'Неизвестная область настроек (%1).'"), Параметры.Область));
	
	ОбщегоНазначенияКлиентСервер.Проверить(
		Параметры.ДеревоНастройки.Строки.НайтиСтроки(ПараметрыПоискаОтмеченныхНастроек(), Истина).Количество() > 0,
		НСтр("ru = 'Не выбраны настройки для выгрузки.'"));
	
	ВременныйКаталог = ФайловаяСистема.СоздатьВременныйКаталог();
	
	Попытка
		
		// Область: Настройки документов
		Если НомерОбластиНастройки = 0 Тогда
			ВыгрузитьВФайлы_НастройкиДокументов(ВременныйКаталог, Параметры.ДеревоНастройки);
			
		// Область: Настройки подсистемы
		ИначеЕсли НомерОбластиНастройки = 1 Тогда
			ВыгрузитьВФайлы_НастройкиПодсистемы(ВременныйКаталог, Параметры.ДеревоНастройки);
		КонецЕсли;
		
		// Файл области настроек
		ЗаписатьКонфигурационныйФайлНастроек(ВременныйКаталог, Параметры.Область);
		
		АрхивНастроек = СформироватьАрхив(ВременныйКаталог);
		
		ФайловаяСистема.УдалитьВременныйКаталог(ВременныйКаталог);
		
		ПоместитьВоВременноеХранилище(АрхивНастроек, АдресРезультата);
		ПоместитьВоВременноеХранилище(Параметры.ДеревоНастройки, АдресДополнительногоРезультата);
		
	Исключение
		ФайловаяСистема.УдалитьВременныйКаталог(ВременныйКаталог);
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(НСтр("ru = 'Выгрузка в файл'")), , 
			Метаданные.Обработки.SUI_ИмпортЭкспортНастроек, , ИнформацияОбОшибке());
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаписатьНастройки(Параметры, АдресРезультата) Экспорт
	
	РезультатЗаписиНастроек = Новый Структура();
	РезультатЗаписиНастроек.Вставить("ЗаписанныеКлючи", Новый Массив());
	РезультатЗаписиНастроек.Вставить("ВсегоНастроекКЗаписи", 0);
	РезультатЗаписиНастроек.Вставить("ВсегоНастроекЗаписано", 0);
	
	Результат = Новый Структура();
	Результат.Вставить("НастройкиДерево", Параметры.НастройкиДерево);
	Результат.Вставить("РезультатЗаписиНастроек", РезультатЗаписиНастроек);
	
	ОбщегоНазначенияКлиентСервер.Проверить(ОбластиНастроек().Найти(Параметры.Область) <> Неопределено,
		СтрШаблон(НСтр("ru = 'Неизвестная область настроек (%1).'"), Параметры.Область));
	
	НастройкиКЗаписи = Результат.НастройкиДерево.Строки.НайтиСтроки(ПараметрыПоискаОтмеченныхНастроек(), Истина);
	Результат.РезультатЗаписиНастроек.ВсегоНастроекКЗаписи = НастройкиКЗаписи.Количество();
	
	ОбщегоНазначенияКлиентСервер.Проверить(Результат.РезультатЗаписиНастроек.ВсегоНастроекКЗаписи > 0,
		НСтр("ru = 'Не выбраны настройки для записи.'"));
	
	ВременныйКаталог = ФайловаяСистема.СоздатьВременныйКаталог();
	
	НачатьТранзакцию();
	
	Попытка
		
		ФайлАрхив = Новый ЧтениеZipФайла(Параметры.ДанныеФайла.ОткрытьПотокДляЧтения());
		ФайлАрхив.ИзвлечьВсе(ВременныйКаталог, РежимВосстановленияПутейФайловZIP.Восстанавливать);
		ФайлАрхив.Закрыть();
		
		Если Параметры.Свойство("ЗагруженноССайта") Тогда
			
			ФайлНеНайденныхНастроек = Новый Файл(SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(
				ВременныйКаталог, "notFound.txt"));
			
			Если ФайлНеНайденныхНастроек.Существует() И ФайлНеНайденныхНастроек.ЭтоФайл() Тогда
				
				ТекстовыйФайл = Новый ТекстовыйДокумент();
				ТекстовыйФайл.Прочитать(ФайлНеНайденныхНастроек.ПолноеИмя, КодировкаТекста.UTF8, Символы.ВК + Символы.ПС);
				
				Для Индекс = 1 По ТекстовыйФайл.КоличествоСтрок() Цикл
					НеНайденныйФайл = ТекстовыйФайл.ПолучитьСтроку(Индекс);
					ТекстСообщения = СтрШаблон(НСтр("ru = 'Файл настройки ""%1"" на сайте не существует'"), НеНайденныйФайл);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			    КонецЦикла;
				
			КонецЕсли;
			
		Иначе
			
			КонфигурационныйФайл = ПрочитатьКонфигурационныйФайлНастроек(ВременныйКаталог);
			
			ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(КонфигурационныйФайл.Область),
				НСтр("ru = 'Конфигурационный файл настроек поврежден.'"));
			
			ОбщегоНазначенияКлиентСервер.Проверить(Параметры.Область = КонфигурационныйФайл.Область,
				СтрШаблон(НСтр("ru = 'Файл настроек ""%1"" не принадлежит области настроек ""%2"".'"), 
				КонфигурационныйФайл.Область, Параметры.Область));
			
		КонецЕсли;
		
		Для индекс = 0 По НастройкиКЗаписи.ВГраница() Цикл
			
			ПараметрыЗаписи = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, 
				"ПараметрыЗаписи", Новый Структура(), Тип("Структура"));
			
			РезультатЗаписиНастройки = ЗаписатьНастройку(ВременныйКаталог, НастройкиКЗаписи[индекс], 
				Результат.РезультатЗаписиНастроек.ЗаписанныеКлючи, ПараметрыЗаписи);
			
			Если РезультатЗаписиНастройки Тогда
				НастройкиКЗаписи[индекс].Пометка = 0;
				ПроставитьПометкиВверх(НастройкиКЗаписи[индекс]);
				Результат.РезультатЗаписиНастроек.ВсегоНастроекЗаписано = 
					Результат.РезультатЗаписиНастроек.ВсегоНастроекЗаписано + 1;
			КонецЕсли;
			
		КонецЦикла;
		
		ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
		
		ФайловаяСистема.УдалитьВременныйКаталог(ВременныйКаталог);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ФайловаяСистема.УдалитьВременныйКаталог(ВременныйКаталог);
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(НСтр("ru = 'Запись настроек'")), , 
			Метаданные.Обработки.SUI_ИмпортЭкспортНастроек, , ИнформацияОбОшибке());
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Функция ПараметрыПоискаОтмеченныхНастроек() Экспорт
	
	ПараметрыПоиска = Новый Структура();
	ПараметрыПоиска.Вставить("ИндексКартинки", ИндексКартинкиФайла());
	ПараметрыПоиска.Вставить("Пометка", 1);
	
	Возврат ПараметрыПоиска;
	
КонецФункции

Процедура ПолучитьСписокКонфигурацийПредопределенныхНастроек(Параметры, АдресРезультата, 
	АдресДополнительногоРезультата) Экспорт
	
	СписокКонфигураций = Новый СписокЗначений();
	
	ДанныеФайла = ПолучитьФайлПредопределеннойНастройкиПоОбласти(Параметры.Область);
	
	ВременныйКаталог = ФайловаяСистема.СоздатьВременныйКаталог();
	
	Попытка
		
		ФайлАрхив = Новый ЧтениеZipФайла(ДанныеФайла.ОткрытьПотокДляЧтения());
		ФайлАрхив.ИзвлечьВсе(ВременныйКаталог, РежимВосстановленияПутейФайловZIP.Восстанавливать);
		ФайлАрхив.Закрыть();
		
		КаталогОбласти = Новый Файл(SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(ВременныйКаталог, Параметры.Область));
		
		Если КаталогОбласти.Существует() И КаталогОбласти.ЭтоКаталог() Тогда
			
			Для Каждого ЭлементКаталога Из НайтиФайлы(КаталогОбласти.ПолноеИмя, "*") Цикл
				
				Если ЭлементКаталога.ЭтоКаталог() И
					НайтиФайлы(ЭлементКаталога.ПолноеИмя, "*.xml", Истина).Количество() > 0 Тогда
					СписокКонфигураций.Добавить(ЭлементКаталога.Имя, ЭлементКаталога.Имя);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
			
		ФайловаяСистема.УдалитьВременныйКаталог(ВременныйКаталог);
		
	Исключение
		ФайловаяСистема.УдалитьВременныйКаталог(ВременныйКаталог);
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(НСтр("ru = 'Предопределенные настройки'")), , 
			Метаданные.Обработки.SUI_ИмпортЭкспортНастроек, , ИнформацияОбОшибке());
		ВызватьИсключение;
	КонецПопытки;
	
	Если СписокКонфигураций.Количество() > 0 Тогда
		ПоместитьВоВременноеХранилище(ДанныеФайла, АдресДополнительногоРезультата);
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(СписокКонфигураций, АдресРезультата);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьАрхив(Каталог)
	
	ФайлАрхив = Новый ЗаписьZipФайла();
	ФайлАрхив.Добавить(
		SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(Каталог, "*.*"), 
		РежимСохраненияПутейZIP.СохранятьОтносительныеПути, 
		РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
	
	Возврат ФайлАрхив.ПолучитьДвоичныеДанные(, , МетодСжатияZIP.Сжатие, УровеньСжатияZIP.Максимальный);
	
КонецФункции

Процедура ПроставитьПометкиВверх(СтрокаДерева)
	
	РодительСтроки = СтрокаДерева.Родитель;
	
	Если РодительСтроки <> Неопределено Тогда
		
		ВсеИстина = Истина;
		НеВсеЛожь = Ложь;
		
		Для Каждого Потомок Из РодительСтроки.Строки Цикл
			ВсеИстина = ВсеИстина И (Потомок.Пометка = 1);
			НеВсеЛожь = НеВсеЛожь Или Булево(Потомок.Пометка);
		КонецЦикла;
		
		Если ВсеИстина Тогда
			РодительСтроки.Пометка = 1;
		ИначеЕсли НеВсеЛожь Тогда
			РодительСтроки.Пометка = 2;
		Иначе
			РодительСтроки.Пометка = 0;
		КонецЕсли;
		
		ПроставитьПометкиВверх(РодительСтроки);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьНастройкиДереваВКаталогРекурсивно(ДеревоНастроек, Знач ТекущийКаталог)
	
	Для Каждого СтрокаДерева Из ДеревоНастроек.Строки Цикл
		
		Если СтрокаДерева.Пометка = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ЭтоКаталог = СтрокаДерева.ИндексКартинки = ИндексКартинкиКаталога();
		
		Если ЭтоКаталог И
			СтрокаДерева.Строки.НайтиСтроки(ПараметрыПоискаОтмеченныхНастроек(), Истина) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяОбъекта = СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими("\/:|*?""<>", СтрокаДерева.name, "");
		
		Если ПустаяСтрока(ИмяОбъекта) Тогда
			ИмяОбъекта = Строка(Новый УникальныйИдентификатор());
		КонецЕсли;
		
		ПриложениеКОбъекту = СформироватьПриложениеКОбъекту(СтрокаДерева);
		
		Если ЭтоКаталог Тогда
			
			СозданныйКаталог = ЗаписатьОбъектНастройки(ТекущийКаталог, ИмяОбъекта, ПриложениеКОбъекту);
			
			Если СозданныйКаталог <> Неопределено Тогда
				ЗаписатьНастройкиДереваВКаталогРекурсивно(СтрокаДерева, СозданныйКаталог);
			КонецЕсли;
			
		Иначе
			
			Данные = Новый Структура();
			Данные.Вставить("Ключ", СтрокаДерева.key);
			Данные.Вставить("Данные", СтрокаДерева.Данные);
			
			ПутьКОбъекту = ЗаписатьОбъектНастройки(ТекущийКаталог, ИмяОбъекта + ".xml", Данные);
			
			Если ПутьКОбъекту <> Неопределено Тогда
				
				СтрокаДерева.Пометка = 0;
				ПроставитьПометкиВверх(СтрокаДерева);
				
				Если ПриложениеКОбъекту <> Неопределено Тогда
					ЗаписатьОбъектНастройки(ТекущийКаталог, ИмяОбъекта + ".json", ПриложениеКОбъекту);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ЗаписатьОбъектНастройки(Каталог, ИмяОбъекта, Данные)
	
	ОбъектНастройки = Новый Файл(SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(Каталог, ИмяОбъекта));
	
	Если ПустаяСтрока(ОбъектНастройки.Расширение) Тогда
		
		Если Не ОбъектНастройки.Существует() Тогда
			СоздатьКаталог(ОбъектНастройки.ПолноеИмя);
		КонецЕсли;
		
		Если Данные <> Неопределено Тогда
			ЗаписатьОбъектНастройки(Каталог, ИмяОбъекта + ".json", Данные);
		КонецЕсли;
		
	ИначеЕсли ОбъектНастройки.Расширение = ".xml" И Данные <> Неопределено Тогда
		
		ДанныеXML = SUI_ОбщегоНазначения.ЗначениеВСтрокуXML(Новый ФиксированнаяСтруктура(Данные));
		
		ЗаписьXML = Новый ЗаписьXML();
		ЗаписьXML.ОткрытьФайл(ОбъектНастройки.ПолноеИмя);
		ЗаписьXML.ЗаписатьБезОбработки(ДанныеXML);
		ЗаписьXML.Закрыть();
		
	ИначеЕсли ОбъектНастройки.Расширение = ".json" И Данные <> Неопределено  Тогда
		
		ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(, Символы.Таб);
		
		ЗаписьJSON = Новый ЗаписьJSON();
		ЗаписьJSON.ОткрытьФайл(ОбъектНастройки.ПолноеИмя, , , ПараметрыЗаписи);
		ЗаписатьJSON(ЗаписьJSON, Данные, , "ПреобразованиеДанныхJSON", Обработки.SUI_ИмпортЭкспортНастроек);
		ЗаписьJSON.Закрыть();
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбъектНастройки.ПолноеИмя;
	
КонецФункции

Процедура ВыгрузитьВФайлы_НастройкиДокументов(Каталог, Знач ДеревоНастроек)
	
	ДеревоНастроек.Колонки.Добавить("Данные", Новый ОписаниеТипов("Структура"));
	
	ТаблицаНастроек = Новый ТаблицаЗначений();
	ТаблицаНастроек.Колонки.Добавить("id", Новый ОписаниеТипов("УникальныйИдентификатор"));
	ТаблицаНастроек.Колонки.Добавить("key", Новый ОписаниеТипов("СправочникСсылка.SUI_НастройкиДокументов"));
	ТаблицаНастроек.Колонки.Добавить("Данные", Новый ОписаниеТипов("Структура"));
	
	НайденныеСтроки = ДеревоНастроек.Строки.НайтиСтроки(ПараметрыПоискаОтмеченныхНастроек(), Истина);
	
	Для индекс = 0 По НайденныеСтроки.ВГраница() Цикл
		
		СтрокаНастройки = ТаблицаНастроек.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНастройки, НайденныеСтроки[индекс]);
		
		Если СтрокаНастройки.key.Пустая() Тогда
			ТаблицаНастроек.Удалить(СтрокаНастройки);
		КонецЕсли;
		
	КонецЦикла;
	
	Справочники.SUI_НастройкиДокументов.СформироватьДанныеДляВыгрузки(ТаблицаНастроек, "key", "Данные");
	
	Если ТаблицаНастроек.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для индекс = 0 По НайденныеСтроки.ВГраница() Цикл
		
		СтрокаДанных = ТаблицаНастроек.Найти(НайденныеСтроки[индекс].id, "id");
		
		Если СтрокаДанных = Неопределено Тогда
			НайденныеСтроки[индекс].Пометка = 0;
			ПроставитьПометкиВверх(НайденныеСтроки[индекс]);
		Иначе
			НайденныеСтроки[индекс].Данные = СтрокаДанных.Данные;
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаписатьНастройкиДереваВКаталогРекурсивно(ДеревоНастроек, Каталог);
	
КонецПроцедуры

Процедура ВыгрузитьВФайлы_НастройкиПодсистемы(Каталог, Знач ДеревоНастроек)
	
	ДеревоНастроек.Колонки.Добавить("Данные", Новый ОписаниеТипов("Структура"));
	
	НайденныеСтроки = ДеревоНастроек.Строки.НайтиСтроки(ПараметрыПоискаОтмеченныхНастроек(), Истина);
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеКПолучению = Новый Структура();
	
	ПараметрыПолученияНастроек = РегистрыСведений.SUI_НастройкиТаблицИнтеграции.ПараметрыПолученияНастроек();
	ПараметрыПолученияНастроек.Используется = Неопределено;
	ПараметрыПолученияНастроек.Настраиваемая = Неопределено;
	ПараметрыПолученияНастроек.ТаблицаИнтеграции = Новый СписокЗначений();
	ПараметрыПолученияНастроек.ИмяОбъекта = Новый СписокЗначений();
	
	ДанныеКПолучению_НастройкиТаблицИнтеграции = Новый Структура();
	ДанныеКПолучению_НастройкиТаблицИнтеграции.Вставить("Данные", Новый Массив());
	ДанныеКПолучению_НастройкиТаблицИнтеграции.Вставить("Параметры", ПараметрыПолученияНастроек);
	
	ДанныеКПолучению.Вставить("НастройкиТаблицИнтеграции", ДанныеКПолучению_НастройкиТаблицИнтеграции);
	
	ДанныеКПолучению_ДополнительныеНастройкиТаблицИнтеграции = Новый Структура();
	ДанныеКПолучению_ДополнительныеНастройкиТаблицИнтеграции.Вставить("Данные", Новый Массив());
	ДанныеКПолучению_ДополнительныеНастройкиТаблицИнтеграции.Вставить("ТаблицыИнтеграции", Новый Массив());
	
	ДанныеКПолучению.Вставить("ДополнительныеНастройкиТаблицИнтеграции", 
		ДанныеКПолучению_ДополнительныеНастройкиТаблицИнтеграции);
	
	Для индекс = 0 По НайденныеСтроки.ВГраница() Цикл
		
		ТипЗначенияКлюча = ТипЗнч(НайденныеСтроки[индекс].key);
		
		Если ТипЗначенияКлюча = Тип("РегистрСведенийКлючЗаписи.SUI_НастройкиТаблицИнтеграции") Тогда
			
			ДанныеКПолучению.НастройкиТаблицИнтеграции.Данные.Добавить(НайденныеСтроки[индекс]);
			ДанныеКПолучению.НастройкиТаблицИнтеграции.Параметры.ТаблицаИнтеграции.Добавить(
				НайденныеСтроки[индекс].key.ТаблицаИнтеграции);
			ДанныеКПолучению.НастройкиТаблицИнтеграции.Параметры.ИмяОбъекта.Добавить(
				НайденныеСтроки[индекс].key.ИмяОбъектаКонфигурации);
			
		ИначеЕсли ТипЗначенияКлюча = Тип("РегистрСведенийКлючЗаписи.SUI_ДополнительныеНастройкиТаблицИнтеграции") Тогда
			
			ДанныеКПолучению.ДополнительныеНастройкиТаблицИнтеграции.Данные.Добавить(НайденныеСтроки[индекс]);
			ДанныеКПолучению.ДополнительныеНастройкиТаблицИнтеграции.ТаблицыИнтеграции.Добавить(
				НайденныеСтроки[индекс].key.ТаблицаИнтеграции);
			
		ИначеЕсли ТипЗначенияКлюча = Тип("КонстантаКлючЗначения.SUI_ПользовательскийЗапрос") Тогда
			
			Данные = Новый Структура();
			Данные.Вставить("Использование", ПолучитьФункциональнуюОпцию("SUI_ИспользоватьПользовательскийЗапрос"));
			Данные.Вставить("ДанныеКонструктора", SUI_НастройкиМетаданныхСервер.ПолучитьПользовательскийЗапрос());
			
			НайденныеСтроки[индекс].Данные = Данные;
			
		ИначеЕсли ТипЗначенияКлюча = Тип("КонстантаКлючЗначения.SUI_ЗапросПолученияОстатковИЦен") Тогда
			
			Данные = Новый Структура();
			Данные.Вставить("ДанныеКонструктора", SUI_НастройкиМетаданныхСервер.ПолучитьЗапросПолученияОстатковИЦен());
			
			НайденныеСтроки[индекс].Данные = Данные;
			
		Иначе
			НайденныеСтроки[индекс].Пометка = 0;
			ПроставитьПометкиВверх(НайденныеСтроки[индекс]);
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ДанныеКПолучению.НастройкиТаблицИнтеграции.Данные.Количество() > 0 Тогда
		
		КоллекцияДанных = РегистрыСведений.SUI_НастройкиТаблицИнтеграции.ПолучитьНастройки(
			ДанныеКПолучению.НастройкиТаблицИнтеграции.Параметры);
		
		Для Каждого СтрокаДерева Из ДанныеКПолучению.НастройкиТаблицИнтеграции.Данные Цикл
			
			ПараметрыОтбора = Новый Структура();
			ПараметрыОтбора.Вставить("ТаблицаИнтеграции", СтрокаДерева.key.ТаблицаИнтеграции);
			ПараметрыОтбора.Вставить("ИмяОбъекта", СтрокаДерева.key.ИмяОбъектаКонфигурации);
			
			СтрокиИзКоллекции = КоллекцияДанных.НайтиСтроки(ПараметрыОтбора);
			
			Если СтрокиИзКоллекции.Количество() = 0 Тогда
				СтрокаДерева.Пометка = 0;
				ПроставитьПометкиВверх(СтрокаДерева);
			Иначе
				СтрокаДерева.Данные = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокиИзКоллекции[0]);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ДанныеКПолучению.ДополнительныеНастройкиТаблицИнтеграции.Данные.Количество() > 0 Тогда
		
		КоллекцияДанных = РегистрыСведений.SUI_ДополнительныеНастройкиТаблицИнтеграции.ПолучитьДополнительныеНастройки(
			ДанныеКПолучению.ДополнительныеНастройкиТаблицИнтеграции.ТаблицыИнтеграции);
		
		Для Каждого СтрокаДерева Из ДанныеКПолучению.ДополнительныеНастройкиТаблицИнтеграции.Данные Цикл
			
			Найдено = Ложь;
			Для Каждого ЭлементКоллекцииДанных Из КоллекцияДанных Цикл
				
				Если ЭлементКоллекцииДанных.Ключ = СтрокаДерева.key.ТаблицаИнтеграции Тогда
					СтрокаДерева.Данные = ЭлементКоллекцииДанных.Значение;
					Найдено = Истина;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			Если Не Найдено Тогда
				СтрокаДерева.Пометка = 0;
				ПроставитьПометкиВверх(СтрокаДерева);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ЗаписатьНастройкиДереваВКаталогРекурсивно(ДеревоНастроек, Каталог);
	
КонецПроцедуры

Функция ЗначенияСвойствСтруктуры(Структура, КоллекцияСвойств, ДополнятьСвойства = Ложь, ТолькоЗаполненные = Истина)
	
	Результат = Новый Структура();
	
	Для Каждого ЭлементСвойство Из Новый Структура(КоллекцияСвойств) Цикл
		
		Значение = Неопределено;
		
		Если Не Структура.Свойство(ЭлементСвойство.Ключ, Значение) И Не ДополнятьСвойства Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЭлементСвойство.Значение <> Неопределено Тогда
			Значение = ЭлементСвойство.Значение.ПривестиЗначение(Значение);
		КонецЕсли;
		
		Если ТолькоЗаполненные И Не ЗначениеЗаполнено(Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		Результат.Вставить(ЭлементСвойство.Ключ, Значение);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПутьВКаталогеСтрокиДерева(СтрокаДерева)
	
	РодительСтроки = СтрокаДерева.Родитель;
	
	Если РодительСтроки = Неопределено Тогда
		Возврат СтрокаДерева.name;
	Иначе
		Возврат SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(
			ПолучитьПутьВКаталогеСтрокиДерева(РодительСтроки), 
			СтрокаДерева.name);
	КонецЕсли;
	
КонецФункции

#Область КонфигурационныйФайл

Функция ИмяКонфигурационногоФайлаНастроек()
	
	Возврат "settings.ini";
	
КонецФункции

Функция ЗаписатьКонфигурационныйФайлНастроек(Каталог, Область, Версия = "1")
	
	ОбщегоНазначенияКлиентСервер.Проверить(ОбластиНастроек().Найти(Область) <> Неопределено,
		СтрШаблон(НСтр("ru = 'Неизвестная область настроек (%1).'"), Область));
	
	ФайлОписаниеОбласти = Новый ТекстовыйДокумент();
	
	ФайлОписаниеОбласти.ДобавитьСтроку("[General]");
	ФайлОписаниеОбласти.ДобавитьСтроку(СтрШаблон("region=%1", Область));
	ФайлОписаниеОбласти.ДобавитьСтроку(СтрШаблон("version=%1", Версия));
	
	ПутьКФайлу = SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(Каталог, ИмяКонфигурационногоФайлаНастроек());
	
	ФайлОписаниеОбласти.Записать(ПутьКФайлу, КодировкаТекста.UTF8, Символы.ВК + Символы.ПС);
	
	Возврат ПутьКФайлу;
	
КонецФункции

Функция ПрочитатьКонфигурационныйФайлНастроек(Каталог)
	
	КонфигурационныйФайл = Новый Структура();
	КонфигурационныйФайл.Вставить("Область", "");
	КонфигурационныйФайл.Вставить("Версия", 0);
	
	ПутьКФайлу = SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(Каталог, ИмяКонфигурационногоФайлаНастроек());
	
	Файл = Новый Файл(ПутьКФайлу);
	
	ОбщегоНазначенияКлиентСервер.Проверить(Файл.Существует() И Файл.ЭтоФайл(),
		НСтр("ru = 'Отсутствует конфигурационный файл настроек.'"));
	
	Файл = Новый ТекстовыйДокумент();
	Файл.Прочитать(ПутьКФайлу, КодировкаТекста.UTF8, Символы.ВК + Символы.ПС);
	
	КоличествоСтрок = Файл.КоличествоСтрок();
	
	Для ТекущийНомерСтроки = 1 По КоличествоСтрок Цикл
		
		СтрокаКонфигурации = СокрЛП(Файл.ПолучитьСтроку(ТекущийНомерСтроки));
		
		Если СтрНачинаетсяС(СтрокаКонфигурации, "region=") Тогда
			КонфигурационныйФайл.Область = СокрЛП(СтрЗаменить(СтрокаКонфигурации, "region=", ""));
		ИначеЕсли СтрНачинаетсяС(СтрокаКонфигурации, "version=") Тогда
			Версия = СтрЗаменить(СтрокаКонфигурации, "version=", "");
			Версия = ОбщегоНазначения.ОписаниеТипаЧисло(1, , ДопустимыйЗнак.Неотрицательный).ПривестиЗначение(Версия);
			КонфигурационныйФайл.Версия = Версия;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Новый ФиксированнаяСтруктура(КонфигурационныйФайл);
	
КонецФункции

#КонецОбласти

#Область ПриложениеКНастройке

Функция СформироватьПриложениеКОбъекту(СтрокаДанных)
	
	КоллекцияСвойств = Новый Структура();
	КоллекцияСвойств.Вставить("description", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	
	Если СтрокаДанных.ИндексКартинки = ИндексКартинкиФайла() Тогда
		КоллекцияСвойств.Вставить("owner_name", ОбщегоНазначения.ОписаниеТипаСтрока(150));
	КонецЕсли;
	
	КоллекцияСвойств = Новый ФиксированнаяСтруктура(КоллекцияСвойств);
	
	ДанныеПриложение = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаДанных);
	ДанныеПриложение = ЗначенияСвойствСтруктуры(ДанныеПриложение, КоллекцияСвойств);
	
	Возврат ?(ДанныеПриложение.Количество() = 0, Неопределено, ДанныеПриложение);
	
КонецФункции

Функция ПрочитатьФайлПриложениеКНастройке(ПутьКФайлу)
	
	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.ОткрытьФайл(ПутьКФайлу);
	Приложение = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	Возврат Приложение;
	
КонецФункции

#КонецОбласти

#Область ЗаполнениеДереваНастроек

Процедура ЗаполнитьДеревоНастроек_НастройкиДокументов(НастройкиДерево)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИндексКартинкиФайла", ИндексКартинкиФайла());
	Запрос.Текст =
		"ВЫБРАТЬ
		|	SUI_НастройкиДокументов.Представление КАК name,
		|	SUI_НастройкиДокументов.Комментарий КАК description,
		|	SUI_НастройкиДокументов.ИмяОбъектаМетаданных КАК ИмяОбъектаМетаданных,
		|	SUI_НастройкиДокументов.Ссылка КАК key,
		|	&ИндексКартинкиФайла КАК ИндексКартинки
		|ИЗ
		|	Справочник.SUI_НастройкиДокументов КАК SUI_НастройкиДокументов";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		СтрокаДереваРодитель = НастройкиДерево.Строки.Добавить();
		СтрокаДереваРодитель.id = Новый УникальныйИдентификатор();
		СтрокаДереваРодитель.name = ОбластиНастроек()[0];
		СтрокаДереваРодитель.ИндексКартинки = ИндексКартинкиКаталога();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ВладелецНастройки = Метаданные.Документы.Найти(Выборка.ИмяОбъектаМетаданных);
			
			Если ВладелецНастройки = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаДерева = СтрокаДереваРодитель.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДерева, Выборка);
			
			СтрокаДерева.id = Новый УникальныйИдентификатор();
			СтрокаДерева.owner_name = ВладелецНастройки.ПолноеИмя();
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДеревоНастроек_НастройкиПодсистемы(НастройкиДерево)
	
	СтрокаДереваРодитель = НастройкиДерево.Строки.Добавить();
	СтрокаДереваРодитель.id = Новый УникальныйИдентификатор();
	СтрокаДереваРодитель.name = ОбластиНастроек()[1];
	СтрокаДереваРодитель.ИндексКартинки = ИндексКартинкиКаталога();
	
	// Настройки таблиц интеграции
	ЗаполнитьДеревоНастроек_НастройкиПодсистемы_ТаблицыИнтеграции(СтрокаДереваРодитель);
	
	// Пользовательские запросы
	ЗаполнитьДеревоНастроек_НастройкиПодсистемы_ДополнительныеНастройкиТаблицИнтеграции(СтрокаДереваРодитель);
	
	// Пользовательские запросы
	ЗаполнитьДеревоНастроек_НастройкиПодсистемы_ПользовательскиеЗапросы(СтрокаДереваРодитель);
	
КонецПроцедуры

Процедура ЗаполнитьДеревоНастроек_НастройкиПодсистемы_ТаблицыИнтеграции(НастройкиДерево)
	
	ПараметрыПолученияНастроек = РегистрыСведений.SUI_НастройкиТаблицИнтеграции.ПараметрыПолученияНастроек();
	ПараметрыПолученияНастроек.Используется = Неопределено;
	ПараметрыПолученияНастроек.Настраиваемая = Неопределено;
	ПараметрыПолученияНастроек.ПолучитьДерево = Истина;
	
	НастройкиТаблиц = РегистрыСведений.SUI_НастройкиТаблицИнтеграции.ПолучитьНастройки(ПараметрыПолученияНастроек);
	
	Если НастройкиТаблиц.Строки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаДерева = НастройкиДерево.Строки.Добавить();
	СтрокаДерева.ИндексКартинки = ИндексКартинкиКаталога();
	СтрокаДерева.name = НСтр("ru = 'Таблицы интеграции'");
	СтрокаДерева.id = Новый УникальныйИдентификатор();
	
	ЗаполнитьДеревоНастроек_НастройкиПодсистемы_ТаблицыИнтеграции_ЗаполнитьРекурсивно(
		СтрокаДерева.Строки, НастройкиТаблиц.Строки);
	
КонецПроцедуры

Процедура ЗаполнитьДеревоНастроек_НастройкиПодсистемы_ТаблицыИнтеграции_ЗаполнитьРекурсивно(
	НастройкиДерево, НастройкиТаблиц)
	
	Для Каждого НастройкаТаблицы Из НастройкиТаблиц Цикл
		
		НастройкаДерева = НастройкиДерево.Добавить();
		НастройкаДерева.id = Новый УникальныйИдентификатор();
		
		Если НастройкаТаблицы.Строки.Количество() > 0 Тогда
			
			НастройкаДерева.name = НастройкаТаблицы.ТаблицаИнтеграции;
			НастройкаДерева.ИндексКартинки = ИндексКартинкиКаталога();
			
			ЗаполнитьДеревоНастроек_НастройкиПодсистемы_ТаблицыИнтеграции_ЗаполнитьРекурсивно(
				НастройкаДерева.Строки, НастройкаТаблицы.Строки);
			
		Иначе
			
			КлючНастройки = Новый Структура();
			КлючНастройки.Вставить("ТаблицаИнтеграции", НастройкаТаблицы.ТаблицаИнтеграции);
			КлючНастройки.Вставить("ИмяОбъектаКонфигурации", НастройкаТаблицы.ИмяОбъекта);
			
			КлючНастройки = РегистрыСведений.SUI_НастройкиТаблицИнтеграции.СоздатьКлючЗаписи(КлючНастройки);
			
			НастройкаДерева.name = НастройкаТаблицы.ИмяОбъекта;
			НастройкаДерева.ИндексКартинки = ИндексКартинкиФайла();
			НастройкаДерева.key = КлючНастройки;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДеревоНастроек_НастройкиПодсистемы_ДополнительныеНастройкиТаблицИнтеграции(НастройкиДерево)
	
	ДополнительныеНастройки = РегистрыСведений.SUI_ДополнительныеНастройкиТаблицИнтеграции
		.ПолучитьДополнительныеНастройки();
	
	Если ДополнительныеНастройки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаДереваРодитель = НастройкиДерево.Строки.Добавить();
	СтрокаДереваРодитель.ИндексКартинки = ИндексКартинкиКаталога();
	СтрокаДереваРодитель.name = НСтр("ru = 'Дополнительные настройки таблиц'");
	СтрокаДереваРодитель.id = Новый УникальныйИдентификатор();
	
	Для Каждого ДополнительнаяНастройка Из ДополнительныеНастройки Цикл
		
		КлючНастройки = Новый Структура();
		КлючНастройки.Вставить("ТаблицаИнтеграции", ДополнительнаяНастройка.Ключ);
		
		КлючНастройки = РегистрыСведений.SUI_ДополнительныеНастройкиТаблицИнтеграции.СоздатьКлючЗаписи(КлючНастройки);
		
		СтрокаДополнительнойНастройки = СтрокаДереваРодитель.Строки.Добавить();
		СтрокаДополнительнойНастройки.id = Новый УникальныйИдентификатор();
		СтрокаДополнительнойНастройки.name = ДополнительнаяНастройка.Ключ;
		СтрокаДополнительнойНастройки.ИндексКартинки = ИндексКартинкиФайла();
		СтрокаДополнительнойНастройки.key = КлючНастройки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДеревоНастроек_НастройкиПодсистемы_ПользовательскиеЗапросы(НастройкиДерево)
	
	СтрокаДереваРодитель = НастройкиДерево.Строки.Добавить();
	СтрокаДереваРодитель.ИндексКартинки = ИндексКартинкиКаталога();
	СтрокаДереваРодитель.name = НСтр("ru = 'Запросы данных'");
	СтрокаДереваРодитель.id = Новый УникальныйИдентификатор();
	
	СтрокаДерева = СтрокаДереваРодитель.Строки.Добавить();
	СтрокаДерева.id = Новый УникальныйИдентификатор();
	СтрокаДерева.ИндексКартинки = ИндексКартинкиФайла();
	СтрокаДерева.name = НСтр("ru = 'Пользовательский запрос'");
	СтрокаДерева.key = Константы.SUI_ПользовательскийЗапрос.СоздатьКлючЗначения();
	
	СтрокаДерева = СтрокаДереваРодитель.Строки.Добавить();
	СтрокаДерева.id = Новый УникальныйИдентификатор();
	СтрокаДерева.ИндексКартинки = ИндексКартинкиФайла();
	СтрокаДерева.name = НСтр("ru = 'Запрос получения остатков и цен'");
	СтрокаДерева.key = Константы.SUI_ЗапросПолученияОстатковИЦен.СоздатьКлючЗначения();
	
КонецПроцедуры

Процедура ЗаполнитьДеревоНастроек_ИзФайлаВыгрузки(ДеревоНастроек, ДанныеФайла, Область, КаталогВОбласти = "")
	
	ВременныйКаталог = ФайловаяСистема.СоздатьВременныйКаталог();
	
	Попытка
		
		ФайлАрхив = Новый ЧтениеZipФайла(ДанныеФайла.ОткрытьПотокДляЧтения());
		ФайлАрхив.ИзвлечьВсе(ВременныйКаталог, РежимВосстановленияПутейФайловZIP.Восстанавливать);
		ФайлАрхив.Закрыть();
		
		КонфигурационныйФайл = ПрочитатьКонфигурационныйФайлНастроек(ВременныйКаталог);
		
		ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(КонфигурационныйФайл.Область),
			НСтр("ru = 'Конфигурационный файл настроек поврежден.'"));
		
		ОбщегоНазначенияКлиентСервер.Проверить(Область = КонфигурационныйФайл.Область,
			СтрШаблон(НСтр("ru = 'Файл настроек ""%1"" не принадлежит области настроек ""%2"".'"), 
			КонфигурационныйФайл.Область, Область));
		
		КаталогОбласти = SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(ВременныйКаталог, Область, КаталогВОбласти);
		НайденныеФайлы = НайтиФайлы(КаталогОбласти, "*.xml", Истина);
		
		ОбщегоНазначенияКлиентСервер.Проверить(НайденныеФайлы.Количество() > 0,
			СтрШаблон(НСтр("ru = 'Файл настроек ""%1"" не содержит настроек для области ""%2"".'"), 
			КонфигурационныйФайл.Область, Область));
		
		Для индекс = 0 По НайденныеФайлы.ВГраница() Цикл
			
			Если НайденныеФайлы[индекс].ЭтоФайл() И Не НайденныеФайлы[индекс].ЭтоКаталог() Тогда
				
				ПутьВКаталоге = СтрЗаменить(НайденныеФайлы[индекс].ПолноеИмя, ВременныйКаталог, "");
				
				ЗаполнитьДеревоНастроек_ИзФайлаВыгрузки_ДобавитьВДерево(ДеревоНастроек, ВременныйКаталог, ПутьВКаталоге);
				
			КонецЕсли;
			
		КонецЦикла;
				
		ФайловаяСистема.УдалитьВременныйКаталог(ВременныйКаталог);
		
	Исключение
		ФайловаяСистема.УдалитьВременныйКаталог(ВременныйКаталог);
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(НСтр("ru = 'Загрузка из файла'")), , 
			Метаданные.Обработки.SUI_ИмпортЭкспортНастроек, , ИнформацияОбОшибке());
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьДеревоНастроек_ИзФайлаВыгрузки_ДобавитьВДерево(ДеревоНастроек, ПутьККаталогу, Знач ПутьФайла)
	
	ПозицияРазделителя = СтрНайти(ПутьФайла, ПолучитьРазделительПути());
    Если ПозицияРазделителя = 0 Тогда
    	
    	Если Не СтрЗаканчиваетсяНа(ПутьФайла, ".xml") Тогда
    		Возврат;
    	КонецЕсли;
    	
    	РасширениеТекущегоИмени = ".xml";
    	ТекущееИмя = Лев(ПутьФайла, СтрДлина(ПутьФайла) - 4);
    	ПутьФайла = "";
        
    Иначе
    	РасширениеТекущегоИмени = "";
        ТекущееИмя = Лев(ПутьФайла, ПозицияРазделителя - 1);
        ПутьФайла = Прав(ПутьФайла, СтрДлина(ПутьФайла) - ПозицияРазделителя);
    КонецЕсли;
    
    СтрокаДерева = ДеревоНастроек.Строки.Найти(ТекущееИмя, "name");
    
    Если СтрокаДерева = Неопределено Тогда
    	
        СтрокаДерева 		= ДеревоНастроек.Строки.Добавить();
        СтрокаДерева.name 	= ТекущееИмя;
        СтрокаДерева.id 	= Новый УникальныйИдентификатор();
        
    КонецЕсли;
    
    ПутьВКаталоге = ПолучитьПутьВКаталогеСтрокиДерева(СтрокаДерева) + РасширениеТекущегоИмени;
    ТекущийФайл = Новый Файл(SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(ПутьККаталогу, ПутьВКаталоге));
    
    Если ТекущийФайл.Существует() Тогда
    	
    	СтрокаДерева.ИндексКартинки = ?(ТекущийФайл.ЭтоФайл(), ИндексКартинкиФайла(), ИндексКартинкиКаталога());
    	
	    Приложение = Новый Файл(SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(
	    		ТекущийФайл.Путь, ТекущийФайл.ИмяБезРасширения) + ".json");
	    
	    Если Приложение.Существует() И Приложение.ЭтоФайл() Тогда
	    	ЗаполнитьЗначенияСвойств(СтрокаДерева, ПрочитатьФайлПриложениеКНастройке(Приложение.ПолноеИмя));
	    КонецЕсли;
	    
	    Если СтрДлина(ПутьФайла) > 0 Тогда
	    	ЗаполнитьДеревоНастроек_ИзФайлаВыгрузки_ДобавитьВДерево(СтрокаДерева, ПутьККаталогу, ПутьФайла);
	    КонецЕсли;
	
    Иначе
    	ДеревоНастроек.Строки.Удалить(СтрокаДерева);
    КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДеревоНастроек_ИзСхемы(ДеревоНастроек, Область, Конфигурация, Схема)
	
	СтрокаДерева = ДеревоНастроек.Строки.Добавить();
	СтрокаДерева.name = Область;
    СтрокаДерева.id = Новый УникальныйИдентификатор();
    СтрокаДерева.ИндексКартинки = ИндексКартинкиКаталога();
    
    СтрокаДерева = СтрокаДерева.Строки.Добавить();
	СтрокаДерева.name = Конфигурация;
    СтрокаДерева.id = Новый УникальныйИдентификатор();
    СтрокаДерева.ИндексКартинки = ИндексКартинкиКаталога();
	
	ЗаполнитьДеревоНастроек_ИзСхемы_ДобавитьРекурсивно(СтрокаДерева, Схема);
	
КонецПроцедуры

Процедура ЗаполнитьДеревоНастроек_ИзСхемы_ДобавитьРекурсивно(ДеревоНастроек, Схема)
	
	ОписаниеТипаСоответствие = Новый ОписаниеТипов("Соответствие");
	
	Для Каждого ЭлементСхемы Из Схема Цикл
		
		ДанныеЭлемента = Новый Структура("name, id, ", ЭлементСхемы.Ключ, Новый УникальныйИдентификатор());
		ДанныеЭлемента.Вставить("name", ЭлементСхемы.Ключ);
		ДанныеЭлемента.Вставить("id", Новый УникальныйИдентификатор());
		ДанныеЭлемента.Вставить("Пометка", 0);
		
		ТипЭлемента = ЭлементСхемы.Значение.Получить("type");
		ДочерниеЭлементы = ОписаниеТипаСоответствие.ПривестиЗначение(ЭлементСхемы.Значение.Получить("children"));
		
		Если ТипЭлемента = "directory" И ДочерниеЭлементы.Количество() > 0 Тогда
			ДанныеЭлемента.Вставить("ИндексКартинки", ИндексКартинкиКаталога());
		ИначеЕсли ТипЭлемента = "file" Тогда
			ДанныеЭлемента.Вставить("ИндексКартинки", ИндексКартинкиФайла());
		Иначе
			Продолжить;
		КонецЕсли;
		
		Для Каждого ЭлементЗначения Из ЭлементСхемы.Значение Цикл
			
			Если ЭлементЗначения.Ключ <> "type" И ЭлементЗначения.Ключ <> "children" И
				Не ДанныеЭлемента.Свойство(ЭлементЗначения.Ключ) Тогда
				ДанныеЭлемента.Вставить(ЭлементЗначения.Ключ, ЭлементЗначения.Значение);
			КонецЕсли;
			
		КонецЦикла;
		
		СтрокаДерева = ДеревоНастроек.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДерева, ДанныеЭлемента);
		
		ЗаполнитьДеревоНастроек_ИзСхемы_ДобавитьРекурсивно(СтрокаДерева, ДочерниеЭлементы);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаписьНастроек

Функция ЗаписатьНастройку(КаталогНастроек, СтрокаНастройки, ЗаписанныеКлючи, ПараметрыЗаписи)
	
	Результат = Ложь;
	
	ПутьВКаталоге = ПолучитьПутьВКаталогеСтрокиДерева(СтрокаНастройки) + ".xml";
	ФайлНастройки = Новый Файл(SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(КаталогНастроек, ПутьВКаталоге));
	
	Если ФайлНастройки.Существует() И ФайлНастройки.ЭтоФайл() Тогда
		
		// Создание объекта для чтения текста из файла
		ЧтениеИзФайла = Новый ЧтениеТекста(ФайлНастройки.ПолноеИмя, КодировкаТекста.UTF8);
		НастройкаXML = ЧтениеИзФайла.Прочитать();
		ЧтениеИзФайла.Закрыть();
		
		Настройка = SUI_ОбщегоНазначения.ЗначениеИзСтрокиXML(НастройкаXML);
		
		КлючНастройки = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Настройка, "Ключ");
		Данные = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Настройка, "Данные", Новый Структура(), Тип("Структура"));
		
		ТипКлюча = ТипЗнч(КлючНастройки);
		
		Если ТипКлюча = Тип("СправочникСсылка.SUI_НастройкиДокументов") Тогда
			
			Результат = ЗаписатьНастройку_НастройкиДокументов(КлючНастройки, Данные, СтрокаНастройки.name, ПараметрыЗаписи);
			
			Если Результат <> Неопределено Тогда
				ЗаписанныеКлючи.Добавить(Результат);
				Результат = Истина;
			КонецЕсли;
			
		ИначеЕсли ТипКлюча = Тип("РегистрСведенийКлючЗаписи.SUI_НастройкиТаблицИнтеграции") Тогда
			
			Результат = ЗаписатьНастройку_НастройкиТаблицИнтеграции(КлючНастройки, Данные, СтрокаНастройки.name, ПараметрыЗаписи);
			
			Если Результат И ЗаписанныеКлючи.Найти(КлючНастройки) = Неопределено Тогда
				ЗаписанныеКлючи.Добавить(КлючНастройки);
			КонецЕсли;
			
		ИначеЕсли ТипКлюча = Тип("РегистрСведенийКлючЗаписи.SUI_ДополнительныеНастройкиТаблицИнтеграции") Тогда
		
			Результат = ЗаписатьНастройку_ДополнительныеНастройкиТаблицИнтеграции(
				КлючНастройки, Данные, СтрокаНастройки.name, ПараметрыЗаписи);
			
			Если Результат И ЗаписанныеКлючи.Найти(КлючНастройки) = Неопределено Тогда
				ЗаписанныеКлючи.Добавить(КлючНастройки);
			КонецЕсли;
			
		ИначеЕсли ТипКлюча = Тип("КонстантаКлючЗначения.SUI_ПользовательскийЗапрос") Тогда
			Результат = ЗаписатьНастройку_ПользовательскийЗапрос(КлючНастройки, Данные, СтрокаНастройки.name, ПараметрыЗаписи);
		ИначеЕсли ТипКлюча = Тип("КонстантаКлючЗначения.SUI_ЗапросПолученияОстатковИЦен") Тогда
			Результат = ЗаписатьНастройку_ЗапросПолученияОстатковИЦен(КлючНастройки, Данные, СтрокаНастройки.name, ПараметрыЗаписи);
		Иначе
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Неизвестный тип ключа ""%1"" для настройки ""%2"".'"),
				ТипКлюча, ФайлНастройки.ИмяБезРасширения));
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗаписатьНастройку_НастройкиДокументов(Ключ, Данные, ИмяНастройкиДерева, ПараметрыЗаписи)
	
	СсылкаСуществует = ОбщегоНазначения.СсылкаСуществует(Ключ);
	
	Если СсылкаСуществует И ПараметрыЗаписи.Свойство("ПерезаписыватьСуществующие") Тогда
		НастройкаДокументаОбъект = Ключ.ПолучитьОбъект();
	Иначе
		
		НастройкаДокументаОбъект = Справочники.SUI_НастройкиДокументов.СоздатьЭлемент();
		НастройкаДокументаОбъект.УстановитьНовыйКод();
		
		Если Не СсылкаСуществует Тогда
			НастройкаДокументаОбъект.УстановитьСсылкуНового(Ключ);
		КонецЕсли;
		
	КонецЕсли;
	
	НастройкаДокументаОбъект.Заполнить(Данные);
	
	НастройкаДокументаОбъект.ОбменДанными.Загрузка = Истина;
	
	Если НастройкаДокументаОбъект.ПроверитьЗаполнение() Тогда
		НастройкаДокументаОбъект.Записать();
		Возврат НастройкаДокументаОбъект.Ссылка;
	КонецЕсли;
	
	ОбщегоНазначения.СообщитьПользователю(СтрШаблон(
		НСтр("ru = 'Запись настройки документа ""%1"" была пропущена по причине:
		|Не пройдена проверка заполнения.'"), ИмяНастройкиДерева));
	
	Возврат Неопределено;
	
КонецФункции

Функция ЗаписатьНастройку_НастройкиТаблицИнтеграции(Ключ, Данные, ИмяНастройкиДерева, ПараметрыЗаписи)
	
	ТаблицаДанных = Новый ТаблицаЗначений();
	Для Каждого ЭлементДанных Из Данные Цикл
		ТаблицаДанных.Колонки.Добавить(ЭлементДанных.Ключ);
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(ТаблицаДанных.Добавить(), Данные);
	
	РегистрыСведений.SUI_НастройкиТаблицИнтеграции.ЗагрузитьНастройки(ТаблицаДанных);
	
	Возврат Истина;
	
КонецФункции

Функция ЗаписатьНастройку_ДополнительныеНастройкиТаблицИнтеграции(Ключ, Данные, ИмяНастройкиДерева, ПараметрыЗаписи)
	
	ДополнительныеНастройки = Новый Соответствие();
	ДополнительныеНастройки.Вставить(Ключ.ТаблицаИнтеграции, Данные);
	РегистрыСведений.SUI_ДополнительныеНастройкиТаблицИнтеграции.СохранитьДополнительныеНастройки(ДополнительныеНастройки);
	
	Возврат Истина;
	
КонецФункции

Функция ЗаписатьНастройку_ПользовательскийЗапрос(Ключ, Данные, ИмяНастройкиДерева, ПараметрыЗаписи)
	
	ДанныеКонструктора = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Данные, "ДанныеКонструктора", 
		Новый Структура(), Тип("ФиксированнаяСтруктура"));
	
	Если ДанныеКонструктора.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(
		СтрШаблон(НСтр("ru = 'Запись настройки ""%1"" была пропущена по причине:
		|Отсутствуют данные настройки.'"), ИмяНастройкиДерева));
		Возврат Ложь;
	КонецЕсли;
	
	Использование = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Данные, "Использование", Ложь, Тип("Булево"));
	
	УстановитьПривилегированныйРежим(Истина);
	SUI_НастройкиМетаданныхСервер.СохранитьПользовательскийЗапрос(ДанныеКонструктора);
	Константы.SUI_ИспользоватьПользовательскийЗапрос.Установить(Использование);
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Истина;
	
КонецФункции

Функция ЗаписатьНастройку_ЗапросПолученияОстатковИЦен(Ключ, Данные, ИмяНастройкиДерева, ПараметрыЗаписи)
	
	ДанныеКонструктора = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Данные, "ДанныеКонструктора", 
		Новый Структура(), Тип("ФиксированнаяСтруктура"));
	
	Если ДанныеКонструктора.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(
		СтрШаблон(НСтр("ru = 'Запись настройки ""%1"" была пропущена по причине:
		|Отсутствуют данные настройки.'"), ИмяНастройкиДерева));
		Возврат Ложь;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	SUI_НастройкиМетаданныхСервер.СохранитьЗапросПолученияОстатковИЦен(ДанныеКонструктора);
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область ПредопределенныеНастройки

Функция ПолучитьФайлПредопределеннойНастройкиПоОбласти(Область)
	
	НомерОбластиНастройки = ОбластиНастроек().Найти(Область);
	
	ОбщегоНазначенияКлиентСервер.Проверить(НомерОбластиНастройки <> Неопределено,
		СтрШаблон(НСтр("ru = 'Неизвестная область настроек (%1).'"), Область));
	
	Если НомерОбластиНастройки = 0 Тогда
		Возврат ПолучитьМакет("ПредопределенныеНастройкиДокументов");
	ИначеЕсли НомерОбластиНастройки = 1 Тогда
		Возврат ПолучитьМакет("ПредопределенныеНастройкиПодсистемы");
	Иначе
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Для области настроек ""%1"" отсутствуют предопределенные настройки'"), 
			Область);
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
