
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ИмяСобытия(ВложенноеСобытие = "") Экспорт
	Возврат НСтр("ru = 'Импорт экспорт настроек'") + ?(ПустаяСтрока(ВложенноеСобытие), "", "." + ВложенноеСобытие);
КонецФункции

Функция ОбластиНастроек() Экспорт
	
	Области = Новый Массив();
	Области.Добавить("DocumentSettings");
	Области.Добавить("IntegrationTableSettings");
	
	Возврат Новый ФиксированныйМассив(Области);
	
КонецФункции

Процедура ЗагрузитьИзФайла(Параметры, АдресРезультата) Экспорт
	
	ВременныйКаталог = ФайловаяСистема.СоздатьВременныйКаталог();
//	ВременныйКаталог = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ВременныйКаталог);
	РазделительПути = ПолучитьРазделительПути();
	
	Попытка
		
		ФайлАрхив = Новый ЧтениеZipФайла(Параметры.ДанныеФайла.ОткрытьПотокДляЧтения());
		ФайлАрхив.ИзвлечьВсе(ВременныйКаталог, РежимВосстановленияПутейФайловZIP.Восстанавливать);
		ФайлАрхив.Закрыть();
		
		Манифест = ПрочитатьМанифест(ВременныйКаталог);
		
		Для Каждого Файл Из НайтиФайлы(ВременныйКаталог, "*.xml", Истина) Цикл
			
			Если Не СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(Файл.ИмяБезРасширения) Тогда
				Продолжить;
			КонецЕсли;
			
			ПараметрыПоиска = Новый Структура();
			ПараметрыПоиска.Вставить("Ключ", Новый УникальныйИдентификатор(Файл.ИмяБезРасширения));
			
			СтрокиМанифеста = Манифест.Данные.НайтиСтроки(ПараметрыПоиска);
			
			Если СтрокиМанифеста.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ОбщегоНазначенияКлиентСервер.Проверить(СтрокиМанифеста.Количество() = 1,
				НСтр("ru = 'Обнаружено дублирование настроек в манифесте настроек.'"));
			
			ПутьКФайлуВКаталоге = СтрЗаменить(Файл.ПолноеИмя, ВременныйКаталог, "");
			
		    ДобавитьДанныеНастройкиВДерево(Параметры.НастройкиДерево.Строки, 
		    	ПутьКФайлуВКаталоге, РазделительПути, ПутьКФайлуВКаталоге);
		    
		КонецЦикла;
		
		ФайловаяСистема.УдалитьВременныйКаталог(ВременныйКаталог);
		
		ПоместитьВоВременноеХранилище(Параметры.НастройкиДерево, АдресРезультата);
		
	Исключение
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(НСтр("ru = 'Загрузка из файла'")), , 
			Метаданные.Обработки.SUI_ИмпортЭкспортНастроек, , ИнформацияОбОшибке());
		ФайловаяСистема.УдалитьВременныйКаталог(ВременныйКаталог);
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура ВыгрузитьВФайл(Параметры, АдресРезультата) Экспорт
	
	ФайлАрхив = Неопределено;
	ВременныйКаталог = ФайловаяСистема.СоздатьВременныйКаталог();
	ТипыМанифестов = ТипыМанифестов();
	
	Попытка
		
		ОбщегоНазначенияКлиентСервер.Проверить(ТипыМанифестов.Найти(Параметры.ТипНастроек) <> Неопределено,
			СтрШаблон(НСтр("ru = 'Неизвестный тип настроек (%1).'"), Параметры.ТипНастроек));
		
		Манифест = Новый Структура(МанифестЭталон(Параметры.ТипНастроек));
		
		ПараметрыПоиска = Новый Структура();
		ПараметрыПоиска.Вставить("ИндексКартинки", 10);
		ПараметрыПоиска.Вставить("Пометка", 1);
		
		НайденныеСтроки = Параметры.ДеревоНастройки.Строки.НайтиСтроки(ПараметрыПоиска);
		
		Для индекс = 0 По НайденныеСтроки.ВГраница() Цикл
			
			Если Манифест.Данные.Найти(НайденныеСтроки[индекс].Ключ, "Ключ") <> Неопределено Тогда
				ОбщегоНазначения.СообщитьПользователю(СтрШаблон(
					НСтр("ru = 'Ключ настройки %1 уже присутствует в манифесте.'"), НайденныеСтроки[индекс].Представление));
				Продолжить;
			КонецЕсли;
			
			Если ТипыМанифестов[0] = Параметры.ТипНастроек Тогда
				ПутьВКаталоге = ЗаписатьФайлНастройкиДокумента(ВременныйКаталог, 
					НайденныеСтроки[индекс].Ключ, НайденныеСтроки[индекс].КлючДанных);
			Иначе
				ПутьВКаталоге = "";
				ВызватьИсключение НСтр("ru = 'Не реализовано.'");
			КонецЕсли;
			
			СтрокаДанныхМанифеста = Манифест.Данные.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДанныхМанифеста, НайденныеСтроки[индекс]);
			СтрокаДанныхМанифеста.ПутьВКаталоге = ПутьВКаталоге;
			
		КонецЦикла;
		
		Если Манифест.Данные.Количество() > 0 Тогда
			
			Манифест = Новый ФиксированнаяСтруктура(Манифест);
			ЗаписатьМанифест(ВременныйКаталог, Манифест);
			
			ФайлАрхив = Новый ЗаписьZipФайла();
			ФайлАрхив.Добавить(SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(ВременныйКаталог, "*.*"), 
				РежимСохраненияПутейZIP.СохранятьОтносительныеПути, 
				РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
			
			ФайлАрхив = ФайлАрхив.ПолучитьДвоичныеДанные(, , МетодСжатияZIP.Сжатие, УровеньСжатияZIP.Максимальный);
			
		КонецЕсли;
		
		ФайловаяСистема.УдалитьВременныйКаталог(ВременныйКаталог);
		
	Исключение
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(НСтр("ru = 'Выгрузка в файл'")), , 
			Метаданные.Обработки.SUI_ИмпортЭкспортНастроек, , ИнформацияОбОшибке());
		ФайловаяСистема.УдалитьВременныйКаталог(ВременныйКаталог);
		ВызватьИсключение;
	КонецПопытки;
	
	ОбщегоНазначенияКлиентСервер.Проверить(ТипЗнч(ФайлАрхив) = Тип("ДвоичныеДанные"),
		НСтр("ru = 'Отсутствуют данные для выгрузки.'"));
	
	ПоместитьВоВременноеХранилище(ФайлАрхив, АдресРезультата);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьИмяФайла(Ключ, АбсолютныйПуть = Неопределено)
	
	ИмяФайла = XMLСтрока(Ключ) + ".xml";
	
	Если АбсолютныйПуть <> Неопределено Тогда
		ИмяФайла = SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(АбсолютныйПуть, ИмяФайла);
	КонецЕсли;
	
	Возврат ИмяФайла;
	
КонецФункции

Функция ИмяФайлаМанифест()
	
	Возврат "manifest";
	
КонецФункции

Функция ТипыМанифестов()
	
	Типы = Новый Массив();
	Типы.Добавить("НастройкиДокументов");
	Типы.Добавить("НастройкиПодсистемы");
	
	Возврат Новый ФиксированныйМассив(Типы);
	
КонецФункции

Функция МанифестЭталон(Тип)
	
	ДанныеМанифеста = Новый ТаблицаЗначений();
	ДанныеМанифеста.Колонки.Добавить("Ключ", Новый ОписаниеТипов("УникальныйИдентификатор"));
	ДанныеМанифеста.Колонки.Добавить("Представление", ОбщегоНазначения.ОписаниеТипаСтрока(150));
	ДанныеМанифеста.Колонки.Добавить("Описание", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	ДанныеМанифеста.Колонки.Добавить("ВерсияSimple", ОбщегоНазначения.ОписаниеТипаСтрока(20));
	ДанныеМанифеста.Колонки.Добавить("КонфигурацияИмя", ОбщегоНазначения.ОписаниеТипаСтрока(150));
	ДанныеМанифеста.Колонки.Добавить("КонфигурацияСиноним", ОбщегоНазначения.ОписаниеТипаСтрока(150));
	ДанныеМанифеста.Колонки.Добавить("КонфигурацияВерсия", ОбщегоНазначения.ОписаниеТипаСтрока(20));
	ДанныеМанифеста.Колонки.Добавить("ПутьВКаталоге", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	
	Манифест = Новый Структура();
	Манифест.Вставить("Тип", Тип);
	Манифест.Вставить("Данные", ДанныеМанифеста);
	
	Возврат Новый ФиксированнаяСтруктура(Манифест);
	
КонецФункции

Функция ПрочитатьМанифест(Каталог)
	
	ФайлМанифест = НайтиФайлы(Каталог, СформироватьИмяФайла(ИмяФайлаМанифест()));
	
	ОбщегоНазначенияКлиентСервер.Проверить(ФайлМанифест.Количество() > 0,
		НСтр("ru = 'Манифест настроек не найден.'"));
	
	ФайлМанифест = ФайлМанифест[0];
	
	ЧтениеXML = Новый ЧтениеXML();
	ЧтениеXML.ОткрытьФайл(ФайлМанифест.ПолноеИмя);
	Манифест = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
	ЧтениеXML.Закрыть();
	
	ТипЗначенияМанифеста = ТипЗнч(Манифест);
	ОбщегоНазначенияКлиентСервер.Проверить(ТипЗначенияМанифеста = Тип("ФиксированнаяСтруктура"),
		СтрШаблон(НСтр("ru = 'Не верный тип значения манифеста настроек (%1).'"), ТипЗначенияМанифеста));
	
	ТипМанифеста = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Манифест, "Тип");
	ОбщегоНазначенияКлиентСервер.Проверить(ТипыМанифестов().Найти(ТипМанифеста) <> Неопределено,
		СтрШаблон(НСтр("ru = 'Неизвестный тип манифеста настроек (%1).'"), ТипМанифеста));
	
	ДанныеМанифеста = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Манифест, "Данные");
	
	ТипДанныхМанифеста = ТипЗнч(ДанныеМанифеста);
	ОбщегоНазначенияКлиентСервер.Проверить(ТипДанныхМанифеста = Тип("ТаблицаЗначений"),
		СтрШаблон(НСтр("ru = 'Неизвестный тип данных манифеста настроек (%1).'"), ТипДанныхМанифеста));
		
	КолонкиДанныхМанифеста = Новый Структура();
	Для Каждого Колонка Из ДанныеМанифеста.Колонки Цикл
		КолонкиДанныхМанифеста.Вставить(Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	КолонкиДанныхМанифестаЭталон = Новый Структура();
	Для Каждого Колонка Из МанифестЭталон(ТипМанифеста).Данные.Колонки Цикл
		КолонкиДанныхМанифестаЭталон.Вставить(Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.Проверить(
		ОбщегоНазначения.КоллекцииИдентичны(КолонкиДанныхМанифеста, КолонкиДанныхМанифестаЭталон),
		НСтр("ru = 'Данные манифеста настроек содержат некорректные данные.'"));
	
	Возврат Манифест;
	
КонецФункции

Функция ЗаписатьМанифест(Каталог, Манифест)
	
	Возврат ЗаписатьДанныеВФайл(Каталог, "manifest", Манифест);
	
КонецФункции


Процедура ДобавитьДанныеНастройкиВДерево(СтрокиДерева, Знач ПутьФайла, РазделительПути, ПутьВКаталоге)
	
    ПозицияРазделителя = СтрНайти(ПутьФайла, РазделительПути);
    
    Если ПозицияРазделителя = 0 Тогда
    	
        ТекущееИмя = ПутьФайла;
        ПутьФайла = "";
        
    Иначе
    	
        ТекущееИмя = Лев(ПутьФайла, ПозицияРазделителя - 1);
        ПутьФайла = Прав(ПутьФайла, СтрДлина(ПутьФайла) - ПозицияРазделителя);
        
    КонецЕсли;
	
    СтрокаДерева = СтрокиДерева.Найти(ТекущееИмя, "Имя");
    
    Если СтрокаДерева = Неопределено Тогда
    	
        СтрокаДерева = СтрокиДерева.Добавить();
        СтрокаДерева.Имя = ТекущееИмя;
        
    КонецЕсли;
    
    Если СтрДлина(ПутьФайла) = 0 Тогда
    	СтрокаДерева.ЭтоКаталог = 10;
    	СтрокаДерева.ПутьВКаталоге = ПутьВКаталоге;
    Иначе
    	СтрокаДерева.ЭтоКаталог = 2;
        ДобавитьДанныеНастройкиВДерево(СтрокаДерева.Строки, ПутьФайла, РазделительПути, ПутьВКаталоге);
    КонецЕсли;
    
КонецПроцедуры

Функция ЗаписатьДанныеВФайл(Каталог, Ключ, Данные)
	
	ИмяФайла = СформироватьИмяФайла(Ключ);
	
	ДанныеКЗаписи = ОбщегоНазначения.ЗначениеВСтрокуXML(Данные);
	
	ЗаписьXML = Новый ЗаписьXML();
	ЗаписьXML.ОткрытьФайл(SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(Каталог, ИмяФайла));
	ЗаписьXML.ЗаписатьБезОбработки(ДанныеКЗаписи);
	ЗаписьXML.Закрыть();
	
	Возврат ИмяФайла;
	
КонецФункции

Функция ЗаписатьФайлНастройкиДокумента(Каталог, Ключ, Ссылка)
	
	Возврат ЗаписатьДанныеВФайл(Каталог, Ключ, Ссылка.ПолучитьОбъект());
	
КонецФункции

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
