
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТекущийПароль") Тогда
		ТекущийПарольОбъекта = Параметры.ТекущийПароль;
	Иначе
		ТекущийПарольОбъекта = "";
	КонецЕсли;

	Элементы.ТекущийПароль.Видимость = Не ПустаяСтрока(ТекущийПарольОбъекта);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьПароль(Команда)
	
	Если Не ПустаяСтрока(ТекущийПарольОбъекта) И ТекущийПарольОбъекта <> ТекущийПароль Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Текущий пароль указан некорректно.'"));
		Возврат;
	КонецЕсли;
	
	Если (Не ПустаяСтрока(НовыйПароль) Или Не ПустаяСтрока(ПодтверждениеПароля)) И НовыйПароль <> ПодтверждениеПароля Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Подтверждение пароля указано некорректно.'"));
		Возврат;
	КонецЕсли;
	
	Закрыть(НовыйПароль);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьУстановкуПароля(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти
