
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	SUI_РегламентныеЗадания.ПриСозданииНаСервере(ЭтотОбъект, SUI_СообщенияОбменаДанными);
	
	Если ПолучитьФункциональнуюОпцию("SUI_СрокХраненияРезультатовОбработкиВходящихСообщенийОбмена") < 1 Тогда
		Элементы.СписокПоказатьОбработанныеСообщения.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьОтображениеСообщений();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_ЗапуститьРегламентноеЗадание(Команда)
	
	Оповещение = Новый ОписаниеОповещения("Подключаемый_ЗапуститьРегламентноеЗаданиеЗавершение", ЭтотОбъект);
	SUI_РегламентныеЗаданияКлиент.Подключаемый_ЗапуститьРегламентноеЗадание(Команда, ЭтотОбъект, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОбработанныеСообщения(Команда)
	
	Элементы.СписокПоказатьОбработанныеСообщения.Пометка = Не Элементы.СписокПоказатьОбработанныеСообщения.Пометка;
	
	УстановитьОтображениеСообщений();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура Подключаемый_ЗапуститьРегламентноеЗаданиеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтображениеСообщений()
	
	Элементы.СписокКонтекстноеМенюПоказатьОбработанныеСообщения.Пометка = Элементы.СписокПоказатьОбработанныеСообщения.Пометка;
	
	Если Элементы.СписокПоказатьОбработанныеСообщения.Пометка Тогда
		
		Заголовок = НСтр("ru = 'Обработанные'");
		
		SUI_КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(Список.Отбор, "Обработано", , ВидСравненияКомпоновкиДанных.Заполнено);
		
		Элементы.ДатаЗаписи.Видимость = Ложь;
		Элементы.СписокГруппаВидДанныхСворачивать.Видимость = Ложь;
		Элементы.Приоритет.Видимость = Ложь;
		Элементы.Обработано.Видимость = Истина;
		Элементы.ОшибкаОбработки.Видимость = Истина;
		
	Иначе
		
		Заголовок = "";
		
		SUI_КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(Список.Отбор, "Обработано", , ВидСравненияКомпоновкиДанных.НеЗаполнено);
		
		Элементы.ДатаЗаписи.Видимость = Истина;
		Элементы.СписокГруппаВидДанныхСворачивать.Видимость = Истина;
		Элементы.Приоритет.Видимость = Истина;
		Элементы.Обработано.Видимость = Ложь;
		Элементы.ОшибкаОбработки.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
