
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьОбработкуСообщений(Команда)
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ВыполнитьОбработкуСообщенийЗавершение", ЭтотОбъект);
	
	ПараметрыЗапуска = SUI_РегламентныеЗаданияКлиент.ПараметрыЗапускаРегламентногоЗадания(
		ПредопределенноеЗначение("Перечисление.SUI_КлючиРегламентыхЗаданий.ОбработкаСообщенийОбменаДанными"));
	
	SUI_РегламентныеЗаданияКлиент.ЗапуститьРегламентноеЗаданиеВручную(ОповещениеОЗавершении, ПараметрыЗапуска);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСверткуСообщений(Команда)
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ВыполнитьСверткуСообщенийЗавершение", ЭтотОбъект);
	
	ПараметрыЗапуска = SUI_РегламентныеЗаданияКлиент.ПараметрыЗапускаРегламентногоЗадания(
		ПредопределенноеЗначение("Перечисление.SUI_КлючиРегламентыхЗаданий.СверткаСообщенийОбменаДанными"));
	
	SUI_РегламентныеЗаданияКлиент.ЗапуститьРегламентноеЗаданиеВручную(ОповещениеОЗавершении, ПараметрыЗапуска);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРезультатыОбработкиСообщений(Команда)
	ОткрытьФорму("РегистрСведений.SUI_РезультатыОбработкиВходящихСообщенийОбменаДанными.ФормаСписка", , 
		ЭтотОбъект, УникальныйИдентификатор, Окно);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыполнитьОбработкуСообщенийЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено И Результат.ЗаданиеВыполнено Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСверткуСообщенийЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено И Результат.ЗаданиеВыполнено Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
