
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	SUI_РегламентныеЗадания.ПриСозданииНаСервере(ЭтотОбъект, SUI_СообщенияОбменаДанными);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_ЗапуститьРегламентноеЗадание(Команда)
	
	Оповещение = Новый ОписаниеОповещения("Подключаемый_ЗапуститьРегламентноеЗаданиеЗавершение", ЭтотОбъект);
	SUI_РегламентныеЗаданияКлиент.Подключаемый_ЗапуститьРегламентноеЗадание(Команда, ЭтотОбъект, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРезультатыОбработкиСообщений(Команда)
	ОткрытьФорму("РегистрСведений.SUI_РезультатыОбработкиВходящихСообщенийОбменаДанными.ФормаСписка", , 
		ЭтотОбъект, УникальныйИдентификатор, Окно);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура Подключаемый_ЗапуститьРегламентноеЗаданиеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти
