
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Сохранить признак использования редактора кода BSL.
// 
// Параметры:
//  Значение - Булево - Признак использования редактора кода BSL.
Процедура СохранитьПризнакИспользованияРедактораКодаBSL(Значение) Экспорт
	
	ОписаниеТипаБулево = Новый ОписаниеТипов("Булево");
	SUI_ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
		КлючОбщейНастройкиИспользоватьРедакторКодаBSL(), ОписаниеТипаБулево.ПривестиЗначение(Значение));
	
КонецПроцедуры

// Получить признак использования редактора кода BSL.
// 
// Возвращаемое значение:
//  Булево - Признак использования редактора кода BSL.
Функция ПолучитьПризнакИспользованияРедактораКодаBSL() Экспорт
	
	Возврат SUI_ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		КлючОбщейНастройкиИспользоватьРедакторКодаBSL(), Ложь);
	
КонецФункции

// Выполнить код. Выполнение происходит через см. ОбщегоНазначения.ВыполнитьВБезопасномРежиме.
// 
// Параметры:
//  Алгоритм - Строка - Код алгоритма.
//  Параметры - Произвольный -  контекст, который требуется для выполнения алгоритма.
//    В тексте алгоритма обращение к контексту должно происходить по имени "Параметры".
//    Например, выражение "Параметры.Значение1 = Параметры.Значение2" обращается к значениям
//    "Значение1" и "Значение2", переданным в Параметры, как свойства.
//  ВыполнитьВПривилегированномРежиме - Булево - Выполнить в привилегированном режиме.
//  
// Пример:
//
//  Параметры = Новый Структура;
//  Параметры.Вставить("Значение1", 1);
//  Параметры.Вставить("Значение2", 10);
//  SUI_РедакторКода.ВыполнитьКод("Параметры.Значение1 = Параметры.Значение2", Параметры);
//
// 
// Возвращаемое значение:
//  Неопределено - Результат выполнения кода, если в структуре параметров было передано свойство "Результат"
Функция ВыполнитьКод(Знач Алгоритм, Знач Параметры, ВыполнитьВПривилегированномРежиме = Ложь) Экспорт
	
	Если Параметры = Неопределено Тогда
		Параметры = Новый Структура();
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.Проверить(
		ТипЗнч(Параметры) = Тип("Структура"),
		НСтр("ru = 'Несоответствие типа параметры алгоритма.
		|Ожидаемый тип параметров алгоритма Структура или Неопеределено'"));
	
	Если Не Параметры.Свойство("Результат") Тогда
		Параметры.Вставить("Результат");
	КонецЕсли;
	
	Алгоритм = SUI_ОбщегоНазначения.ОписаниеТипаСтрока(0).ПривестиЗначение(Алгоритм);
	
	Если Не ПустаяСтрока(Алгоритм) Тогда
		
		Если ВыполнитьВПривилегированномРежиме Тогда
			УстановитьПривилегированныйРежим(Истина);
		КонецЕсли;
		
		ОбщегоНазначения.ВыполнитьВБезопасномРежиме(Алгоритм, Параметры);
		
		Если ВыполнитьВПривилегированномРежиме Тогда
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
		
	КонецЕсли;
	
	Результат = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Результат");
	
	Параметры.Вставить("Результат");
	
	Возврат Результат;
	
КонецФункции

// Выполнить код через метод конфигурации.  Выполнение происходит через см. ОбщегоНазначения.ВыполнитьМетодКонфигурации.
// 
// Параметры:
//  ИмяМетода - Строка - имя экспортной процедуры в формате
//                   <имя объекта>.<имя процедуры>, где <имя объекта> - это
//                   общий модуль или модуль менеджера объекта.
//  Алгоритм - Строка - Код алгоритма.
//  Параметры - Массив из Произвольный - параметры передаются в процедуру <ИмяЭкспортнойПроцедуры>
//                       в порядке расположения элементов массива.
//  ВыполнитьВПривилегированномРежиме - Булево - Выполнить в привилегированном режиме.
// 
// Возвращаемое значение:
//  Массив из Произвольный - Параметры после выполнения алгоритма через метод конфигурации
Функция ВыполнитьКодЧерезМетодКонфигурации(ИмяМетода, Знач Алгоритм, Параметры, ВыполнитьВПривилегированномРежиме = Ложь) Экспорт
	
	Результат = Неопределено;
	
	Алгоритм = SUI_ОбщегоНазначения.ОписаниеТипаСтрока(0).ПривестиЗначение(Алгоритм);
	
	Если Не ПустаяСтрока(Алгоритм) Тогда
		
		Если ВыполнитьВПривилегированномРежиме Тогда
			УстановитьПривилегированныйРежим(Истина);
		КонецЕсли;
		
		ПараметрыМетода = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Алгоритм);
		
		ОписаниеТипаМассив = Новый ОписаниеТипов("Массив");
		Для Каждого Параметр Из ОписаниеТипаМассив.ПривестиЗначение(Параметры) Цикл
			ПараметрыМетода.Добавить(Параметр);
		КонецЦикла;
		
		ОбщегоНазначения.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
		
		Если ВыполнитьВПривилегированномРежиме Тогда
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
		
		Результат = Новый Массив();
		Для индекс = 1 По ПараметрыМетода.ВГраница() Цикл
			Результат.Добавить(ПараметрыМетода[индекс]);
		КонецЦикла;
		
	Иначе
		Результат = Параметры;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция КлючОбщейНастройкиИспользоватьРедакторКодаBSL() Экспорт
	
	Возврат "ИспользоватьРедакторКодаBSL";
	
КонецФункции

#КонецОбласти

#КонецЕсли
