
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьВерсию() Экспорт
	Возврат ОбработатьСтрокуВерсии(Константы.SUI_ВерсияДанных.Получить());
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ОбработатьСтрокуВерсии(СтрокаВерсии) Экспорт
	
	Версия = "#1.#2.#3.#4";
	
	Подверсии = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаВерсии, ".", Ложь, Истина);
	
	SUI_ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Подверсии, SUI_ОбщегоНазначенияКлиентСервер.МассивЗначений("0", "0", "0", "0"));
	
	Для индекс = 1 По 4 Цикл
		
		Подверсия = СокрЛП(?(индекс = 4, Лев(Подверсии[индекс-1], 4), Лев(Подверсии[индекс-1], 3)));
		
		Если ПустаяСтрока(Подверсия) Тогда
			Подверсия = "0";
		ИначеЕсли Не СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Подверсия) Тогда
			Версия = "0.0.0.0";
			Прервать;
		КонецЕсли;
		
		Версия = СтрЗаменить(Версия, "#" + Строка(индекс), Подверсия);

	КонецЦикла;
	
	Возврат Версия;
	
КонецФункции

#КонецОбласти

#КонецЕсли
