
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОписаниеШаблоновСервиса = SUI_HTTPСервисПовтИсп.ОписаниеДанныхHTTPСервисаExchange().Получить("Шаблоны");
	
	Для Каждого ОписаниеШаблона Из ОписаниеШаблоновСервиса Цикл
		ШаблоныОписанийСервиса.Добавить(ОписаниеШаблона.Значение, ОписаниеШаблона.Значение.Получить("Представление"));
	КонецЦикла;
	
	ОбновитьДанныеПослеЧтения();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьДанныеПослеЧтения();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНаборЗаписей

&НаКлиенте
Процедура НаборЗаписейПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	Если ПолучитьСписокВыбораШаблонов().Количество() = 0 Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Или ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьДанныеВСтроке(ТекущиеДанные, ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ПолучитьСписокВыбораШаблонов();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьДанныеПослеЧтения()
	
	ОписаниеШаблоновСервиса = SUI_HTTPСервисПовтИсп.ОписаниеДанныхHTTPСервисаExchange().Получить("Шаблоны");
	
	Для Каждого Запись Из НаборЗаписей Цикл
		
		ОписаниеШаблона = ОписаниеШаблоновСервиса.Получить(Запись.ИмяШаблона);
		
		Если ОписаниеШаблона = Неопределено Тогда
			НаборЗаписей.Удалить(Запись);
		Иначе
			ОбновитьДанныеВСтроке(Запись, ОписаниеШаблона);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьДанныеВСтроке(ДанныеСтроки, Данные)
	
	ДанныеСтроки.ИмяШаблона = Данные.Получить("Имя");
	ДанныеСтроки.Наименование = Данные.Получить("Представление");
	ДанныеСтроки.Адрес = Данные.Получить("Адрес");
	ДанныеСтроки.Комментарий = Данные.Получить("Комментарий");
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСписокВыбораШаблонов()
	
	СписокВыбораШаблонов = Новый СписокЗначений();
	
	Для Каждого ЭлементВыбора Из ШаблоныОписанийСервиса Цикл
		
		ИмяШаблона = ЭлементВыбора.Значение.Получить("Имя");
		
		Если ИмяШаблона <> Неопределено Тогда
			
			ПараметрыОтбора = Новый Структура("ИмяШаблона", ИмяШаблона);
			
			Если НаборЗаписей.НайтиСтроки(ПараметрыОтбора).Количество() = 0 Тогда
				СписокВыбораШаблонов.Добавить(ЭлементВыбора.Значение, ЭлементВыбора.Представление);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СписокВыбораШаблонов;
	
КонецФункции

#КонецОбласти
