
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.Свойство("ТипАлгоритма", 			ТипАлгоритма);
	Параметры.Свойство("Алгоритм", 				Алгоритм);
	Параметры.Свойство("ИмяОбъектаМетаданных", 	ИмяОбъектаМетаданных);
	Параметры.Свойство("ТипТаблицы", 			ТипТаблицы);
	Параметры.Свойство("ИмяТабличнойЧасти", 	ИмяТабличнойЧасти);
	Параметры.Свойство("ИмяСоздаваемогоДокумента", ИмяСоздаваемогоДокумента);
    Параметры.Свойство("ИмяМетаданныхСоздаваемогоДокумента", ИмяМетаданныхСоздаваемогоДокумента);
	
	Если Не ПроверитьЗаполнениеПараметровПриСозданииНаСервере(Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ИнициализироватьИнформациюАлгоритмаПриСозданииНаСервере();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АлгоритмПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

//@skip-check module-region-empty
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаЗакрытьБезСохранения(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранить(Команда)

	ПараметрыЗакрытия = Новый Структура();
	
	ПараметрыЗакрытия.Вставить("ТипАлгоритма", 		ТипАлгоритма);
	ПараметрыЗакрытия.Вставить("Алгоритм", 			Алгоритм);
	ПараметрыЗакрытия.Вставить("ТипТаблицы", 		ТипТаблицы);
	ПараметрыЗакрытия.Вставить("ИмяТабличнойЧасти", ИмяТабличнойЧасти);
	ПараметрыЗакрытия.Вставить("ИмяСоздаваемогоДокумента", ИмяСоздаваемогоДокумента);
	ПараметрыЗакрытия.Вставить("ИмяМетаданныхСоздаваемогоДокумента", ИмяМетаданныхСоздаваемогоДокумента);
	
	Закрыть(ПараметрыЗакрытия);	

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПредопределенным(Команда)
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаполнитьПредопределеннымПослеПодтверждения", ЭтотОбъект);
	
	ПоказатьВопрос(ОповещениеОЗавершении, НСтр("ru = 'Произвольный алгоритм будет очищен и заполнен предопределенным. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

#КонецОбласти

//@skip-check module-region-empty
#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПроверитьЗаполнениеПараметровПриСозданииНаСервере(Отказ)
	
	Если Не ЗначениеЗаполнено(ИмяОбъектаМетаданных) Тогда
		Отказ = Истина;
	Иначе
	
		Если ВРег(ТипАлгоритма) = ВРег("ОбработкаСтрокиТабличнойЧасти") Тогда
			
			Если ТипТаблицы.Пустая() Или Не ЗначениеЗаполнено(ИмяТабличнойЧасти) Тогда
				Отказ = Истина;
			Иначе
				ТипАлгоритма = "ОбработкаСтрокиТабличнойЧасти";
			КонецЕсли;
			
		ИначеЕсли ВРег(ТипАлгоритма) = ВРег("АлгоритмОбработкиСозданияДокументаНаОсновании") Тогда
			ТипАлгоритма = "ОбработкаСозданияДокументаНаОсновании";	
		ИначеЕсли ВРег(ТипАлгоритма) = ВРег("ПередЗаписью") Тогда
			ТипАлгоритма = "ПередЗаписью";
		ИначеЕсли ВРег(ТипАлгоритма) = ВРег("ПослеЗаписи") Тогда
			ТипАлгоритма = "ПослеЗаписи";
		Иначе
			Отказ = Истина;
		КонецЕсли;
	
	КонецЕсли;
	
	Если Не Отказ Тогда
		
		МетаданныеДокумента = Метаданные.Документы.Найти(ИмяОбъектаМетаданных);
		
		Если МетаданныеДокумента = Неопределено Тогда
			Отказ = Истина;
		Иначе
			
			ИмяОбъектаМетаданных = МетаданныеДокумента.Имя;
			
			Если ТипАлгоритма = "ОбработкаСтрокиТабличнойЧасти" Тогда
				
				МетаданныеТабличнойЧасти = МетаданныеДокумента.ТабличныеЧасти.Найти(ИмяТабличнойЧасти);
				
				Если МетаданныеТабличнойЧасти = Неопределено Тогда
					Отказ = Истина;
				Иначе
					ИмяТабличнойЧасти = МетаданныеТабличнойЧасти.Имя;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Не Отказ;
	
КонецФункции

&НаСервере
Процедура ИнициализироватьИнформациюАлгоритмаПриСозданииНаСервере()
	
	МетаданныеДокумента = Метаданные.Документы.Найти(ИмяОбъектаМетаданных);
	
	//@skip-check new-font
	ШрифтТекстаЗаголовка 			= Новый Шрифт(, 13);
	//@skip-check new-font
	ШрифтТекстаОписания 			= Новый Шрифт(, 11);
	//@skip-check new-font
	ШрифтТекстаЗаголовкаПеременных	= Новый Шрифт(, 10);
	//@skip-check new-font
	ШрифтТекстаПеременных 			= Новый Шрифт(, 9, , , Истина);
	//@skip-check new-font
	ШрифтТекстаОписанияПеременных 	= Новый Шрифт(, 9);
	
	ЦветТекстаЗаголовков 			= WebЦвета.Зеленый;
	ЦветТекстаПеременных 			= WebЦвета.Синий;
	
	ИнформацияОбАлгоритме = Новый Массив();
	ИнформацияОписаниеПеременных = Новый Массив();
	
	ИнформацияОписаниеПеременных.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Доступные переменные:'"), ШрифтТекстаЗаголовкаПеременных, ЦветТекстаЗаголовков));
	
	Если ТипАлгоритма = "ОбработкаСтрокиТабличнойЧасти" Тогда
		
		МетаданныеТабличнойЧасти = МетаданныеДокумента.ТабличныеЧасти.Найти(ИмяТабличнойЧасти);
		
		Заголовок = СтрШаблон(НСтр("ru = '%1: Обработка строки табличной части ""%2""'"), 
			МетаданныеДокумента.Синоним, МетаданныеТабличнойЧасти.Синоним);
			
		ИнформацияОбАлгоритме.Добавить(Новый ФорматированнаяСтрока(
			СтрШаблон(НСтр("ru = 'Произвольный алгоритм выполняемый после обновления данных в строке табличной части %1 документа %2'"), 
				МетаданныеТабличнойЧасти.Синоним, МетаданныеДокумента.Синоним), 
			ШрифтТекстаЗаголовка, 
			ЦветТекстаЗаголовков
		));
		
		ИнформацияОбАлгоритме.Добавить(Новый ФорматированнаяСтрока(СтрШаблон(НСтр("ru = '
		|Напишите свой алгоритм выполняемый после обновления данных в строке табличной части %1 документа %2 
		|или заполните предопределенным по кнопке ""Заполнить предопределенным""'"), 
			МетаданныеТабличнойЧасти.Синоним, МетаданныеДокумента.Синоним), 
			ШрифтТекстаОписания
		));
		
		ИнформацияОписаниеПеременных.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = '
		|ДокументОбъект'"), ШрифтТекстаПеременных, ЦветТекстаПеременных));
		ИнформацияОписаниеПеременных.Добавить(Новый ФорматированнаяСтрока(
			СтрШаблон(НСтр("ru = ' - Объект документа %1'"), МетаданныеДокумента.Синоним), 
			ШрифтТекстаОписанияПеременных
		));
			
		ИнформацияОписаниеПеременных.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = '
		|ТекущаяСтрока'"), ШрифтТекстаПеременных, ЦветТекстаПеременных));
		ИнформацияОписаниеПеременных.Добавить(Новый ФорматированнаяСтрока(
			СтрШаблон(НСтр("ru = ' - Строка табличной части %1 объекта документа %2'"), 
			МетаданныеТабличнойЧасти.Синоним, МетаданныеДокумента.Синоним), 
			ШрифтТекстаОписанияПеременных
		));
	ИначеЕсли ТипАлгоритма = "ОбработкаСозданияДокументаНаОсновании" Тогда
				
		Заголовок = СтрШаблон(НСтр("ru = '%1: Обработка создания документа на основании ""%2""'"), 
			ИмяСоздаваемогоДокумента, МетаданныеДокумента.Синоним);
			
		ИнформацияОбАлгоритме.Добавить(Новый ФорматированнаяСтрока(
			СтрШаблон(НСтр("ru = 'Произвольный алгоритм выполняемый при создании документа  %1'"), 
				ИмяСоздаваемогоДокумента), 
			ШрифтТекстаЗаголовка, 
			ЦветТекстаЗаголовков
		));
		
		ИнформацияОбАлгоритме.Добавить(Новый ФорматированнаяСтрока(СтрШаблон(НСтр("ru = '
		|Напишите свой алгоритм выполняемый при создании документа %1 
		|или заполните предопределенным по кнопке ""Заполнить предопределенным""'"), 
			ИмяСоздаваемогоДокумента), 
			ШрифтТекстаОписания
		));
		
		ИнформацияОписаниеПеременных.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = '
		|ДокументОбъект'"), ШрифтТекстаПеременных, ЦветТекстаПеременных));
		ИнформацияОписаниеПеременных.Добавить(Новый ФорматированнаяСтрока(
			СтрШаблон(НСтр("ru = ' - Объект документа %1'"), ИмяСоздаваемогоДокумента), 
			ШрифтТекстаОписанияПеременных
		));
		
	ИначеЕсли ТипАлгоритма = "ПередЗаписью" Тогда
		
		Заголовок = СтрШаблон(НСтр("ru = '%1: Перед записью'"), МетаданныеДокумента.Синоним);
		
		ИнформацияОбАлгоритме.Добавить(Новый ФорматированнаяСтрока(
			СтрШаблон(НСтр("ru = 'Произвольный алгоритм выполняемый перед записью документа %1'"), МетаданныеДокумента.Синоним), 
			ШрифтТекстаЗаголовка, 
			ЦветТекстаЗаголовков
		));
		
		ИнформацияОбАлгоритме.Добавить(Новый ФорматированнаяСтрока(СтрШаблон(НСтр("ru = '
		|Напишите свой алгоритм выполняемый перед записью документа %1 
		|или заполните предопределенным по кнопке ""Заполнить предопределенным""'"), 
			МетаданныеДокумента.Синоним), 
			ШрифтТекстаОписания
		));
	
		ИнформацияОписаниеПеременных.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = '
		|ДокументОбъект'"), ШрифтТекстаПеременных, ЦветТекстаПеременных));
		ИнформацияОписаниеПеременных.Добавить(Новый ФорматированнаяСтрока(
			СтрШаблон(НСтр("ru = ' - Объект документа %1'"), МетаданныеДокумента.Синоним),
			ШрифтТекстаОписанияПеременных
		));
			
	ИначеЕсли ТипАлгоритма = "ПослеЗаписи" Тогда
		
		Заголовок = СтрШаблон(НСтр("ru = '%1: После записи'"), МетаданныеДокумента.Синоним);

		ИнформацияОбАлгоритме.Добавить(Новый ФорматированнаяСтрока(
			СтрШаблон(НСтр("ru = 'Произвольный алгоритм выполняемый после записи документа %1'"), МетаданныеДокумента.Синоним), 
			ШрифтТекстаЗаголовка, 
			ЦветТекстаЗаголовков
		));
		
		ИнформацияОбАлгоритме.Добавить(Новый ФорматированнаяСтрока(СтрШаблон(НСтр("ru = '
		|Напишите свой алгоритм выполняемый после записи документа %1 
		|или заполните предопределенным по кнопке ""Заполнить предопределенным""'"), 
			МетаданныеДокумента.Синоним), 
			ШрифтТекстаОписания
		));
		
		ИнформацияОписаниеПеременных.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = '
		|ДокументСсылка'"), ШрифтТекстаПеременных, ЦветТекстаПеременных));
		ИнформацияОписаниеПеременных.Добавить(Новый ФорматированнаяСтрока(
			СтрШаблон(НСтр("ru = ' - Ссылка документа %1'"), МетаданныеДокумента.Синоним), 
			ШрифтТекстаОписанияПеременных
		));
		
	КонецЕсли;

	Элементы.ИнформацияОбАлгоритме.Заголовок = Новый ФорматированнаяСтрока(ИнформацияОбАлгоритме);
	Элементы.ИнформацияОписаниеПеременных.Заголовок = Новый ФорматированнаяСтрока(ИнформацияОписаниеПеременных);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПредопределеннымПослеПодтверждения(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Алгоритм = "";
	
	Если ТипАлгоритма = "ОбработкаСтрокиТабличнойЧасти" Тогда
		Алгоритм = SUI_НастройкиДокументовКлиентСервер.ПолучитьПроизвольныйАлгоритмОбработкиСтрокДокумента(ПараметрыПолученияПроизвольногоАлгоритма());
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПараметрыПолученияПроизвольногоАлгоритма()
	
	ПараметрыПолученияАлгоритма = Новый Структура();
	
	ПараметрыПолученияАлгоритма.Вставить("ИмяОбъектаМетаданных", 	ИмяОбъектаМетаданных);
	
	Если ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары Тогда
		ПараметрыПолученияАлгоритма.Вставить("ЭтоТовары");
	КонецЕсли;
	
	Если ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор Тогда
		ПараметрыПолученияАлгоритма.Вставить("ЭтоОтбор");
	КонецЕсли;
	
	Если ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение Тогда
		ПараметрыПолученияАлгоритма.Вставить("ЭтоРазмещение");
	КонецЕсли;
	
	Если ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок Тогда
		ПараметрыПолученияАлгоритма.Вставить("ЭтоШтрихкодыУпаковок");
	КонецЕсли;
	
	Возврат ПараметрыПолученияАлгоритма;
	
КонецФункции

#КонецОбласти
