
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция РабочиеСостоянияДокументовОбмена() Экспорт
	
	Возврат SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.МассивЗначений(
		Перечисления.SUI_СостоянияДокументовОбмена.КВыгрузке, 
		Перечисления.SUI_СостоянияДокументовОбмена.Выгружен, 
		Перечисления.SUI_СостоянияДокументовОбмена.Загружен, 
		Перечисления.SUI_СостоянияДокументовОбмена.ВРаботе);
	
КонецФункции

// Получить данные документов обмена.
// 
// Параметры:
//  Отбор - Соответствие из Произвольный - Отбор документов обмена
//  ПолучаемыеДополнительныеПоля - Соответствие из Строка, Неопределено - Получаемые дополнительные поля. По умолчанию: sid, id_doc, НастройкаДокумента
// 		* Ключ - Строка - Поле документа обмена (возможно получение через точку)
// 		* Значение - Строка, Неопределено - Псевдоним выбираемого поля
// Возвращаемое значение:
//  РезультатЗапроса - Получить данные документов обмена
Функция ПолучитьДанныеДокументовОбмена(Отбор, ПолучаемыеДополнительныеПоля = Неопределено) Экспорт
	
	ИмяФункцииВызова = "РегистрыСведений.SUI_docs.ПолучитьДанныеДокументовОбмена";
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(ИмяФункцииВызова, "Отбор", Отбор, Тип("Соответствие"));
	
	ТекстОшибки = НСтр("ru = 'Не передан отбор'");
	ОбщегоНазначенияКлиентСервер.Проверить(Отбор.Количество() > 0, ТекстОшибки, ИмяФункцииВызова);
	
	Если ПолучаемыеДополнительныеПоля <> Неопределено Тогда
		
		ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(ИмяФункцииВызова, 
			"ПолучаемыеДополнительныеПоля", ПолучаемыеДополнительныеПоля, Тип("Соответствие"));
		
	КонецЕсли;
	
	ВыбранныеПоля = Новый Массив();
	ВыбранныеПоля.Добавить("sid");
	ВыбранныеПоля.Добавить("id_doc");
	ВыбранныеПоля.Добавить("НастройкаДокумента");
	
	Запрос = Новый Запрос("ВЫБРАТЬ " + СтрСоединить(ВыбранныеПоля, ",") + " ИЗ РегистрСведений.SUI_docs");
	
	СхемаЗапроса = Новый СхемаЗапроса();
	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
	
	ЗапросПакета = СхемаЗапроса.ПакетЗапросов[СхемаЗапроса.ПакетЗапросов.Количество() - 1];
	ОператорыПакета = ЗапросПакета.Операторы[0];
	ПсевдонимИсточника = ОператорыПакета.Источники[0].Источник.Псевдоним;
	
	Если ПолучаемыеДополнительныеПоля <> Неопределено Тогда
		
		Для Каждого КлючЗначение Из ПолучаемыеДополнительныеПоля Цикл
			
			ПолеВыражение = КлючЗначение.Ключ;
			ПолеПсевдоним = КлючЗначение.Значение;
			
			Если ПолеПсевдоним = Неопределено И ВыбранныеПоля.Найти(ПолеВыражение) <> Неопределено Тогда
				Продолжить;
			ИначеЕсли ПолеПсевдоним <> Неопределено И ВыбранныеПоля.Найти(ПолеПсевдоним) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ВыбранноеПоле = ОператорыПакета.ВыбираемыеПоля.Добавить(ПсевдонимИсточника + "." + ПолеВыражение);
			
			Если ПолеПсевдоним <> Неопределено Тогда
				
				КолонкаВыбранноеПоле = ЗапросПакета.Колонки.Найти(ВыбранноеПоле);
				КолонкаВыбранноеПоле.Псевдоним = ПолеПсевдоним;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Для Каждого КлючЗначение Из Отбор Цикл
		
		ТипЗначения = ТипЗнч(КлючЗначение.Значение);
		
		КлючПараметра = СтрЗаменить(КлючЗначение.Ключ, ".", "_");
		
		Если ТипЗначения = Тип("Массив") Или 
			ТипЗначения = Тип("ФиксированныйМассив") Или
			ТипЗначения = Тип("СписокЗначений") Тогда
			
			ОператорыПакета.Отбор.Добавить(СтрШаблон("%1 В (&%2)", КлючЗначение.Ключ, КлючПараметра));
			
		Иначе
			ОператорыПакета.Отбор.Добавить(СтрШаблон("%1 = &%2", КлючЗначение.Ключ, КлючПараметра));
		КонецЕсли;
		
		Запрос.УстановитьПараметр(КлючПараметра, КлючЗначение.Значение);
		
	КонецЦикла;
	
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция ДанныеДляЗагрузкиИзМобильногоУстройства(ИдентификаторДокумента, МобильноеУстройство) Экспорт
	
	ТаблицыДляЗагрузки = Новый Структура();
	ТаблицыДляЗагрузки.Вставить("Товары");
	ТаблицыДляЗагрузки.Вставить("Серии");
	ТаблицыДляЗагрузки.Вставить("ШтрихкодыУпаковок");
	ТаблицыДляЗагрузки.Вставить("ПотокШтрихкодов");
	
	ДанныеДляЗагрузки = Новый Структура();
	ДанныеДляЗагрузки.Вставить("ИдентификаторДокументаОбмена");
	ДанныеДляЗагрузки.Вставить("НастройкаДокумента");
	ДанныеДляЗагрузки.Вставить("ИдентификаторДокумента", ИдентификаторДокумента);
	ДанныеДляЗагрузки.Вставить("МобильноеУстройство", МобильноеУстройство);
	ДанныеДляЗагрузки.Вставить("Таблицы", ТаблицыДляЗагрузки);
	
	Возврат ДанныеДляЗагрузки;
	
КонецФункции

Функция ЗагрузитьИзМобильногоУстройства(ДанныеДляЗагрузки) Экспорт
	
	ДанныеЗагружены = Ложь;
	
	ОтборДокументовОбмена = Новый Соответствие();
	ОтборДокументовОбмена.Вставить("Состояние", РабочиеСостоянияДокументовОбмена());
	ОтборДокументовОбмена.Вставить("НастройкаДокумента.Используется", Истина);
	ОтборДокументовОбмена.Вставить("НастройкаДокумента.ПометкаУдаления", Ложь);
	ОтборДокументовОбмена.Вставить("id_doc", ДанныеДляЗагрузки.ИдентификаторДокумента);
	
	Если ДанныеДляЗагрузки.ИдентификаторДокументаОбмена <> Неопределено Тогда
		ОтборДокументовОбмена.Вставить("sid", ДанныеДляЗагрузки.ИдентификаторДокументаОбмена);
	КонецЕсли;
	
	Если ДанныеДляЗагрузки.НастройкаДокумента <> Неопределено Тогда
		ОтборДокументовОбмена.Вставить("НастройкаДокумента", ДанныеДляЗагрузки.НастройкаДокумента);
	КонецЕсли;
	
	ПоляДокументовОбмена = Новый Соответствие();
	ПоляДокументовОбмена.Вставить("НастройкаДокумента.ЗагружатьВДокумент1СПослеПолученияИзТСД", "ЗагружатьВДокумент1С");
	ПоляДокументовОбмена.Вставить("НастройкаДокумента.ЗавершатьДокумент1СПослеПолученияИзТСД", "ЗавершатьДокументОбмена");
	
	РезультатДокументыОбмена = ПолучитьДанныеДокументовОбмена(ОтборДокументовОбмена, ПоляДокументовОбмена);
	
	Если РезультатДокументыОбмена.Пустой() Тогда
		
		ТекстОшибки = НСтр("ru = 'Документ с идентификатором ""%1"" не был выгружен!'");
		ТекстОшибки = СтрШаблон(ТекстОшибки, ДанныеДляЗагрузки.ИдентификаторДокумента);
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	ВыборкаДокументыОбмена = РезультатДокументыОбмена.Выбрать();
	
	Пока ВыборкаДокументыОбмена.Следующий() Цикл
		
		РезультатЗагрузки = Новый Структура();
		РезультатЗагрузки.Вставить("Товары", Ложь);
		РезультатЗагрузки.Вставить("Серии", Ложь);
		РезультатЗагрузки.Вставить("ШтрихкодыУпаковок", Ложь);
		РезультатЗагрузки.Вставить("ПотокШтрихкодов", Ложь);
		
		Для Каждого КлючЗначение Из ДанныеДляЗагрузки.Таблицы Цикл
			
			Если КлючЗначение.Значение = Неопределено Тогда
				Продолжить;
				
			ИначеЕсли КлючЗначение.Ключ = "Товары" Тогда
				
				РезультатЗагрузки.Товары = РегистрыСведений.SUI_docs_tbl_goods.ЗагрузитьИзМобильногоУстройства(
					ВыборкаДокументыОбмена.sid, КлючЗначение.Значение);
				
			ИначеЕсли КлючЗначение.Ключ = "Серии" Тогда
				
				РезультатЗагрузки.Серии = РегистрыСведений.SUI_docs_tbl_series.ЗагрузитьИзМобильногоУстройства(
					ВыборкаДокументыОбмена.sid, КлючЗначение.Значение);
				
			ИначеЕсли КлючЗначение.Ключ = "ШтрихкодыУпаковок" Тогда
				
				РезультатЗагрузки.ШтрихкодыУпаковок = РегистрыСведений.SUI_docs_tbl_barcodes.ЗагрузитьИзМобильногоУстройства(
					ВыборкаДокументыОбмена.sid, КлючЗначение.Значение);
				
			ИначеЕсли КлючЗначение.Ключ = "ПотокШтрихкодов" Тогда
				
				РезультатЗагрузки.ПотокШтрихкодов = РегистрыСведений.SUI_docs_tbl_barcode_flow.ЗагрузитьИзМобильногоУстройства(
					ВыборкаДокументыОбмена.sid, КлючЗначение.Значение);
				
			Иначе
				//TODO: artem - 08.04.2025 - Неизвестный ключ таблицы
			КонецЕсли;
			
		КонецЦикла;
		
		Если Не РезультатЗагрузки.Товары И Не РезультатЗагрузки.Серии И 
			Не РезультатЗагрузки.ШтрихкодыУпаковок И Не РезультатЗагрузки.ПотокШтрихкодов Тогда
			Продолжить;
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Истина);
		
		РегистрироватьИзменения = Константы.SUI_РегистрироватьИзмененияПослеЗагрузкиДокументаИзМУ.Получить();
		ДокументСсылка = SUI_ИнтеграцияВКонфигурацию.СсылкаПоИдентификаторуSimple(ВыборкаДокументыОбмена.id_doc, Истина);
		
		Если ЗначениеЗаполнено(ДокументСсылка) Тогда
			ПредставлениеДокументаОчереди = Строка(ДокументСсылка);
		Иначе
			ПредставлениеДокументаОчереди = Строка(ВыборкаДокументыОбмена.НастройкаДокумента);
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Ложь);
		
		НаименованиеЗаданияОчереди = НСтр("ru = 'Постобработка документа обмена (%1)'");
		НаименованиеЗаданияОчереди = СтрШаблон(НаименованиеЗаданияОчереди, ПредставлениеДокументаОчереди);
		
		ПараметрыСозданияЗадания = SUI_ОчередьЗаданийКлиентСервер.ПараметрыСозданияЗадания();
		ПараметрыСозданияЗадания.Наименование = НаименованиеЗаданияОчереди;
		ПараметрыСозданияЗадания.ИдентификаторДокумента = ВыборкаДокументыОбмена.id_doc;
		
		Если РезультатЗагрузки.ШтрихкодыУпаковок Тогда
			
			ПараметрыПроцедуры = Новый Структура();
			ПараметрыПроцедуры.Вставить("sid_doc", ВыборкаДокументыОбмена.sid);
			
			ПараметрыПроцедуры = SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.МассивЗначений(
				ПараметрыПроцедуры, Неопределено);
			
			SUI_ОчередьЗаданийКлиентСервер.ДобавитьОбработчикВПараметрыСозданияЗадания(ПараметрыСозданияЗадания, 
				"SUI_ДокументыОбмена.ЗаданиеСоздатьШтрихкодыУпаковокДокументаОбмена", ПараметрыПроцедуры);
			
		КонецЕсли;
		
		Если РезультатЗагрузки.Серии Тогда
			
			ПараметрыПроцедуры = Новый Структура();
			ПараметрыПроцедуры.Вставить("sid_doc", ВыборкаДокументыОбмена.sid);
			
			ПараметрыПроцедуры = SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.МассивЗначений(
				ПараметрыПроцедуры, Неопределено);
			
			SUI_ОчередьЗаданийКлиентСервер.ДобавитьОбработчикВПараметрыСозданияЗадания(ПараметрыСозданияЗадания, 
				"SUI_ДокументыОбмена.ЗаданиеСоздатьСерииНоменклатурыДокументаОбмена", ПараметрыПроцедуры);
			
		КонецЕсли;
		
		Если ПараметрыСозданияЗадания.Обработчики.Количество() > 0 Тогда
			РегистрыСведений.SUI_ОчередьЗаданий.СоздатьЗадание(ПараметрыСозданияЗадания);
		КонецЕсли;
		
		Если РезультатЗагрузки.Товары И ВыборкаДокументыОбмена.ЗагружатьВДокумент1С Тогда
			
			НаименованиеЗаданияОчереди = НСтр("ru = 'Загрузка в документ 1С (%1)'");
			НаименованиеЗаданияОчереди = СтрШаблон(НаименованиеЗаданияОчереди, ПредставлениеДокументаОчереди);
			
			ПараметрыСозданияЗадания = SUI_ОчередьЗаданийКлиентСервер.ПараметрыСозданияЗадания();
			ПараметрыСозданияЗадания.Наименование = НаименованиеЗаданияОчереди;
			ПараметрыСозданияЗадания.ИдентификаторДокумента = ВыборкаДокументыОбмена.id_doc;
			
			// Проверка обработки всех входящих сообщений и всех заданий очереди
			SUI_ДокументыОбменаПереопределяемый.ДобавитьЗаданиеПостобработкиДокумента_ПроверкаОбработанныхДанных(
				ПараметрыСозданияЗадания, ВыборкаДокументыОбмена.id_doc);
			
			// Загрузка в документ 1С
			ПараметрыПроцедуры = Новый Структура();
			ПараметрыПроцедуры.Вставить("sid", ВыборкаДокументыОбмена.sid);
			ПараметрыПроцедуры.Вставить("id_doc", ВыборкаДокументыОбмена.id_doc);
			ПараметрыПроцедуры.Вставить("НастройкаДокумента", ВыборкаДокументыОбмена.НастройкаДокумента);
			
			ПараметрыПроцедуры = SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.МассивЗначений(ПараметрыПроцедуры, Неопределено);
			
			SUI_ОчередьЗаданийКлиентСервер.ДобавитьОбработчикВПараметрыСозданияЗадания(ПараметрыСозданияЗадания,
				"SUI_ДокументыОбмена.ЗаданиеЗагрузитьДокументОбменаВДокумент1СПослеЗагрузки", ПараметрыПроцедуры);
			
			// Смена состояния документа обмена на Завершен
			Если ВыборкаДокументыОбмена.ЗавершатьДокументОбмена Тогда
				
				ПараметрыУстановкиСостояния = ПараметрыУстановкиСостоянияДокументаОбмена(ВыборкаДокументыОбмена.sid,
					Перечисления.SUI_СостоянияДокументовОбмена.Завершен);
				ПараметрыУстановкиСостояния.МобильноеУстройство = ДанныеДляЗагрузки.МобильноеУстройство;
				ПараметрыУстановкиСостояния.РегистрацияИзменений.Регистрировать = Истина;
				
				ПараметрыПроцедуры = Новый Массив();
				ПараметрыПроцедуры.Добавить(ПараметрыУстановкиСостояния);
				
				SUI_ОчередьЗаданийКлиентСервер.ДобавитьОбработчикВПараметрыСозданияЗадания(ПараметрыСозданияЗадания,
					"РегистрыСведений.SUI_docs.УстановитьСостояниеДокументаОбмена", ПараметрыПроцедуры);
				
			КонецЕсли;
			
			РегистрыСведений.SUI_ОчередьЗаданий.СоздатьЗадание(ПараметрыСозданияЗадания);
			
		КонецЕсли;
		
		// Сменить состояние документа обмена на Загружен
		ПараметрыУстановкиСостояния = ПараметрыУстановкиСостоянияДокументаОбмена(ВыборкаДокументыОбмена.sid,
			Перечисления.SUI_СостоянияДокументовОбмена.Загружен);
		ПараметрыУстановкиСостояния.МобильноеУстройство = ДанныеДляЗагрузки.МобильноеУстройство;
		ПараметрыУстановкиСостояния.РегистрацияИзменений.Регистрировать = РегистрироватьИзменения;
		ПараметрыУстановкиСостояния.РегистрацияИзменений.ИсключитьМобильноеУстройство = ДанныеДляЗагрузки.МобильноеУстройство;
		
		ДанныеЗагружены = УстановитьСостояниеДокументаОбмена(ПараметрыУстановкиСостояния);
		
	КонецЦикла;
	
	Возврат ДанныеЗагружены;
	
КонецФункции

Функция ПараметрыУстановкиСостоянияДокументаОбмена(ИдентификаторДокументаОбмена, Состояние) Экспорт
	
	ПараметрыУстановкиСостояния = Новый Структура();
	ПараметрыУстановкиСостояния.Вставить("ИдентификаторДокументаОбмена", ИдентификаторДокументаОбмена);
	ПараметрыУстановкиСостояния.Вставить("Состояние", Состояние);
	ПараметрыУстановкиСостояния.Вставить("МобильноеУстройство");
	
	РегистрацияИзменений = Новый Структура();
	РегистрацияИзменений.Вставить("Регистрировать", Ложь);
	РегистрацияИзменений.Вставить("МобильноеУстройство");
	РегистрацияИзменений.Вставить("ИсключитьМобильноеУстройство");
	
	ПараметрыУстановкиСостояния.Вставить("РегистрацияИзменений", РегистрацияИзменений);
	
	Возврат ПараметрыУстановкиСостояния;
	
КонецФункции

Функция УстановитьСостояниеДокументаОбмена(ПараметрыУстановкиСостояния) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДокументыОбмена.sid,
		|	ДокументыОбмена.id_doc,
		|	ДокументыОбмена.НастройкаДокумента
		|ИЗ
		|	РегистрСведений.SUI_docs КАК ДокументыОбмена
		|ГДЕ
		|	ДокументыОбмена.sid = &sid";
	
	Запрос.УстановитьПараметр("sid", ПараметрыУстановкиСостояния.ИдентификаторДокументаОбмена);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.sid.Установить(Выборка.sid);
		НаборЗаписей.Отбор.id_doc.Установить(Выборка.id_doc);
		НаборЗаписей.Отбор.НастройкаДокумента.Установить(Выборка.НастройкаДокумента);
		
		НаборЗаписей.Прочитать();
		
		НаборЗаписей[0].Состояние = ПараметрыУстановкиСостояния.Состояние;
		НаборЗаписей[0].ДатаОбновления = ТекущаяДатаСеанса();
		
		Если ПараметрыУстановкиСостояния.МобильноеУстройство <> Неопределено Тогда
			НаборЗаписей[0].МобильноеУстройство = ПараметрыУстановкиСостояния.МобильноеУстройство;
		КонецЕсли;
		
		Если ПараметрыУстановкиСостояния.РегистрацияИзменений.Регистрировать Тогда
			
			Если ПараметрыУстановкиСостояния.РегистрацияИзменений.МобильноеУстройство <> Неопределено Тогда
				НаборЗаписей.ДополнительныеСвойства.Вставить("МобильноеУстройство", 
					ПараметрыУстановкиСостояния.РегистрацияИзменений.МобильноеУстройство);
			КонецЕсли;
			
			Если ПараметрыУстановкиСостояния.РегистрацияИзменений.ИсключитьМобильноеУстройство <> Неопределено Тогда
				НаборЗаписей.ДополнительныеСвойства.Вставить("ИсключитьМобильноеУстройство", 
					ПараметрыУстановкиСостояния.РегистрацияИзменений.ИсключитьМобильноеУстройство);
			КонецЕсли;
			
			НаборЗаписей.ДополнительныеСвойства.Вставить("РегистрироватьИзменения");
			
		Иначе
			НаборЗаписей.ДополнительныеСвойства.Вставить("НеРегистрироватьИзменения");
			НаборЗаписей.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
		КонецЕсли;
		
		НаборЗаписей.Записать(Истина);
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#КонецЕсли
