
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция РабочиеСостоянияДокументовОбмена() Экспорт
	
	Возврат SUI_ОбщегоНазначенияКлиентСервер.МассивЗначений(
		Перечисления.SUI_СостоянияДокументовОбмена.КВыгрузке, 
		Перечисления.SUI_СостоянияДокументовОбмена.Выгружен, 
		Перечисления.SUI_СостоянияДокументовОбмена.Загружен, 
		Перечисления.SUI_СостоянияДокументовОбмена.ВРаботе);
	
КонецФункции

// Получить данные документов обмена.
// 
// Параметры:
//  Отбор - Соответствие из Произвольный - Отбор документов обмена
//  ПолучаемыеДополнительныеПоля - Соответствие из Строка, Неопределено - Получаемые дополнительные поля. По умолчанию: sid, id_doc, НастройкаДокумента
// 		* Ключ - Строка - Поле документа обмена (возможно получение через точку)
// 		* Значение - Строка, Неопределено - Псевдоним выбираемого поля
// Возвращаемое значение:
//  РезультатЗапроса - Получить данные документов обмена
Функция ПолучитьДанныеДокументовОбмена(Отбор, ПолучаемыеДополнительныеПоля = Неопределено) Экспорт
	
	ИмяФункцииВызова = "РегистрыСведений.SUI_docs.ПолучитьДанныеДокументовОбмена";
	
	SUI_ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(ИмяФункцииВызова, "Отбор", Отбор, Тип("Соответствие"));
	
	ТекстОшибки = НСтр("ru = 'Не передан отбор'");
	SUI_ОбщегоНазначенияКлиентСервер.Проверить(Отбор.Количество() > 0, ТекстОшибки, ИмяФункцииВызова);
	
	Если ПолучаемыеДополнительныеПоля <> Неопределено Тогда
		
		SUI_ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(ИмяФункцииВызова, 
			"ПолучаемыеДополнительныеПоля", ПолучаемыеДополнительныеПоля, Тип("Соответствие"));
		
	КонецЕсли;
	
	ВыбранныеПоля = Новый Массив();
	ВыбранныеПоля.Добавить("sid");
	ВыбранныеПоля.Добавить("id_doc");
	ВыбранныеПоля.Добавить("НастройкаДокумента");
	
	Запрос = Новый Запрос("ВЫБРАТЬ " + СтрСоединить(ВыбранныеПоля, ",") + " ИЗ РегистрСведений.SUI_docs");
	
	СхемаЗапроса = Новый СхемаЗапроса();
	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
	
	ЗапросПакета = СхемаЗапроса.ПакетЗапросов[СхемаЗапроса.ПакетЗапросов.Количество() - 1];
	ОператорыПакета = ЗапросПакета.Операторы[0];
	ПсевдонимИсточника = ОператорыПакета.Источники[0].Источник.Псевдоним;
	
	Если ПолучаемыеДополнительныеПоля <> Неопределено Тогда
		
		Для Каждого КлючЗначение Из ПолучаемыеДополнительныеПоля Цикл
			
			ПолеВыражение = КлючЗначение.Ключ;
			ПолеПсевдоним = КлючЗначение.Значение;
			
			Если ПолеПсевдоним = Неопределено И ВыбранныеПоля.Найти(ПолеВыражение) <> Неопределено Тогда
				Продолжить;
			ИначеЕсли ПолеПсевдоним <> Неопределено И ВыбранныеПоля.Найти(ПолеПсевдоним) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ВыбранноеПоле = ОператорыПакета.ВыбираемыеПоля.Добавить(ПсевдонимИсточника + "." + ПолеВыражение);
			
			Если ПолеПсевдоним <> Неопределено Тогда
				
				КолонкаВыбранноеПоле = ЗапросПакета.Колонки.Найти(ВыбранноеПоле);
				КолонкаВыбранноеПоле.Псевдоним = ПолеПсевдоним;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Для Каждого КлючЗначение Из Отбор Цикл
		
		ТипЗначения = ТипЗнч(КлючЗначение.Значение);
		
		КлючПараметра = СтрЗаменить(КлючЗначение.Ключ, ".", "_");
		
		Если ТипЗначения = Тип("Массив") Или 
			ТипЗначения = Тип("ФиксированныйМассив") Или
			ТипЗначения = Тип("СписокЗначений") Тогда
			
			ОператорыПакета.Отбор.Добавить(СтрШаблон("%1 В (&%2)", КлючЗначение.Ключ, КлючПараметра));
			
		Иначе
			ОператорыПакета.Отбор.Добавить(СтрШаблон("%1 = &%2", КлючЗначение.Ключ, КлючПараметра));
		КонецЕсли;
		
		Запрос.УстановитьПараметр(КлючПараметра, КлючЗначение.Значение);
		
	КонецЦикла;
	
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция ДанныеДляЗагрузкиИзМобильногоУстройства(ИдентификаторДокумента, МобильноеУстройство) Экспорт
	
	ТаблицыДляЗагрузки = Новый Структура();
	ТаблицыДляЗагрузки.Вставить("Товары");
	ТаблицыДляЗагрузки.Вставить("Серии");
	ТаблицыДляЗагрузки.Вставить("ШтрихкодыУпаковок");
	ТаблицыДляЗагрузки.Вставить("ПотокШтрихкодов");
	
	ДанныеДляЗагрузки = Новый Структура();
	ДанныеДляЗагрузки.Вставить("ИдентификаторДокументаОбмена");
	ДанныеДляЗагрузки.Вставить("НастройкаДокумента");
	ДанныеДляЗагрузки.Вставить("ИдентификаторДокумента", ИдентификаторДокумента);
	ДанныеДляЗагрузки.Вставить("МобильноеУстройство", МобильноеУстройство);
	ДанныеДляЗагрузки.Вставить("Таблицы", ТаблицыДляЗагрузки);
	
	Возврат ДанныеДляЗагрузки;
	
КонецФункции

Функция ЗагрузитьИзМобильногоУстройства(ДанныеДляЗагрузки) Экспорт
	
	ДанныеЗагружены = Ложь;
	
	ОтборДокументовОбмена = Новый Соответствие();
	ОтборДокументовОбмена.Вставить("id_doc", ДанныеДляЗагрузки.ИдентификаторДокумента);
	
	Если ДанныеДляЗагрузки.ИдентификаторДокументаОбмена <> Неопределено Тогда
		ОтборДокументовОбмена.Вставить("sid", ДанныеДляЗагрузки.ИдентификаторДокументаОбмена);
	КонецЕсли;
	
	Если ДанныеДляЗагрузки.НастройкаДокумента <> Неопределено Тогда
		ОтборДокументовОбмена.Вставить("НастройкаДокумента", ДанныеДляЗагрузки.НастройкаДокумента);
	КонецЕсли;
	
	ПоляДокументовОбмена = Новый Соответствие();
	ПоляДокументовОбмена.Вставить("Состояние", "Состояние");
	ПоляДокументовОбмена.Вставить("НастройкаДокумента.Используется", "НастройкаДокументаИспользуется");
	ПоляДокументовОбмена.Вставить("НастройкаДокумента.ПометкаУдаления", "НастройкаДокументаПометкаУдаления");
	ПоляДокументовОбмена.Вставить("НастройкаДокумента.ЗагружатьВДокумент1СПослеПолученияИзТСД", "ЗагружатьВДокумент1С");
	ПоляДокументовОбмена.Вставить("НастройкаДокумента.ЗавершатьДокумент1СПослеПолученияИзТСД", "ЗавершатьДокументОбмена");
	
	РезультатДокументыОбмена = ПолучитьДанныеДокументовОбмена(ОтборДокументовОбмена, ПоляДокументовОбмена);
	
	Если РезультатДокументыОбмена.Пустой() Тогда
		
		ТекстОшибки = НСтр("ru = 'Документ с идентификатором ""%1"" не был выгружен!'");
		ТекстОшибки = СтрШаблон(ТекстОшибки, ДанныеДляЗагрузки.ИдентификаторДокумента);
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	ОшибкиПоДокументамОбмена = Новый Массив();
	СтатусЗагрузкиПоДокументамОбмена = Новый Соответствие();
	ВыборкаДокументыОбмена = РезультатДокументыОбмена.Выбрать();
	
	Пока ВыборкаДокументыОбмена.Следующий() Цикл
		
		СтатусЗагрузкиПоДокументамОбмена.Вставить(ВыборкаДокументыОбмена.sid, Ложь);
		
		Если РабочиеСостоянияДокументовОбмена().Найти(ВыборкаДокументыОбмена.Состояние) = Неопределено Тогда
			ТекстОшибки = НСтр("ru = 'Документ обмена ""%1"" (%2) находится в состоянии ""%3"".'");
			ТекстОшибки = СтрШаблон(ТекстОшибки, ВыборкаДокументыОбмена.id_doc, ВыборкаДокументыОбмена.sid, 
				ВыборкаДокументыОбмена.Состояние);
			ОшибкиПоДокументамОбмена.Добавить(ТекстОшибки);
			Продолжить;
		ИначеЕсли Не ВыборкаДокументыОбмена.НастройкаДокументаИспользуется Или 
			ВыборкаДокументыОбмена.НастройкаДокументаПометкаУдаления Тогда
			ТекстОшибки = НСтр("ru = 'Настройка документа обмена ""%1"" (%2) не используется.'");
				ТекстОшибки = СтрШаблон(ТекстОшибки, ВыборкаДокументыОбмена.id_doc, ВыборкаДокументыОбмена.sid);
			ОшибкиПоДокументамОбмена.Добавить(ТекстОшибки);
			Продолжить;
		КонецЕсли;
		
		РезультатЗагрузки = Новый Структура();
		РезультатЗагрузки.Вставить("Товары", Ложь);
		РезультатЗагрузки.Вставить("Серии", Ложь);
		РезультатЗагрузки.Вставить("ШтрихкодыУпаковок", Ложь);
		РезультатЗагрузки.Вставить("ПотокШтрихкодов", Ложь);
		
		Для Каждого КлючЗначение Из ДанныеДляЗагрузки.Таблицы Цикл
			
			Если КлючЗначение.Значение = Неопределено Тогда
				Продолжить;
				
			ИначеЕсли КлючЗначение.Ключ = "Товары" Тогда
				
				РезультатЗагрузки.Товары = РегистрыСведений.SUI_docs_tbl_goods.ЗагрузитьИзМобильногоУстройства(
					ВыборкаДокументыОбмена.sid, КлючЗначение.Значение);
				
			ИначеЕсли КлючЗначение.Ключ = "Серии" Тогда
				
				РезультатЗагрузки.Серии = РегистрыСведений.SUI_docs_tbl_series.ЗагрузитьИзМобильногоУстройства(
					ВыборкаДокументыОбмена.sid, КлючЗначение.Значение);
				
			ИначеЕсли КлючЗначение.Ключ = "ШтрихкодыУпаковок" Тогда
				
				//TODO: artem - 14.05.2025 - Переключение на новый РС штрихкоды упаковок >>>
				РезультатЗагрузки.ШтрихкодыУпаковок = РегистрыСведений.SUI_ОтсканированныеШтрихкодыУпаковокДокументовОбмена
					.ЗагрузитьИзМобильногоУстройства(ВыборкаДокументыОбмена.sid, КлючЗначение.Значение);
//				РезультатЗагрузки.ШтрихкодыУпаковок = РегистрыСведений.Удалить_SUI_docs_tbl_barcodes.ЗагрузитьИзМобильногоУстройства(
//					ВыборкаДокументыОбмена.sid, КлючЗначение.Значение);
				//TODO: artem - 14.05.2025 - Переключение на новый РС штрихкоды упаковок <<<
				
			ИначеЕсли КлючЗначение.Ключ = "ПотокШтрихкодов" Тогда
				
				РезультатЗагрузки.ПотокШтрихкодов = РегистрыСведений.SUI_docs_tbl_barcode_flow.ЗагрузитьИзМобильногоУстройства(
					ВыборкаДокументыОбмена.sid, КлючЗначение.Значение);
				
			Иначе
				ТекстОшибки = НСтр("ru = 'Обнаружен неизвестный ключ таблицы (%1)!'");
				ТекстОшибки = СтрШаблон(ТекстОшибки, КлючЗначение.Ключ);
				ВызватьИсключение ТекстОшибки;
			КонецЕсли;
			
		КонецЦикла;
		
		Если Не РезультатЗагрузки.Товары И Не РезультатЗагрузки.Серии И 
			Не РезультатЗагрузки.ШтрихкодыУпаковок И Не РезультатЗагрузки.ПотокШтрихкодов Тогда
			Продолжить;
		Иначе
			СтатусЗагрузкиПоДокументамОбмена.Вставить(ВыборкаДокументыОбмена.sid, Истина);
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Истина);
		
		РегистрироватьИзменения = Константы.SUI_РегистрироватьИзмененияПослеЗагрузкиДокументаИзМУ.Получить();
		ДокументСсылка = SUI_ИнтеграцияВКонфигурацию.СсылкаПоИдентификаторуSimple(ВыборкаДокументыОбмена.id_doc, Истина);
		
		Если ЗначениеЗаполнено(ДокументСсылка) Тогда
			ПредставлениеДокументаОчереди = Строка(ДокументСсылка);
		Иначе
			ПредставлениеДокументаОчереди = Строка(ВыборкаДокументыОбмена.НастройкаДокумента);
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Ложь);
		
		НаименованиеЗаданияОчереди = НСтр("ru = 'Постобработка документа обмена (%1)'");
		НаименованиеЗаданияОчереди = СтрШаблон(НаименованиеЗаданияОчереди, ПредставлениеДокументаОчереди);
		
		ПараметрыСозданияЗадания = SUI_ОчередьЗаданийКлиентСервер.ПараметрыСозданияЗадания();
		ПараметрыСозданияЗадания.Наименование = НаименованиеЗаданияОчереди;
		ПараметрыСозданияЗадания.ИдентификаторДокумента = ВыборкаДокументыОбмена.id_doc;
		
		Если РезультатЗагрузки.ШтрихкодыУпаковок Тогда
			
			//TODO: artem - 14.05.2025 - Переключение на новый РС штрихкоды упаковок >>>
			ПараметрыПроцедуры = Новый Структура();
			ПараметрыПроцедуры.Вставить("ИдентификаторДокументаОбмена", ВыборкаДокументыОбмена.sid);
			
			SUI_ОчередьЗаданийКлиентСервер.ДобавитьОбработчикВПараметрыСозданияЗадания(ПараметрыСозданияЗадания, 
				"РегистрыСведений.SUI_ОтсканированныеШтрихкодыУпаковокДокументовОбмена.ВыполнитьОбработкуОтсканированныхШтрихкодов", 
				SUI_ОбщегоНазначенияКлиентСервер.МассивЗначений(ПараметрыПроцедуры));
			
//			ПараметрыПроцедуры = Новый Структура();
//			ПараметрыПроцедуры.Вставить("sid_doc", ВыборкаДокументыОбмена.sid);
//			
//			ПараметрыПроцедуры = SUI_ОбщегоНазначенияКлиентСервер.МассивЗначений(
//				ПараметрыПроцедуры, Неопределено);
//			
//			SUI_ОчередьЗаданийКлиентСервер.ДобавитьОбработчикВПараметрыСозданияЗадания(ПараметрыСозданияЗадания, 
//				"SUI_ДокументыОбмена.ЗаданиеСоздатьШтрихкодыУпаковокДокументаОбмена", ПараметрыПроцедуры);
			//TODO: artem - 14.05.2025 - Переключение на новый РС штрихкоды упаковок <<<
			
		КонецЕсли;
		
		Если РезультатЗагрузки.Серии Тогда
			
			ПараметрыПроцедуры = Новый Структура();
			ПараметрыПроцедуры.Вставить("sid_doc", ВыборкаДокументыОбмена.sid);
			
			ПараметрыПроцедуры = SUI_ОбщегоНазначенияКлиентСервер.МассивЗначений(
				ПараметрыПроцедуры, Неопределено);
			
			SUI_ОчередьЗаданийКлиентСервер.ДобавитьОбработчикВПараметрыСозданияЗадания(ПараметрыСозданияЗадания, 
				"SUI_ДокументыОбмена.ЗаданиеСоздатьСерииНоменклатурыДокументаОбмена", ПараметрыПроцедуры);
			
		КонецЕсли;
		
		Если ПараметрыСозданияЗадания.Обработчики.Количество() > 0 Тогда
			РегистрыСведений.SUI_ОчередьЗаданий.СоздатьЗадание(ПараметрыСозданияЗадания);
		КонецЕсли;
		
		Если РезультатЗагрузки.Товары И ВыборкаДокументыОбмена.ЗагружатьВДокумент1С Тогда
			
			НаименованиеЗаданияОчереди = НСтр("ru = 'Загрузка в документ 1С (%1)'");
			НаименованиеЗаданияОчереди = СтрШаблон(НаименованиеЗаданияОчереди, ПредставлениеДокументаОчереди);
			
			ПараметрыСозданияЗадания = SUI_ОчередьЗаданийКлиентСервер.ПараметрыСозданияЗадания();
			ПараметрыСозданияЗадания.Наименование = НаименованиеЗаданияОчереди;
			ПараметрыСозданияЗадания.ИдентификаторДокумента = ВыборкаДокументыОбмена.id_doc;
			
			// Проверка обработки всех входящих сообщений и всех заданий очереди
			ПараметрыПроцедуры = Новый Массив();
			ПараметрыПроцедуры.Добавить(ВыборкаДокументыОбмена.id_doc);
			
			SUI_ОчередьЗаданийКлиентСервер.ДобавитьОбработчикВПараметрыСозданияЗадания(ПараметрыСозданияЗадания, 
				"РегистрыСведений.SUI_docs.ПроверкаОбработанныхДанныхПередЗагрузкой", ПараметрыПроцедуры);
			
			// Загрузка в документ 1С
			ПараметрыПроцедуры = Новый Структура();
			ПараметрыПроцедуры.Вставить("sid", ВыборкаДокументыОбмена.sid);
			ПараметрыПроцедуры.Вставить("id_doc", ВыборкаДокументыОбмена.id_doc);
			ПараметрыПроцедуры.Вставить("НастройкаДокумента", ВыборкаДокументыОбмена.НастройкаДокумента);
			
			ПараметрыПроцедуры = SUI_ОбщегоНазначенияКлиентСервер.МассивЗначений(ПараметрыПроцедуры, Неопределено);
			
			SUI_ОчередьЗаданийКлиентСервер.ДобавитьОбработчикВПараметрыСозданияЗадания(ПараметрыСозданияЗадания,
				"SUI_ДокументыОбмена.ЗаданиеЗагрузитьДокументОбменаВДокумент1СПослеЗагрузки", ПараметрыПроцедуры);
			
			// Смена состояния документа обмена на Завершен
			Если ВыборкаДокументыОбмена.ЗавершатьДокументОбмена Тогда
				
				ПараметрыУстановкиСостояния = ПараметрыУстановкиСостоянияДокументаОбмена(ВыборкаДокументыОбмена.sid,
					Перечисления.SUI_СостоянияДокументовОбмена.Завершен);
				ПараметрыУстановкиСостояния.ИдентификаторДокумента = ВыборкаДокументыОбмена.id_doc;
				ПараметрыУстановкиСостояния.НастройкаДокумента = ВыборкаДокументыОбмена.НастройкаДокумента;
				ПараметрыУстановкиСостояния.МобильноеУстройство = ДанныеДляЗагрузки.МобильноеУстройство;
				ПараметрыУстановкиСостояния.РегистрацияИзменений.Регистрировать = Истина;
				
				ПараметрыПроцедуры = Новый Массив();
				ПараметрыПроцедуры.Добавить(ПараметрыУстановкиСостояния);
				
				SUI_ОчередьЗаданийКлиентСервер.ДобавитьОбработчикВПараметрыСозданияЗадания(ПараметрыСозданияЗадания,
					"РегистрыСведений.SUI_docs.УстановитьСостояниеДокументаОбмена", ПараметрыПроцедуры);
				
			КонецЕсли;
			
			РегистрыСведений.SUI_ОчередьЗаданий.СоздатьЗадание(ПараметрыСозданияЗадания);
			
		КонецЕсли;
		
		// Сменить состояние документа обмена на Загружен
		ПараметрыУстановкиСостояния = ПараметрыУстановкиСостоянияДокументаОбмена(ВыборкаДокументыОбмена.sid,
			Перечисления.SUI_СостоянияДокументовОбмена.Загружен);
		ПараметрыУстановкиСостояния.ИдентификаторДокумента = ВыборкаДокументыОбмена.id_doc;
		ПараметрыУстановкиСостояния.НастройкаДокумента = ВыборкаДокументыОбмена.НастройкаДокумента;
		ПараметрыУстановкиСостояния.МобильноеУстройство = ДанныеДляЗагрузки.МобильноеУстройство;
		ПараметрыУстановкиСостояния.РегистрацияИзменений.Регистрировать = РегистрироватьИзменения;
		ПараметрыУстановкиСостояния.РегистрацияИзменений.ИсключитьМобильноеУстройство = ДанныеДляЗагрузки.МобильноеУстройство;
		
		//@skip-check query-in-loop
		Если УстановитьСостояниеДокументаОбмена(ПараметрыУстановкиСостояния) Тогда
			ДанныеЗагружены = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ОшибкиПоДокументамОбмена.Количество() > 0 Тогда
		
		ЕстьЗагруженныеДанные = Ложь;
		
		Для Каждого КлючЗначение Из СтатусЗагрузкиПоДокументамОбмена Цикл
			Если КлючЗначение.Значение Тогда
				ЕстьЗагруженныеДанные = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Не ЕстьЗагруженныеДанные Тогда
			ВызватьИсключение СтрСоединить(ОшибкиПоДокументамОбмена, Символы.ПС);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДанныеЗагружены;
	
КонецФункции

Функция ПараметрыУстановкиСостоянияДокументаОбмена(ИдентификаторДокументаОбмена, Состояние) Экспорт
	
	ПараметрыУстановкиСостояния = Новый Структура();
	ПараметрыУстановкиСостояния.Вставить("ИдентификаторДокументаОбмена", ИдентификаторДокументаОбмена);
	ПараметрыУстановкиСостояния.Вставить("ИдентификаторДокумента");
	ПараметрыУстановкиСостояния.Вставить("НастройкаДокумента");
	ПараметрыУстановкиСостояния.Вставить("Состояние", Состояние);
	ПараметрыУстановкиСостояния.Вставить("МобильноеУстройство");
	
	РегистрацияИзменений = Новый Структура();
	РегистрацияИзменений.Вставить("Регистрировать", Ложь);
	РегистрацияИзменений.Вставить("МобильноеУстройство");
	РегистрацияИзменений.Вставить("ИсключитьМобильноеУстройство");
	
	ПараметрыУстановкиСостояния.Вставить("РегистрацияИзменений", РегистрацияИзменений);
	
	Возврат ПараметрыУстановкиСостояния;
	
КонецФункции

Функция УстановитьСостояниеДокументаОбмена(ПараметрыУстановкиСостояния) Экспорт
	
	КлючиЗаписи = Новый Массив();
	
	Если ПараметрыУстановкиСостояния.ИдентификаторДокументаОбмена <> Неопределено И
		ПараметрыУстановкиСостояния.ИдентификаторДокумента <> Неопределено Или
		ПараметрыУстановкиСостояния.НастройкаДокумента <> Неопределено Тогда
		
		ЗначенияКлюча = Новый Структура();
		ЗначенияКлюча.Вставить("sid", ПараметрыУстановкиСостояния.ИдентификаторДокументаОбмена);
		ЗначенияКлюча.Вставить("id_doc", ПараметрыУстановкиСостояния.ИдентификаторДокумента);
		ЗначенияКлюча.Вставить("НастройкаДокумента", ПараметрыУстановкиСостояния.НастройкаДокумента);
		
		КлючиЗаписи.Добавить(СоздатьКлючЗаписи(ЗначенияКлюча));
		
	ИначеЕсли ПараметрыУстановкиСостояния.ИдентификаторДокумента = Неопределено Или
		ПараметрыУстановкиСостояния.НастройкаДокумента = Неопределено Тогда
		
		ОтборДокументовОбмена = Новый Соответствие();
		ОтборДокументовОбмена.Вставить("sid", ПараметрыУстановкиСостояния.ИдентификаторДокументаОбмена);
		
		Если ПараметрыУстановкиСостояния.ИдентификаторДокументаОбмена <> Неопределено Тогда
			ОтборДокументовОбмена.Вставить("id_doc", ПараметрыУстановкиСостояния.ИдентификаторДокумента);
		КонецЕсли;
		
		Если ПараметрыУстановкиСостояния.НастройкаДокумента <> Неопределено Тогда
			ОтборДокументовОбмена.Вставить("НастройкаДокумента", ПараметрыУстановкиСостояния.НастройкаДокумента);
		КонецЕсли;
		
		РезультатДокументыОбмена = ПолучитьДанныеДокументовОбмена(ОтборДокументовОбмена);
		
		Если Не РезультатДокументыОбмена.Пустой() Тогда
			
			Выборка = РезультатДокументыОбмена.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				ЗначенияКлюча = SUI_ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Выборка);
				КлючиЗаписи.Добавить(СоздатьКлючЗаписи(ЗначенияКлюча));
				
			КонецЦикла;
			
		КонецЕсли;
		
	Иначе
		ТекстОшибки = НСтр("ru = 'Не переданы параметры для установки состояния документа обмена.'");
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	SUI_ОбщегоНазначенияКлиентСервер.Проверить(КлючиЗаписи.Количество() > 0,
		НСтр("ru = 'Ключи записи для установки состояния документов обмена не сформированы'"),
		"РегистрыСведений.SUI_docs.УстановитьСостояниеДокументаОбмена");
	
	Для индекс = 0 По КлючиЗаписи.ВГраница() Цикл
		
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.sid.Установить(КлючиЗаписи[индекс].sid);
		НаборЗаписей.Отбор.id_doc.Установить(КлючиЗаписи[индекс].id_doc);
		НаборЗаписей.Отбор.НастройкаДокумента.Установить(КлючиЗаписи[индекс].НастройкаДокумента);
		
		НаборЗаписей.Прочитать();
		
		НаборЗаписей[0].Состояние = ПараметрыУстановкиСостояния.Состояние;
		НаборЗаписей[0].ДатаОбновления = ТекущаяДатаСеанса();
		
		Если ПараметрыУстановкиСостояния.МобильноеУстройство <> Неопределено Тогда
			НаборЗаписей[0].МобильноеУстройство = ПараметрыУстановкиСостояния.МобильноеУстройство;
		КонецЕсли;
		
		Если ПараметрыУстановкиСостояния.РегистрацияИзменений.Регистрировать Тогда
			
			Если ПараметрыУстановкиСостояния.РегистрацияИзменений.МобильноеУстройство <> Неопределено Тогда
				НаборЗаписей.ДополнительныеСвойства.Вставить("МобильноеУстройство", 
					ПараметрыУстановкиСостояния.РегистрацияИзменений.МобильноеУстройство);
			КонецЕсли;
			
			Если ПараметрыУстановкиСостояния.РегистрацияИзменений.ИсключитьМобильноеУстройство <> Неопределено Тогда
				НаборЗаписей.ДополнительныеСвойства.Вставить("ИсключитьМобильноеУстройство", 
					ПараметрыУстановкиСостояния.РегистрацияИзменений.ИсключитьМобильноеУстройство);
			КонецЕсли;
			
			НаборЗаписей.ДополнительныеСвойства.Вставить("РегистрироватьИзменения");
			
		Иначе
			НаборЗаписей.ДополнительныеСвойства.Вставить("НеРегистрироватьИзменения");
			НаборЗаписей.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
		КонецЕсли;
		
		НаборЗаписей.Записать(Истина);
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Процедура ПроверкаОбработанныхДанныхПередЗагрузкой(ИдентификаторДокумента) Экспорт
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("НеНомерСеансаЗадания", НомерСеансаИнформационнойБазы());
	
	Результат = SUI_ДокументыОбмена.ВыполнитьПроверкуОбработкиДанныхДокументаПередЗагрузкой(ИдентификаторДокумента, ДополнительныеПараметры);
	
	Если Не Результат Тогда
		РегистрыСведений.SUI_ОчередьЗаданий.ОтправитьСлужебноеСообщениеОтложитьТекущееЗадание();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
