
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

//Процедура ПередЗаписью(Отказ, Замещение)
//	
//	Если Отказ Или ОбменДанными.Загрузка Тогда
//		Возврат;
//	КонецЕсли;
//	
//	ДатаОбновленияЗаписи = ТекущаяДатаСеанса();
//	
//	ПолноеИмяМетаданных = Метаданные().ПолноеИмя();
//	
//	Для Каждого Запись Из ЭтотОбъект Цикл
//		
//		// Проверить SID
//		ОбщегоНазначенияКлиентСервер.Проверить(СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(Запись.sid),
//			СтрШаблон(НСтр("ru = 'Служебный идентификатор строки (%1) не является идентификатором'"), Запись.sid),
//			ПолноеИмяМетаданных);
//			
//		// Проверить SID документа
//		ОбщегоНазначенияКлиентСервер.Проверить(SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(Запись.id_doc),
//			СтрШаблон(НСтр("ru = 'Идентификатор документа (%1) не является идентификатором Simple'"), Запись.id_doc),
//			ПолноеИмяМетаданных);
//			
//		// Проверить заполнение Настройка документа
//		ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(Запись.НастройкаДокумента),
//			НСтр("ru = 'Не определена настройка документа обмена'"),
//			ПолноеИмяМетаданных);
//		
//		// Обновить значение Дата обновления
//		Если Не ДополнительныеСвойства.Свойство("НеОбновлятьМеткуВремени") Тогда
//			Запись.ДатаОбновления = ДатаОбновленияЗаписи;
//		КонецЕсли;
//		
//	КонецЦикла;
//	
//КонецПроцедуры

#КонецОбласти

#КонецЕсли
