
#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиКомандФормы

Процедура ВыполнитьПереопределяемуюКоманду(Форма, Команда, ДополнительныеПараметры) Экспорт
	
	Если СтрНачинаетсяС(Команда.Имя, "SUI_ЗагрузитьШтрихкодыМаркировки") Тогда
		НачатьЗагрузкуШтрихкодовМаркировки(Форма);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура НачатьЗагрузкуШтрихкодовМаркировки(Форма)
	
	//TODO: 28.08.2024 - artem - Подключить к новому документу обмена
	ВызватьИсключение НСтр("ru = 'Не реализовано'");
	
	Контекст = Новый Структура();
	Контекст.Вставить("Форма", Форма);
	Контекст.Вставить("ДокументСсылка", Форма.ПроверяемыйДокумент);
	
	Если Не SUI_ДокументыОбменаВызовСервера.ДокументБылВыгружен(Контекст.ДокументСсылка) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Документ %1 не был выгружен'"), Контекст.ДокументСсылка));
		Возврат;
	КонецЕсли;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("НачатьЗагрузкуШтрихкодовМаркировкиПослеПодтверждения", 
		SUI_СобытияФормИСКлиент, Контекст);
	
	ПоказатьВопрос(ОповещениеОЗавершении, 
		СтрШаблон(НСтр("ru = 'Загрузить штрихкоды маркировки из подсистемы %1'"), SUI_SimpleКлиентСервер.Представление()), 
		РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

Процедура НачатьЗагрузкуШтрихкодовМаркировкиПослеПодтверждения(Ответ, Контекст) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("НачатьЗагрузкуШтрихкодовМаркировкиПослеВыбораНастройкиДокумента", 
		SUI_СобытияФормИСКлиент, Контекст);
			
	НастройкиДокумента = SUI_НастройкиДокументовВызовСервера.ПолучитьНастройкиДокумента(Контекст.ДокументСсылка, Истина);
	
	Если НастройкиДокумента.Количество() > 1 Тогда
		
		ОткрытьФорму("ОбщаяФорма.SUI_ФормаВыбораЗначений", 
			Новый Структура("ЗначенияДляВыбора, Заголовок", НастройкиДокумента, НСтр("ru = 'Выберите настройку документа'")), 
			Контекст.Форма, Контекст.Форма.УникальныйИдентификатор, , , ОповещениеОЗавершении);
		
	Иначе
		
		ВыполнитьОбработкуОповещения(ОповещениеОЗавершении, 
			?(НастройкиДокумента.Количество() = 0, 
			ПредопределенноеЗначение("Справочник.Удалить_SUI_НастройкиДокументов.ПустаяСсылка"), 
			НастройкиДокумента[0])
		);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьЗагрузкуШтрихкодовМаркировкиПослеВыбораНастройкиДокумента(НастройкаДокумента, Контекст) Экспорт
	
	Если НастройкаДокумента = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НастройкаДокумента = ПредопределенноеЗначение("Справочник.Удалить_SUI_НастройкиДокументов.ПустаяСсылка") Тогда
		НастройкаДокумента = Неопределено;
	КонецЕсли;
	
	ДлительнаяОперация = SUI_ДокументыОбменаВызовСервера.ПолучитьШтрихкодыМаркировкиДокументаОбмена(
		Контекст.ДокументСсылка, НастройкаДокумента, Контекст.Форма.УникальныйИдентификатор);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("НачатьЗагрузкуШтрихкодовМаркировкиПослеПолученияШтрихкодовДокументаОбмена", 
		SUI_СобытияФормИСКлиент, Контекст);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Контекст.Форма);
	ПараметрыОжидания.Заголовок = СтрШаблон(
		НСтр("ru = 'Получение штрихкодов маркировки из документа обмена подсистемы %1'"), 
		SUI_SimpleКлиентСервер.Представление());
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

Процедура НачатьЗагрузкуШтрихкодовМаркировкиПослеПолученияШтрихкодовДокументаОбмена(Результат, Контекст) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		ПараметрыОбработкиТС = Новый Структура;
		ПараметрыОбработкиТС.Вставить("Состояние", "");
		ПараметрыОбработкиТС.Вставить("ЭтоЗавершениеАвторизации", Ложь);
		ПараметрыОбработкиТС.Вставить("ЭтоВосстановлениеВложенностиУпаковок", Ложь);
		ПараметрыОбработкиТС.Вставить("ДополнительныеПараметры", Неопределено);
		
		ОповещениеЗавершения = Новый ОписаниеОповещения("Подключаемый_ПолученыДанныеИзТСД", Контекст.Форма, ПараметрыОбработкиТС);
		
		ВыполнитьОбработкуОповещения(ОповещениеЗавершения, ПолучитьИзВременногоХранилища(Результат.АдресРезультата));
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		
		ПоказатьПредупреждение(, СтрШаблон(
		НСтр("ru = 'Во время получения штрихкодов маркировки из документа обмена подсистемы %1 возникла ошибка:
		|
		|%2'"), SUI_SimpleКлиентСервер.Представление(), Результат.КраткоеПредставлениеОшибки));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
