#Область ПрограммныйИнтерфейс

Процедура ЗаписатьВТаблицы(Форма, ПараметрыОперации, Оповещение = Неопределено) Экспорт
	
	Контекст = Новый Структура();
	Контекст.Вставить("Оповещение", Оповещение);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаписатьВТаблицыЗавершение", ЭтотОбъект, Контекст);
	
	ОчиститьСообщения();
	
	ДлительнаяОперация = SUI_ИнтеграцияВКонфигурациюВызовСервера.ЗаписатьВТаблицы(ПараметрыОперации,
		Форма.УникальныйИдентификатор);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
	
	ПараметрыОжидания.Заголовок 					= НСтр("ru = 'Выгрузка в таблицы'");
	ПараметрыОжидания.ВыводитьПрогрессВыполнения 	= Истина;
	ПараметрыОжидания.ВыводитьСообщения 			= Истина;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

Процедура ОчиститьТаблицы(Форма, ПараметрыОперации, Оповещение = Неопределено) Экспорт
	
	Контекст = Новый Структура();
	Контекст.Вставить("Оповещение", Оповещение);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОчиститьТаблицыЗавершение", ЭтотОбъект, Контекст);
	
	ОчиститьСообщения();
	
	ДлительнаяОперация = SUI_ИнтеграцияВКонфигурациюВызовСервера.ОчиститьТаблицы(ПараметрыОперации, 
		Форма.УникальныйИдентификатор);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
	
	ПараметрыОжидания.Заголовок 					= НСтр("ru = 'Очистка таблиц'");
	ПараметрыОжидания.ВыводитьПрогрессВыполнения 	= Истина;
	ПараметрыОжидания.ВыводитьСообщения 			= Истина;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

Процедура ОткрытиеИдентификатора(ОповещениеОЗавершении, Идентификатор, СтандартнаяОбработка) Экспорт 
	
	СсылкаДляОткрытия = SUI_ИнтеграцияВКонфигурациюВызовСервера.СсылкаПоИдентификаторуSimple(Идентификатор);
	
	Если СсылкаДляОткрытия <> Неопределено Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если ТипЗнч(ОповещениеОЗавершении) = Тип("ОписаниеОповещения") Тогда
			ПоказатьЗначение(ОповещениеОЗавершении, СсылкаДляОткрытия);
		Иначе
			ПоказатьЗначение(, СсылкаДляОткрытия);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПоказатьИдентификаторSimpleСсылки(Ссылка, ПараметрыВыполнения) Экспорт 
	
	ПараметрыОткрытия = Новый Структура();
	
	Если Ссылка <> Неопределено Тогда
		
		Если SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(Ссылка) Тогда
			ПараметрыОткрытия.Вставить("ИдентификаторSimple", Ссылка);
		Иначе
			ПараметрыОткрытия.Вставить("Ссылка", Ссылка);
		КонецЕсли;
		
	КонецЕсли;
	
	ОткрытьФорму("ОбщаяФорма.SUI_ИдентификаторSimple", ПараметрыОткрытия);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьВТаблицыЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение(, СтрШаблон(НСтр("ru = 'Возникла ошибка при выполнении операции записи в таблицы.
		|%1'"), Результат.КраткоеПредставлениеОшибки));
	Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'Не удалось получить результат выполнении операции записи в таблицы.'"));
	КонецЕсли;

	Если ТипЗнч(ДополнительныеПараметры.Оповещение) = Тип("ОписаниеОповещения") Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.Оповещение, (Результат.Статус = "Выполнено"));
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьТаблицыЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Результат.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение(, СтрШаблон(НСтр("ru = 'Возникла ошибка при выполнении операции очистки таблиц.
		|%1'"), Результат.КраткоеПредставлениеОшибки));
	ИначеЕсли Результат.Статус <> "Выполнено" Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Не удалось получить результат выполнении операции очистки таблиц.'"));
	КонецЕсли;

	Если ТипЗнч(ДополнительныеПараметры.Оповещение) = Тип("ОписаниеОповещения") Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.Оповещение, (Результат.Статус = "Выполнено"));
	КонецЕсли;

КонецПроцедуры

#КонецОбласти