
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)

	Если Отказ Или ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ДатаОбновленияЗаписи = ТекущаяДатаСеанса();
	ПолноеИмяМетаданных = Метаданные().ПолноеИмя();
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		// Проверить SID
		ОбщегоНазначенияКлиентСервер.Проверить(СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(Запись.sid),
			СтрШаблон(НСтр("ru = 'Служебный идентификатор строки (%1) не является идентификатором'"), Запись.sid),
			ПолноеИмяМетаданных);
			
		// Проверить SID документа
		ОбщегоНазначенияКлиентСервер.Проверить(СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(Запись.sid_doc),
			СтрШаблон(НСтр("ru = 'Служебный идентификатор документа (%1) не является идентификатором'"), Запись.sid_doc),
			ПолноеИмяМетаданных);
		
		// Проверить SID документа
		ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(Запись.mark_code),
			НСтр("ru = 'Пустое значение штрихкода'"),
			ПолноеИмяМетаданных);
		
		// Обновить значение Дата обновления
		Если Не ДополнительныеСвойства.Свойство("НеОбновлятьМеткуВремени") Тогда
			Запись.ДатаОбновления = ДатаОбновленияЗаписи;
		КонецЕсли;
		
	КонецЦикла;	

КонецПроцедуры

#КонецОбласти

#КонецЕсли
