
#Область СлужебныеПроцедурыИФункции

#Область РасширяемыеПроцедурыИФункции

//@skip-check unknown-adoptable-method
&Вместо("ВидыКоманд")
Функция SUI_ВидыКоманд()
	
	SUI_ВидыКоманд = ПродолжитьВызов();
	
	Если SUI_ИнтеграцияВКонфигурацию.Используется() Тогда
		
		// Подменю Документы обмена
		SUI_НовыйВидКоманды = SUI_ВидыКоманд.Добавить();
		SUI_НовыйВидКоманды.ВидГруппыФормы = ВидГруппыФормы.Подменю;
		SUI_НовыйВидКоманды.Имя = SUI_ИдентификаторПодменюДокументыОбмена();
		SUI_НовыйВидКоманды.ИмяПодменю = SUI_НовыйВидКоманды.Имя;
		SUI_НовыйВидКоманды.Заголовок = SUI_SimpleКлиентСервер.Представление();
		SUI_НовыйВидКоманды.Картинка = БиблиотекаКартинок.SUI_ПодсистемаSimple;
		SUI_НовыйВидКоманды.Отображение = ОтображениеКнопки.КартинкаИТекст;
		SUI_НовыйВидКоманды.Порядок = 1000;
		
	КонецЕсли;
	
	Возврат SUI_ВидыКоманд; 
		
КонецФункции

#КонецОбласти

Функция SUI_ИдентификаторПодменюДокументыОбмена() Экспорт 
	Возврат НСтр("ru = 'SUI_ПодменюДокументыОбмена'");
КонецФункции

#КонецОбласти