
#Область ПрограммныйИнтерфейс

Процедура СоздатьСерииНоменклатуры(ОповещениеОЗавершении, Форма, ПараметрыСоздания) Экспорт

	Оповещение = Новый ОписаниеОповещения("СоздатьСерииНоменклатурыПослеПодтверждения", ЭтотОбъект, 
		Новый Структура("ОповещениеОЗавершении, Форма, ПараметрыСоздания", ОповещениеОЗавершении, Форма, ПараметрыСоздания));
	
	ПоказатьВопрос(Оповещение, НСтр("ru = 'Запустить операцию создания серий номенклатуры?'"), РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура СоздатьСерииНоменклатурыПослеПодтверждения(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеОЗавершении, Неопределено);
		Возврат;
	КонецЕсли;

	ОповещениеОЗавершении = Новый ОписаниеОповещения("СоздатьСерииНоменклатурыЗавершение", ЭтотОбъект, ДополнительныеПараметры);

	ДлительнаяОперация = SUI_СерииНоменклатурыВызовСервера.СоздатьСерииНоменклатуры(
		ДополнительныеПараметры.ПараметрыСоздания, ДополнительныеПараметры.Форма.УникальныйИдентификатор);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ДополнительныеПараметры.Форма);
	
	ПараметрыОжидания.Заголовок 					= НСтр("ru = 'Создание серий номенклатуры'");
	ПараметрыОжидания.ВыводитьПрогрессВыполнения 	= Истина;
	ПараметрыОжидания.ВыводитьСообщения 			= Истина;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

Процедура СоздатьСерииНоменклатурыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеОЗавершении, Неопределено);
		Возврат;
	КонецЕсли;
	
	Если Результат.Свойство("АдресРезультата") И ЭтоАдресВременногоХранилища(Результат.АдресРезультата) Тогда
		РезультатОперации = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		УдалитьИзВременногоХранилища(Результат.АдресРезультата);
	Иначе
		РезультатОперации = Неопределено;
	КонецЕсли;
	
	Для Каждого Сообщение Из SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Результат, "Сообщения", Новый Массив()) Цикл
		Сообщение.Сообщить();
	КонецЦикла;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		Если ЗначениеЗаполнено(РезультатОперации) Тогда
			SUI_ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Создание серий номенклатуры выполнено'"));
		Иначе
			SUI_ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Создание серий номенклатуры не выполнено'"));
		КонецЕсли;
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение(, СтрШаблон(НСтр("ru = 'Возникла ошибка при выполнении операции создания серий номенклатуры.
		|%1'"), Результат.КраткоеПредставлениеОшибки));
		SUI_ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
	Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'Не удалось получить результат выполнения операции создания серий номенклатуры.'"));
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеОЗавершении, РезультатОперации);
	
КонецПроцедуры

#КонецОбласти
