
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ТаблицыИнтеграции = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ТаблицыИнтеграции", 
		Новый СписокЗначений(), Тип("СписокЗначений"));
		
	Если ТаблицыИнтеграции.Количество() = 0 Тогда
		ТаблицыИнтеграции = SUI_НастройкиМетаданныхПовтИсп.ТаблицыИнтеграции();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаВыбрать(Команда)
	
	Закрыть(ТаблицыИнтеграции);
	
КонецПроцедуры

#КонецОбласти
