
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЭтоАдресВременногоХранилища(КартинкаПредпросмотр) Тогда
		УдалитьИзВременногоХранилища(КартинкаПредпросмотр);
		КартинкаПредпросмотр = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьКартинкуПредпросмотра();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "SUI_ЗаписьШаблонаЭтикеткиZPL" Тогда
		ОбновитьКартинкуПредпросмотра();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ОбновитьКартинкуПредпросмотра();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьДвоичныеДанныеКартинки(Ссылка)
	
	ДвоичныеДанныеКартинки = Неопределено;
	
	Если ЗначениеЗаполнено(Ссылка) И ОбщегоНазначения.СсылкаСуществует(Ссылка) Тогда
		
		Картинка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Картинка");
			
		Если ТипЗнч(Картинка) = Тип("ХранилищеЗначения") Тогда
			ДвоичныеДанныеКартинки = Картинка.Получить();
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДвоичныеДанныеКартинки;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьКартинкуПредпросмотра()

	Если ЭтоАдресВременногоХранилища(КартинкаПредпросмотр) Тогда
		УдалитьИзВременногоХранилища(КартинкаПредпросмотр);
	КонецЕсли;
	
	КартинкаПредпросмотр = "";
	
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДвоичныеДанныеКартинки = ПолучитьДвоичныеДанныеКартинки(Элементы.Список.ТекущиеДанные.Ссылка);
	
	Если ТипЗнч(ДвоичныеДанныеКартинки) = Тип("ДвоичныеДанные") Тогда
		КартинкаПредпросмотр = ПоместитьВоВременноеХранилище(ДвоичныеДанныеКартинки, УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
