
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для Каждого ЭлементСпискаВыбора Из Параметры.СписокВыбора Цикл
		Список.Добавить(ЭлементСпискаВыбора.Значение, ЭлементСпискаВыбора.Представление, ЭлементСпискаВыбора.Пометка);
	КонецЦикла;
	
	Если Параметры.ВыборПометкой И Список.Количество() = 0 Тогда
		SUI_ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Отсутсвует список выбора'"), , , , Отказ);
		Возврат;
	ИначеЕсли Не Параметры.ВыборПометкой Тогда
		Элементы.СписокПометка.Видимость = Ложь;
	КонецЕсли;
	
	Если Не ПустаяСтрока(Параметры.Заголовок) Тогда
		Заголовок = Параметры.Заголовок;
		АвтоЗаголовок = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Не Элементы.СписокПометка.Видимость Тогда
		Закрыть(Элементы.Список.ТекущиеДанные.Значение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	Закрыть(ПодготовитьДанныеВыбора());
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПодготовитьДанныеВыбора()
	
	Если Элементы.СписокПометка.Видимость Тогда
		
		ДанныеВыбора = Новый СписокЗначений();
		
		Для Каждого ЭлементСписка Из Список Цикл
			ДанныеВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление, ЭлементСписка.Пометка);
		КонецЦикла;
		
		Возврат ДанныеВыбора;
		
	Иначе
		Возврат Элементы.Список.ТекущиеДанные.Значение;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
