
#Область ПрограммныйИнтерфейс

Процедура НачатьИнициализациюФайловойСистемы(ОповещениеОЗавершении) Экспорт
	
	Контекст = Новый Структура();
	Контекст.Вставить("ОповещениеОЗавершении", ОповещениеОЗавершении);
	
	Оповещение = Новый ОписаниеОповещения(
		"ИнициализироватьФайловуюСистемуПослеПодключенияРасширения", ЭтотОбъект, Контекст);
	ФайловаяСистемаКлиент.ПодключитьРасширениеДляРаботыСФайлами(Оповещение, , Ложь);
	
КонецПроцедуры

Процедура НачатьДеинициализациюФайловойСистемы(ОповещениеОЗавершении = Неопределено) Экспорт
	
	ДанныеФайловойСистемы = ПолучитьДанныйФайловойСистемыSimple();
	
	Если ЗначениеЗаполнено(ДанныеФайловойСистемы.РабочийКаталогПользователя) Тогда
		
		Контекст = Новый Структура();
		
		Если ОповещениеОЗавершении <> Неопределено Тогда
			Контекст.Вставить("ОповещениеОЗавершении", ОповещениеОЗавершении);
		КонецЕсли;
		
		Оповещение = Новый ОписаниеОповещения("НачатьДеинициализациюФайловойСистемыЗавершение", ЭтотОбъект, Контекст);
		НачатьУдалениеФайлов(Оповещение, СформироватьПутьРабочегоКаталогаSimple(
			ДанныеФайловойСистемы.РабочийКаталогПользователя));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализироватьФайловуюСистемуПослеПодключенияРасширения(Результат, Контекст) Экспорт
	
	Если Результат Тогда
		
		ДанныеФайловойСистемы = ПолучитьДанныйФайловойСистемыSimple();
		
		Контекст.Вставить("ДанныеФайловойСистемы", ДанныеФайловойСистемы);
		
		Если ПустаяСтрока(ДанныеФайловойСистемы.РабочийКаталогПользователя) Тогда
			
			Оповещение = Новый ОписаниеОповещения(
				"ИнициализироватьФайловуюСистемуПослеПолученияРабочегоКаталога", ЭтотОбъект, Контекст);
			НачатьПолучениеРабочегоКаталогаДанныхПользователя(Оповещение);
			
		Иначе
			
			Оповещение = Новый ОписаниеОповещения(
				"ИнициализироватьФайловуюСистемуПослеПроверкиРабочегоКаталога", ЭтотОбъект, Контекст);
			
			ФайлНаДиске = Новый Файл(ДанныеФайловойСистемы.РабочийКаталогПользователя);
			ФайлНаДиске.НачатьПроверкуСуществования(Оповещение);
				
		КонецЕсли;
		
	Иначе
		
		Результат = РезультатИнициализацииФайловойСистемы(НСтр("ru = 'Не подключено расширение для работы с файлами.'"));
		ВыполнитьОбработкуОповещения(Контекст.ОповещениеОЗавершении, Результат);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ИнициализироватьФайловуюСистемуПослеПроверкиРабочегоКаталога(Существует, Контекст) Экспорт
	
	Оповещение = Новый ОписаниеОповещения("ИнициализироватьФайловуюСистемуПослеПолученияРабочегоКаталога", 
		ЭтотОбъект, Контекст);
	
	Если Существует Тогда
		ВыполнитьОбработкуОповещения(Оповещение, Контекст.ДанныеФайловойСистемы.РабочийКаталогПользователя);
	Иначе
		НачатьПолучениеРабочегоКаталогаДанныхПользователя(Оповещение);
	КонецЕсли;
	
КонецПроцедуры

Процедура ИнициализироватьФайловуюСистемуПослеПолученияРабочегоКаталога(ПутьРабочегоКаталога, Контекст) Экспорт
	
	Если ПустаяСтрока(ПутьРабочегоКаталога) Тогда
		
		Результат = РезультатИнициализацииФайловойСистемы(НСтр("ru = 'Не удалось получить рабочий каталог пользователя.'"));
		ВыполнитьОбработкуОповещения(Контекст.ОповещениеОЗавершении, Результат);
		
	Иначе
		
		Если Контекст.ДанныеФайловойСистемы.РабочийКаталогПользователя <> ПутьРабочегоКаталога Тогда
			
			Контекст.ДанныеФайловойСистемы.РабочийКаталогПользователя = ПутьРабочегоКаталога;
			ОбновитьДанныеФайловойСистемыSimple(Контекст.ДанныеФайловойСистемы);
			
		КонецЕсли;
		
		Контекст.Вставить("ПутьКРабочемуКаталогуSimple", СформироватьПутьРабочегоКаталогаSimple(ПутьРабочегоКаталога));
		
		Оповещение = Новый ОписаниеОповещения(
			"ИнициализироватьФайловуюСистемуПослеПроверкиРабочегоКаталогаSimple", ЭтотОбъект, Контекст);
		
		РабочийКаталогSimple = Новый Файл(Контекст.ПутьКРабочемуКаталогуSimple);
		РабочийКаталогSimple.НачатьПроверкуСуществования(Оповещение);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ИнициализироватьФайловуюСистемуПослеПроверкиРабочегоКаталогаSimple(Существует, Контекст) Экспорт
	
	Оповещение = Новый ОписаниеОповещения(
		"ИнициализироватьФайловуюСистемуПослеСозданияРабочегоКаталогаSimple", ЭтотОбъект, Контекст);
	
	Если Существует Тогда
		ВыполнитьОбработкуОповещения(Оповещение, Контекст.ПутьКРабочемуКаталогуSimple);
	Иначе
		НачатьСозданиеКаталога(Оповещение, Контекст.ПутьКРабочемуКаталогуSimple);
	КонецЕсли;
	
КонецПроцедуры

Процедура ИнициализироватьФайловуюСистемуПослеСозданияРабочегоКаталогаSimple(ПутьРабочегоКаталогаSimple, Контекст) Экспорт
	
	Если ПустаяСтрока(ПутьРабочегоКаталогаSimple) Тогда
		Результат = РезультатИнициализацииФайловойСистемы(НСтр("ru = 'Не удалось создать рабочий каталог Simple.'"));
	Иначе
		Результат = РезультатИнициализацииФайловойСистемы(, ПутьРабочегоКаталогаSimple);
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(Контекст.ОповещениеОЗавершении, Результат);
	
КонецПроцедуры

Процедура НачатьДеинициализациюФайловойСистемыЗавершение(Контекст) Экспорт
	
	Если Контекст.Свойство("ОповещениеОЗавершении") Тогда
		ВыполнитьОбработкуОповещения(Контекст.ОповещениеОЗавершении, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция КлючВПараметрахПриложения()
	
	Возврат "ФАЙЛОВАЯ_СИСТЕМА_SIMPLE";
	
КонецФункции

Функция ИмяРабочегоКаталогаSimple()
	
	Возврат "simple";
	
КонецФункции

Функция СформироватьПутьРабочегоКаталогаSimple(ПутьРабочегоКаталога)
	
	Возврат SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(ПутьРабочегоКаталога, ИмяРабочегоКаталогаSimple());
	
КонецФункции

Функция ПолучитьДанныйФайловойСистемыSimple()
	
	Данные = SUI_SimpleКлиент.ПолучитьПараметрПриложения(КлючВПараметрахПриложения());
	
	ОбновитьЗначениеДанных = Ложь;
	
	Если ТипЗнч(Данные) <> Тип("Структура") Тогда
		Данные = Новый Структура();
	КонецЕсли;
	
	Если Не Данные.Свойство("РабочийКаталогПользователя") Тогда
		Данные.Вставить("РабочийКаталогПользователя", "");
		ОбновитьЗначениеДанных = Истина;
	КонецЕсли;
	
	Если ОбновитьЗначениеДанных Тогда
		ОбновитьДанныеФайловойСистемыSimple(Данные);
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции

Процедура ОбновитьДанныеФайловойСистемыSimple(Данные)
	
	SUI_SimpleКлиент.УстановитьПараметрПриложения(КлючВПараметрахПриложения(), Данные);
	
КонецПроцедуры

Функция РезультатИнициализацииФайловойСистемы(Ошибка = "", РабочийКаталогSimple = "")
	
	Результат = Новый Структура();
	Результат.Вставить("РабочийКаталогSimple", РабочийКаталогSimple);
	Результат.Вставить("Ошибка", Ошибка);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
