
#Область ПрограммныйИнтерфейс

Функция НачатьЗамерВремени() Экспорт
	
	НачалоЗамера = 0;
	
	МодульОценкаПроизводительности = ОбщийМодульОценкаПроизводительности();
	Если МодульОценкаПроизводительности <> Неопределено Тогда
		НачалоЗамера = МодульОценкаПроизводительности.НачатьЗамерВремени();
	КонецЕсли;
	
	Возврат НачалоЗамера;
	
КонецФункции

Процедура ЗакончитьЗамерВремени(КлючеваяОперация, ВремяНачала, ВесЗамера = 1, Комментарий = Неопределено, ВыполненСОшибкой = Ложь) Экспорт
	
	МодульОценкаПроизводительности = ОбщийМодульОценкаПроизводительности();
	Если МодульОценкаПроизводительности <> Неопределено Тогда
		МодульОценкаПроизводительности.ЗакончитьЗамерВремени(
			КлючеваяОперацияПодсистемы(КлючеваяОперация), ВремяНачала, ВесЗамера, Комментарий, ВыполненСОшибкой);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбщийМодульОценкаПроизводительности()
	
	Если SUI_ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ОценкаПроизводительности") Тогда
		Возврат SUI_ОбщегоНазначения.ОбщийМодуль("ОценкаПроизводительности");
	Иначе
		Возврат Неопределено;
	КонецЕсли;
		
КонецФункции

Функция КлючеваяОперацияПодсистемы(КлючеваяОперация)
	Возврат SUI_SimpleКлиентСервер.ИмяРасширения() + ":" + КлючеваяОперация;
КонецФункции

#КонецОбласти
