
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьМобильныеУстройстваПоНастройке(НастройкаДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МобильноеУстройство
		|ИЗ
		|	РегистрСведений.SUI_ВладельцыНастроекДокументов
		|ГДЕ
		|	НастройкаДокумента = &НастройкаДокумента";
	
	Запрос.УстановитьПараметр("НастройкаДокумента", НастройкаДокумента);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("МобильноеУстройство");
	
КонецФункции

#КонецОбласти

#КонецЕсли
