
#Область ОписаниеПеременных

&НаКлиенте
Перем МодифицированностьТаблицИнтеграции;

&НаКлиенте
Перем СписокТаблицКОбновлению;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЗначениеВРеквизитФормы(СформироватьДеревоТаблицИнтеграции(), "ДеревоТаблицИнтеграции");
	УстановитьУсловноеОформлениеДереваТаблицыИнтеграции();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МодифицированностьТаблицИнтеграции = Ложь;
	
	ОбновитьКоличествоЗаписейВДеревеТаблицИнтеграции();
	
	УстановитьВидимостьИДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Отказ Или ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если МодифицированностьТаблицИнтеграции Тогда
		
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ПередЗакрытиемИзменитьМодифицированностьТаблицИнтеграции", ЭтотОбъект);
		ПоказатьВопрос(ОповещениеОЗавершении, НСтр("ru = 'Настройки таблиц интеграции были модифицированны.
		|Выполнить выгрузку таблиц?'"), РежимДиалогаВопрос.ДаНетОтмена);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_SUI_НастройкиТаблицИнтеграции" И ТипЗнч(Параметр) = Тип("Массив") Тогда
		
		ПодключитьОбработчикОбновленияКоличества = Ложь;
		
		ПропуститьТаблицыИнтеграции = Новый Массив();
		ПропуститьТаблицыИнтеграции.Добавить(
			ПредопределенноеЗначение("Перечисление.SUI_ТаблицыИнтеграции.ПользователиТСД"));
		
		ТаблицыИнтеграцииЗаписанныхНастроек = ПолучитьМассивТаблицИнтеграцийИзМассиваКлючейЗаписи(Параметр);
		
		Для Каждого СтрокаДерева Из ДеревоТаблицИнтеграции.ПолучитьЭлементы() Цикл
			
			Если ТаблицыИнтеграцииЗаписанныхНастроек.Найти(СтрокаДерева.ТаблицаИнтеграции) <> Неопределено И
				ПропуститьТаблицыИнтеграции.Найти(СтрокаДерева.ТаблицаИнтеграции) = Неопределено Тогда
				СтрокаДерева.Модифицированность = Истина;
				МодифицированностьТаблицИнтеграции = Истина;
				ПодключитьОбработчикОбновленияКоличества = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ПодключитьОбработчикОбновленияКоличества Тогда
			ПодключитьОбработчикОжидания("ОбновитьКоличествоЗаписейВДеревеТаблицИнтеграции", 1, Истина);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаборКонстантSUI_ИспользоватьПользовательскийЗапросПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент, Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоТаблицИнтеграции

&НаКлиенте
Процедура ДеревоТаблицИнтеграцииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле.Имя = "ДеревоТаблицИнтеграцииТаблицаИнтеграции" Тогда
		ОткрытьНастройкуТаблицыИнтеграции();
	ИначеЕсли Поле.Имя = "ДеревоТаблицИнтеграцииДополнительныеНастройки" Тогда
		ОткрытьДополнительныеНастройкиТаблицыИнтеграции();
	ИначеЕсли Поле.Имя = "ДеревоТаблицИнтеграцииКоличествоЗаписей" Тогда
		ОткрытьТаблицуИнтеграции();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДеревоТаблицИнтеграцииИспользуетсяПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоТаблицИнтеграции.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Контекст = Новый Структура();
	Контекст.Вставить("ТаблицаИнтеграции", ТекущиеДанные.ТаблицаИнтеграции);
	Контекст.Вставить("Используется", ТекущиеДанные.Используется);
	
	Оповещение = Новый ОписаниеОповещения("ИспользованиеТаблицыИнтеграцииПослеПодтверждениеОчисткиТаблицы", ЭтотОбъект, Контекст);
	
	Если ТекущиеДанные.Используется Или 
		ТекущиеДанные.ТаблицаИнтеграции = ПредопределенноеЗначение("Перечисление.SUI_ТаблицыИнтеграции.ПользователиТСД") Тогда
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Нет);
	Иначе
		ТекстВопроса = СтрШаблон(НСтр("ru = 'Очистить таблицу %1?'"), Контекст.ТаблицаИнтеграции);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьДеревоТаблицыИнтеграции(Команда)
	ОбновитьКоличествоЗаписейВДеревеТаблицИнтеграции();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТаблицуИнтеграцииКоманда(Команда)
	ОткрытьТаблицуИнтеграции();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьВсеТаблицыИнтеграции(Команда)

	Контекст = Новый Структура();
	Контекст.Вставить("ТаблицыИнтеграции", Новый Массив());
	Контекст.Вставить("Используется", Истина);
	
	Для Каждого СтрокаДерева Из ДеревоТаблицИнтеграции.ПолучитьЭлементы() Цикл
		Если Не СтрокаДерева.Используется Тогда
			Контекст.ТаблицыИнтеграции.Добавить(СтрокаДерева.ТаблицаИнтеграции);
			СтрокаДерева.Используется = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если Контекст.ТаблицыИнтеграции.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ИспользованиеТаблицыИнтеграцииПослеПодтверждениеОчисткиТаблицы", ЭтотОбъект, Контекст);
	ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеИспользованиеТаблиц(Команда)
	
	Контекст = Новый Структура();
	Контекст.Вставить("ТаблицыИнтеграции", Новый Массив());
	Контекст.Вставить("Используется", Ложь);
	
	Для Каждого СтрокаДерева Из ДеревоТаблицИнтеграции.ПолучитьЭлементы() Цикл
		Если СтрокаДерева.Используется Тогда
			Контекст.ТаблицыИнтеграции.Добавить(СтрокаДерева.ТаблицаИнтеграции);
			СтрокаДерева.Используется = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Оповещение = Новый ОписаниеОповещения("ИспользованиеТаблицыИнтеграцииПослеПодтверждениеОчисткиТаблицы", ЭтотОбъект, Контекст);
	
	Если Контекст.ТаблицыИнтеграции.Количество() = 0 Тогда
		Возврат;
	ИначеЕсли Контекст.ТаблицыИнтеграции.Количество() = 1 И
		Контекст.ТаблицыИнтеграции.Найти(ПредопределенноеЗначение("Перечисление.SUI_ТаблицыИнтеграции.ПользователиТСД")) <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Нет);
	Иначе
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Очистить таблицы?'"), РежимДиалогаВопрос.ДаНет);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкуТаблицыИнтеграцииКоманда(Команда)
	ОткрытьНастройкуТаблицыИнтеграции();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДополнительныеНастройкиТаблицыИнтеграцииКоманда(Команда)
	ОткрытьДополнительныеНастройкиТаблицыИнтеграции();
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВТаблицуИнтеграции(Команда)
	
	ВыполнитьДействиеСТаблицами("Выгрузить");

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТаблицуИнтеграции(Команда)
	
	ВыполнитьДействиеСТаблицами("Очистить");
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаписатьТаблицуИнтеграцииВМУ(Команда)
	
	ТекущиеДанные = Элементы.ДеревоТаблицИнтеграции.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПерезаписатьТаблицуИнтеграцииВМУНаСервере(ТекущиеДанные.ТаблицаИнтеграции);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПользовательскийЗапрос(Команда)
	
	ПараметрыОткрытияКонструктора = SUI_КонструкторЗапросаКлиентСервер.ПараметрыОткрытияКонструктора();
	ПараметрыОткрытияКонструктора.Данные = 
		SUI_НастройкиМетаданныхВызовСервера.ПолучитьПользовательскийЗапрос();
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОткрытьПользовательскийЗапросЗавершение", ЭтотОбъект);
	
	SUI_КонструкторЗапросаКлиент.ОткрытьКонструктор(ПараметрыОткрытияКонструктора, ОповещениеОЗавершении, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗапросПолученияОстатковИЦен(Команда)
	
	ПараметрыОткрытияКонструктора = SUI_КонструкторЗапросаКлиентСервер.ПараметрыОткрытияКонструктора();
	ПараметрыОткрытияКонструктора.ОтображатьНастройкиРезультатаЗапроса = Ложь;
	ПараметрыОткрытияКонструктора.Данные = ПолучитьЗапросПолученияОстатковИЦен();
	ПараметрыОткрытияКонструктора.ОписаниеЗапроса = СтроковыеФункцииКлиент.ФорматированнаяСтрока(
		НСтр("ru = '<b>Результат запроса должен возращать колонки:</b>
		|
		|<b>purpose</b> = Склад
		|<b>id_good</b> = Номенклатура
		|<b>good_name</b> = Наименование номенклатуры
		|<b>article</b> = Артикул номенклатуры
		|<b>id_property</b> = Характеристика
		|<b>property_name</b> = Наименование характеристики
		|<b>representation</b> = Представление результата
		|<b>qtty</b> = Количество остаток
		|<b>price_new</b> = Цена (текущая)
		|<b>price_old</b> = Цена (старая)'"));

	SUI_КонструкторЗапросаКлиентСервер.ДобавитьОписаниеПараметра(ПараметрыОткрытияКонструктора, 
		"Номенклатура", Неопределено, НСтр("ru = 'Номенклатура'"));
	SUI_КонструкторЗапросаКлиентСервер.ДобавитьОписаниеПараметра(ПараметрыОткрытияКонструктора, 
		"Характеристика", Неопределено, НСтр("ru = 'Характеристика номенклатуры'"));
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОткрытьЗапросПолученияОстатковИЦенЗавершение", ЭтотОбъект);
	
	SUI_КонструкторЗапросаКлиент.ОткрытьКонструктор(ПараметрыОткрытияКонструктора, ОповещениеОЗавершении, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьНастройкиВФайл(Команда)
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("ОбластьНастроек", "Настройки подсистемы");
	ПараметрыОткрытия.Вставить("РежимВыгрузки", Истина);
	ОткрытьФорму("Обработка.SUI_ИмпортЭкспортНастроек.Форма", ПараметрыОткрытия, ЭтотОбъект, 
		УникальныйИдентификатор, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройкиИзФайла(Команда)
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("ОбластьНастроек", "Настройки подсистемы");
	ПараметрыОткрытия.Вставить("РежимВыгрузки", Ложь);
	ОткрытьФорму("Обработка.SUI_ИмпортЭкспортНастроек.Форма", ПараметрыОткрытия, ЭтотОбъект, 
		УникальныйИдентификатор, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция СформироватьДеревоТаблицИнтеграции()
	
	ТаблицыИнтеграции = SUI_НастройкиМетаданныхПовтИсп.ТаблицыИнтеграции();
	ТаблицыИнтеграции.СортироватьПоПредставлению();
	
	ТаблицыСДополнительнымиНастройками = Новый Массив();
	ТаблицыСДополнительнымиНастройками.Добавить(Перечисления.SUI_ТаблицыИнтеграции.СерииНоменклатуры);
	ТаблицыСДополнительнымиНастройками.Добавить(Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыНоменклатуры);
	ТаблицыСДополнительнымиНастройками.Добавить(Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыУпаковок);
	
	ДеревоТаблиц = Новый ДеревоЗначений();
	ДеревоТаблиц.Колонки.Добавить("ТаблицаИнтеграции");
	ДеревоТаблиц.Колонки.Добавить("ИмяМетаданных");
	ДеревоТаблиц.Колонки.Добавить("Используется");
	ДеревоТаблиц.Колонки.Добавить("ДополнительныеНастройки");
	ДеревоТаблиц.Колонки.Добавить("КоличествоЗаписей");
	ДеревоТаблиц.Колонки.Добавить("Модифицированность");
	ДеревоТаблиц.Колонки.Добавить("ИндексКартинки");
	
	Для Каждого ТаблицаИнтеграции Из ТаблицыИнтеграции Цикл

		СтрокаДерева 					= ДеревоТаблиц.Строки.Добавить();
		СтрокаДерева.ТаблицаИнтеграции 	= ТаблицаИнтеграции.Значение;
		СтрокаДерева.ИмяМетаданных 		= SUI_НастройкиМетаданныхСервер.ПолучитьИмяТаблицыВКонфигурации(СтрокаДерева.ТаблицаИнтеграции);
		
		Если ТаблицыСДополнительнымиНастройками.Найти(СтрокаДерева.ТаблицаИнтеграции) <> Неопределено Тогда
			СтрокаДерева.ДополнительныеНастройки = Истина;
		КонецЕсли;
		
	КонецЦикла;

	Возврат ДеревоТаблиц;

КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформлениеДереваТаблицыИнтеграции()
	
	// Цвет гиперссылки Таблица интеграции
	ЭлементУсловногоОформления  	= УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента                	= ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле           	= Новый ПолеКомпоновкиДанных("ДеревоТаблицИнтеграцииТаблицаИнтеграции");
	ОтборЭлемента               	= ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ДеревоТаблицИнтеграции.Используется");
	ОтборЭлемента.ВидСравнения  	= ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение 	= Истина;
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ГиперссылкаЦвет);
	
	// Цвет гиперссылки Дополнительные настройки
	ЭлементУсловногоОформления  	= УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента                	= ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле           	= Новый ПолеКомпоновкиДанных("ДеревоТаблицИнтеграцииДополнительныеНастройки");
	ОтборЭлемента               	= ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ДеревоТаблицИнтеграции.Используется");
	ОтборЭлемента.ВидСравнения  	= ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение 	= Истина;
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ГиперссылкаЦвет);
	
	// Цвет гиперссылки Количество записей
	ЭлементУсловногоОформления  	= УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента                	= ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле           	= Новый ПолеКомпоновкиДанных("ДеревоТаблицИнтеграцииКоличествоЗаписей");
	ОтборЭлемента               	= ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ДеревоТаблицИнтеграции.Используется");
	ОтборЭлемента.ВидСравнения  	= ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение 	= Истина;
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ГиперссылкаЦвет);
	
	// Отобразить гиперссылки Дополнительные настройки
	ЭлементУсловногоОформления  	= УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента                	= ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле           	= Новый ПолеКомпоновкиДанных("ДеревоТаблицИнтеграцииДополнительныеНастройки");
	ОтборЭлемента               	= ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ДеревоТаблицИнтеграции.ДополнительныеНастройки");
	ОтборЭлемента.ВидСравнения  	= ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение 	= Истина;
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Дополнительные настройки'"));

	// Скрыть гиперссылку Дополнительные настройки
	ЭлементУсловногоОформления  	= УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента                	= ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле           	= Новый ПолеКомпоновкиДанных("ДеревоТаблицИнтеграцииДополнительныеНастройки");
	ОтборЭлемента               	= ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ДеревоТаблицИнтеграции.ДополнительныеНастройки");
	ОтборЭлемента.ВидСравнения  	= ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение 	= Ложь;
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", "");
	
	// Отобразить как гиперссылку Количество записей когда 0
	ЭлементУсловногоОформления  	= УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента                	= ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле           	= Новый ПолеКомпоновкиДанных("ДеревоТаблицИнтеграцииКоличествоЗаписей");
	ОтборЭлемента               	= ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ДеревоТаблицИнтеграции.КоличествоЗаписей");
	ОтборЭлемента.ВидСравнения  	= ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	ОтборЭлемента.ПравоеЗначение 	= 0;
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '0'"));
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ГиперссылкаЦвет);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользованиеТаблицыИнтеграцииПослеПодтверждениеОчисткиТаблицы(Ответ, Контекст) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОчиститьТаблицу = Истина;
		ОчиститьСообщения();
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
		ОчиститьТаблицу = Ложь;
	Иначе
		Возврат;
	КонецЕсли;
	
	ОписаниеТипаТаблицаИнтеграции = Новый ОписаниеТипов("ПеречислениеСсылка.SUI_ТаблицыИнтеграции");
	
	ТаблицыКОбработке = Новый СписокЗначений();
	
	Если Контекст.Свойство("ТаблицаИнтеграции") И 
		Не ОписаниеТипаТаблицаИнтеграции.ПривестиЗначение(Контекст.ТаблицаИнтеграции).Пустая() Тогда
		ТаблицыКОбработке.Добавить(Контекст.ТаблицаИнтеграции);
	ИначеЕсли Контекст.Свойство("ТаблицыИнтеграции") Тогда
		ОписаниеТипаМассив = Новый ОписаниеТипов("Массив");
		Для Каждого ТаблицаИнтеграции Из ОписаниеТипаМассив.ПривестиЗначение(Контекст.ТаблицыИнтеграции) Цикл
			Если Не ОписаниеТипаТаблицаИнтеграции.ПривестиЗначение(ТаблицаИнтеграции).Пустая() Тогда
				ТаблицыКОбработке.Добавить(ТаблицаИнтеграции);
			КонецЕсли;
		КонецЦикла;
	Иначе
		Возврат;
	КонецЕсли;
	
	Если ТаблицыКОбработке.Количество() = 0 Тогда
		Возврат;
	Иначе
		ТаблицыКОбработке.ЗаполнитьПометки(Контекст.Используется);
	КонецЕсли;
	
	ИспользованиеТаблицыИнтеграцииНаСервере(ТаблицыКОбработке, ОчиститьТаблицу);
	
	СписокТаблицКОбновлению = ТаблицыКОбработке.ВыгрузитьЗначения();
	
	ОбновитьКоличествоЗаписейВДеревеТаблицИнтеграции();
	
	ОбновитьПовторноИспользуемыеЗначения();
	ПодключитьОбработчикОжидания("ОбновлениеИнтерфейса", 0.2, Истина);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИспользованиеТаблицыИнтеграцииНаСервере(КоллекцияТаблицИнтеграции, ОчищатьТаблицы)
	
	ОписаниеТипаСписокЗначений = Новый ОписаниеТипов("СписокЗначений");
	Для Каждого ТаблицаИнтеграции Из ОписаниеТипаСписокЗначений.ПривестиЗначение(КоллекцияТаблицИнтеграции) Цикл
		SUI_НастройкиМетаданныхСервер.УстановитьПризнакИспользованияТаблицы(ТаблицаИнтеграции.Значение, 
			ТаблицаИнтеграции.Пометка, ?(Не ТаблицаИнтеграции.Пометка И ОчищатьТаблицы, Истина, Ложь));
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеИнтерфейса() Экспорт
	ОбщегоНазначенияКлиент.ОбновитьИнтерфейсПрограммы();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизита(Элемент, ОбновлятьИнтерфейс = Истина)
	
	ПриИзмененииРеквизитаСервер(Элемент.Имя);
	
	ОбновитьПовторноИспользуемыеЗначения();

	Если ОбновлятьИнтерфейс Тогда
		ПодключитьОбработчикОжидания("ОбновлениеИнтерфейса", 2, Истина);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПриИзмененииРеквизитаСервер(ИмяЭлемента)
	
	РеквизитПутьКДанным = Элементы[ИмяЭлемента].ПутьКДанным;
	ИмяКонстанты = СохранитьЗначениеРеквизита(РеквизитПутьКДанным);
	УстановитьВидимостьИДоступность();
	Возврат ИмяКонстанты;
	
КонецФункции

&НаСервере
Функция СохранитьЗначениеРеквизита(РеквизитПутьКДанным)
	
	Если РеквизитПутьКДанным = "" Тогда
		Возврат "";
	КонецЕсли;
	
	ЧастиИмени = СтрРазделить(РеквизитПутьКДанным, ".");
	
	Если ЧастиИмени.Количество() = 2 Тогда
		КонстантаИмя = ЧастиИмени[1];
		КонстантаЗначение = НаборКонстант[КонстантаИмя];
	ИначеЕсли ЧастиИмени.Количество() = 1 И НРег(Лев(РеквизитПутьКДанным, 9)) = НРег("Константа") Тогда
		КонстантаИмя = Сред(РеквизитПутьКДанным, 10);
		КонстантаЗначение = ЭтотОбъект[РеквизитПутьКДанным];
	Иначе
		Возврат "";
	КонецЕсли;
	
	Если Константы[КонстантаИмя].Получить() <> КонстантаЗначение Тогда
		Константы[КонстантаИмя].Установить(КонстантаЗначение);
	КонецЕсли;
	
	Возврат КонстантаИмя;
	
КонецФункции

&НаСервере
Процедура УстановитьВидимостьИДоступность(РеквизитПутьКДанным = "")
	
	Элементы.ОткрытьПользовательскийЗапрос.Доступность = НаборКонстант.SUI_ИспользоватьПользовательскийЗапрос;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКоличествоЗаписейВДеревеТаблицИнтеграции() Экспорт
	
	ДлительнаяОперация = ОбновитьКоличествоЗаписейВДеревеТаблицИнтеграцииНаСервере(СписокТаблицКОбновлению);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбновитьКоличествоЗаписейВДеревеТаблицИнтеграцииЗавершение", 
		ЭтотОбъект, Новый Структура("ВсеТаблицы", (СписокТаблицКОбновлению = Неопределено)));
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

&НаСервере
Функция ОбновитьКоличествоЗаписейВДеревеТаблицИнтеграцииНаСервере(СписокТаблиц = Неопределено)

	ПараметрыПроцедуры = Новый Структура();
	ПараметрыПроцедуры.Вставить("СписокТаблиц", СписокТаблиц);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"Обработки.SUI_НастройкаМетаданных.ПолучитьКоличествоЗаписейВТаблицахИнтеграции", 
		ПараметрыПроцедуры, ПараметрыВыполнения);

КонецФункции

&НаКлиенте
Процедура ОбновитьКоличествоЗаписейВДеревеТаблицИнтеграцииЗавершение(Результат, ДополнительныеПараметры) Экспорт

	СписокТаблицКОбновлению = Неопределено;
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Сообщения <> Неопределено Тогда
		
		Для индекс = 0 По Результат.Сообщения.ВГраница() Цикл
			Результат.Сообщения[индекс].Сообщить();
		КонецЦикла;
		
	КонецЕсли;

	Если Результат.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение(, Результат.КраткоеПредставлениеОшибки);
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
		Возврат;
	КонецЕсли;

	Если Результат.Статус = "Выполнено" Тогда
		ОбновитьКоличествоЗаписейВДеревеТаблицИнтеграцииЗавершениеНаСервере(Результат.АдресРезультата, 
			ДополнительныеПараметры.ВсеТаблицы);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновитьКоличествоЗаписейВДеревеТаблицИнтеграцииЗавершениеНаСервере(АдресРезультата, ВсеТаблицы)
	
	ТаблицаКоличествоЗаписей = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Для Каждого СтрокаДерева Из ДеревоТаблицИнтеграции.ПолучитьЭлементы() Цикл
		
		НайденныеСтроки = ТаблицаКоличествоЗаписей.НайтиСтроки(Новый Структура("ТаблицаИнтеграции", СтрокаДерева.ТаблицаИнтеграции));
		Если НайденныеСтроки.Количество() = 0 Тогда
			
			Если ВсеТаблицы Тогда
				СтрокаДерева.КоличествоЗаписей = 0;
				СтрокаДерева.Используется = Ложь;
				СтрокаДерева.ИндексКартинки = 9;
			КонецЕсли;
			
		Иначе
			СтрокаДерева.КоличествоЗаписей = НайденныеСтроки[0].КоличествоЗаписей;
			СтрокаДерева.Используется = НайденныеСтроки[0].Используется;
			СтрокаДерева.ИндексКартинки = НайденныеСтроки[0].ИндексКартинки;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкуТаблицыИнтеграции()
	
	ТекущиеДанные = Элементы.ДеревоТаблицИнтеграции.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("ТаблицаИнтеграции", ТекущиеДанные.ТаблицаИнтеграции);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОткрытьНастройкуТаблицыИнтеграцииЗавершение", ЭтотОбъект, 
		Элементы.ДеревоТаблицИнтеграции.ТекущаяСтрока);
		
	ОткрытьФорму("РегистрСведений.SUI_НастройкиТаблицИнтеграции.Форма.НастройкаТаблиц", ПараметрыОткрытия, ЭтотОбъект, 
		УникальныйИдентификатор, , , ОповещениеОЗавершении);
		
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкуТаблицыИнтеграцииЗавершение(НастройкаИзменена, ИдентификаторСтрокиДерева) Экспорт
	
	Если Не ЗначениеЗаполнено(НастройкаИзменена) Тогда
		Возврат;
	КонецЕсли;
	
	Данные = ДеревоТаблицИнтеграции.НайтиПоИдентификатору(ИдентификаторСтрокиДерева);
	
	Если Данные <> Неопределено И Данные.Используется Тогда
		Данные.Модифицированность = Истина;
		МодифицированностьТаблицИнтеграции = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДополнительныеНастройкиТаблицыИнтеграции()
	
	ТекущиеДанные = Элементы.ДеревоТаблицИнтеграции.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Контекст = Новый Структура();
	Контекст.Вставить("Таблица", ТекущиеДанные.ТаблицаИнтеграции);
	
	СписокМеню = Новый СписокЗначений();
	
	Если Контекст.Таблица = ПредопределенноеЗначение("Перечисление.SUI_ТаблицыИнтеграции.ШтрихкодыУпаковок") Тогда
		
		СписокМеню.Добавить("АлгоритмНормализацииЗначенияШтрихкода", НСтр("ru = 'Алгоритм нормализации штрихкода'"));
		СписокМеню.Добавить("АлгоритмСозданияШтрихкодаУпаковки", НСтр("ru = 'Алгоритм создания штрихкода упаковки'"));
	
	ИначеЕсли Контекст.Таблица = ПредопределенноеЗначение("Перечисление.SUI_ТаблицыИнтеграции.ШтрихкодыНоменклатуры") Тогда
		СписокМеню.Добавить("АлгоритмСозданияШтрихкодаНоменклатуры", НСтр("ru = 'Алгоритм создания штрихкода'"));
	ИначеЕсли Контекст.Таблица = ПредопределенноеЗначение("Перечисление.SUI_ТаблицыИнтеграции.СерииНоменклатуры") Тогда
		СписокМеню.Добавить("АлгоритмСозданияСерииНоменклатуры", НСтр("ru = 'Алгоритм создания серий'"));
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораДополнительнойНастройки", ЭтотОбъект, Контекст);
	
	Если СписокМеню.Количество() > 1 Тогда
		ПоказатьВыборИзМеню(Оповещение, СписокМеню);
	ИначеЕсли СписокМеню.Количество() = 1 Тогда
		ВыполнитьОбработкуОповещения(Оповещение, СписокМеню[0]);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораДополнительнойНастройки(ВыбраннаяНастройка, Контекст) Экспорт
	
	Если ВыбраннаяНастройка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Контекст.Вставить("КлючНастройки", ВыбраннаяНастройка.Значение);
	
	ПараметрыОткрытияРедактора = SUI_РедакторКодаКлиент.ПараметрыОткрытия();
	ПараметрыОткрытияРедактора.ЗапретРедактированияПриОткрытии = Не Модифицированность;
	
	ЗаполнитьПараметрыОткрытияРедактораКодаНаСервере(ПараметрыОткрытияРедактора, Контекст);
	
	Оповещение = Новый ОписаниеОповещения("ОткрытьРедактораКодаДополнительныхНастроекЗавершение", ЭтотОбъект, Контекст);
	
	#Если ВебКлиент Тогда
		SUI_РедакторКодаКлиент.ОткрытьРедактор(ПараметрыОткрытияРедактора, Оповещение, ЭтотОбъект, , 
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	#Иначе
		SUI_РедакторКодаКлиент.ОткрытьРедактор(ПараметрыОткрытияРедактора, Оповещение, ЭтотОбъект, Окно);
	#КонецЕсли
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьПараметрыОткрытияРедактораКодаНаСервере(ПараметрыОткрытияРедактора, Контекст)
	
	Если Контекст.Таблица = Перечисления.SUI_ТаблицыИнтеграции.СерииНоменклатуры Тогда
		
		ПараметрыОткрытияРедактора.ПредопределенныйТекст = 
			SUI_СерииНоменклатурыКлиентСервер.ПредопределенныеАлгоритмыСозданияСерий();
		
		ПараметрыОткрытияРедактора.Заголовок = НСтр("ru = 'Алгоритм создания серий номенклатуры'");
		
		ПараметрыОткрытияРедактора.Описание = СтроковыеФункции.ФорматированнаяСтрока(
			НСтр("ru = 'Созданную серию номенклатуры необходимо присвоить в колонке <span style=""color: ГиперссылкаЦвет""><b>Серия</b> в строке таблицы <span style=""color: ГиперссылкаЦвет""><b>ТаблицаСерий</b></span></span>.
			|<span style=""color:ПоясняющийОшибкуТекст; font:ВажнаяНадписьШрифт"">
			|Внимание!</span> Колонки <b>sid</b>, <b>sid_doc</b> и <b>Серия</b> таблицы <b>ТаблицаСерий</b> должны присутствовать при завершении выполнения алгоритма!'"));
		
		// Описание переменных: ТаблицаСерий
		ОписаниеОбъекта = SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(
			ПараметрыОткрытияРедактора.ПользовательскиеОбъекты, 
			"ТаблицаСерий", НСтр("ru = 'Таблица серий полученная из ТСД'"), "ТаблицаЗначений");
		
		// Описание переменных: ТаблицаСерий.sid
		SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(ОписаниеОбъекта, 
			"sid",
			"sid", 
			НСтр("ru = 'Внутренний идентификатор записи регистра сведений Серии документов обмена'"), 
			Тип("Строка"));
			
		// Описание переменных: ТаблицаСерий.sid_doc
		SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(ОписаниеОбъекта, 
			"sid_doc",
			"sid_doc", 
			НСтр("ru = 'Внутренний идентификатор записи регистра сведений Документы обмена'"), 
			Тип("Строка"));
		
		// Описание переменных: ТаблицаСерий.Номенклатура
		SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(ОписаниеОбъекта, 
			"Номенклатура", "Номенклатура", НСтр("ru = 'Номенклатура серии'"), "Произвольный");
			
		// Описание переменных: ТаблицаСерий.Серия
		SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(ОписаниеОбъекта, 
			"Серия", "Серия", НСтр("ru = 'Колонка результата создания серии номенклатуры'"), "Произвольный");
		
		// Описание переменных: ТаблицаСерий.Наименование
		SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(ОписаниеОбъекта, 
			"Наименование", "Наименование", НСтр("ru = 'Наименование серии'"), Тип("Строка"));
		
		// Описание переменных: ТаблицаСерий.Номер
		SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(ОписаниеОбъекта, 
			"Номер", "Номер", НСтр("ru = 'Номер серии'"), Тип("Строка"));
		
		// Описание переменных: ТаблицаСерий.ДатаПроизводства
		SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(ОписаниеОбъекта, 
			"ДатаПроизводства", "ДатаПроизводства", НСтр("ru = 'Дата производства серии'"), Тип("Дата"));
		
		// Описание переменных: ТаблицаСерий.ГоденДо
		SUI_РедакторКодаКлиентСервер.ДобавитьСвойствоПользовательскогоОбъекта(ОписаниеОбъекта, 
			"ГоденДо", "ГоденДо", НСтр("ru = 'Дата окончания срока годности серии'"), Тип("Дата"));
			
	ИначеЕсли Контекст.Таблица = Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыНоменклатуры Тогда
		
		ПараметрыОткрытияРедактора.ПредопределенныйТекст = 
			SUI_ШтрихкодыНоменклатурыКлиентСервер.ПредопределенныеАлгоритмыСозданияШтрихкодаНоменклатуры();
			
		ПараметрыОткрытияРедактора.Заголовок = НСтр("ru = 'Алгоритм создания штрихкода номенклатуры'");
		
		// Описание переменных: Штрихкод
		SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(ПараметрыОткрытияРедактора.ПользовательскиеОбъекты, 
			"Штрихкод", НСтр("ru = 'Значение штрихкода'"), Тип("Строка"));
		
		// Описание переменных: Номенклатура
		SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(ПараметрыОткрытияРедактора.ПользовательскиеОбъекты, 
			"Номенклатура", НСтр("ru = 'Номенклатура полученная из ТСД'"), "Произвольный");
		
		// Описание переменных: Характеристика
		SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(ПараметрыОткрытияРедактора.ПользовательскиеОбъекты, 
			"Характеристика", НСтр("ru = 'Характеристика полученная из ТСД'"), "Произвольный");
		
		// Описание переменных: Упаковка
		SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(ПараметрыОткрытияРедактора.ПользовательскиеОбъекты, 
			"Упаковка", НСтр("ru = 'Упаковка полученная из ТСД'"), "Произвольный");
		
	ИначеЕсли Контекст.Таблица = Перечисления.SUI_ТаблицыИнтеграции.ШтрихкодыУпаковок Тогда
		
		Если Контекст.КлючНастройки = "АлгоритмНормализацииЗначенияШтрихкода" Тогда
			
			ПараметрыОткрытияРедактора.ПредопределенныйТекст = 
				SUI_ШтрихкодыУпаковокКлиентСервер.ПредопределенныеАлгоритмыНормализацииЗначенияШтрихкода();
			
			ПараметрыОткрытияРедактора.Заголовок = НСтр("ru = 'Алгоритм нормализации значения штрихкода упаковки'");
			ПараметрыОткрытияРедактора.Описание = СтроковыеФункции.ФорматированнаяСтрока(
			НСтр("ru = '<span style=""font:ВажнаяНадписьШрифт"">Пример нормализации значения штрихкода упаковки:</span>
			|
			|<b>До:</b> 010460780959150821sSBmxTYIFT(eq91FFD092testtesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttesttest
			|<b>После:</b> (01)04607809591508(21)sSBmxTYIFT(eq
			|
			|или
			|
			|<b>До:</b> 00077212602200000010
			|<b>После:</b> (00)077212602200000010
			|
			|<span style=""font:ВажнаяНадписьШрифт"">Нормализованное значение штрихкода упаковки необходимо присвоить переменной</span> <span style=""color: ГиперссылкаЦвет"">ЗначениеШтрихкода</span>'"));
			
			// Описание переменных: ЗначениеШтрихкода
			SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(ПараметрыОткрытияРедактора.ПользовательскиеОбъекты, 
				"ЗначениеШтрихкода", НСтр("ru = 'Значение штрихкода полученное из ТСД'"), Тип("Строка"));
			
			// Описание переменных: Номенклатура
			SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(ПараметрыОткрытияРедактора.ПользовательскиеОбъекты, 
				"Номенклатура", НСтр("ru = 'Номенклатура полученная из ТСД'"), "Произвольный");
			
		ИначеЕсли Контекст.КлючНастройки = "АлгоритмСозданияШтрихкодаУпаковки" Тогда
			
			ПараметрыОткрытияРедактора.ПредопределенныйТекст = 
				SUI_ШтрихкодыУпаковокКлиентСервер.ПредопределенныеАлгоритмыСозданияШтрихкодаУпаковки();
			
			ПараметрыОткрытияРедактора.Заголовок = НСтр("ru = 'Алгоритм создания штрихкода упаковки'");
			ПараметрыОткрытияРедактора.Описание = СтроковыеФункции.ФорматированнаяСтрока(
				НСтр("ru = '<span style=""font:ВажнаяНадписьШрифт"">Созданный объект штрихкода упаковки необходимо присвоить переменной</span> <span style=""color: ГиперссылкаЦвет"">ШтрихкодУпаковки</span>.
				|<span style=""font:ВажнаяНадписьШрифт"">
				|Созданный объект штрихкода транспортной упаковки необходимо присвоить переменной</span> <span style=""color: ГиперссылкаЦвет"">ШтрихкодТранспортнойУпаковки</span>.'"));
			
			// Описание переменных: ЗначениеШтрихкода
			SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(ПараметрыОткрытияРедактора.ПользовательскиеОбъекты, 
				"ЗначениеШтрихкода", НСтр("ru = 'Значение штрихкода упаковки'"), Тип("Строка"));
			
			// Описание переменных: ЗначениеШтрихкодаТранспортнойУпаковки
			SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(ПараметрыОткрытияРедактора.ПользовательскиеОбъекты, 
				"ЗначениеШтрихкодаТранспортнойУпаковки", 
				НСтр("ru = 'Значение штрихкода транспортной упаковки (SSCC)'"), Тип("Строка"));
			
			// Описание переменных: ШтрихкодУпаковки
			SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(ПараметрыОткрытияРедактора.ПользовательскиеОбъекты, 
				"ШтрихкодУпаковки", НСтр("ru = 'Созданный штрихкод упаковки'"), "Произвольный");
			
			// Описание переменных: ШтрихкодТранспортнойУпаковки
			SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(ПараметрыОткрытияРедактора.ПользовательскиеОбъекты, 
				"ШтрихкодТранспортнойУпаковки", НСтр("ru = 'Созданный штрихкод транспортной упаковки (SSCC)'"), "Произвольный");
			
			// Описание переменных: Номенклатура
			SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(ПараметрыОткрытияРедактора.ПользовательскиеОбъекты, 
				"Номенклатура", НСтр("ru = 'Номенклатура полученная из ТСД'"), "Произвольный");
			
			// Описание переменных: Характеристика
			SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(ПараметрыОткрытияРедактора.ПользовательскиеОбъекты, 
				"Характеристика", НСтр("ru = 'Характеристика полученная из ТСД'"), "Произвольный");
			
			// Описание переменных: Серия
			SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(ПараметрыОткрытияРедактора.ПользовательскиеОбъекты, 
				"Серия", НСтр("ru = 'Серия полученная из ТСД'"), "Произвольный");
			
			// Описание переменных: Упаковка
			SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(ПараметрыОткрытияРедактора.ПользовательскиеОбъекты, 
				"Упаковка", НСтр("ru = 'Упаковка полученная из ТСД'"), "Произвольный");
			// Описание переменных: Упаковка
			SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(ПараметрыОткрытияРедактора.ПользовательскиеОбъекты, 
				"Ячейка", НСтр("ru = 'Ячейка полученная из ТСД'"), "Произвольный");
		
		КонецЕсли;
		
	КонецЕсли;
	
	ОписаниеТипаСтруктура = Новый ОписаниеТипов("Структура");
	Контекст.Вставить("ДополнительныеНастройки", ОписаниеТипаСтруктура.ПривестиЗначение(
		SUI_НастройкиМетаданныхСервер.ПолучитьДополнительныеНастройки(Контекст.Таблица, Ложь)));
	
	Если Не Контекст.ДополнительныеНастройки.Свойство(Контекст.КлючНастройки) Или 
		ТипЗнч(Контекст.ДополнительныеНастройки[Контекст.КлючНастройки]) <> Тип("Структура") Тогда
		Контекст.ДополнительныеНастройки.Вставить(Контекст.КлючНастройки, Новый Структура());
	КонецЕсли;
	
	Если Не Контекст.ДополнительныеНастройки[Контекст.КлючНастройки].Свойство("Алгоритм") Или 
		ТипЗнч(Контекст.ДополнительныеНастройки[Контекст.КлючНастройки].Алгоритм) <> Тип("Строка") Тогда
		Контекст.ДополнительныеНастройки[Контекст.КлючНастройки].Вставить("Алгоритм", "");
	КонецЕсли;
	
	ПараметрыОткрытияРедактора.ИсходныйТекст = Контекст.ДополнительныеНастройки[Контекст.КлючНастройки].Алгоритм;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРедактораКодаДополнительныхНастроекЗавершение(Алгоритм, Контекст) Экспорт
	
	Если Алгоритм = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Контекст.ДополнительныеНастройки[Контекст.КлючНастройки].Вставить("Алгоритм", Алгоритм);
	
	ОткрытьРедактораКодаДополнительныхНастроекЗавершениеНаСервере(Контекст);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОткрытьРедактораКодаДополнительныхНастроекЗавершениеНаСервере(Контекст)
	
	SUI_НастройкиМетаданныхСервер.СохранитьДополнительныеНастройки(Контекст.Таблица, Контекст.ДополнительныеНастройки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТаблицуИнтеграции()
	
	ТекущиеДанные = Элементы.ДеревоТаблицИнтеграции.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОткрытьТаблицуИнтеграцииЗавершение", ЭтотОбъект);
	ОткрытьФорму(ТекущиеДанные.ИмяМетаданных + ".ФормаСписка", , ЭтотОбъект, УникальныйИдентификатор, , , ОповещениеОЗавершении);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТаблицуИнтеграцииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	ОбновитьКоличествоЗаписейВДеревеТаблицИнтеграции();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействиеСТаблицами(Действие, ОповещениеОЗавершении = Неопределено)
	
	ОчиститьСообщения();
	
	ТекущиеДанные = Элементы.ДеревоТаблицИнтеграции.ТекущиеДанные;

	Контекст = Новый Структура();
	Контекст.Вставить("Действие", ВРег(Действие));
	
	Если ТипЗнч(ОповещениеОЗавершении) = Тип("ОписаниеОповещения") Тогда
		Контекст.Вставить("ОповещениеОЗавершении", ОповещениеОЗавершении);
	КонецЕсли;

	Если Контекст.Действие = "ВЫГРУЗИТЬ" Тогда
		ТекстЗаголовка = НСтр("ru = 'Выгрузить таблицы:'");
	ИначеЕсли Контекст.Действие = "ОЧИСТИТЬ" Тогда
		ТекстЗаголовка = НСтр("ru = 'Очистить таблицы:'");
	Иначе
		Возврат;
	КонецЕсли;
	
	КнопкиВопроса = Новый СписокЗначений();
	
	Если ТекущиеДанные <> Неопределено И
		ТекущиеДанные.ТаблицаИнтеграции <> ПредопределенноеЗначение("Перечисление.SUI_ТаблицыИнтеграции.ПользователиТСД") Тогда
		КнопкиВопроса.Добавить("ПоИдентификаторуСтроки", ТекущиеДанные.ТаблицаИнтеграции);
		Контекст.Вставить("ИдентификаторСтроки", Элементы.ДеревоТаблицИнтеграции.ТекущаяСтрока);
	Иначе
		Контекст.Вставить("ИдентификаторСтроки");
	КонецЕсли;
	
	КнопкиВопроса.Добавить("Используемые", НСтр("ru = 'Используемые таблицы'"));
	КнопкиВопроса.Добавить("Модифицированные", НСтр("ru = 'По модифицированным настройкам'"));
	КнопкиВопроса.Добавить("ВыбратьИзСписка", НСтр("ru = 'Выбрать из списка'"));
	КнопкиВопроса.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru = 'Отмена'"));
	
	Оповещение = Новый ОписаниеОповещения("ДействияСТаблицамиИнтеграцииПослеВыбора", ЭтотОбъект, Контекст);
	ПоказатьВопрос(Оповещение, , КнопкиВопроса, 15, КодВозвратаДиалога.Отмена, ТекстЗаголовка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияСТаблицамиИнтеграцииПослеВыбора(РезультатВыбора, Контекст) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Отмена Тогда
		Если Контекст.Свойство("ОповещениеОЗавершении") И ТипЗнч(Контекст.ОповещениеОЗавершении) = Тип("ОписаниеОповещения") Тогда
			ВыполнитьОбработкуОповещения(Контекст.ОповещениеОЗавершении);
		КонецЕсли;
		Возврат;
	КонецЕсли;

	Контекст.Вставить("КонтекстДействия", РезультатВыбора);

	ТаблицыКОбработкеДействием = Новый СписокЗначений();

	Если РезультатВыбора = "ПоИдентификаторуСтроки" И Контекст.ИдентификаторСтроки <> Неопределено Тогда

		ТекущиеДанные = ДеревоТаблицИнтеграции.НайтиПоИдентификатору(Контекст.ИдентификаторСтроки);
		Если ТекущиеДанные <> Неопределено Тогда
			ТаблицыКОбработкеДействием.Добавить(ТекущиеДанные.ТаблицаИнтеграции);
		КонецЕсли;
		
		ТаблицыКОбработкеДействием.ЗаполнитьПометки(Истина);
	
	Иначе
		
		Для Каждого СтрокаДерева Из ДеревоТаблицИнтеграции.ПолучитьЭлементы() Цикл
			
			Если (РезультатВыбора = "Используемые" И Не СтрокаДерева.Используется)
				Или (РезультатВыбора = "Модифицированные" И Не СтрокаДерева.Модифицированность) Или
				СтрокаДерева.ТаблицаИнтеграции = ПредопределенноеЗначение("Перечисление.SUI_ТаблицыИнтеграции.ПользователиТСД") Тогда
				Продолжить;
			КонецЕсли;

			ТаблицыКОбработкеДействием.Добавить(СтрокаДерева.ТаблицаИнтеграции);
			
		КонецЦикла;
		
		Если РезультатВыбора = "Используемые" Или РезультатВыбора = "Модифицированные" Тогда
			ТаблицыКОбработкеДействием.ЗаполнитьПометки(Истина);
		КонецЕсли;
		
		Контекст.Вставить("ПоказатьОтметкуЭлементов");
		
	КонецЕсли;

	Если ЗначениеЗаполнено(ТаблицыКОбработкеДействием) Тогда
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ДействияСТаблицамиИнтеграцииПослеВыбораПродолжить", ЭтотОбъект, Контекст);
		ВыполнитьОбработкуОповещения(ОповещениеОЗавершении, ТаблицыКОбработкеДействием);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Отсутствуют доступные таблицы для выполнения действия.'"));
		Если Контекст.Свойство("ОповещениеОЗавершении") И ТипЗнч(Контекст.ОповещениеОЗавершении) = Тип("ОписаниеОповещения") Тогда
			ВыполнитьОбработкуОповещения(Контекст.ОповещениеОЗавершении, Ложь);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДействияСТаблицамиИнтеграцииПослеВыбораПродолжить(ТаблицыКОбработке, Контекст) Экспорт
	
	Если Не ЗначениеЗаполнено(ТаблицыКОбработке) Тогда
		Если Контекст.Свойство("ОповещениеОЗавершении") И ТипЗнч(Контекст.ОповещениеОЗавершении) = Тип("ОписаниеОповещения") Тогда
			ВыполнитьОбработкуОповещения(Контекст.ОповещениеОЗавершении, Ложь);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если Контекст.Свойство("ПоказатьОтметкуЭлементов") Тогда
		Контекст.Удалить("ПоказатьОтметкуЭлементов");
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ДействияСТаблицамиИнтеграцииПослеВыбораПродолжить", ЭтотОбъект, Контекст);
		ТаблицыКОбработке.ПоказатьОтметкуЭлементов(ОповещениеОЗавершении, НСтр("ru = 'Выберите таблицы'"));
		Возврат;
	КонецЕсли;

	МассивТаблицКОбработке = Новый Массив();
	Для Каждого ТаблицаКОбработке Из ТаблицыКОбработке Цикл

		Если ТаблицаКОбработке.Пометка Тогда
			
			Если ТаблицаКОбработке.Значение = ПредопределенноеЗначение("Перечисление.SUI_ТаблицыИнтеграции.ПользователиТСД") Тогда
				ТаблицаКОбработке.Пометка = Ложь;
				Продолжить;
			КонецЕсли;
			
			МассивТаблицКОбработке.Добавить(ТаблицаКОбработке.Значение);
			
		КонецЕсли;

	КонецЦикла;
	
	Если МассивТаблицКОбработке.Количество() = 0 Тогда
		Если Контекст.Свойство("ОповещениеОЗавершении") И ТипЗнч(Контекст.ОповещениеОЗавершении) = Тип("ОписаниеОповещения") Тогда
			ВыполнитьОбработкуОповещения(Контекст.ОповещениеОЗавершении, Ложь);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	НеиспользуемыеТаблицы = Новый Массив();
	Для Каждого СтрокаДерева Из ДеревоТаблицИнтеграции.ПолучитьЭлементы() Цикл
		
		Если МассивТаблицКОбработке.Найти(СтрокаДерева.ТаблицаИнтеграции) <> Неопределено И
			Не СтрокаДерева.Используется Тогда
			НеиспользуемыеТаблицы.Добавить(СтрокаДерева.ТаблицаИнтеграции);
			СтрокаДерева.Модифицированность = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Контекст.Действие = "ВЫГРУЗИТЬ" Тогда

		МассивТаблицКОбработке = SUI_ОбщегоНазначенияКлиентСервер.РазностьМассивов(МассивТаблицКОбработке, НеиспользуемыеТаблицы);
		
		Для индекс = 0 По НеиспользуемыеТаблицы.ВГраница() Цикл
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				СтрШаблон(НСтр("ru = 'Таблица %1 не используется. Выгрузка для таблицы не будет выполнена.'"), 
				НеиспользуемыеТаблицы[индекс]));
		КонецЦикла;
	
	КонецЕсли;
	
	Если МассивТаблицКОбработке.Количество() = 0 Тогда
		Если Контекст.Свойство("ОповещениеОЗавершении") И ТипЗнч(Контекст.ОповещениеОЗавершении) = Тип("ОписаниеОповещения") Тогда
			ВыполнитьОбработкуОповещения(Контекст.ОповещениеОЗавершении, Ложь);
		КонецЕсли;
		Возврат;
	КонецЕсли;

	ТекстаВопроса = СтрШаблон(НСтр("ru = 'Будет выполнена #ДЕЙСТВИЕ таблиц:
	|
	|%1
	|
	|Продолжить?'"), СтрСоединить(МассивТаблицКОбработке, Символы.ПС));
	
	КнопкиВопроса = Новый СписокЗначений();
	
	Если Контекст.Действие = "ВЫГРУЗИТЬ" Тогда
		ТекстаВопроса = СтрЗаменить(ТекстаВопроса, "#ДЕЙСТВИЕ", "выгрузка");
		КнопкиВопроса.Добавить("ОчиститьИВыгрузить", НСтр("ru = 'Очистить и выгрузить'"));
		КнопкиВопроса.Добавить("Выгрузить", НСтр("ru = 'Выгрузить'"));
	ИначеЕсли Контекст.Действие = "ОЧИСТИТЬ" Тогда
		ТекстаВопроса = СтрЗаменить(ТекстаВопроса, "#ДЕЙСТВИЕ", "очистка");
		КнопкиВопроса.Добавить("Очистить", НСтр("ru = 'Очистить'"));
	Иначе
		Если Контекст.Свойство("ОповещениеОЗавершении") И ТипЗнч(Контекст.ОповещениеОЗавершении) = Тип("ОписаниеОповещения") Тогда
			ВыполнитьОбработкуОповещения(Контекст.ОповещениеОЗавершении, Ложь);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	КнопкиВопроса.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru = 'Отмена'"));
	
	Контекст.Вставить("ТаблицыКОбработке", МассивТаблицКОбработке);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ДействияСТаблицамиИнтеграцииПослеПослеПодтверждения", 
		ЭтотОбъект, Контекст);
	
	ПоказатьВопрос(ОповещениеОЗавершении, ТекстаВопроса, КнопкиВопроса, 15);

КонецПроцедуры

&НаКлиенте
Процедура ДействияСТаблицамиИнтеграцииПослеПослеПодтверждения(Ответ, Контекст) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ДействияСТаблицамиИнтеграцииПослеПослеПодтвержденияЗавершение", 
		ЭтотОбъект, Контекст);
	
	ПараметрыОперации = Новый Структура();
	ПараметрыОперации.Вставить("СписокТаблиц", Контекст.ТаблицыКОбработке);
	
	Если Ответ = "Выгрузить" Или Ответ = "ОчиститьИВыгрузить" Тогда

		Если Ответ = "ОчиститьИВыгрузить" Тогда
			ПараметрыОперации.Вставить("ОчиститьТаблицу", Истина);
		КонецЕсли;
		
		SUI_ИнтеграцияВКонфигурациюКлиент.ЗаписатьВТаблицы(ЭтотОбъект, ПараметрыОперации, ОповещениеОЗавершении);
		
	ИначеЕсли Ответ = "Очистить" Тогда
		SUI_ИнтеграцияВКонфигурациюКлиент.ОчиститьТаблицы(ЭтотОбъект, ПараметрыОперации, ОповещениеОЗавершении);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияСТаблицамиИнтеграцииПослеПослеПодтвержденияЗавершение(Результат, Контекст) Экспорт
	
	Если Результат Тогда
	
		МодифицированностьТаблицИнтеграции = Ложь;
		
		Для Каждого СтрокаДерева Из ДеревоТаблицИнтеграции.ПолучитьЭлементы() Цикл
			
			Если Не СтрокаДерева.Модифицированность Тогда
				Продолжить;
			КонецЕсли;
			
			Если Контекст.ТаблицыКОбработке.Найти(СтрокаДерева.ТаблицаИнтеграции) = Неопределено Тогда
				МодифицированностьТаблицИнтеграции = Истина;
			Иначе
				СтрокаДерева.Модифицированность = Ложь;
			КонецЕсли;
			
		КонецЦикла;
	
		ПодключитьОбработчикОжидания("ОбновитьКоличествоЗаписейВДеревеТаблицИнтеграции", 0.2, Истина);
	
	КонецЕсли;
	
	Если Контекст.Свойство("ОповещениеОЗавершении") И ТипЗнч(Контекст.ОповещениеОЗавершении) = Тип("ОписаниеОповещения") Тогда
		ВыполнитьОбработкуОповещения(Контекст.ОповещениеОЗавершении, Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПользовательскийЗапросЗавершение(ДанныеКонструктора, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(ДанныеКонструктора) <> Тип("ФиксированнаяСтруктура") Тогда
		Возврат;
	КонецЕсли;

	SUI_НастройкиМетаданныхВызовСервера.СохранитьПользовательскийЗапрос(ДанныеКонструктора);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗапросПолученияОстатковИЦен()
	Возврат SUI_НастройкиМетаданныхСервер.ПолучитьЗапросПолученияОстатковИЦен();
КонецФункции

&НаКлиенте
Процедура ОткрытьЗапросПолученияОстатковИЦенЗавершение(ДанныеКонструктора, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(ДанныеКонструктора) <> Тип("ФиксированнаяСтруктура") Тогда
		Возврат;
	КонецЕсли;

	ЗапросПолученияОстатковИЦенПослеЗакрытияНаСервере(ДанныеКонструктора);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗапросПолученияОстатковИЦенПослеЗакрытияНаСервере(ДанныеКонструктора)
	SUI_НастройкиМетаданныхСервер.СохранитьЗапросПолученияОстатковИЦен(ДанныеКонструктора);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемИзменитьМодифицированностьТаблицИнтеграции(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		МодифицированностьТаблицИнтеграции = Ложь;
		Закрыть();
		Возврат;
	ИначеЕсли Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицыКОбработкеДействием = Новый СписокЗначений();
	Для Каждого СтрокаДерева Из ДеревоТаблицИнтеграции.ПолучитьЭлементы() Цикл
			
		Если Не СтрокаДерева.Модифицированность Или
			СтрокаДерева.ТаблицаИнтеграции = ПредопределенноеЗначение("Перечисление.SUI_ТаблицыИнтеграции.ПользователиТСД") Тогда
			Продолжить;
		КонецЕсли;

		ТаблицыКОбработкеДействием.Добавить(СтрокаДерева.ТаблицаИнтеграции);
		
	КонецЦикла;
	
	ТаблицыКОбработкеДействием.ЗаполнитьПометки(Истина);
		
	Контекст = Новый Структура();
	Контекст.Вставить("Действие", "ВЫГРУЗИТЬ");
	Контекст.Вставить("ОповещениеОЗавершении", Новый ОписаниеОповещения(
		"ПередЗакрытиемИзменитьМодифицированностьТаблицИнтеграцииЗавершение", ЭтотОбъект));
		
	ОповещениеВыполнения = Новый ОписаниеОповещения("ДействияСТаблицамиИнтеграцииПослеВыбораПродолжить", ЭтотОбъект, Контекст);
	ВыполнитьОбработкуОповещения(ОповещениеВыполнения, ТаблицыКОбработкеДействием);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемИзменитьМодифицированностьТаблицИнтеграцииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройкиИзФайлаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ОписаниеТипаСписок = Новый ОписаниеТипов("СписокЗначений");
	Если ОписаниеТипаСписок.ПривестиЗначение(Результат).Количество() = 0 Тогда
		Возврат
	КонецЕсли;
	
	МодифицированностьТаблицИнтеграции = Ложь;

	Для Каждого СтрокаДерева Из ДеревоТаблицИнтеграции.ПолучитьЭлементы() Цикл
		
		Если СтрокаДерева.ТаблицаИнтеграции = ПредопределенноеЗначение("Перечисление.SUI_ТаблицыИнтеграции.ПользователиТСД") Тогда
			Продолжить;
		КонецЕсли;
		
		НайденныйРезультат = Результат.НайтиПоЗначению(СтрокаДерева.ТаблицаИнтеграции);
		Если НайденныйРезультат = Неопределено Или Не НайденныйРезультат.Пометка Тогда
			СтрокаДерева.Модифицированность = Ложь;
		Иначе
			СтрокаДерева.Модифицированность = Истина;
			МодифицированностьТаблицИнтеграции = Истина;
		КонецЕсли;
		
	КонецЦикла;

	Если МодифицированностьТаблицИнтеграции Тогда
		ПодключитьОбработчикОжидания("ОбновитьКоличествоЗаписейВДеревеТаблицИнтеграции", 1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПерезаписатьТаблицуИнтеграцииВМУНаСервере(ТаблицаИнтеграции)
	
	РегистрыСведений.SUI_ТаблицыКПерезаписиВМУ.Добавить(ТаблицаИнтеграции);
	ОбщегоНазначения.СообщитьПользователю(СтрШаблон(
		НСтр("ru = 'Таблица %1 будет перезаписана во всех мобильных устройствах.'"), ТаблицаИнтеграции));

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМассивТаблицИнтеграцийИзМассиваКлючейЗаписи(МассивКлючейЗаписи)
	
	МассивТаблицИнтеграций = Новый Массив();
	
	Для индекс = 0 По МассивКлючейЗаписи.ВГраница() Цикл
		
		Если ТипЗнч(МассивКлючейЗаписи[индекс]) = Тип("РегистрСведенийКлючЗаписи.SUI_НастройкиТаблицИнтеграции") И
			МассивКлючейЗаписи[индекс].ТаблицаИнтеграции <> Перечисления.SUI_ТаблицыИнтеграции.ПользователиТСД И
			МассивТаблицИнтеграций.Найти(МассивКлючейЗаписи[индекс].ТаблицаИнтеграции) = Неопределено Тогда
			МассивТаблицИнтеграций.Добавить(МассивКлючейЗаписи[индекс].ТаблицаИнтеграции);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивТаблицИнтеграций;
	
КонецФункции

#КонецОбласти
