
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Версия = Параметры.Версия;
	
	Элементы.Версия.РедактированиеТекста = Не Параметры.ТолькоПросмотр;
	
	Если Не ПустаяСтрока(Параметры.Заголовок) Тогда
		Заголовок = Параметры.Заголовок;
		АвтоЗаголовок = Ложь;
	КонецЕсли;
	
	Версия = SUI_СтроковыеФункцииКлиентСервер.ОбработатьСтрокуВерсии(Версия);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Отказ Или ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		
		Оповещение = Новый ОписаниеОповещения("ПередЗакрытиемПослеПодтвержденияСохранения", ЭтотОбъект);
		ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, ЗавершениеРаботы);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВерсияПриИзменении(Элемент)
	
	Версия = SUI_СтроковыеФункцииКлиентСервер.ОбработатьСтрокуВерсии(Версия);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаСохранить(Команда)

	Оповещение = Новый ОписаниеОповещения("ПередЗакрытиемПослеПодтвержденияСохранения", ЭтотОбъект);
	ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПередЗакрытиемПослеПодтвержденияСохранения(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Модифицированность = Ложь;
	
	ОповеститьОВыборе(SUI_СтроковыеФункцииКлиентСервер.ОбработатьСтрокуВерсии(Версия));

КонецПроцедуры

#КонецОбласти
