
#Область ПрограммныйИнтерфейс

Функция ПредопределенныеАлгоритмыНормализацииЗначенияШтрихкода() Экспорт
	
	ПредопределенныеАлгоритмы = Новый СписокЗначений();
	ПредопределенныеАлгоритмы.Добавить(
		ПредопределенныеАлгоритмыНормализацииЗначенияШтрихкодаТорговлей11(),
		ПредопределенноеЗначение("Перечисление.SUI_ПредопределенныеНастройкиПодсистемы.УправлениеТорговлей11"));

	Возврат ПредопределенныеАлгоритмы;
	
КонецФункции

Функция ПредопределенныеАлгоритмыСозданияШтрихкодаУпаковки() Экспорт
	
	ПредопределенныеАлгоритмы = Новый СписокЗначений();
	ПредопределенныеАлгоритмы.Добавить(
		ПредопределенныеАлгоритмыСозданияШтрихкодаУпаковкиТорговлей11(),
		ПредопределенноеЗначение("Перечисление.SUI_ПредопределенныеНастройкиПодсистемы.УправлениеТорговлей11"));

	Возврат ПредопределенныеАлгоритмы;
	
КонецФункции

// Выполняет проверку на соответствие алфавиту кода маркировки.
//
// Параметры:
//  Штрихкод - Строка - Штрихкод упаковки.
//  Алфавит - Строка - перечень допустимых символов.
// Возвращаемое значение:
//  Булево - Истина, если код соответствует алфавиту.
Функция ШтрихкодСоответствуетАлфавиту(Штрихкод, Алфавит) Экспорт
	
	ДлинаКода = СтрДлина(Штрихкод);
	
	Индекс = 1;
	Пока Индекс <= ДлинаКода Цикл
		
		ПроверяемыйСимвол = Сред(Штрихкод, Индекс, 1);
		
		Если СтрНайти(Алфавит, ПроверяемыйСимвол) = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ИмяСобытия() Экспорт
	Возврат НСтр("ru = 'Штрихкоды упаковок'");
КонецФункции

Функция ПредопределенныеАлгоритмыНормализацииЗначенияШтрихкодаТорговлей11()
	
	Возврат "РезультатРазбора = РазборКодаМаркировкиИССлужебный.РазобратьКодМаркировки(ЗначениеШтрихкода);
	|
	|Если ЗначениеЗаполнено(РезультатРазбора) Тогда
	|	ЗначениеШтрихкода = РезультатРазбора.НормализованныйКодМаркировки;
	|Иначе
	|	ЗначениеШтрихкода = """";
	|КонецЕсли;";
	
КонецФункции

Функция ПредопределенныеАлгоритмыСозданияШтрихкодаУпаковкиТорговлей11()
	
	Возврат "ШтрихкодУпаковки = Справочники.ШтрихкодыУпаковокТоваров.ПолучитьПоЗначениюШтрихкода(ЗначениеШтрихкода);
	|
	|Если Не ЗначениеЗаполнено(ШтрихкодУпаковки) Тогда
	|	
	|	РезультатРазбора = РазборКодаМаркировкиИССлужебный.РазобратьКодМаркировки(ЗначениеШтрихкода);
	|
	|	Если ЗначениеЗаполнено(РезультатРазбора) Тогда
	|
	|		СтруктураСоздания = Справочники.ШтрихкодыУпаковокТоваров.СтруктураСозданияШтрихкодаУпаковки();
	|		СтруктураСоздания.Номенклатура = Номенклатура;
	|		СтруктураСоздания.Характеристика = Характеристика;
	|		СтруктураСоздания.Серия = Серия;
	|		СтруктураСоздания.Упаковка = Упаковка;
	|		СтруктураСоздания.Штрихкод = РезультатРазбора.НормализованныйКодМаркировки;
	|		СтруктураСоздания.ТипШтрихкода = РезультатРазбора.ТипШтрихкода;
	|
	|		Если РезультатРазбора.ВидУпаковки = ПредопределенноеЗначение(""Перечисление.ВидыУпаковокИС.Потребительская"") Тогда
	|			СтруктураСоздания.ТипУпаковки = ПредопределенноеЗначение(""Перечисление.ТипыУпаковок.МаркированныйТовар"");
	|		ИначеЕсли РезультатРазбора.ВидУпаковки = ПредопределенноеЗначение(""Перечисление.ВидыУпаковокИС.Групповая"") Тогда
	|			СтруктураСоздания.ТипУпаковки = ПредопределенноеЗначение(""Перечисление.ТипыУпаковок.МонотоварнаяУпаковка"");
	|		ИначеЕсли РезультатРазбора.ВидУпаковки = ПредопределенноеЗначение(""Перечисление.ВидыУпаковокИС.Логистическая"") И
	|			РезультатРазбора.СоставКодаМаркировки.Свойство(""GTIN"") И
	|			ЗначениеЗаполнено(РезультатРазбора.СоставКодаМаркировки.GTIN) Тогда
	|			СтруктураСоздания.ТипУпаковки = ПредопределенноеЗначение(""Перечисление.ТипыУпаковок.МонотоварнаяУпаковка"");
	|		Иначе
	|			СтруктураСоздания.ТипУпаковки = ПредопределенноеЗначение(""Перечисление.ТипыУпаковок.МультитоварнаяУпаковка"");
	|		КонецЕсли;
	|
	|		ДополнительныеПараметрыСоздания = Справочники.ШтрихкодыУпаковокТоваров.ДополнительныеПараметрыСозданияШтрихкодовУпаковок();
	|
	|		ШтрихкодУпаковки =  Справочники.ШтрихкодыУпаковокТоваров.СоздатьШтрихкодУпаковки(СтруктураСоздания, , , , ДополнительныеПараметрыСоздания);
	|
	|	КонецЕсли;
	|
	|КонецЕсли;";
	
КонецФункции

#КонецОбласти
