
#Область ПрограммныйИнтерфейс

// Выполняет проверку на соответствие алфавиту кода маркировки.
//
// Параметры:
//  Штрихкод - Строка - Штрихкод упаковки.
//  Алфавит - Строка - перечень допустимых символов.
// Возвращаемое значение:
//  Булево - Истина, если код соответствует алфавиту.
Функция ШтрихкодСоответствуетАлфавиту(Штрихкод, Алфавит) Экспорт
	
	ДлинаКода = СтрДлина(Штрихкод);
	
	Индекс = 1;
	Пока Индекс <= ДлинаКода Цикл
		
		ПроверяемыйСимвол = Сред(Штрихкод, Индекс, 1);
		
		Если СтрНайти(Алфавит, ПроверяемыйСимвол) = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ИмяСобытия() Экспорт
	Возврат НСтр("ru = 'Штрихкоды упаковок'");
КонецФункции

Функция ПредопределенныеАлгоритмыНормализацииЗначенияШтрихкода() Экспорт
	
	ПредопределенныеАлгоритмы = Новый СписокЗначений();
	ПредопределенныеАлгоритмы.Добавить(
		ПредопределенныеАлгоритмыНормализацииЗначенияШтрихкодаТорговлей11(),
		ПредопределенноеЗначение("Перечисление.SUI_ПредопределенныеНастройкиПодсистемы.УправлениеТорговлей11"));
	ПредопределенныеАлгоритмы.Добавить(
		ПредопределенныеАлгоритмыНормализацииЗначенияШтрихкодаУНФ(),
		ПредопределенноеЗначение("Перечисление.SUI_ПредопределенныеНастройкиПодсистемы.УправлениеНашейФирмой"));
	
	Возврат ПредопределенныеАлгоритмы;
	
КонецФункции

Функция ПредопределенныеАлгоритмыСозданияШтрихкодаУпаковки() Экспорт
	
	ПредопределенныеАлгоритмы = Новый СписокЗначений();
	ПредопределенныеАлгоритмы.Добавить(
		ПредопределенныеАлгоритмыСозданияШтрихкодаУпаковкиТорговлей11(),
		ПредопределенноеЗначение("Перечисление.SUI_ПредопределенныеНастройкиПодсистемы.УправлениеТорговлей11"));

	Возврат ПредопределенныеАлгоритмы;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПредопределенныеАлгоритмыНормализацииЗначенияШтрихкодаТорговлей11()
	
	Возврат "ТекстОшибки = """";
	|ПримечаниеКРезультатуРазбора = Новый Структура();
	|РезультатРазбора = РазборКодаМаркировкиИССлужебный.РазобратьКодМаркировки(ЗначениеШтрихкода, , ПримечаниеКРезультатуРазбора);
	|
	|Если РезультатРазбора = Неопределено Тогда
	|	
	|	Если ПримечаниеКРезультатуРазбора.ИдентификаторОшибки = ""КодМаркировкиСоответствуетНесколькимШаблонам"" И
	|		ПримечаниеКРезультатуРазбора.РезультатРазбора.Количество() > 0 Тогда
	|		
	|		Если ЗначениеЗаполнено(Номенклатура) Тогда
	|			
	|			ОсобенностьУчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, ""ОсобенностьУчета"");
	|			ВидПродукции = ИнтеграцияИСУТКлиентСервер.ОсобенностьУчетаПоВидуПродукции(ОсобенностьУчета);
	|			
	|			Если ЗначениеЗаполнено(ВидПродукции) Тогда
	|				
	|				Для индекс = 0 По ПримечаниеКРезультатуРазбора.РезультатРазбора.ВГраница() Цикл
	|					
	|					Если ПримечаниеКРезультатуРазбора.РезультатРазбора[индекс].ВидыПродукции.Найти(ВидПродукции) <> Неопределено Тогда
	|						РезультатРазбора = ПримечаниеКРезультатуРазбора.РезультатРазбора[индекс];
	|						Прервать;
	|					КонецЕсли;
	|					
	|				КонецЦикла;
	|				
	|				Если РезультатРазбора = Неопределено Тогда
	|					ТекстОшибки = НСтр(""ru = 'В результатах разбора отсутствуют данные для номенклатуры """"%1"""" по виду продукции """"%2"""".'"");
	|					ТекстОшибки = СтрШаблон(ТекстОшибки, Номенклатура, ВидПродукции);
	|				КонецЕсли;
	|				
	|			Иначе
	|				ТекстОшибки = СтрШаблон(НСтр(""ru = 'Для номенклатуры """"%1"""" не удалось определить вид продукции.'""), Номенклатура);
	|			КонецЕсли;
	|			
	|		Иначе
	|			ТекстОшибки = НСтр(""ru = 'Не удалось определить номенклатуру.'"");
	|		КонецЕсли;
	|		
	|		ТекстОшибки = СтрШаблон(""%1 %2"", ПримечаниеКРезультатуРазбора.ТекстОшибки, ТекстОшибки);
	|		
	|	ИначеЕсли ПримечаниеКРезультатуРазбора.Свойство(""ТекстОшибки"") И ЗначениеЗаполнено(ПримечаниеКРезультатуРазбора.ТекстОшибки) Тогда
	|		ТекстОшибки = ПримечаниеКРезультатуРазбора.ТекстОшибки;
	|	КонецЕсли;
	|	
	|КонецЕсли;
	|
	|Если РезультатРазбора = Неопределено Тогда
	|	
	|	Если ПустаяСтрока(ТекстОшибки) Тогда
	|		ТекстОшибки = НСтр(""ru = 'Не удалось получить результаты разбора значения штрихкода кода маркировки.'"");
	|	КонецЕсли;
	|	
	|	ТекстОшибки = СтрШаблон(НСтр(""ru = 'Нормализация значения штрихкода: %1 (%2).'""), ТекстОшибки, ЗначениеШтрихкода);
	|	SUI_ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
	|	
	|КонецЕсли;
	|
	|ЗначениеШтрихкода = ?(ЗначениеЗаполнено(РезультатРазбора), РезультатРазбора.НормализованныйКодМаркировки, """");";
	
КонецФункции

Функция ПредопределенныеАлгоритмыНормализацииЗначенияШтрихкодаУНФ()
	
	Возврат "ТекстОшибки = """";
	|ПримечаниеКРезультатуРазбора = Новый Структура();
	|РезультатРазбора = РазборКодаМаркировкиИССлужебный.РазобратьКодМаркировки(ЗначениеШтрихкода, , ПримечаниеКРезультатуРазбора);
	|
	|Если РезультатРазбора = Неопределено Тогда
	|	
	|	Если ПримечаниеКРезультатуРазбора.ИдентификаторОшибки = ""КодМаркировкиСоответствуетНесколькимШаблонам"" И
	|		ПримечаниеКРезультатуРазбора.РезультатРазбора.Количество() > 0 Тогда
	|		
	|		Если ЗначениеЗаполнено(Номенклатура) Тогда
	|			
	|			ВидПродукции = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, ""ВидПродукцииИС"");
	|			
	|			Если ЗначениеЗаполнено(ВидПродукции) Тогда
	|				
	|				Для индекс = 0 По ПримечаниеКРезультатуРазбора.РезультатРазбора.ВГраница() Цикл
	|					
	|					Если ПримечаниеКРезультатуРазбора.РезультатРазбора[индекс].ВидыПродукции.Найти(ВидПродукции) <> Неопределено Тогда
	|						РезультатРазбора = ПримечаниеКРезультатуРазбора.РезультатРазбора[индекс];
	|						Прервать;
	|					КонецЕсли;
	|					
	|				КонецЦикла;
	|				
	|				Если РезультатРазбора = Неопределено Тогда
	|					ТекстОшибки = НСтр(""ru = 'В результатах разбора отсутствуют данные для номенклатуры """"%1"""" по виду продукции """"%2"""".'"");
	|					ТекстОшибки = СтрШаблон(ТекстОшибки, Номенклатура, ВидПродукции);
	|				КонецЕсли;
	|				
	|			Иначе
	|				ТекстОшибки = СтрШаблон(НСтр(""ru = 'Для номенклатуры """"%1"""" не удалось определить вид продукции.'""), Номенклатура);
	|			КонецЕсли;
	|			
	|		Иначе
	|			ТекстОшибки = НСтр(""ru = 'Не удалось определить номенклатуру.'"");
	|		КонецЕсли;
	|		
	|		ТекстОшибки = СтрШаблон(""%1 %2"", ПримечаниеКРезультатуРазбора.ТекстОшибки, ТекстОшибки);
	|		
	|	ИначеЕсли ПримечаниеКРезультатуРазбора.Свойство(""ТекстОшибки"") И ЗначениеЗаполнено(ПримечаниеКРезультатуРазбора.ТекстОшибки) Тогда
	|		ТекстОшибки = ПримечаниеКРезультатуРазбора.ТекстОшибки;
	|	КонецЕсли;
	|	
	|КонецЕсли;
	|
	|Если РезультатРазбора = Неопределено Тогда
	|	
	|	Если ПустаяСтрока(ТекстОшибки) Тогда
	|		ТекстОшибки = НСтр(""ru = 'Не удалось получить результаты разбора значения штрихкода кода маркировки.'"");
	|	КонецЕсли;
	|	
	|	ТекстОшибки = СтрШаблон(НСтр(""ru = 'Нормализация значения штрихкода: %1 (%2).'""), ТекстОшибки, ЗначениеШтрихкода);
	|	SUI_ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
	|	
	|КонецЕсли;
	|
	|ЗначениеШтрихкода = ?(ЗначениеЗаполнено(РезультатРазбора), РезультатРазбора.НормализованныйКодМаркировки, """");";
	
КонецФункции

Функция ПредопределенныеАлгоритмыСозданияШтрихкодаУпаковкиТорговлей11()
	
	Возврат "ШтрихкодУпаковки = Справочники.ШтрихкодыУпаковокТоваров.ПолучитьПоЗначениюШтрихкода(ЗначениеШтрихкода);
	|
	|Если ВложенныеШтрихкоды.Количество() > 0 Тогда
	|	НайденныеШтрихкодыУпаковок = ШтрихкодированиеИС.ШтрихкодыУпаковок(ВложенныеШтрихкоды);
	|	ВложенныеШтрихкодыУпаковок = НайденныеШтрихкодыУпаковок.ВыгрузитьКолонку(""Ссылка"");
	|Иначе
	|	ВложенныеШтрихкодыУпаковок = Новый Массив();
	|КонецЕсли;
	|
	|Если ШтрихкодУпаковки <> Неопределено Тогда
	|	
	|	РезультатЗапросаВложенныеШтрихкоды = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ШтрихкодУпаковки, ""ВложенныеШтрихкоды.Штрихкод"");
	|	ВыборкаВложенных = РезультатЗапросаВложенныеШтрихкоды.Выбрать();
	|	
	|	ОбновитьВложенныеШтрихкоды = (ВложенныеШтрихкодыУпаковок.Количество() <> ВыборкаВложенных.Количество());
	|	
	|	Если Не ОбновитьВложенныеШтрихкоды Тогда
	|		
	|		Для индекс = 0 По ВложенныеШтрихкодыУпаковок.ВГраница() Цикл
	|			
	|			ПараметрыОтбора = Новый Структура();
	|			ПараметрыОтбора.Вставить(""Штрихкод"", ВложенныеШтрихкодыУпаковок[индекс]);
	|			
	|			ВыборкаВложенных.Сбросить();
	|			ОбновитьВложенныеШтрихкоды = Не ВыборкаВложенных.НайтиСледующий(ПараметрыОтбора);
	|			
	|			Если ОбновитьВложенныеШтрихкоды Тогда
	|				Прервать;
	|			КонецЕсли;
	|			
	|		КонецЦикла;
	|		
	|	КонецЕсли;
	|	
	|	Если ОбновитьВложенныеШтрихкоды Тогда
	|		
	|		ШтрихкодУпаковкиОбъект = ШтрихкодУпаковки.ПолучитьОбъект();
	|		
	|		Для индекс = 0 По ВложенныеШтрихкодыУпаковок.ВГраница() Цикл
	|			
	|			СтрокаВложенныеШтрихкоды = ШтрихкодУпаковкиОбъект.ВложенныеШтрихкоды.Найти(ВложенныеШтрихкодыУпаковок[индекс], ""Штрихкод"");
	|			
	|			Если СтрокаВложенныеШтрихкоды = Неопределено Тогда
	|				
	|				СтрокаВложенныеШтрихкоды = ШтрихкодУпаковкиОбъект.ВложенныеШтрихкоды.Добавить();
	|				СтрокаВложенныеШтрихкоды.Штрихкод = ШтрихкодУпаковки;
	|				
	|			КонецЕсли;
	|			
	|		КонецЦикла;
	|		
	|		ПараметрыНоменклатуры = Справочники.ШтрихкодыУпаковокТоваров.ПараметрыНоменклатурыВложенныхШтрихкодов(ШтрихкодУпаковки);
	|		
	|		ЗаполнитьЗначенияСвойств(ШтрихкодУпаковкиОбъект, ПараметрыНоменклатуры);
	|		
	|		ШтрихкодУпаковкиОбъект.Записать();
	|		
	|	КонецЕсли;
	|	
	|Иначе
	|	
	|	НастройкиРазбораКодаМаркировки = РазборКодаМаркировкиИССлужебный.НастройкиРазбораКодаМаркировки(, Истина);
	|	ВидыПродукции = НастройкиРазбораКодаМаркировки.ДоступныеВидыПродукции;
	|	
	|	ПримечаниеКРазбору = Новый Структура;
	|	РезультатРазбора = РазборКодаМаркировкиИССлужебный.РазобратьКодМаркировки(ЗначениеШтрихкода, ВидыПродукции, ПримечаниеКРазбору);
	|	
	|	Если РезультатРазбора = Неопределено Тогда
	|		ТекстОшибки = НСтр(""ru = 'Ошибка разбора штрихкода маркировки %1
	|		|%2'"");
	|		ТекстОшибки = СтрШаблон(ТекстОшибки, ЗначениеШтрихкода, ПримечаниеКРазбору.ТекстОшибки);
	|		ВызватьИсключение ТекстОшибки;
	|	КонецЕсли;
	|	
	|	СтруктураСоздания = Справочники.ШтрихкодыУпаковокТоваров.СтруктураСозданияШтрихкодаУпаковки();
	|	СтруктураСоздания.Номенклатура = Номенклатура;
	|	СтруктураСоздания.Характеристика = Характеристика;
	|	СтруктураСоздания.Серия = Серия;
	|	СтруктураСоздания.Упаковка = Упаковка;
	|	СтруктураСоздания.Штрихкод = РезультатРазбора.НормализованныйКодМаркировки;
	|	СтруктураСоздания.ТипШтрихкода = РезультатРазбора.ТипШтрихкода;
	|	СтруктураСоздания.ТипУпаковки = Перечисления.ТипыУпаковок.МаркированныйТовар;
	|	
	|	Если РезультатРазбора.ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая Или
	|		РезультатРазбора.ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая Тогда
	|		СтруктураСоздания.ТипУпаковки = Перечисления.ТипыУпаковок.МонотоварнаяУпаковка;
	|	КонецЕсли;
	|	
	|	Если ВложенныеШтрихкодыУпаковок.Количество() > 0 Тогда
	|		
	|		ТаблицаВложенныхШтрихкодов = Новый ТаблицаЗначений();
	|		ТаблицаВложенныхШтрихкодов.Колонки.Добавить(""Штрихкод"");
	|		
	|		СтруктураОбъекта = Новый Структура(""ТипУпаковки,Номенклатура,Характеристика,Упаковка,Серия"");
	|		ЗаполнитьЗначенияСвойств(СтруктураОбъекта, СтруктураСоздания);
	|		СтруктураОбъекта.Вставить(""ВложенныеШтрихкоды"", ТаблицаВложенныхШтрихкодов);
	|		
	|		Для индекс = 0 По ВложенныеШтрихкодыУпаковок.ВГраница() Цикл
	|			
	|			СтрокаВложенныхОбъекта = ТаблицаВложенныхШтрихкодов.Добавить();
	|			СтрокаВложенныхОбъекта.Штрихкод = ВложенныеШтрихкодыУпаковок[индекс];
	|			
	|		КонецЦикла;
	|		
	|		ПараметрыНоменклатуры = Справочники.ШтрихкодыУпаковокТоваров.ПараметрыНоменклатурыВложенныхШтрихкодов(СтруктураОбъекта);
	|		
	|		ЗаполнитьЗначенияСвойств(СтруктураСоздания, ПараметрыНоменклатуры);
	|		
	|	КонецЕсли;
	|	
	|	ДополнительныеПараметрыСоздания = Справочники.ШтрихкодыУпаковокТоваров
	|		.ДополнительныеПараметрыСозданияШтрихкодовУпаковок();
	|	
	|	ШтрихкодУпаковки = Справочники.ШтрихкодыУпаковокТоваров.СоздатьШтрихкодУпаковки(СтруктураСоздания, 
	|		ВложенныеШтрихкодыУпаковок, , , ДополнительныеПараметрыСоздания);
	|	
	|КонецЕсли;";
	
КонецФункции

#КонецОбласти
