
#Область ПрограммныйИнтерфейс

// Выполняет проверку на соответствие алфавиту кода маркировки.
//
// Параметры:
//  Штрихкод - Строка - Штрихкод упаковки.
//  Алфавит - Строка - перечень допустимых символов.
// Возвращаемое значение:
//  Булево - Истина, если код соответствует алфавиту.
Функция ШтрихкодСоответствуетАлфавиту(Штрихкод, Алфавит) Экспорт
	
	ДлинаКода = СтрДлина(Штрихкод);
	
	Индекс = 1;
	Пока Индекс <= ДлинаКода Цикл
		
		ПроверяемыйСимвол = Сред(Штрихкод, Индекс, 1);
		
		Если СтрНайти(Алфавит, ПроверяемыйСимвол) = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ИмяСобытия() Экспорт
	Возврат НСтр("ru = 'Штрихкоды упаковок'");
КонецФункции

Функция ПредопределенныеАлгоритмыНормализацииЗначенияШтрихкода() Экспорт
	
	ПредопределенныеАлгоритмы = Новый СписокЗначений();
	ПредопределенныеАлгоритмы.Добавить(
		ПредопределенныеАлгоритмыНормализацииЗначенияШтрихкодаТорговлей11(),
		ПредопределенноеЗначение("Перечисление.SUI_ПредопределенныеНастройкиПодсистемы.УправлениеТорговлей11"));

	Возврат ПредопределенныеАлгоритмы;
	
КонецФункции

Функция ПредопределенныеАлгоритмыСозданияШтрихкодаУпаковки() Экспорт
	
	ПредопределенныеАлгоритмы = Новый СписокЗначений();
	ПредопределенныеАлгоритмы.Добавить(
		ПредопределенныеАлгоритмыСозданияШтрихкодаУпаковкиТорговлей11(),
		ПредопределенноеЗначение("Перечисление.SUI_ПредопределенныеНастройкиПодсистемы.УправлениеТорговлей11"));

	Возврат ПредопределенныеАлгоритмы;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПредопределенныеАлгоритмыНормализацииЗначенияШтрихкодаТорговлей11()
	
	Возврат "РезультатРазбора = РазборКодаМаркировкиИССлужебный.РазобратьКодМаркировки(ЗначениеШтрихкода);
	|ЗначениеШтрихкода = ?(ЗначениеЗаполнено(РезультатРазбора), РезультатРазбора.НормализованныйКодМаркировки, """");";
	
КонецФункции

Функция ПредопределенныеАлгоритмыСозданияШтрихкодаУпаковкиТорговлей11()
	
	Возврат "ШтрихкодУпаковки = Справочники.ШтрихкодыУпаковокТоваров.ПолучитьПоЗначениюШтрихкода(ЗначениеШтрихкода);
	|
	|Если Не ЗначениеЗаполнено(ШтрихкодУпаковки) Тогда
	|	
	|	РезультатРазбора = РазборКодаМаркировкиИССлужебный.РазобратьКодМаркировки(ЗначениеШтрихкода);
	|	
	|	Если ЗначениеЗаполнено(РезультатРазбора) Тогда
	|		
	|		СтруктураСоздания = Справочники.ШтрихкодыУпаковокТоваров.СтруктураСозданияШтрихкодаУпаковки();
	|		СтруктураСоздания.Номенклатура = Номенклатура;
	|		СтруктураСоздания.Характеристика = Характеристика;
	|		СтруктураСоздания.Серия = Серия;
	|		СтруктураСоздания.Упаковка = Упаковка;
	|		СтруктураСоздания.Штрихкод = РезультатРазбора.НормализованныйКодМаркировки;
	|		СтруктураСоздания.ТипШтрихкода = РезультатРазбора.ТипШтрихкода;
	|		СтруктураСоздания.ТипУпаковки = Перечисления.ТипыУпаковок.МаркированныйТовар;
	|		
	|		ДополнительныеПараметрыСоздания = Справочники.ШтрихкодыУпаковокТоваров
	|			.ДополнительныеПараметрыСозданияШтрихкодовУпаковок();
	|		
	|		ШтрихкодУпаковки =  Справочники.ШтрихкодыУпаковокТоваров.СоздатьШтрихкодУпаковки(СтруктураСоздания, , , , 
	|			ДополнительныеПараметрыСоздания);
	|		
	|	КонецЕсли;
	|	
	|КонецЕсли;
	|
	|ШтрихкодТранспортнойУпаковки = Справочники.ШтрихкодыУпаковокТоваров.ПолучитьДанныеУпаковкиПоЗначениюШтрихкода(
	|	ЗначениеШтрихкодаТранспортнойУпаковки);
	|
	|Если ЗначениеЗаполнено(ШтрихкодТранспортнойУпаковки) Тогда
	|	
	|	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ШтрихкодТранспортнойУпаковки, 
	|		""ТипУпаковки,ВложенныеШтрихкоды.Штрихкод"");
	|	
	|	Если ЗначенияРеквизитов.ТипУпаковки = Перечисления.ТипыУпаковок.МонотоварнаяУпаковка Или
	|		ЗначенияРеквизитов.ТипУпаковки = Перечисления.ТипыУпаковок.МонотоварнаяУпаковка Тогда
	|		
	|		Если ЗначениеЗаполнено(ШтрихкодУпаковки) Тогда
	|			
	|			РезультатЗапроса = ЗначенияРеквизитов.ВложенныеШтрихкодыШтрихкод;
	|			
	|			Если РезультатЗапроса.Пустой() Тогда
	|				ДобавитьВложенныйШтрихкод = Истина;
	|			Иначе
	|				
	|				Выборка = РезультатЗапроса.Выбрать();
	|				
	|				ПараметрыОтбора = Новый Структура();
	|				ПараметрыОтбора.Вставить(""Штрихкод"", ШтрихкодУпаковки);
	|				
	|				ДобавитьВложенныйШтрихкод = Выборка.НайтиСледующий(ПараметрыОтбора);
	|				
	|			КонецЕсли;
	|			
	|			Если ДобавитьВложенныйШтрихкод Тогда
	|				
	|				ШтрихкодТранспортнойУпаковкиОбъект = ШтрихкодТранспортнойУпаковки.ПолучитьОбъект();
	|				
	|				НоваяСтрокаВложенныеШтрихкоды = ШтрихкодТранспортнойУпаковкиОбъект.ВложенныеШтрихкоды.Добавить();
	|				НоваяСтрокаВложенныеШтрихкоды.Штрихкод = ШтрихкодУпаковки;
	|				
	|				ШтрихкодТранспортнойУпаковкиОбъект.Записать();
	|				
	|			КонецЕсли;
	|			
	|		КонецЕсли;
	|		
	|	Иначе
	|		ШтрихкодТранспортнойУпаковки = Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка();
	|	КонецЕсли;
	|	
	|Иначе
	|	
	|	РезультатРазбора = РазборКодаМаркировкиИССлужебный.РазобратьКодМаркировки(ЗначениеШтрихкодаТранспортнойУпаковки);
	|	
	|	Если ЗначениеЗаполнено(РезультатРазбора) Тогда
	|		
	|		СтруктураСоздания = Справочники.ШтрихкодыУпаковокТоваров.СтруктураСозданияШтрихкодаУпаковки();
	|		СтруктураСоздания.Штрихкод = РезультатРазбора.НормализованныйКодМаркировки;
	|		СтруктураСоздания.ТипШтрихкода = РезультатРазбора.ТипШтрихкода;
	|		
	|		Если РезультатРазбора.ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая И
	|			РезультатРазбора.СоставКодаМаркировки.Свойство(""GTIN"") И
	|			ЗначениеЗаполнено(РезультатРазбора.СоставКодаМаркировки.GTIN) Тогда
	|			СтруктураСоздания.ТипУпаковки = Перечисления.ТипыУпаковок.МонотоварнаяУпаковка;
	|		Иначе
	|			СтруктураСоздания.ТипУпаковки = Перечисления.ТипыУпаковок.МультитоварнаяУпаковка;
	|		КонецЕсли;
	|		
	|		ДополнительныеПараметрыСоздания = Справочники.ШтрихкодыУпаковокТоваров
	|			.ДополнительныеПараметрыСозданияШтрихкодовУпаковок();
	|		
	|		ВложенныеШтрихкоды = ?(ЗначениеЗаполнено(ШтрихкодУпаковки),
	|			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ШтрихкодУпаковки),
	|			Неопределено);
	|		
	|		ШтрихкодТранспортнойУпаковки = Справочники.ШтрихкодыУпаковокТоваров.СоздатьШтрихкодУпаковки(
	|			СтруктураСоздания, ВложенныеШтрихкоды, , , ДополнительныеПараметрыСоздания);
	|		
	|	КонецЕсли;
	|	
	|КонецЕсли;";
	
КонецФункции

#КонецОбласти
