
#Область ПрограммныйИнтерфейс

// Привести строку к разрешенным символам.
// 
// Параметры:
//  СтрокаОбработки - Строка - Строка обработки
//  РазрешенныеСимволы - Строка - Разрешенные символы
//  СтрокаЗамены - Строка - Строка замены
// 
// Возвращаемое значение:
//  Строка - Результат
Функция ПривестиСтрокуКРазрешеннымСимволам(Знач СтрокаОбработки, РазрешенныеСимволы, СтрокаЗамены = "") Экспорт
	
	Результат = "";
	
	ДлинаСтроки = СтрДлина(СтрокаОбработки);
	
	Для Индекс = 1 По ДлинаСтроки Цикл
		
		ПроверяемыйСимвол = Сред(СтрокаОбработки, Индекс, 1);
		
		Если СтрНайти(РазрешенныеСимволы, ПроверяемыйСимвол) = 0 Тогда
			Результат = Результат + СтрокаЗамены;
		Иначе
			Результат = Результат + ПроверяемыйСимвол;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Алфавит цифры.
// 
// Возвращаемое значение:
//  Строка - Алфавит цифры
Функция АлфавитЦифры() Экспорт
	Возврат "0123456789";
КонецФункции

// Алфавит буквы русские.
// 
// Параметры:
//  Прописные - Булево - Прописные
//  Строчные - Булево - Строчные
// 
// Возвращаемое значение:
//  Строка - Алфавит буквы русские
Функция АлфавитБуквыРусские(Прописные = Истина, Строчные = Истина) Экспорт
	
	Алфавит = "";
	
	Если Прописные Тогда
		Алфавит = Алфавит + "АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ";
	КонецЕсли;
	
	Если Строчные Тогда
		Алфавит = Алфавит + "абвгдеёжзийклмнопрстуфхцчшщъыьэюя";
	КонецЕсли;
	
	Возврат Алфавит;
	
КонецФункции

// Алфавит буквы латинские.
// 
// Параметры:
//  Прописные - Булево - Прописные
//  Строчные - Булево - Строчные
// 
// Возвращаемое значение:
//  Строка - Алфавит буквы латинские
Функция АлфавитБуквыЛатинские(Прописные = Истина, Строчные = Истина) Экспорт
	
	Алфавит = "";
	
	Если Прописные Тогда
		Алфавит = Алфавит + "ABCDEFGHIJKLMNOPQRSTUVWXYZ";
	КонецЕсли;
	
	Если Строчные Тогда
		Алфавит = Алфавит + "abcdefghijklmnopqrstuvwxyz";
	КонецЕсли;
	
	Возврат Алфавит;
	
КонецФункции

// Разобрать строку ключ-значение в соответствие.
// 
// Параметры:
//  РазбираемаяСтрока - Строка - Разбираемая строка
//  РазделительСтрок - Строка - Разделитель строк
//  РазделительКлючЗначение - Строка - Разделитель ключ значение
// 
// Возвращаемое значение:
//  Соответствие из Строка - Разобрать строку в соответствие
Функция РазобратьСтрокуВСоответствие(Знач РазбираемаяСтрока, РазделительСтрок = ",", РазделительКлючЗначение = "=") Экспорт 
	
	СтрокаСоответствие = Новый Соответствие;   
	
	ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка");
	Если Не ПустаяСтрока(ОписаниеТипаСтрока.ПривестиЗначение(РазбираемаяСтрока)) Тогда

		МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(
			РазбираемаяСтрока, РазделительСтрок, Истина, Истина);
	
		Для Каждого эМассивСтрок Из МассивСтрок Цикл
			
			МассивПодстрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(
				эМассивСтрок, РазделительКлючЗначение, Истина, Истина);
			
			Если МассивПодстрок.Количество() = 2 Тогда
				СтрокаСоответствие.Вставить(СокрЛП(МассивПодстрок[0]));
			ИначеЕсли МассивПодстрок.Количество() = 2 Тогда
				СтрокаСоответствие.Вставить(СокрЛП(МассивПодстрок[0]), СокрЛП(МассивПодстрок[1]));			
			КонецЕсли;
			
		КонецЦикла;
	
	КонецЕсли;
	
	Возврат СтрокаСоответствие;
	
КонецФункции  

// Обработать строку версии.
// 
// Параметры:
//  СтрокаВерсии - Строка - Строка версии
//  ВключатьНомерСборки - Булево - Включать номер сборки
// 
// Возвращаемое значение:
//  Строка - Строка версии
Функция ОбработатьСтрокуВерсии(СтрокаВерсии) Экспорт

	ЧастиВерсии = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрЗаменить(СтрокаВерсии, ",", "."), "-", Истина, Истина);
	
	РезультатОбработки = Новый Массив();
	
	Если ЧастиВерсии.ВГраница() >= 0 Тогда

		Для индекс = 0 По ЧастиВерсии.ВГраница() Цикл
			
			Если индекс = 0 Тогда
				
				ЧастьВерсия = ПривестиСтрокуКРазрешеннымСимволам(ЧастиВерсии[индекс], АлфавитЦифры() + ".");
				РазобраннаяЧастьВерсии = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ЧастьВерсия, ".", Ложь, Истина);
				
				Для индексЧастиВерсии = 0 По 4 - РазобраннаяЧастьВерсии.Количество()-1 Цикл
					РазобраннаяЧастьВерсии.Добавить("0");
				КонецЦикла;
				
				ОбработаннаяЧастьВерсии = Новый Массив();
				Для индексЧастиВерсии = 0 По РазобраннаяЧастьВерсии.ВГраница() Цикл
					
					Если индексЧастиВерсии > 3 Тогда
						Прервать;
					КонецЕсли;
					
					ОбработаннаяЧастьВерсии.Добавить(Лев(РазобраннаяЧастьВерсии[индексЧастиВерсии], ?(индексЧастиВерсии = 3, 4, 3)));
	
				КонецЦикла;
				
				РезультатОбработки.Добавить(СтрСоединить(ОбработаннаяЧастьВерсии, "."));
				
			ИначеЕсли индекс = 1 Тогда
				
				ЧастьВерсия = НРег(ПривестиСтрокуКРазрешеннымСимволам(ЧастиВерсии[индекс], АлфавитБуквыЛатинские()));
				
				Если SUI_ОбщегоНазначенияКлиентСервер.ИменаПредрелизныхСборок().Найти(ЧастьВерсия) = Неопределено Тогда
					Прервать;
				КонецЕсли;
				
				РезультатОбработки.Добавить(ЧастьВерсия);
				
			ИначеЕсли индекс = 2 Тогда
				
				ЧастьВерсия = Лев(ПривестиСтрокуКРазрешеннымСимволам(ЧастиВерсии[индекс], АлфавитЦифры()), 3);
				
				Если ПустаяСтрока(ЧастьВерсия) Тогда
					Прервать;
				КонецЕсли;
				
				РезультатОбработки.Добавить(ЧастьВерсия);
				
			Иначе
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
	
	КонецЕсли;
	
	РезультатОбработки = СтрСоединить(РезультатОбработки, "-");
	
	Если ПустаяСтрока(РезультатОбработки) Или СтрНачинаетсяС(РезультатОбработки, SUI_ОбщегоНазначенияКлиентСервер.ПустаяВерсия()) Тогда
		Возврат SUI_ОбщегоНазначенияКлиентСервер.ПустаяВерсия();
	КонецЕсли;
	
	Возврат РезультатОбработки;
	
КонецФункции

Функция РазобратьСтрокуВерсии(Знач СтрокаВерсии) Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("Мажор", 						"0");
	Результат.Вставить("МажорЧислом", 					0);
	Результат.Вставить("Минор", 						"0");
	Результат.Вставить("МинорЧислом", 					0);
	Результат.Вставить("Патч", 							"0");
	Результат.Вставить("ПатчЧислом", 					0);
	Результат.Вставить("Сборка", 						"0");
	Результат.Вставить("СборкаЧислом", 					0);
	Результат.Вставить("ПредрелизСборки", 				"");
	Результат.Вставить("ПредрелизСборкиЧислом", 		0);
	Результат.Вставить("ВерсияПредрелизаСборки", 		"0");
	Результат.Вставить("ВерсияПредрелизаСборкиЧислом", 	0);
	
	СтрокаВерсии = ОбработатьСтрокуВерсии(СтрокаВерсии);
	
	РазобраннаяВерсия = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаВерсии, "-", Истина, Истина);
	
	Если РазобраннаяВерсия.ВГраница() >= 0 Тогда

		Для индекс = 0 По РазобраннаяВерсия.ВГраница() Цикл
			
			Если индекс = 0 Тогда
				СтрокаВерсии = РазобраннаяВерсия[индекс];
			ИначеЕсли индекс = 1 Тогда
				
				Предрелиз = SUI_ОбщегоНазначенияКлиентСервер.ИменаПредрелизныхСборок().Найти(РазобраннаяВерсия[индекс]);
				
				Если Предрелиз = Неопределено Тогда
					Прервать;
				КонецЕсли;
				
				Результат.ПредрелизСборки = РазобраннаяВерсия[индекс];
				Результат.ПредрелизСборкиЧислом = Предрелиз+1;
	
			ИначеЕсли индекс = 2 Тогда
				Результат.ВерсияПредрелизаСборки = РазобраннаяВерсия[индекс];
				Результат.ВерсияПредрелизаСборкиЧислом = Число(Результат.ВерсияПредрелизаСборки);
			Иначе
				Прервать;
			КонецЕсли;
	
		КонецЦикла;
		
		РазобраннаяВерсия = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаВерсии, ".", Истина, Истина);
		
		Для индекс = 0 По РазобраннаяВерсия.ВГраница() Цикл
			
			Если индекс = 0 Тогда
				Результат.Мажор = РазобраннаяВерсия[индекс];
				Результат.МажорЧислом = Число(Результат.Мажор);
			ИначеЕсли индекс = 1 Тогда
				Результат.Минор = РазобраннаяВерсия[индекс];
				Результат.МинорЧислом = Число(Результат.Минор);
			ИначеЕсли индекс = 2 Тогда
				Результат.Патч = РазобраннаяВерсия[индекс];
				Результат.ПатчЧислом = Число(Результат.Патч);
			ИначеЕсли индекс = 3 Тогда
				Результат.Сборка = РазобраннаяВерсия[индекс];
				Результат.СборкаЧислом = Число(Результат.Сборка);
			Иначе
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
		
КонецФункции

// см. СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор
//
Функция ЭтоУникальныйИдентификатор(Значение) Экспорт
	ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(36, ДопустимаяДлина.Фиксированная));
	Возврат СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ОписаниеТипаСтрока.ПривестиЗначение(Значение));
КонецФункции

#КонецОбласти
