
#Область СлужебныйПрограммныйИнтерфейс

Функция ОписаниеДанныхHTTPСервиса() Экспорт 
	
	ШаблоныРасширения = Новый Соответствие();
	
	Для Каждого ШаблонURL Из Метаданные.HTTPСервисы.SUI_Exchange.ШаблоныURL Цикл
		
		ДанныеШаблона = Новый Соответствие();
		ДанныеШаблона.Вставить("Имя", 			ШаблонURL.Имя);
		ДанныеШаблона.Вставить("Синоним", 		ШаблонURL.Синоним);
		ДанныеШаблона.Вставить("Адрес", 		ШаблонURL.Шаблон);
		ДанныеШаблона.Вставить("Комментарий", 	ШаблонURL.Комментарий);
		ДанныеШаблона.Вставить("ПолноеИмя", 	ШаблонURL.ПолноеИмя());
		ДанныеШаблона.Вставить("Представление", ШаблонURL.Представление());
		
		МетодыШаблона = Новый Соответствие();
		Для Каждого МетодШаблона Из ШаблонURL.Методы Цикл
			
			ПолноеИмяПредопределенного = "Перечисление.SUI_HTTPМетоды." + Строка(МетодШаблона.HTTPМетод);
			Метод = SUI_ОбщегоНазначенияПереопределяемый.ПредопределенныйЭлемент(ПолноеИмяПредопределенного);
			
			Если Метод = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ДанныеМетода = Новый Соответствие();
			ДанныеМетода.Вставить("Метод", Метод);
			ДанныеМетода.Вставить("Имя", 			МетодШаблона.Имя);
			ДанныеМетода.Вставить("Синоним", 		МетодШаблона.Синоним);
			ДанныеМетода.Вставить("Комментарий", 	МетодШаблона.Комментарий);
			ДанныеМетода.Вставить("Обработчик", 	МетодШаблона.Обработчик);
			ДанныеМетода.Вставить("ПолноеИмя", 		МетодШаблона.ПолноеИмя());
			ДанныеМетода.Вставить("Представление", 	МетодШаблона.Представление());
			
			МетодыШаблона.Вставить(Метод, Новый ФиксированноеСоответствие(ДанныеМетода));
			
		КонецЦикла;
		
		ДанныеШаблона.Вставить("Методы", Новый ФиксированноеСоответствие(МетодыШаблона));
		
		ШаблоныРасширения.Вставить(ШаблонURL.Имя, Новый ФиксированноеСоответствие(ДанныеШаблона));
		
	КонецЦикла;
	
	Возврат Новый ФиксированноеСоответствие(ШаблоныРасширения);
	
КонецФункции

#КонецОбласти
