
#Область СлужебныйПрограммныйИнтерфейс

Функция ШаблоныРасширения() Экспорт 
	
	ШаблоныРасширения = Новый Соответствие();
	
	Для Каждого ШаблонURL Из Метаданные.HTTPСервисы.SUI_Exchange.ШаблоныURL Цикл
		ДанныеШаблона = Новый Структура("Имя,Синоним,Шаблон");
		ЗаполнитьЗначенияСвойств(ДанныеШаблона, ШаблонURL);
		ШаблоныРасширения.Вставить(ШаблонURL.Имя, Новый ФиксированнаяСтруктура(ДанныеШаблона));
	КонецЦикла;
	
	Возврат Новый ФиксированноеСоответствие(ШаблоныРасширения);
	
КонецФункции

#КонецОбласти
