
#Область СлужебныйПрограммныйИнтерфейс

Функция ОписаниеДанныхHTTPСервисаExchange() Экспорт 
	
	МетаданныеСервиса = Метаданные.HTTPСервисы.SUI_Exchange;
	
	ОписаниеДанных = Новый Соответствие();
	ОписаниеДанных.Вставить("Имя", 			МетаданныеСервиса.Имя);
	ОписаниеДанных.Вставить("Синоним", 		МетаданныеСервиса.Синоним);
	ОписаниеДанных.Вставить("Комментарий", 	МетаданныеСервиса.Комментарий);
	ОписаниеДанных.Вставить("КорневойURL", МетаданныеСервиса.КорневойURL);
	ОписаниеДанных.Вставить("ВремяЖизниСеанса", МетаданныеСервиса.ВремяЖизниСеанса);
	ОписаниеДанных.Вставить("ПолноеИмя", 	МетаданныеСервиса.ПолноеИмя());
	ОписаниеДанных.Вставить("Представление", МетаданныеСервиса.Представление());
	
	ШаблоныСервиса = Новый Соответствие();
	АдресаШаблонов = Новый Соответствие();
	
	Для Каждого ШаблонURL Из Метаданные.HTTPСервисы.SUI_Exchange.ШаблоныURL Цикл
		
		ДанныеШаблона = Новый Соответствие();
		ДанныеШаблона.Вставить("Имя", 			ШаблонURL.Имя);
		ДанныеШаблона.Вставить("Синоним", 		ШаблонURL.Синоним);
		ДанныеШаблона.Вставить("Адрес", 		ШаблонURL.Шаблон);
		ДанныеШаблона.Вставить("Комментарий", 	ШаблонURL.Комментарий);
		ДанныеШаблона.Вставить("ПолноеИмя", 	ШаблонURL.ПолноеИмя());
		ДанныеШаблона.Вставить("Представление", ШаблонURL.Представление());
		
		МетодыШаблона = Новый Соответствие();
		Для Каждого МетодШаблона Из ШаблонURL.Методы Цикл
			
			ПолноеИмяПредопределенного = "Перечисление.SUI_HTTPМетоды." + Строка(МетодШаблона.HTTPМетод);
			Метод = SUI_ОбщегоНазначенияПереопределяемый.ПредопределенныйЭлемент(ПолноеИмяПредопределенного);
			
			Если Метод = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ДанныеМетода = Новый Соответствие();
			ДанныеМетода.Вставить("Метод", Метод);
			ДанныеМетода.Вставить("Имя", 			МетодШаблона.Имя);
			ДанныеМетода.Вставить("Синоним", 		МетодШаблона.Синоним);
			ДанныеМетода.Вставить("Комментарий", 	МетодШаблона.Комментарий);
			ДанныеМетода.Вставить("Обработчик", 	МетодШаблона.Обработчик);
			ДанныеМетода.Вставить("ПолноеИмя", 		МетодШаблона.ПолноеИмя());
			ДанныеМетода.Вставить("Представление", 	МетодШаблона.Представление());
			
			МетодыШаблона.Вставить(Метод, Новый ФиксированноеСоответствие(ДанныеМетода));
			
		КонецЦикла;
		
		Если МетодыШаблона.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеШаблона.Вставить("Методы", Новый ФиксированноеСоответствие(МетодыШаблона));
		
		ШаблоныСервиса.Вставить(ШаблонURL.Имя, Новый ФиксированноеСоответствие(ДанныеШаблона));
		АдресаШаблонов.Вставить(ШаблонURL.Шаблон, ШаблонURL.Имя);
		
	КонецЦикла;
	
	ОписаниеДанных.Вставить("Шаблоны", Новый ФиксированноеСоответствие(ШаблоныСервиса));
	ОписаниеДанных.Вставить("Адреса", Новый ФиксированноеСоответствие(АдресаШаблонов));
	
	Возврат Новый ФиксированноеСоответствие(ОписаниеДанных);
	
КонецФункции

#КонецОбласти
