
#Область ПрограммныйИнтерфейс

Процедура ОбработатьСоставКодовМаркировокВФоне(МобильноеУстройство, ИдентификаторЗапроса) Экспорт

	Попытка

		ПодключеннаяИнтеграционнаяОбработка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту(
		"ИмяОбъекта", SUI_ОбменДаннымиСервер.ИмяВнешнейОбработкиГИСМТ());
		
		Запись = РегистрыСведений.SUI_ДанныеКодовМаркировки.СоздатьМенеджерЗаписи();
		Запись.МобильноеУстройство = МобильноеУстройство;
		Запись.УникальныйИдентификатор = ИдентификаторЗапроса;
		Запись.Прочитать();
		
		ДанныеДляЗапроса = Запись.ДанныеДляЗапроса.Получить();
		
		SUI_ОбменДаннымиСервер.ВыполнитьПроверкиПередЗапускомИнтеграционнойОбработкиГИСМТ(ДанныеДляЗапроса,
			ПодключеннаяИнтеграционнаяОбработка);
		
		ПараметрыКоманды = Новый Структура;
		ПараметрыКоманды.Вставить("ДополнительнаяОбработкаСсылка", ПодключеннаяИнтеграционнаяОбработка);
		ПараметрыКоманды.Вставить("ИдентификаторКоманды", "ЗапросСоставаКодовМаркировки");
		ПараметрыКоманды.Вставить("ОбъектыНазначения", Новый Массив);
		ПараметрыКоманды.Вставить("Штрихкоды", ДанныеДляЗапроса);

		РезультатВыполнения = ДополнительныеОтчетыИОбработки.ВыполнитьКоманду(ПараметрыКоманды);

		Запись.Результат = Новый ХранилищеЗначения(РезультатВыполнения);
		Запись.Выполнено = Истина;
		Запись.ДатаОбновления = ТекущаяДатаСеанса();
		Запись.Записать();

	Исключение

		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации("Данные кодов маркировки", ,
			Метаданные.РегистрыСведений.SUI_ДанныеКодовМаркировки.МодульМенеджера, , ИнформацияОбОшибке());

		Запись = РегистрыСведений.SUI_ДанныеКодовМаркировки.СоздатьМенеджерЗаписи();
		Запись.МобильноеУстройство = МобильноеУстройство;
		Запись.УникальныйИдентификатор = ИдентификаторЗапроса;
		Запись.Прочитать();

		Запись.ТекстОшибки = ОписаниеОшибки();
		Запись.Выполнено = Ложь;
		Запись.ДатаОбновления = ТекущаяДатаСеанса();
		Запись.Записать();

	КонецПопытки;

КонецПроцедуры

#КонецОбласти

