
#Область ПрограммныйИнтерфейс

Процедура ОбработатьСоставКодовМаркировокВФоне(МобильноеУстройство, КодыМаркировкиКЗапросу, ИдентификаторЗапроса) Экспорт

	Попытка

		ПодключеннаяИнтеграционнаяОбработка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту(
		"ИмяОбъекта", SUI_ОбменДаннымиСервер.ИмяВнешнейОбработкиГИСМТ());

		SUI_ОбменДаннымиСервер.ВыполнитьПроверкиПередЗапускомИнтеграционнойОбработкиГИСМТ(КодыМаркировкиКЗапросу,
			ПодключеннаяИнтеграционнаяОбработка);

		ПараметрыКоманды = Новый Структура;
		ПараметрыКоманды.Вставить("ДополнительнаяОбработкаСсылка", ПодключеннаяИнтеграционнаяОбработка);
		ПараметрыКоманды.Вставить("ИдентификаторКоманды", "ЗапросСоставаКодовМаркировки");
		ПараметрыКоманды.Вставить("ОбъектыНазначения", Новый Массив);
		ПараметрыКоманды.Вставить("Штрихкоды", КодыМаркировкиКЗапросу);

		РезультатВыполнения = ДополнительныеОтчетыИОбработки.ВыполнитьКоманду(ПараметрыКоманды);

		Запись = РегистрыСведений.SUI_ДанныеКодовМаркировки.СоздатьМенеджерЗаписи();
		Запись.МобильноеУстройство = МобильноеУстройство;
		Запись.УникальныйИдентификатор = ИдентификаторЗапроса;
		Запись.Прочитать();

		Запись.Результат = Новый ХранилищеЗначения(РезультатВыполнения);
		Запись.Выполнено = Истина;
		Запись.ДатаОбновления = ТекущаяДатаСеанса();
		Запись.Записать();

	Исключение

		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации("Данные кодов маркировки", ,
			Метаданные.РегистрыСведений.SUI_ДанныеКодовМаркировки.МодульМенеджера, , ИнформацияОбОшибке());

		Запись = РегистрыСведений.SUI_ДанныеКодовМаркировки.СоздатьМенеджерЗаписи();
		Запись.МобильноеУстройство = МобильноеУстройство;
		Запись.УникальныйИдентификатор = ИдентификаторЗапроса;
		Запись.Прочитать();

		Запись.ТекстОшибки = ОписаниеОшибки();
		Запись.Выполнено = Ложь;
		Запись.ДатаОбновления = ТекущаяДатаСеанса();
		Запись.Записать();

	КонецПопытки;

КонецПроцедуры

#КонецОбласти

