
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	SUI_ИнтеграцияВКонфигурацию.УстановитьДействиеОткрытияИдентификаторов(ЭтотОбъект, "id_");
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(ТекущийОбъект.ДатаЗаписи) Тогда
		ТекущийОбъект.ДатаЗаписи = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если Не Запись.ИсходныйКлючЗаписи.Пустой() Тогда
		ТекущийОбъект.ДатаОбновления = ТекущаяДатаСеанса();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура hashНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	РасчитатьХешШтрихкода();
	
КонецПроцедуры

&НаКлиенте
Процедура barcodeПриИзменении(Элемент)
	
	РасчитатьХешШтрихкода();
	
КонецПроцедуры

&НаКлиенте
Процедура hash_ownerНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	РасчитатьХешШтрихкодаВладельца();
	
КонецПроцедуры

&НаКлиенте
Процедура barcode_ownerПриИзменении(Элемент)
	
	РасчитатьХешШтрихкодаВладельца();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РасчитатьХешШтрихкода()
	
	Запись.hash = РасчитатьХешШтрихкодаНаСервере(Запись.barcode);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РасчитатьХешШтрихкодаВладельца()
	
	Запись.hash_owner = РасчитатьХешШтрихкодаНаСервере(Запись.barcode_owner);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РасчитатьХешШтрихкодаНаСервере(Штрихкод)
	
	Возврат SUI_ШтрихкодированиеВызовСервера.РасчитатьХешШтрихкода(Штрихкод);
	
КонецФункции

&НаКлиенте
Процедура SUI_Переопределяемый_ОткрытиеИдентификатора(Элемент, СтандартнаяОбработка)
	
	SUI_ИнтеграцияВКонфигурациюКлиент.ОткрытиеИдентификатора(Неопределено, 
		Элемент.ТекстРедактирования, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти
