
#Область ОписаниеПеременных

&НаКлиенте
Перем ОписаниеОбновленияДляСкачивания;

&НаКлиенте
Перем ТекущийКонтекст;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СведенияОРасширении = SUI_ОбновлениеSimple.СведенияОРасширении();
	
	ИдентификаторРасширения = СведенияОРасширении.УникальныйИдентификатор;
	ТекущаяВерсия = СведенияОРасширении.Версия;
	ТекущаяВерсияДанных = SUI_ОбновлениеSimple.ВерсияДанных();
	
	ОбновитьОтображениеПредупрежденияПерезапуска();
	
	УстановкаПредварительныхВерсий = ПолучитьФункциональнуюОпцию("SUI_УстановкаПредварительныхВерсий");
	
	Заголовок = SUI_SimpleКлиентСервер.Представление() + ": " + Заголовок + " (" + ТекущаяВерсия + ")";
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОтображениеПредупрежденияПерезапуска();
	
	ОбновитьОтображениеКнопкиОбновленияИзСписка();
	
	Если Элементы.ГруппаПредупреждениеПерезапуска.Видимость Тогда
		ОтобразитьСтраницуОшибки(НСтр("ru = 'Требуется перезапустить приложение.'"));
	Иначе
		
		ОтобразитьДлительнуюОперацию(НСтр("ru = 'Получение сведений из репозитория обновлений'"));
		ПодключитьОбработчикОжидания("НачатьПолучениеСведенийОбОбновлении", 0.1, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "SUI_ОбновлениеВерсииДанныхВыполнено" Тогда
		ОбновлениеВерсииДанныхВыполнено = Параметр;
		ОбновитьОтображениеПредупрежденияПерезапуска();
		ОтображениеПредупрежденияПерезапуска();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НадписьПредупреждениеПерезапускаОбработкаНавигационнойСсылки(Элемент, 
	НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыЗавершенияРаботы = SUI_ОбщегоНазначенияКлиентСервер.ПараметрыЗавершенияРаботы();
	ПараметрыЗавершенияРаботы.ПерезапуститьПриЗавершении = Истина;
	ПараметрыЗавершенияРаботы.ДополнительныеПараметрыКоманднойСтроки = 
		SUI_ОбновлениеSimpleКлиентСервер.ПараметрЗапускаОбновления();
	
	SUI_ОбщегоНазначенияКлиент.ВыполнитьЗавершениеРаботыСистемы(ПараметрыЗавершенияРаботы);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОбновленийtag_nameНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.СписокОбновлений.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(ТекущиеДанные.url);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокОбновлений

&НаКлиенте
Процедура СписокОбновленийВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	Если Не ПроверитьПраваОбновленияРасширения() Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПодтверждениеВыбораВерсииОбновления", ЭтотОбъект, Элемент.ТекущаяСтрока);
	
	ТекстВопроса = СтрШаблон(НСтр("ru = 'Текущая версия %1 будет обновлена на версию %2.
	|Продолжить?'"), SUI_SimpleКлиентСервер.Представление(), Элемент.ТекущиеДанные.tag_name);
	
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОбновленийПриАктивизацииСтроки(Элемент)
	
	ОбновитьОтображениеКнопкиОбновленияИзСписка();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьОбновлениеИзФайла(Команда)
	
	Если Не ПроверитьПраваОбновленияРасширения() Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьОбновлениеИзФайлаЗавершение", ЭтотОбъект);
	
	ПараметрыЗагрузкиФайла = ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла();
	ПараметрыЗагрузкиФайла.ИдентификаторФормы = УникальныйИдентификатор;
	ПараметрыЗагрузкиФайла.Диалог.МножественныйВыбор = Ложь;
	ПараметрыЗагрузкиФайла.Диалог.Фильтр = СтрШаблон(НСтр("ru = 'Файл обновления %1 (*.zip)|*.zip'"), 
		SUI_SimpleКлиентСервер.Представление());
	ПараметрыЗагрузкиФайла.Диалог.Заголовок = СтрШаблон(НСтр("ru = 'Выберите файл обновления %1'"), 
		SUI_SimpleКлиентСервер.Представление());
	
	ФайловаяСистемаКлиент.ЗагрузитьФайл(Оповещение, ПараметрыЗагрузкиФайла);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПроверитьПраваОбновленияРасширения()
	
	Если Не ПравоДоступа("Администрирование", Метаданные) Или
		Не ПравоДоступа("АдминистрированиеРасширенийКонфигурации", Метаданные) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Недостаточно прав'"));
		Возврат Ложь;
	КонецЕсли;

	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ОтображениеПредупрежденияПерезапуска()
	
	Если Не ОбновлениеВерсииДанныхВыполнено Или ИзменилосьСостояниеРасширений Тогда
		Элементы.ГруппаПредупреждениеПерезапуска.Видимость = Истина;
	Иначе
		Элементы.ГруппаПредупреждениеПерезапуска.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.СтраницыОбновление.Доступность = Не Элементы.ГруппаПредупреждениеПерезапуска.Видимость;
	Элементы.ФормаЗагрузитьОбновлениеИзФайла.Доступность = Не Элементы.ГруппаПредупреждениеПерезапуска.Видимость;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьДлительнуюОперацию(ИнформацияДлительнойОперации = "")
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаДлительнаяОперация;
	Элементы.ИнформацияДлительнойОперации.Заголовок = НСтр("ru = 'Пожалуйста подождите...'");
	
	Если Не ПустаяСтрока(ИнформацияДлительнойОперации) Тогда
		Элементы.ИнформацияДлительнойОперации.Заголовок = Элементы.ИнформацияДлительнойОперации.Заголовок
			+ Символы.ПС + Символы.ПС
			+ ИнформацияДлительнойОперации;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьСтраницуОшибки(ТекстОшибки = "")
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОбновление;
	Элементы.СтраницыОбновление.ТекущаяСтраница = Элементы.СтраницаОшибка;
	Элементы.НадписьОшибка.Заголовок = ТекстОшибки;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьСтраницуОбновления() Экспорт
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОбновление;
	Элементы.СтраницыОбновление.ТекущаяСтраница = Элементы.СтраницаОсновная;
	
	Если СписокОбновлений.Количество() > 0 Тогда
		Элементы.КраткоеОписаниеРезультата.Заголовок = НСтр("ru = 'Выберите обновление из списка'");
		Элементы.ГруппаСписокОбновлений.Доступность = Истина;
	Иначе
		Элементы.КраткоеОписаниеРезультата.Заголовок = НСтр("ru = 'Отсутствуют доступные обновления'");
		Элементы.ГруппаСписокОбновлений.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьСтраницуЗавершения(ТекстЗавершения = "")
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОбновление;
	Элементы.СтраницыОбновление.ТекущаяСтраница = Элементы.СтраницаУспешно;
	Элементы.НадписьУспешно.Заголовок = ТекстЗавершения;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПолучениеСведенийОбОбновлении() Экспорт
	
	СписокОбновлений.Очистить();
	
	Результат = SUI_ОбновлениеSimpleКлиентСервер.ПолучитьСписокОбновленийИзРепозитория(УстановкаПредварительныхВерсий);
	
	Если Не ПустаяСтрока(Результат.Ошибка) Тогда
		ОтобразитьСтраницуОшибки(Результат.Ошибка);
	Иначе
		
		Для индекс = 0 По Результат.СписокВерсий.ВГраница() Цикл
			НоваяСтрока = СписокОбновлений.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Результат.СписокВерсий[индекс]);
		КонецЦикла;
		
		Если СписокОбновлений.Количество() = 0 Тогда
			
			НайденныеСтроки = СписокОбновлений.НайтиСтроки(Новый Структура("manual_update", Ложь));
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				Элементы.СписокОбновлений.ТекущаяСтрока = НайденныеСтроки[0].ПолучитьИдентификатор();
			Иначе
				Элементы.СписокОбновлений.ТекущаяСтрока = 0;
			КонецЕсли;
		
		КонецЕсли;
		
		ОтобразитьСтраницуОбновления();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеКнопкиОбновленияИзСписка()
	
	Элементы.ГруппаИнформацияОРучномОбновлении.Видимость = Ложь;
	Элементы.Выбрать.Видимость = Ложь;
	Элементы.СписокОбновленийКонтекстноеМенюВыбрать.Видимость = Ложь;
	
	ТекущиеДанные = Элементы.СписокОбновлений.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.manual_update Тогда
		
		Элементы.ГруппаИнформацияОРучномОбновлении.Видимость = Истина;
		
		ТекстИнформации = ?(ТекущиеДанные.tag_name = ТекущиеДанные.tag_init,
			СтрШаблон(НСтр("ru = 'Обновление на версию %1 возможно только в режиме конфигуратора.'"), ТекущиеДанные.tag_name),
			СтрШаблон(НСтр("ru = 'Обновление через центр обновлений %1 на версию %2 
			|возможно только с версии %3 или в режиме конфигуратора.'"), 
				SUI_SimpleКлиентСервер.Представление(), ТекущиеДанные.tag_name, ТекущиеДанные.tag_init));
				
		Элементы.ИнформацияОРучномОбновлении.Заголовок = ТекстИнформации;
		
	Иначе
		Элементы.Выбрать.Видимость = Истина;
		Элементы.СписокОбновленийКонтекстноеМенюВыбрать.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеВыбораВерсииОбновления(Подтверждение, ТекущаяСтрока) Экспорт
	
	Если Подтверждение <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОбновления = СписокОбновлений.НайтиПоИдентификатору(ТекущаяСтрока);
	
	Если ОписаниеОбновления = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ОписаниеОбновления.manual_update Тогда
		
		ТекстПредупреждения = ?(ОписаниеОбновления.tag_name = ОписаниеОбновления.tag_init,
			СтрШаблон(НСтр("ru = 'Обновление на версию %1 возможно только в режиме конфигуратора.'"), 
			ОписаниеОбновления.tag_name),
			СтрШаблон(НСтр("ru = 'Обновление через центр обновлений %1 на версию %2 
			|возможно только с версии %3 или в режиме конфигуратора.
			|Текущая версия %4.'"), 
			SUI_SimpleКлиентСервер.Представление(), ОписаниеОбновления.tag_name, ОписаниеОбновления.tag_init, ТекущаяВерсия));
		
		ПоказатьПредупреждение(, ТекстПредупреждения);
		
	Иначе
		
		ОтобразитьДлительнуюОперацию(НСтр("ru = 'Получение файла обновления'"));
		
		ОписаниеОбновленияДляСкачивания = Новый Структура("tag_name,file_id,file_url");
		ЗаполнитьЗначенияСвойств(ОписаниеОбновленияДляСкачивания, ОписаниеОбновления);
		
		ПодключитьОбработчикОжидания("НачатьПолучениеФайлаОбновления", 0.1, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПолучениеФайлаОбновления() Экспорт
	
	Если ЭтоАдресВременногоХранилища(АдресФайлаОбновления) Тогда
		УдалитьИзВременногоХранилища(АдресФайлаОбновления);
	КонецЕсли;
	
	АдресФайлаОбновления = "";
	
	Если ТипЗнч(ОписаниеОбновленияДляСкачивания) = Тип("Структура") Тогда
		
		АдресХранения = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
		Результат = SUI_ОбновлениеSimpleКлиентСервер.ЗагрузитьФайлОбновленияИзРепозитория(
			ОписаниеОбновленияДляСкачивания, АдресХранения, 60);
		
	Иначе
		Результат = Новый Структура();
		Результат.Вставить("Ошибка", НСтр("ru = 'Не выбрано обновление для скачивания из списка доступных обновлений.'"));
	КонецЕсли;
	
	Если Не ПустаяСтрока(Результат.Ошибка) Тогда
		ОтобразитьСтраницуОшибки(Результат.Ошибка);
	Иначе
		
		АдресФайлаОбновления = Результат.АдресХранения;
		НачатьОбновлениеИзФайла();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОбновлениеИзФайлаЗавершение(ЗагруженныйФайл, ДополнительныеПараметры) Экспорт
	
	Если ЗагруженныйФайл = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Контекст = Новый Структура();
	Контекст.Вставить("АдресФайлаОбновления", ЗагруженныйФайл.Хранение);
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьОбновлениеИзФайлаПодтверждение", ЭтотОбъект, Контекст);
	
	РазборИмениФайла = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ЗагруженныйФайл.Имя);
	
	ТекстВопроса = СтрШаблон(НСтр("ru = 'Выполнить обновление %1 из файла %2?'"), 
		SUI_SimpleКлиентСервер.Представление(), РазборИмениФайла.Имя);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОбновлениеИзФайлаПодтверждение(Подтверждение, Контекст) Экспорт
	
	Если Подтверждение <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(АдресФайлаОбновления) Тогда
		УдалитьИзВременногоХранилища(АдресФайлаОбновления);
	КонецЕсли;
	
	АдресФайлаОбновления = Контекст.АдресФайлаОбновления;
	НачатьОбновлениеИзФайла();
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьОбновлениеИзФайла()
	
	ОтобразитьДлительнуюОперацию(НСтр("ru = 'Выполняется обновление'"));
	ПодключитьОбработчикОжидания("НачатьОбновлениеИзФайлаПродолжить", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьОбновлениеИзФайлаПродолжить() Экспорт
	
	Результат = ПолучитьИПроверитьФайлОбновленияИзАрхиваНаСервере(АдресФайлаОбновления, ТекущаяВерсия);
	
	Если Не ПустаяСтрока(Результат.Ошибка) Тогда
		
		Если ЭтоАдресВременногоХранилища(АдресФайлаОбновления) Тогда
			УдалитьИзВременногоХранилища(АдресФайлаОбновления);
		КонецЕсли;
		АдресФайлаОбновления = "";
		
		ОтобразитьСтраницуОшибки(Результат.Ошибка);
		
	Иначе
		
		Контекст = Новый Структура();
		Контекст.Вставить("ИдентификаторРасширения", ИдентификаторРасширения);
		Контекст.Вставить("ПомещенныеФайлы", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Результат.ПомещенныйФайл));
		
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ЗагрузитьРасширениеПродолжение", ЭтотОбъект, Контекст);
		
		Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПрофилиБезопасности") Тогда
			
			ЗапросыРазрешений = Новый Массив;
			Попытка
				ДобавитьЗапросРазрешений(ЗапросыРазрешений, Контекст.ПомещенныеФайлы, Контекст.ИдентификаторРасширения);
			Исключение
				ОтобразитьСтраницуОшибки(ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
				Возврат;
			КонецПопытки;
			
			МодульРаботаВБезопасномРежимеКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаВБезопасномРежимеКлиент");
			МодульРаботаВБезопасномРежимеКлиент.ПрименитьЗапросыНаИспользованиеВнешнихРесурсов(
				ЗапросыРазрешений, ЭтотОбъект, ОповещениеОЗакрытии);
			
		Иначе
			ВыполнитьОбработкуОповещения(ОповещениеОЗакрытии, КодВозвратаДиалога.ОК);
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИПроверитьФайлОбновленияИзАрхиваНаСервере(АдресХранения, ТекущаяВерсия)
	
	Перем ВременныйКаталог;
	
	Результат = Новый Структура();
	Результат.Вставить("Ошибка", "");
	Результат.Вставить("ПомещенныйФайл", Новый Структура("Имя,Хранение", "", ""));
	
	Попытка
		
		ФайлАрхив = ПолучитьИзВременногоХранилища(АдресХранения);
		
		ВременныйКаталог = ФайловаяСистема.СоздатьВременныйКаталог();
		
		ЧтениеАрхива = Новый ЧтениеZipФайла();
		ЧтениеАрхива.Открыть(ФайлАрхив.ОткрытьПотокДляЧтения());
		ЧтениеАрхива.ИзвлечьВсе(ВременныйКаталог);
		ЧтениеАрхива.Закрыть();
		
		ПутьКФайлу = SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(ВременныйКаталог, "manifest.json");
		ФайлИзАрхива = Новый Файл(ПутьКФайлу);
		ОбщегоНазначенияКлиентСервер.Проверить(ФайлИзАрхива.Существует() И ФайлИзАрхива.ЭтоФайл(),
			НСтр("ru = 'В файле обновления отсутствует файл манифест.
			|Обратитесь к поставщику обновлений.'"));
		
		ЧтениеJSON = Новый ЧтениеJSON();
		ЧтениеJSON.ОткрытьФайл(ПутьКФайлу);
		Манифест = ПрочитатьJSON(ЧтениеJSON, Истина);
		ЧтениеJSON.Закрыть();
		
		ИмяФайлаОбновления = SUI_ОбщегоНазначенияКлиентСервер.ЗначениеСоответствия(Манифест, "path", "", Тип("Строка"));
		НачальнаяВерсияОбновления = SUI_СтроковыеФункцииКлиентСервер.ОбработатьСтрокуВерсии(
			SUI_ОбщегоНазначенияКлиентСервер.ЗначениеСоответствия(Манифест, "init", "", Тип("Строка")));
		
		ОбщегоНазначенияКлиентСервер.Проверить((
			Не ПустаяСтрока(ИмяФайлаОбновления) И
			НачальнаяВерсияОбновления <> SUI_ОбщегоНазначенияКлиентСервер.ПустаяВерсия()),
			НСтр("ru = 'Манифест обновления поврежден.
			|Обратитесь к поставщику обновлений.'"));
		
		Попытка
			
			ПутьКФайлу = SUI_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(ВременныйКаталог, ИмяФайлаОбновления);
			ФайлИзАрхива = Новый Файл(ПутьКФайлу);
			ОбщегоНазначенияКлиентСервер.Проверить(ФайлИзАрхива.Существует() И ФайлИзАрхива.ЭтоФайл());
			
			ФайлОбновления = Новый ДвоичныеДанные(ПутьКФайлу);
			ОписаниеРасширения = Новый ОписаниеКонфигурации(ФайлОбновления);
			
		Исключение
			ВызватьИсключение НСтр("ru = 'Архив файла обновления не содержит файл обновлений.
			|Обратитесь к поставщику обновлений.'");
		КонецПопытки;
		
		ОбщегоНазначенияКлиентСервер.Проверить(
			SUI_ОбщегоНазначенияКлиентСервер.СравнитьВерсии(ОписаниеРасширения.Версия, ТекущаяВерсия) > 0,
			СтрШаблон(НСтр("ru = 'Файл обновлений %1 не содержит обновлений для версии %2'"),
			ОписаниеРасширения.Версия, ТекущаяВерсия));
		
		Если SUI_ОбщегоНазначенияКлиентСервер.СравнитьВерсии(ОписаниеРасширения.Версия, НачальнаяВерсияОбновления) = 0 Тогда
			ВызватьИсключение НСтр("ru = 'Файл обновлений содержит обновления только для обновления в режиме конфигуратора.'");
		ИначеЕсли SUI_ОбщегоНазначенияКлиентСервер.СравнитьВерсии(НачальнаяВерсияОбновления, ТекущаяВерсия) > 0 Тогда
			ВызватьИсключение СтрШаблон(
				НСтр("ru = 'Обновление на версию %1 возможно только с версии %2 или в режиме конфигуратора.
				|Текущая версия %3.'"),
				ОписаниеРасширения.Версия, НачальнаяВерсияОбновления, ТекущаяВерсия);
		КонецЕсли;
		
		Результат.ПомещенныйФайл.Имя = "ИмяФайлаОбновления";
		Результат.ПомещенныйФайл.Хранение = ПоместитьВоВременноеХранилище(ФайлОбновления, АдресХранения);
		
		ФайловаяСистема.УдалитьВременныйКаталог(ВременныйКаталог);
		ВременныйКаталог = Неопределено;
		
	Исключение
		Если ВременныйКаталог <> Неопределено Тогда
			ФайловаяСистема.УдалитьВременныйКаталог(ВременныйКаталог);
		КонецЕсли;
		Ошибка = ИнформацияОбОшибке();
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(SUI_ОбновлениеSimpleКлиентСервер.ИмяСобытия(), ,
			Метаданные.Обработки.SUI_ОбновлениеSimple.Формы.Форма, , Ошибка);
		Результат.Ошибка = ОбработкаОшибок.КраткоеПредставлениеОшибки(Ошибка);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ОтключитьПредупрежденияБезопасности(Расширение)
	Расширение.ЗащитаОтОпасныхДействий = ОбщегоНазначения.ОписаниеЗащитыБезПредупреждений();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОтключитьИспользованиеОсновныхРолейДляВсехПользователей(Расширение)
	Расширение.ИспользоватьОсновныеРолиДляВсехПользователей = Ложь;
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиРасширение(ИдентификаторРасширения)
	
	Перем Расширение;
	
	Если ТипЗнч(ИдентификаторРасширения) = Тип("УникальныйИдентификатор") Тогда
		
		Отбор = Новый Структура("УникальныйИдентификатор", Новый УникальныйИдентификатор(ИдентификаторРасширения));
		Расширения = РасширенияКонфигурации.Получить(Отбор);
		
		Если Расширения.Количество() = 1 Тогда
			Расширение = Расширения[0];
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Расширение;
	
КонецФункции

&НаСервере
Процедура ДобавитьЗапросРазрешений(ЗапросыРазрешений, ПомещенныеФайлы, ИдентификаторРасширения = Неопределено)
	
	МодульРаботаВБезопасномРежиме = ОбщегоНазначения.ОбщийМодуль("РаботаВБезопасномРежиме");
	Если Не МодульРаботаВБезопасномРежиме.ИспользуютсяПрофилиБезопасности() Тогда
		Возврат;
	КонецЕсли;
	
	Разрешения = Новый Массив;
	
	Для Каждого ПомещенныйФайл Из ПомещенныеФайлы Цикл
		
		ДанныеОбновляемогоРасширения = Неопределено;
		ТребуетсяВосстановление = Ложь;
		
		Попытка
			
			Если ИдентификаторРасширения = Неопределено Тогда
				ВременноеРасширение = РасширенияКонфигурации.Создать();
			Иначе
				
				ВременноеРасширение = НайтиРасширение(ИдентификаторРасширения);
				ОбщегоНазначенияКлиентСервер.Проверить(ВременноеРасширение <> Неопределено,
					НСтр("ru = 'Текущее расширение не существует в программе,
					|возможно оно было удалено в другом сеансе.'"));
				ДанныеОбновляемогоРасширения = ВременноеРасширение.ПолучитьДанные();
				
			КонецЕсли;
			
			ОтключитьПредупрежденияБезопасности(ВременноеРасширение);
			ОтключитьИспользованиеОсновныхРолейДляВсехПользователей(ВременноеРасширение);
			
			ДанныеРасширения = ПолучитьИзВременногоХранилища(ПомещенныйФайл.Хранение);
			ВременноеРасширение.Записать(ДанныеРасширения);
			
			ТребуетсяВосстановление = Истина;
			
			ВременноеРасширение = НайтиРасширение(Строка(ВременноеРасширение.УникальныйИдентификатор));
			
			СвойстваВременногоРасширения = Новый Структура;
			СвойстваВременногоРасширения.Вставить("Имя",      ВременноеРасширение.Имя);
			СвойстваВременногоРасширения.Вставить("ХешСумма", ВременноеРасширение.ХешСумма);
			
			Если ИдентификаторРасширения = Неопределено Тогда
				ВременноеРасширение.Удалить();
			Иначе
				
				ВременноеРасширение = НайтиРасширение(ИдентификаторРасширения);
				
				Если ВременноеРасширение = Неопределено Тогда
					ВременноеРасширение = РасширенияКонфигурации.Создать();
				КонецЕсли;
				
				ОтключитьПредупрежденияБезопасности(ВременноеРасширение);
				ОтключитьИспользованиеОсновныхРолейДляВсехПользователей(ВременноеРасширение);
				
				ВременноеРасширение.Записать(ДанныеОбновляемогоРасширения);
				
			КонецЕсли;
			
			ТребуетсяВосстановление = Ложь;
			Разрешение = МодульРаботаВБезопасномРежиме.РазрешениеНаИспользованиеВнешнегоМодуля(
				СвойстваВременногоРасширения.Имя, Base64Строка(СвойстваВременногоРасширения.ХешСумма));
			Разрешения.Добавить(Разрешение);
			
		Исключение
			
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			
			Если ИдентификаторРасширения = Неопределено Тогда
				Если ПомещенныеФайлы.Количество() > 1 Тогда
					ТекстОшибки = СтрШаблон(
						НСтр("ru = 'При попытке временно добавить расширение из файла
						|""%1""
						|возникла ошибка:
						|%2'"), ПомещенныйФайл.Имя, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
				Иначе
					ТекстОшибки = СтрШаблон(
						НСтр("ru = 'При попытке временно добавить расширение возникла ошибка:
						|%1'"), ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
				КонецЕсли;
			Иначе
				ТекстОшибки = СтрШаблон(
					НСтр("ru = 'При попытке временно обновить расширение возникла ошибка:
					|%1'"), ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
			КонецЕсли;
			
			Если ТребуетсяВосстановление Тогда
				
				Попытка
					
					Если ИдентификаторРасширения = Неопределено Тогда
						ВременноеРасширение.Удалить();
					Иначе
						ВременноеРасширение = НайтиРасширение(ИдентификаторРасширения);
						Если ВременноеРасширение = Неопределено Тогда
							ВременноеРасширение = РасширенияКонфигурации.Создать();
						КонецЕсли;
						ОтключитьПредупрежденияБезопасности(ВременноеРасширение);
						ОтключитьИспользованиеОсновныхРолейДляВсехПользователей(ВременноеРасширение);
						ВременноеРасширение.Записать(ДанныеОбновляемогоРасширения);
					КонецЕсли;
					
				Исключение
					
					ИнформацияОбОшибке = ИнформацияОбОшибке();
					
					Если ИдентификаторРасширения = Неопределено Тогда
						 
						Если ПомещенныеФайлы.Количество() > 1 Тогда
							ТекстОшибки = ТекстОшибки + Символы.ПС + Символы.ПС
								+ СтрШаблон(
								НСтр("ru = 'При попытке удалить временно добавленное расширение из файла
								|%1
								|возникла еще одна ошибка:
								|%2'"), ПомещенныйФайл.Имя, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
						Иначе
							ТекстОшибки = ТекстОшибки + Символы.ПС + Символы.ПС
								+ СтрШаблон(
								НСтр("ru = 'При попытке удалить временно добавленное расширение возникла еще одна ошибка:
								|%1'"), ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
						КонецЕсли;
						
					Иначе
						ТекстОшибки = ТекстОшибки + Символы.ПС + Символы.ПС
							+ СтрШаблон(
							НСтр("ru = 'При попытке восстановить временно измененное расширение возникла еще одна ошибка:
							|%1'"), ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
					КонецЕсли;
					
				КонецПопытки;
				
			КонецЕсли;
			
			ВызватьИсключение ТекстОшибки;
			
		КонецПопытки;
		
	КонецЦикла;
	
	УстановленныеРасширения = РасширенияКонфигурации.Получить();
	Для Каждого Расширение Из УстановленныеРасширения Цикл
		Разрешение = МодульРаботаВБезопасномРежиме.РазрешениеНаИспользованиеВнешнегоМодуля(
			Расширение.Имя, Base64Строка(Расширение.ХешСумма));
		Разрешения.Добавить(Разрешение);
	КонецЦикла;
	
	ЗапросыРазрешений.Добавить(МодульРаботаВБезопасномРежиме.ЗапросНаИспользованиеВнешнихРесурсов(Разрешения,
		ОбщегоНазначения.ИдентификаторОбъектаМетаданных("РегистрСведений.ПараметрыРаботыВерсийРасширений")));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьРасширениеПродолжение(Результат, Контекст) Экспорт
	
	Если Результат <> КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	ОтобразитьДлительнуюОперацию(СтрШаблон(НСтр("ru = 'Выполняется подготовка расширения %1 к использованию.'"), 
		SUI_SimpleКлиентСервер.Представление()));
	
	ТекущийКонтекст = Контекст;
	ПодключитьОбработчикОжидания("ЗагрузитьРасширениеЗавершение", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьРасширениеЗавершение()
	
	Контекст = ТекущийКонтекст;
	
	НеподключенныеРасширения = "";
	РасширенияИзменены = Ложь;
	
	Если Контекст.Свойство("ЗаменаИмениПодтверждена") Тогда
		ПодтверждениеЗаменыИмени = Неопределено;
	Иначе
		ПодтверждениеЗаменыИмени = Новый Структура("СтароеИмя, НовоеИмя", "", "");
	КонецЕсли;
	
	Попытка
		ИзменитьРасширенияНаСервере(Контекст.ПомещенныеФайлы, НеподключенныеРасширения, 
			РасширенияИзменены, ПодтверждениеЗаменыИмени);
	Исключение
		ОтобразитьСтраницуОшибки(ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки;
	
	ОтображениеПредупрежденияПерезапуска();
	
	Если Не Контекст.Свойство("ЗаменаИмениПодтверждена") И ЗначениеЗаполнено(ПодтверждениеЗаменыИмени.СтароеИмя) Тогда
		
		ПодключитьОбработчикОжидания("ОтобразитьСтраницуОбновления", 0.1, Истина);
		
		ТекстВопроса = СтрШаблон(
			НСтр("ru = 'Расширение с именем ""%1"" будет заменено на расширение с именем ""%2"".
			|
			|Если расширение ""%2"" не является обновлением расширения ""%1"",
			|тогда следует отказаться от замены и добавить расширение ""%2"", как новое.
			|Прим.: если расширение ""%2"" не удается добавить из-за расширения ""%1"",
			|тогда следует сначала удалить расширение ""%1"", а затем добавить ""%2"".'"),
			ПодтверждениеЗаменыИмени.СтароеИмя, ПодтверждениеЗаменыИмени.НовоеИмя);
			
		ОбработчикЗавершения = Новый ОписаниеОповещения("ЗагрузитьРасширениеПослеВопросаЗаменыИмени", ЭтотОбъект, Контекст);
		
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить("Заменить",   НСтр("ru = 'Заменить'"));
		Кнопки.Добавить("НеЗаменять", НСтр("ru = 'Не заменять'"));
		
		ПараметрыВопроса = СтандартныеПодсистемыКлиент.ПараметрыВопросаПользователю();
		ПараметрыВопроса.КнопкаПоУмолчанию = "НеЗаменять";
		ПараметрыВопроса.ПредлагатьБольшеНеЗадаватьЭтотВопрос = Ложь;
		
		СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(ОбработчикЗавершения, ТекстВопроса, Кнопки, ПараметрыВопроса);
	
	ИначеЕсли Не РасширенияИзменены Тогда
		ПодключитьОбработчикОжидания("ОтобразитьСтраницуОбновления", 0.1, Истина);
	Иначе
		
		ПоказатьОповещениеПользователя(НСтр("ru = 'Расширение конфигурации обновлено'"));
		
		ОтобразитьСтраницуЗавершения(НСтр("ru = 'Расширение конфигурации обновлено'"));
		
		Если Не ЗначениеЗаполнено(НеподключенныеРасширения) Тогда
			Возврат;
		КонецЕсли;
		
		Если Контекст.ПомещенныеФайлы.Количество() > 1 Тогда
			
			Если СтрНайти(НеподключенныеРасширения, ",") > 0 Тогда
				ТекстПредупреждения = НСтр("ru = 'Некоторые расширения не подключаются:'");
			Иначе
				ТекстПредупреждения = НСтр("ru = 'Одно расширение не подключается:'");
			КонецЕсли;
			
			ТекстПредупреждения = ТекстПредупреждения + " " + НеподключенныеРасширения;
			
		Иначе
			ТекстПредупреждения = НСтр("ru = 'Расширение не подключается.'");
		КонецЕсли;
		
		ПоказатьПредупреждение(, ТекстПредупреждения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьРасширениеПослеВопросаЗаменыИмени(Результат, Контекст) Экспорт
	
	Если Результат = Неопределено Или Результат.Значение <> "Заменить" Тогда
		Возврат;
	КонецЕсли;
	
	Контекст.Вставить("ЗаменаИмениПодтверждена");
	
	ОтобразитьДлительнуюОперацию(СтрШаблон(НСтр("ru = 'Выполняется подготовка расширения %1 к использованию.'"), 
		SUI_SimpleКлиентСервер.Представление()));
	
	ТекущийКонтекст = Контекст;
	ПодключитьОбработчикОжидания("ЗагрузитьРасширениеЗавершение", 0.1, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьРасширенияНаСервере(ПомещенныеФайлы, НеподключенныеРасширения, РасширенияИзменены, ПодтверждениеЗаменыИмени)
	
	Перем Расширение;
	
	ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(ИдентификаторРасширения),
		СтрШаблон(НСтр("ru = 'Не удалось определить установленное расширение %1 по идентификатору %2'"), 
			SUI_SimpleКлиентСервер.Представление(), Строка(ИдентификаторРасширения))); 
			
	ОбщегоНазначенияКлиентСервер.Проверить(ПомещенныеФайлы.Количество() = 1,
		СтрШаблон(НСтр("ru = 'Передано слишком много файлов для обновления расширения %1'"), 
			SUI_SimpleКлиентСервер.Представление()));
			
	ВыделенныеРасширения = Новый Структура;
	Для Каждого ПомещенныйФайл Из ПомещенныеФайлы Цикл
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(ПомещенныйФайл.Хранение);
		Попытка
			ОписаниеРасширения = Новый ОписаниеКонфигурации(ДвоичныеДанные);
		Исключение
			ВызватьИсключение СтрШаблон(НСтр("ru = 'Ошибка получения описания конфигурации из файла обновления.
			|%1'"), 
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		ВыделенныеРасширения.Вставить(ОписаниеРасширения.Имя, ДвоичныеДанные);
	КонецЦикла;
	
	ПроверяемыеРасширения 	= Новый Соответствие;
	ИсходныеРасширения    	= Новый Соответствие;
	ТекстОшибки 			= "";
	
	Попытка
		
		Расширение = НайтиРасширение(ИдентификаторРасширения);
		
		ОбщегоНазначенияКлиентСервер.Проверить(Расширение <> Неопределено,
			СтрШаблон(НСтр("ru = 'Не удалось определить установленное расширение %1'"), 
			SUI_SimpleКлиентСервер.Представление()));
		
		ПрежнееИмяРасширения = Расширение.Имя;
		НовоеИмяРасширения = ПрежнееИмяРасширения;
		
		Если Не ВыделенныеРасширения.Свойство(ПрежнееИмяРасширения) Тогда
			
			Если ПодтверждениеЗаменыИмени <> Неопределено Тогда
				ПодтверждениеЗаменыИмени.СтароеИмя = ПрежнееИмяРасширения;
				ПодтверждениеЗаменыИмени.НовоеИмя = ОписаниеРасширения.Имя;
				Возврат;
			Иначе
				НовоеИмяРасширения = ОписаниеРасширения.Имя;
			КонецЕсли;
			
		КонецЕсли;
		
		ДанныеРасширения = Расширение.ПолучитьДанные();
		ИсходныеРасширения.Вставить(ПрежнееИмяРасширения, ДанныеРасширения);
		
		ОтключитьПредупрежденияБезопасности(Расширение);
		ОтключитьИспользованиеОсновныхРолейДляВсехПользователей(Расширение);
		
		НовыеДвоичныеДанные = ВыделенныеРасширения[НовоеИмяРасширения];
		
		Ошибки = Расширение.ПроверитьВозможностьПрименения(НовыеДвоичныеДанные, Ложь);
		
		Для Каждого Ошибка Из Ошибки Цикл
			Если Ошибка.Важность <> ВажностьПроблемыПримененияРасширенияКонфигурации.Критичная Тогда
				Продолжить;
			КонецЕсли;
			ТекстОшибки = ТекстОшибки + Символы.ПС + Ошибка.Описание;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Новое расширение не может быть применено по причине:
			|%1'"), ТекстОшибки);
		Иначе
			Расширение.Записать(НовыеДвоичныеДанные);
			Расширение = НайтиРасширение(ИдентификаторРасширения);
			ПроверяемыеРасширения.Вставить(Расширение.Имя, Расширение.Синоним);
			НоваяУстановленнаяВерсия = Расширение.Версия;
		КонецЕсли;
			
	Исключение
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Не удалось обновить расширение по причине:
		|%1'"), ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда
		
		Попытка
			РегистрыСведений.ПараметрыРаботыВерсийРасширений.ОбновитьПараметрыРаботыРасширений(ПроверяемыеРасширения, НеподключенныеРасширения);
			РасширенияИзменены = Истина;
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ТекстОшибки = СтрШаблон(НСтр("ru = 'После обновления, при подготовке расширений к работе, произошла ошибка:
			|%1'"), ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
		КонецПопытки;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		
		ИнформацияОбОшибкеВосстановления = Неопределено;
		ВосстановлениеВыполнялось = Ложь;
		
		Попытка

			Для Каждого ПроверяемоеРасширение Из ПроверяемыеРасширения Цикл
				
				ДанныеРасширения = ИсходныеРасширения[ПроверяемоеРасширение.Ключ];
				
				Расширение = НайтиРасширение(ИдентификаторРасширения);
				
				Если Расширение = Неопределено Тогда
					Расширение = РасширенияКонфигурации.Создать();
				КонецЕсли;
				
				ОтключитьПредупрежденияБезопасности(Расширение);
				ОтключитьИспользованиеОсновныхРолейДляВсехПользователей(Расширение);
				
				Расширение.Записать(ДанныеРасширения);
				
			КонецЦикла;
			
			ВосстановлениеВыполнялось = Истина;

		Исключение
			ТекстОшибки = ТекстОшибки + Символы.ПС + Символы.ПС + СтрШаблон(
				НСтр("ru = 'При попытке восстановить измененное расширение произошла еще одна ошибка:
				|%1'"), ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
				
		Если ВосстановлениеВыполнялось И ИнформацияОбОшибкеВосстановления = Неопределено Тогда
			
			Если ПроверяемыеРасширения.Количество() > 0 Тогда
				ТекстОшибки = ТекстОшибки + Символы.ПС + Символы.ПС + НСтр("ru = 'Измененное расширение было восстановлено.'");
			Иначе
				ТекстОшибки = ТекстОшибки + Символы.ПС + Символы.ПС + НСтр("ru = 'Расширение не было изменено.'");
			КонецЕсли;

		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		НоваяУстановленнаяВерсия = "";
		ВызватьИсключение ТекстОшибки;
	Иначе
		ТекущаяВерсия = НоваяУстановленнаяВерсия;
	КонецЕсли;
	
	ОбновитьОтображениеПредупрежденияПерезапуска();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтображениеПредупрежденияПерезапуска()
	
	УстановитьПривилегированныйРежим(Истина);
	
	УстановленныеРасширения = Справочники.ВерсииРасширений.УстановленныеРасширения();
	
	Если ПараметрыСеанса.УстановленныеРасширения.ОсновныеСостояние <> УстановленныеРасширения.ОсновныеСостояние Тогда
		ИзменилосьСостояниеРасширений = Истина;
	Иначе
		ИзменилосьСостояниеРасширений = Ложь;
	КонецЕсли;
	
	ОбновлениеВерсииДанныхВыполнено = SUI_ОбщегоНазначенияКлиентСервер.СравнитьВерсии(
		ТекущаяВерсия, ТекущаяВерсияДанных) = 0;
	
КонецПроцедуры

#КонецОбласти
