
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьВФайловойСистеме(Команда)

	Оповещение = Новый ОписаниеОповещения("СохранитьВФайловойСистемеЗавершение", ЭтотОбъект);

	ПараметрыСохранения = ФайловаяСистемаКлиент.ПараметрыСохраненияФайла();
	
	ПараметрыСохранения.Диалог.Фильтр = НСтр("ru = 'Файл пакета данных'") + "(*.json)|*.json";
	ПараметрыСохранения.Диалог.МножественныйВыбор = Ложь;
	
	ФайловаяСистемаКлиент.СохранитьФайл(Оповещение, ПолучитьПакет(), "data.json", ПараметрыСохранения);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьПакет()
	
	АдресФайла = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	SUI_ПакетыДанных.Данные
		|ИЗ
		|	РегистрСведений.Удалить_SUI_ПакетыДанных КАК SUI_ПакетыДанных
		|ГДЕ
		|	SUI_ПакетыДанных.ИдентификаторПакета = &ИдентификаторПакета";
	
	Запрос.УстановитьПараметр("ИдентификаторПакета", Запись.ИдентификаторПакета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда

		Выборка = РезультатЗапроса.Выбрать();
		
		Выборка.Следующий();
		
		СтрокаJSON = Выборка.Данные.Получить();
		
		Если ТипЗнч(СтрокаJSON) <> Тип("Строка") Тогда
			АдресФайла = ПоместитьВоВременноеХранилище(СтрокаJSON);
		КонецЕсли;

	КонецЕсли;
	
	Возврат АдресФайла;
	
КонецФункции

&НаКлиенте
Процедура СохранитьВФайловойСистемеЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если ТипЗнч(Результат) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;

	ПутиФайлов = Новый Массив();
	
	Для Каждого Элемент Из Результат Цикл
		ПутиФайлов.Добавить(Элемент.ПолноеИмя);
	КонецЦикла;

	ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Файл пакета данных сохранен:
		|%1'"), СтрСоединить(ПутиФайлов, Символы.ПС)));
   
КонецПроцедуры

#КонецОбласти
