
//@skip-check doc-comment-collection-item-type
#Область ПрограммныйИнтерфейс

// Записать в таблицы.
// 
// Параметры:
//  Параметры - Структура - Параметры:
// * СписокТаблиц - СписокЗначений, Массив, ФиксированныйМассив, ПеречислениеСсылка.SUI_ТаблицыИнтеграции - Список таблиц интеграции
//  АдресРезультата - Строка - Адрес результата
Процедура ЗаписатьВТаблицы(Параметры, АдресРезультата) Экспорт
	
	ВремяНачалоОбщее = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ТаблицыКЗаписи = ТаблицыИнтеграцииИзПараметров(Параметры);
	
	Для Каждого ТаблицаКЗаписи Из ТаблицыКЗаписи Цикл
		
		ВремяНачало = ТекущаяУниверсальнаяДатаВМиллисекундах();
		
		ДлительныеОперации.СообщитьПрогресс(, СтрШаблон(НСтр("ru = 'Выгрузка в таблицу ""%1""'"), ТаблицаКЗаписи.Значение));
		
		Если Параметры.Свойство("ОчиститьТаблицу") И Параметры.ОчиститьТаблицу Тогда
			
			ПараметрыОчистки = Новый Структура();
			ПараметрыОчистки.Вставить("СписокТаблиц", ТаблицаКЗаписи.Значение);
			ПараметрыОчистки.Вставить("НеСообщатьПрогресс");
			ПараметрыОчистки.Вставить("НеВыводитьОбщееСообщение");
			
			ОчиститьТаблицы(ПараметрыОчистки, Неопределено);
			
		КонецЕсли;
		
		ПараметрыЗаписи = ПараметрыЗаписи(ТаблицаКЗаписи.Значение);
		
		Если ПараметрыЗаписи.Настройки = Неопределено Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Не удалось получить настройки для выгрузки в таблицу ""%1"".'"), 
				ТаблицаКЗаписи.Значение);
		Иначе
			
			ВыполнитьЗаписьВТаблицы(ПараметрыЗаписи, Истина);
			
			ТаблицаКЗаписи.Пометка = Истина;
			
			РазницаВремени = ТекущаяУниверсальнаяДатаВМиллисекундах() - ВремяНачало;
			ПредставлениеРазницыВремени = SUI_ОбщегоНазначенияКлиентСервер.ПолучитьПредставлениеРазницыВремени(
				РазницаВремени, Истина);
			ТекстСообщения = СтрШаблон(НСтр("ru = '[%1]: Выгрузка выполнена (время: %2).'"), 
				ТаблицаКЗаписи.Значение, ПредставлениеРазницыВремени);
			
		КонецЕсли;
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
	КонецЦикла;
	
	Если ТаблицыКЗаписи.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Выгрузка не выполнена. Отсутствуют данные для выгрузки.'");
	Иначе
		
		РазницаВремени = ТекущаяУниверсальнаяДатаВМиллисекундах() - ВремяНачалоОбщее;
		ПредставлениеРазницыВремени = SUI_ОбщегоНазначенияКлиентСервер.ПолучитьПредставлениеРазницыВремени(
			РазницаВремени, Истина);
		
		НеВыгруженныеТаблицы = Новый Массив();
		Для Каждого Элемент Из ТаблицыКЗаписи Цикл
			Если Не Элемент.Пометка Тогда
				НеВыгруженныеТаблицы.Добавить("- " + Строка(Элемент.Значение) + ";");
			КонецЕсли;
		КонецЦикла;
		
		Если НеВыгруженныеТаблицы.Количество() = 0 Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Выгрузка выполнена (время: %1).'"), ПредставлениеРазницыВремени);
		Иначе
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Выгрузка выполнена частично (время: %1). Не выгруженные таблицы:
			|- %2'"), 
			ПредставлениеРазницыВремени, СтрСоединить(НеВыгруженныеТаблицы, Символы.ПС));
		КонецЕсли;
		
	КонецЕсли;
	
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

// Очистить таблицы.
// 
// Параметры:
//  Параметры - Структура - Параметры:
// * СписокТаблиц - СписокЗначений, Массив, ФиксированныйМассив, ПеречислениеСсылка.SUI_ТаблицыИнтеграции - Список таблиц интеграции
//  АдресРезультата - Строка - Адрес результата
Процедура ОчиститьТаблицы(Параметры, АдресРезультата) Экспорт
	
	ВремяНачалоОбщее = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	// Оценка производительности
	ОценкаПроизводительности_НачалоЗамера = SUI_ОценкаПроизводительностиПереопределяемый.НачатьЗамерВремени();
	ОценкаПроизводительности_ВесЗамера = 0;
	ОценкаПроизводительности_КлючеваяОперация = "ОчисткаТаблиц";
	
	ТаблицыКОчистке = ТаблицыИнтеграцииИзПараметров(Параметры);
	
	// Оценка производительности
	ОценкаПроизводительности_ВесЗамера = ТаблицыКОчистке.Количество();
	
	Для Каждого ТаблицаКОчистке Из ТаблицыКОчистке Цикл
		
		ВремяНачало = ТекущаяУниверсальнаяДатаВМиллисекундах();
		
		НачатьТранзакцию();
		
		Попытка
			
			ИмяТаблицы = SUI_НастройкиМетаданныхСервер.ПолучитьИмяТаблицыВКонфигурации(ТаблицаКОчистке.Значение);
			
			Если ЗначениеЗаполнено(ИмяТаблицы) Тогда
				
				Если Не Параметры.Свойство("НеСообщатьПрогресс") Тогда
					ДлительныеОперации.СообщитьПрогресс(, СтрШаблон(
						НСтр("ru = 'Удаление записей таблицы ""%1""'"), 
						ТаблицаКОчистке.Значение));
				КонецЕсли;
				
				МенеджерТаблицы = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ИмяТаблицы);
				НаборЗаписей = МенеджерТаблицы.СоздатьНаборЗаписей();
				НаборЗаписей.Записать(Истина);
				
				РазницаВремени = ТекущаяУниверсальнаяДатаВМиллисекундах() - ВремяНачало;
				ПредставлениеРазницыВремени = SUI_ОбщегоНазначенияКлиентСервер.ПолучитьПредставлениеРазницыВремени(
					РазницаВремени, Истина);
				ТекстСообщения = СтрШаблон(НСтр("ru = '[%1]: Записи удалены (время: %2)'"), 
					ТаблицаКОчистке.Значение, ПредставлениеРазницыВремени);
				
			Иначе
				ТекстСообщения = СтрШаблон(
					НСтр("ru = '[%1]: Записи не были удалены. Не удалось определить таблицу конфигурации.'"), 
					ТаблицаКОчистке.Значение);
			КонецЕсли;
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			Ошибка = ИнформацияОбОшибке();
			
			SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(НСтр("ru = 'Очистка таблиц'"), , 
				Метаданные.ОбщиеМодули.SUI_ИнтеграцияВКонфигурацию, ТаблицаКОчистке.Значение, Ошибка);
			
			// Оценка производительности
			SUI_ОценкаПроизводительностиПереопределяемый.ЗакончитьЗамерВремени(
				ОценкаПроизводительности_КлючеваяОперация, 
				ОценкаПроизводительности_НачалоЗамера, 
				ОценкаПроизводительности_ВесЗамера, 
				ОбработкаОшибок.КраткоеПредставлениеОшибки(Ошибка), 
				Истина);
				
			ВызватьИсключение;
			
		КонецПопытки;
	
	КонецЦикла;
	
	// Оценка производительности
	Если ОценкаПроизводительности_ВесЗамера > 0 Тогда
		SUI_ОценкаПроизводительностиПереопределяемый.ЗакончитьЗамерВремени(ОценкаПроизводительности_КлючеваяОперация, 
			ОценкаПроизводительности_НачалоЗамера, ОценкаПроизводительности_ВесЗамера);
	КонецЕсли;
	
	Если Не Параметры.Свойство("НеВыводитьОбщееСообщение") Тогда
		
		РазницаВремени = ТекущаяУниверсальнаяДатаВМиллисекундах() - ВремяНачалоОбщее;
		ПредставлениеРазницыВремени = SUI_ОбщегоНазначенияКлиентСервер.ПолучитьПредставлениеРазницыВремени(
			РазницаВремени, Истина);
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Очистка таблиц выполнена (время: %1).'"), ПредставлениеРазницыВремени);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

// Проверить БСП.
// 
// Возвращаемое значение:
//  Булево - Проверить БСП
Функция ПроверитьБСП() Экспорт
	
	Если Метаданные.ОбщиеМодули.Найти("СтандартныеПодсистемыСервер") = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПоддерживаемыеВерсии = Новый Массив();
	ПоддерживаемыеВерсии.Добавить("3.0");
	ПоддерживаемыеВерсии.Добавить("3.1");
	
	ВерсияБСП = СтандартныеПодсистемыСервер.ВерсияБиблиотеки();
	
	РазрядыВерсииБСП = СтрРазделить(ВерсияБСП, ".", Ложь);
	
	Если РазрядыВерсииБСП.Количество() < 2 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЧастьВерсииКПроверке = РазрядыВерсииБСП[0] + "." + РазрядыВерсииБСП[1];
	
	Возврат (ПоддерживаемыеВерсии.Найти(ЧастьВерсииКПроверке) <> Неопределено);
	
КонецФункции

// Найти в таблице по значению.
// 
// Параметры:
//  Таблица - ПеречислениеСсылка.SUI_ТаблицыИнтеграции - Таблица поиска
//  ИмяКолонки - Строка - Имя колонки поиска
//  Значение - Произвольный - Значение поиска
// 
// Возвращаемое значение:
//  РезультатЗапроса, Неопределено - Найти в таблице по значению
Функция НайтиВТаблицеПоЗначению(Таблица, ИмяКолонки, Значение) Экспорт
	
	Перем Результат, ТекстСообщения;
	
	Если SUI_НастройкиМетаданныхСервер.ТаблицаИспользуется(Таблица) Тогда
		
		ИмяТаблицыВКонфигурации = SUI_НастройкиМетаданныхСервер.ПолучитьИмяТаблицыВКонфигурации(Таблица);
		
		Если ЗначениеЗаполнено(ИмяТаблицыВКонфигурации) Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ
				|	*
				|ИЗ
				|	" + ИмяТаблицыВКонфигурации + " КАК Таблица
				|ГДЕ
				|	Таблица." + ИмяКолонки + " = &" + ИмяКолонки;
			
			Запрос.УстановитьПараметр(ИмяКолонки, Значение);
			
			Результат = Запрос.Выполнить();
		
		Иначе
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Для таблицы ""%1"" не определена таблица конфигурации'"), Таблица);
		КонецЕсли;
		
	Иначе
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Таблица ""%1"" не используется'"), Таблица);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстСообщения) Тогда
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#Область ИдентификаторыSimple

// Получить идентификатор Simple по ссылке.
// 
// Параметры:
//  Ссылка - ЛюбаяСсылка - Ссылка объекта для получения идентификатора Simple
//  ОтключитьПроверку - Булево - Отключить проверку на тип ссылки и пустую ссылку.
// 
// Возвращаемое значение:
//  Неопределено, Строка - Идентификатор Simple по ссылке или Неопределено, если переменная Ссылка не является ссылкой объекта 
//	или не существует.
Функция ИдентификаторSimpleПоСсылке(Ссылка, ОтключитьПроверку = Ложь) Экспорт
	
	Идентификатор = "";
	
	Если Не ОтключитьПроверку Тогда
		
		Если Не SUI_ОбщегоНазначенияПереопределяемый.ЭтоСсылка(ТипЗнч(Ссылка)) Или 
			Не ОбщегоНазначения.СсылкаСуществует(Ссылка) Тогда
			Возврат Идентификатор;
		КонецЕсли;
		
	КонецЕсли;
	
	Идентификатор = ЗначениеВСтрокуВнутр(Ссылка);
	
	Если СтрНачинаетсяС(Идентификатор, "{""#"",") И Прав(Идентификатор, 1) = "}" Тогда
		
		Идентификатор = Сред(Идентификатор, 6);  
		Идентификатор = Сред(Идентификатор, 1, СтрНайти(Идентификатор, ",") - 1) + "-" + Сред(Идентификатор, СтрНайти(Идентификатор, ":") + 1);
		Идентификатор = Лев(Идентификатор, СтрДлина(Идентификатор) - 1);
		
		Если СтрДлина(Идентификатор) <> 69 Тогда
			Идентификатор = "";	
		КонецЕсли;
	
	Иначе
		Идентификатор = "";
	КонецЕсли;
	
	Возврат Идентификатор;
	
КонецФункции

// Получить ссылку объекта по идентификатору Simple.
// 
// Параметры:
//  Идентификатор - Строка - Идентификатор Simple
//  ОтключитьПроверку - Булево - Отключить проверку на тип ссылки и пустую ссылку.
// 
// Возвращаемое значение:
//  Неопределено, ЛюбаяСсылка - Ссылка объекта полученная по идентификатору Simple или Неопределено, если идентификатор
//	не является идентификатором Simple или полученный объект по идентификатору не является ссылочным типом или не существует.
Функция СсылкаПоИдентификаторуSimple(Знач Идентификатор, ОтключитьПроверку = Ложь) Экспорт
	
	Перем Ссылка;
	
	Если SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(Идентификатор) Тогда
		
		Идентификатор = НРег(Идентификатор);
		
		Попытка
			Ссылка = ЗначениеИзСтрокиВнутр("{""#""," + Лев(Идентификатор, 36) + ",1:" + Прав(Идентификатор, 32) + "}");
		Исключение
			Ссылка = Неопределено;
		КонецПопытки;
		
		Если Не ОтключитьПроверку Тогда
			
			Если Не SUI_ОбщегоНазначенияПереопределяемый.ЭтоСсылка(ТипЗнч(Ссылка)) Или 
				Не ОбщегоНазначения.СсылкаСуществует(Ссылка) Тогда
				Ссылка = Неопределено;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ссылка;
	
КонецФункции

// Привести ссылки к идентификаторам simple.
// 
// Параметры:
//  Данные - ЛюбаяСсылка, Структура, Соответствие, СписокЗначений, Массив из Структура - Данные
//  ИсключитьСвойства - Строка - Исключить свойства структуры или соответствия
//	ИсключитьПустыеИдентификаторы - Булево - Пустой идентификатор Simple как пустая строка
// 
// Возвращаемое значение:
//  Строка, Структура, Соответствие, СписокЗначений, Массив из Структура - Данные
//@skip-check doc-comment-collection-item-type
Функция ПривестиСсылкиКИдентификаторамSimple(Данные, ИсключитьСвойства = "", ИсключитьПустыеИдентификаторы = Истина) Экспорт 
	
	ТипДанных = ТипЗнч(Данные);
	ТипДанныхСтрокой = Строка(ТипДанных); // RS. Кучик
	
	Если ТипДанных = Тип("Массив") Тогда
		
		Для Индекс = 0 По Данные.ВГраница() Цикл
			ПривестиСсылкиКИдентификаторамSimple(Данные[Индекс], ИсключитьСвойства, ИсключитьПустыеИдентификаторы);
		КонецЦикла;
		
	ИначеЕсли ТипДанных = Тип("СписокЗначений") Тогда
		Данные.ЗагрузитьЗначения(ПривестиСсылкиКИдентификаторамSimple(
			Данные.ВыгрузитьЗначения(), ИсключитьСвойства, ИсключитьПустыеИдентификаторы));	
	ИначеЕсли ТипДанных = Тип("Структура") Или ТипДанных = Тип("Соответствие") Тогда
		
		ИсключаемыеСвойства = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИсключитьСвойства, ",", , Истина);
		
		Для Каждого КлючЗначение Из Данные Цикл
			
			Если ИсключаемыеСвойства.Найти(КлючЗначение.Ключ) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Значение = КлючЗначение.Значение;
			Данные.Вставить(КлючЗначение.Ключ, ПривестиСсылкиКИдентификаторамSimple(
				Значение, ИсключитьСвойства, ИсключитьПустыеИдентификаторы));
			
		КонецЦикла;
		
	ИначеЕсли ОбщегоНазначения.ЭтоСсылка(ТипДанных) Тогда
		
		Если ОбщегоНазначения.СсылкаСуществует(Данные) Или Не ИсключитьПустыеИдентификаторы Тогда
			Данные = ИдентификаторSimpleПоСсылке(Данные, Истина);
		Иначе
			Данные = "";
		КонецЕсли;
		
	// RS. Кучик
	ИначеЕсли ТипДанныхСтрокой = "Ячейка (Simple)" Тогда
		
		Если ОбщегоНазначения.СсылкаСуществует(Данные) Или Не ИсключитьПустыеИдентификаторы Тогда
			Данные = ИдентификаторSimpleПоСсылке(Данные, Истина);
		Иначе
			Данные = "";
		КонецЕсли;
		
	//~RS
	КонецЕсли;
	
	//@skip-check constructor-function-return-section
	Возврат Данные;
	
КонецФункции

// Восстановить ссылки идентификаторов simple.
// 
// Параметры:
//  Данные - Строка, Структура, Соответствие, СписокЗначений, Массив из Структура - Данные
//  ИсключитьСвойства - Строка - Исключить свойства
//  ПроверятьНаСсылку - Булево - Проверять на ссылочный тип и существование ссылки после восстановления
//	ЗначенияТолькоИдентификаторов - Булево - Оставить в структуре значения только идентификаторов
// 
// Возвращаемое значение:
//  Строка, Структура, Соответствие, СписокЗначений, Массив из Структура - Данные
//@skip-check doc-comment-collection-item-type
Функция ВосстановитьСсылкиИдентификаторовSimple(Данные, ИсключитьСвойства = "", ПроверятьНаСсылку = Истина,
	ЗначенияТолькоИдентификаторов = Ложь) Экспорт 
	
	ТипДанных = ТипЗнч(Данные);
	
	Если ТипДанных = Тип("Массив") Тогда
		
		Для Индекс = 0 По Данные.ВГраница() Цикл
			ВосстановитьСсылкиИдентификаторовSimple(Данные[Индекс], ИсключитьСвойства, ПроверятьНаСсылку, ЗначенияТолькоИдентификаторов);
		КонецЦикла;
		
	ИначеЕсли ТипДанных = Тип("СписокЗначений") Тогда
		Данные.ЗагрузитьЗначения(ВосстановитьСсылкиИдентификаторовSimple(
			Данные.ВыгрузитьЗначения(), ИсключитьСвойства, ПроверятьНаСсылку, ЗначенияТолькоИдентификаторов));
	ИначеЕсли ТипДанных = Тип("Структура") Или ТипДанных = Тип("Соответствие") Тогда
		
		ИсключаемыеСвойства = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИсключитьСвойства, ",", , Истина);
		
		Для Каждого КлючЗначение Из Данные Цикл
			
			Если ИсключаемыеСвойства.Найти(КлючЗначение.Ключ) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
		
			Значение = КлючЗначение.Значение;
			Данные.Вставить(КлючЗначение.Ключ, ВосстановитьСсылкиИдентификаторовSimple(
				Значение, ИсключитьСвойства, ПроверятьНаСсылку, ЗначенияТолькоИдентификаторов));
		
		КонецЦикла;
		
	ИначеЕсли ТипДанных = Тип("Строка") И SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(Данные) Тогда
		Данные = СсылкаПоИдентификаторуSimple(Данные, Не ПроверятьНаСсылку);
	КонецЕсли;
	
	//@skip-check constructor-function-return-section
	Возврат Данные;
	
КонецФункции

// Установить действие открытия идентификаторов.
// 
// Параметры:
//  Форма - Форма - Форма
//  ПрефиксЭлемента - Строка - Префикс элемента
//  Действие - Строка - Действие
Процедура УстановитьДействиеОткрытияИдентификаторов(Форма, ПрефиксЭлемента = "", Действие = "") Экспорт 
	
	Если ПустаяСтрока(Действие) Тогда
		Действие = "SUI_Переопределяемый_ОткрытиеИдентификатора";
	КонецЕсли;
	
	Для Каждого ЭлементФормы Из Форма.Элементы Цикл
		
		Если ТипЗнч(ЭлементФормы) <> Тип("ПолеФормы") Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЭлементФормы.Вид <> ВидПоляФормы.ПолеВвода Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЭлементФормы.КнопкаОткрытия <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПустаяСтрока(ЭлементФормы.ПутьКДанным) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ПустаяСтрока(ПрефиксЭлемента) Тогда
			
			Если Не СтрНачинаетсяС(ЭлементФормы.Имя, ПрефиксЭлемента) Тогда
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		
		мсвПутьКДанным = СтрРазделить(ЭлементФормы.ПутьКДанным, ".", Ложь);
		
		ДанныеЭлемента = Неопределено;
		Для Индекс = 0 По мсвПутьКДанным.ВГраница() Цикл
			
			Если Индекс = 0 Тогда
				ДанныеЭлемента = Форма[мсвПутьКДанным[Индекс]];
			Иначе 
				ДанныеЭлемента = ДанныеЭлемента[мсвПутьКДанным[Индекс]];
			КонецЕсли;
			
		КонецЦикла;

		Если ТипЗнч(ДанныеЭлемента) <> Тип("Строка") Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементФормы.КнопкаОткрытия = Истина;
		ЭлементФормы.УстановитьДействие("Открытие", Действие);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

//@skip-check method-too-many-params
#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПодписокНаСобытия

Процедура КонстантыИспользоватьТаблицуПриЗаписи(Источник, Отказ) Экспорт

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не Источник.ДополнительныеСвойства.Свойство("SUI_НеОчищатьТаблицу") Тогда
		
		ЭтаКонстанта = Константы[Метаданные.НайтиПоТипу(ТипЗнч(Источник)).Имя];
		
		ТаблицаИнтеграции = SUI_НастройкиМетаданныхСервер.ПолучитьТаблицуИнтеграцииПоКонстанте(ЭтаКонстанта);
		
		Если ТаблицаИнтеграции <> Неопределено Тогда
			
			ПараметрыОчистки = Новый Структура();
			ПараметрыОчистки.Вставить("СписокТаблиц", ТаблицаИнтеграции);
			ПараметрыОчистки.Вставить("НеСообщатьПрогресс");
			
			ОчиститьТаблицы(ПараметрыОчистки, Неопределено);
			
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

Процедура СправочникиПриЗаписи(Источник, Отказ) Экспорт
	
	Если Отказ Или Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыЗаписи = ПараметрыЗаписи(, Источник);
	
	Если ПараметрыЗаписи.Настройки <> Неопределено Тогда
		
		ВыполнитьЗаписьВТаблицы(ПараметрыЗаписи);
		
	ИначеЕсли (ПараметрыЗаписи.ОбъектДанныхИмя = "SUI_ПользователиТСД" Или 
		ПараметрыЗаписи.ОбъектДанныхИмя = "SUI_НастройкиДокументов") И 
		ПараметрыЗаписи.ОтключитьМеханизмРегистрацииОбъектов Тогда
		
		Источник.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
		Источник.ОбменДанными.Получатели.Очистить();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СправочникиПередУдалением(Источник, Отказ) Экспорт
	
	Если Отказ Или Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыЗаписи = ПараметрыЗаписи(, Источник);
	
	Если ПараметрыЗаписи.Настройки <> Неопределено Тогда
		
		ПараметрыЗаписи.УдалениеДанных = Истина;
		
		ВыполнитьЗаписьВТаблицы(ПараметрыЗаписи);
		
	ИначеЕсли (ПараметрыЗаписи.ОбъектДанныхИмя = "SUI_ПользователиТСД" Или 
		ПараметрыЗаписи.ОбъектДанныхИмя = "SUI_НастройкиДокументов") И 
		ПараметрыЗаписи.ОтключитьМеханизмРегистрацииОбъектов Тогда
		
		Источник.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
		Источник.ОбменДанными.Получатели.Очистить();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура РегистрыСведенийПередЗаписью(Источник, Отказ, Замещение) Экспорт
	
	Если Отказ Или Источник.ОбменДанными.Загрузка Или Источник.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не SUI_НастройкиМетаданныхСервер.ЭтоТаблицаИнтеграции(Источник.Метаданные().ПолноеИмя()) Тогда
		
		ПараметрыЗаписи = ПараметрыЗаписи(, Источник);
		
		Если ПараметрыЗаписи.Настройки <> Неопределено Тогда
			
			ПараметрыЗаписи.УдалениеДанных = Истина;
			
			ВыполнитьЗаписьВТаблицы(ПараметрыЗаписи);
			
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

Процедура РегистрыСведенийПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	Если Отказ Или Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если SUI_НастройкиМетаданныхСервер.ЭтоТаблицаИнтеграции(Источник.Метаданные().ПолноеИмя()) Тогда
		
		Если Источник.ДополнительныеСвойства.Свойство("ОтключитьМеханизмРегистрацииОбъектов") Тогда
			
			Источник.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
			Источник.ОбменДанными.Получатели.Очистить();
			
		КонецЕсли;
		
	ИначеЕсли Источник.Количество() > 0 Тогда
		
		ПараметрыЗаписи = ПараметрыЗаписи(, Источник);
		
		Если ПараметрыЗаписи.Настройки <> Неопределено Тогда
			
			ВыполнитьЗаписьВТаблицы(ПараметрыЗаписи);
			
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

Функция СформироватьИдентификатор(Значение1, Значение2 = Неопределено, Значение3 = Неопределено, 
	Значение4 = Неопределено, Значение5 = Неопределено, Значение6 = Неопределено, 
	Значение7 = Неопределено, Значение8 = Неопределено, Значение9 = Неопределено) Экспорт
	
	ПереданныеЗначения = Новый Массив;
	ПереданныеЗначения.Добавить(Значение9);
	ПереданныеЗначения.Добавить(Значение8);
	ПереданныеЗначения.Добавить(Значение7);
	ПереданныеЗначения.Добавить(Значение6);
	ПереданныеЗначения.Добавить(Значение5);
	ПереданныеЗначения.Добавить(Значение4);
	ПереданныеЗначения.Добавить(Значение3);
	ПереданныеЗначения.Добавить(Значение2);
	ПереданныеЗначения.Добавить(Значение1);
	
	МассивЗначений = Новый Массив;
	
	Для индекс = 0 По ПереданныеЗначения.ВГраница() Цикл
		Если МассивЗначений.Количество() = 0 И ПереданныеЗначения[индекс] = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		МассивЗначений.Вставить(0, ПереданныеЗначения[индекс]);
	КонецЦикла;
	
	Если МассивЗначений.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Недопустимая операция'");
	ИначеЕсли МассивЗначений.Количество() = 1 И 
		SUI_ОбщегоНазначенияПереопределяемый.ЭтоСсылка(ТипЗнч(МассивЗначений[0])) Тогда
		Возврат ИдентификаторSimpleПоСсылке(МассивЗначений[0], Истина);
	Иначе
		Возврат НРег(ОбщегоНазначения.КонтрольнаяСуммаСтрокой(МассивЗначений, ХешФункция.SHA256));
	КонецЕсли;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция МенеджерНастроек()
	
	Возврат РегистрыСведений.SUI_НастройкиТаблицИнтеграции;
	
КонецФункции

Функция ПараметрыЗаписи(ТаблицаИнтеграции = Неопределено, ОбъектДанных = Неопределено)
	
	ПараметрыЗаписи = Новый Структура();
	ПараметрыЗаписи.Вставить("УдалениеДанных", 							Ложь);
	ПараметрыЗаписи.Вставить("ОтключитьМеханизмРегистрацииОбъектов", 	Ложь);
	ПараметрыЗаписи.Вставить("ТаблицаИнтеграции", 						ТаблицаИнтеграции);
	ПараметрыЗаписи.Вставить("ОбъектДанных", 							ОбъектДанных);
	ПараметрыЗаписи.Вставить("ОбъектДанныхИмя", 						"");
	ПараметрыЗаписи.Вставить("ОбъектДанныхПолноеИмя", 					"");
	ПараметрыЗаписи.Вставить("ВидОбъектаДанных", 						"");
	ПараметрыЗаписи.Вставить("ПараметрыСКД", 							Новый Структура());
	ПараметрыЗаписи.Вставить("Настройки");
	
	Если ПараметрыЗаписи.ОбъектДанных <> Неопределено Тогда
		
		ТипОбъекта = XMLТип(ТипЗнч(ПараметрыЗаписи.ОбъектДанных));
		ТипОбъекта = ?(ТипОбъекта = Неопределено, "", ТипОбъекта.ИмяТипа);
		
		Если СтрНачинаетсяС(ТипОбъекта, "CatalogObject.") Тогда
			ПараметрыЗаписи.ВидОбъектаДанных = "Справочник";
		ИначеЕсли СтрНачинаетсяС(ТипОбъекта, "InformationRegisterRecordSet.") Тогда
			ПараметрыЗаписи.ВидОбъектаДанных = "РегистрСведений";
		Иначе
			ПараметрыЗаписи.ОбъектДанных = Неопределено;
		КонецЕсли;
		
		Если ПараметрыЗаписи.ОбъектДанных <> Неопределено Тогда
			
			Если ПараметрыЗаписи.ОбъектДанных.ДополнительныеСвойства.Свойство("ОтключитьМеханизмРегистрацииОбъектов") Тогда
				ПараметрыЗаписи.ОтключитьМеханизмРегистрацииОбъектов = Истина;
			КонецЕсли;
			
			МетаданныеОбъектаДанных = ПараметрыЗаписи.ОбъектДанных.Метаданные();
			
			ПараметрыЗаписи.ОбъектДанныхИмя = МетаданныеОбъектаДанных.Имя;
			ПараметрыЗаписи.ОбъектДанныхПолноеИмя = МетаданныеОбъектаДанных.ПолноеИмя();
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПараметрыЗаписи.ТаблицаИнтеграции <> Неопределено Или ПараметрыЗаписи.ОбъектДанных <> Неопределено Тогда
		
		ПараметрыПолученияНастроек = МенеджерНастроек().ПараметрыПолученияНастроек(
			ПараметрыЗаписи.ТаблицаИнтеграции, ПараметрыЗаписи.ОбъектДанныхПолноеИмя);
		
		Если Не ЗначениеЗаполнено(ПараметрыПолученияНастроек.ИмяОбъекта) Тогда
			ПараметрыПолученияНастроек.ИмяОбъекта = Неопределено;
		КонецЕсли;
		
		ПараметрыЗаписи.Настройки = МенеджерНастроек().ПолучитьНастройки(ПараметрыПолученияНастроек);
		
		Если ПараметрыЗаписи.Настройки.Количество() = 0 Тогда
			ПараметрыЗаписи.Настройки = Неопределено;
		ИначеЕсли ПараметрыЗаписи.ОбъектДанных <> Неопределено Тогда
			
			Если ПараметрыЗаписи.ВидОбъектаДанных = "Справочник" Тогда
				ПараметрыЗаписи.ПараметрыСКД.Вставить("Ссылка", ПараметрыЗаписи.ОбъектДанных.Ссылка);
			ИначеЕсли ПараметрыЗаписи.ВидОбъектаДанных = "РегистрСведений" Тогда
				
				Для Каждого ЭлементОтбораНабораЗаписей Из ПараметрыЗаписи.ОбъектДанных.Отбор Цикл
					ПараметрыЗаписи.ПараметрыСКД.Вставить(ЭлементОтбораНабораЗаписей.Имя, ЭлементОтбораНабораЗаписей.Значение);
				КонецЦикла;
				
			КонецЕсли;
			
			Если ПараметрыЗаписи.ПараметрыСКД.Количество() = 0 Тогда
				ПараметрыЗаписи.Настройки = Неопределено;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ПараметрыЗаписи;
	
КонецФункции

Процедура ВыполнитьЗаписьВТаблицы(ПараметрыЗаписи, ЗамерПроизводительности = Ложь)
	
	УдалениеДанных = ПараметрыЗаписи.УдалениеДанных;
	
	Для Каждого Настройка Из ПараметрыЗаписи.Настройки Цикл
		
		// Оценка производительности
		Если ЗамерПроизводительности Тогда
			
			ОценкаПроизводительности_НачалоЗамера = SUI_ОценкаПроизводительностиПереопределяемый.НачатьЗамерВремени();
			ОценкаПроизводительности_ВесЗамера = 0;
			ОценкаПроизводительности_КлючеваяОперация = СтрШаблон("Выгрузка в таблицу: %1 (%2)", 
				Настройка.ТаблицаИнтеграции, Настройка.ИмяОбъекта);
			
		Иначе
			ОценкаПроизводительности_ВесЗамера = Неопределено;
		КонецЕсли;
		
		Попытка
			
			Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных();
			SUI_КомпоновкаДанныхСервер.ИнициализироватьКомпоновщикНастроек(Компоновщик, Настройка.СхемаКомпоновкиДанных, 
				Настройка.НастройкиКомпоновкиДанных);
			
			НастройкаКомпоновки = Компоновщик.ПолучитьНастройки();
			
			УстановитьСлужебныеПоля(НастройкаКомпоновки, Настройка.ИмяОбъекта, ПараметрыЗаписи.ПараметрыСКД);
			
			Если ПараметрыЗаписи.ВидОбъектаДанных = "Справочник" И ПараметрыЗаписи.УдалениеДанных Тогда
				НастройкаКомпоновки.Отбор.Элементы.Очистить();
			КонецЕсли;
			
			Результат = ВыгрузитьРезультатПоНастройке(Настройка.СхемаКомпоновкиДанных, НастройкаКомпоновки, 
				ПараметрыЗаписи.ПараметрыСКД);
			
			Если ПараметрыЗаписи.ВидОбъектаДанных = "Справочник" И
				Не ПараметрыЗаписи.УдалениеДанных И
				Настройка.НастройкиКомпоновкиДанных.Отбор.Элементы.Количество() > 0 И
				Результат.Данные.Количество() = 0 Тогда
				
				ПараметрыЗаписи.УдалениеДанных = Истина;
				
				НастройкаКомпоновки.Отбор.Элементы.Очистить();
				
				Результат = ВыгрузитьРезультатПоНастройке(Настройка.СхемаКомпоновкиДанных, НастройкаКомпоновки, 
					ПараметрыЗаписи.ПараметрыСКД);
				
			КонецЕсли;
			
			// Оценка производительности
			Если ОценкаПроизводительности_ВесЗамера <> Неопределено Тогда
				ОценкаПроизводительности_ВесЗамера = Результат.Данные.Количество();
			КонецЕсли;
			
			ЗаписатьВТаблицуДанные(ПараметрыЗаписи, Настройка, Результат);
			
			// Оценка производительности
			Если ОценкаПроизводительности_ВесЗамера <> Неопределено И ОценкаПроизводительности_ВесЗамера > 0 Тогда
				SUI_ОценкаПроизводительностиПереопределяемый.ЗакончитьЗамерВремени(ОценкаПроизводительности_КлючеваяОперация, 
					ОценкаПроизводительности_НачалоЗамера, ОценкаПроизводительности_ВесЗамера);
			КонецЕсли;
			
			ПараметрыЗаписи.УдалениеДанных = УдалениеДанных;
			
		Исключение
			
			Ошибка = ИнформацияОбОшибке();
			SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(НСтр("ru = 'Запись в таблицы'"), ,
				Метаданные.ОбщиеМодули.SUI_ИнтеграцияВКонфигурацию, 
				Настройка.ТаблицаИнтеграции, 
				Ошибка);
			
			// Оценка производительности
			Если ОценкаПроизводительности_ВесЗамера <> Неопределено Тогда
				
				SUI_ОценкаПроизводительностиПереопределяемый.ЗакончитьЗамерВремени(
					ОценкаПроизводительности_КлючеваяОперация, 
					ОценкаПроизводительности_НачалоЗамера, 
					ОценкаПроизводительности_ВесЗамера, 
					ОбработкаОшибок.КраткоеПредставлениеОшибки(Ошибка), 
					Истина);
				
			КонецЕсли;
			
			ВызватьИсключение;
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ВыгрузитьРезультатПоНастройке(СхемаКомпоновки, НастройкиКомпоновки, ПараметрыСКД)
	
	Для Каждого ПараметрСКД Из ПараметрыСКД Цикл
		SUI_КомпоновкаДанныхКлиентСервер.УстановитьПараметр(НастройкиКомпоновки, ПараметрСКД.Ключ, ПараметрСКД.Значение);
	КонецЦикла;
	
	ПараметрыРезультата = SUI_КомпоновкаДанныхСервер.ПараметрыРезультатСхемыКомпоновкиДанных(
		СхемаКомпоновки, НастройкиКомпоновки);
	ПараметрыРезультата.ВозможностьИспользованияВнешнихФункций = Истина;
	ПараметрыРезультата.ВыполнятьВПривилегированномРежиме = Истина;
	
	Результат = Новый Структура();
	Результат.Вставить("Данные", SUI_КомпоновкаДанныхСервер.ВыгрузитьРезультатСхемыКомпоновкиДанных(ПараметрыРезультата));
	Результат.Вставить("Колонки", Новый Массив());
	Результат.Вставить("СлужебныеПоля", Новый Массив());
	
	Для Каждого Колонка Из Результат.Данные.Колонки Цикл
		
		Если Не ПустаяСтрока(Колонка.Заголовок) Тогда
			Колонка.Имя = Колонка.Заголовок;
		КонецЕсли;
		
		Если СтрНачинаетсяС(Колонка.Имя, ПрефиксСлужебногоПоля()) Тогда
			Результат.СлужебныеПоля.Добавить(Колонка.Имя);
		Иначе
			Результат.Колонки.Добавить(Колонка.Имя);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаписатьВТаблицуДанные(ПараметрыЗаписи, Настройка, РезультатДанные)
	
	ГраницаДанных = РезультатДанные.Данные.Количество() - 1;
	
	Если ГраницаДанных < 0 Тогда
		Возврат;
	КонецЕсли;
	
	ГраницаТранзакции = 999;
	КлючиАвтоГенерацииID = Неопределено;
	
	МенеджерТаблицы = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(Настройка.ИмяТаблицы);
	КолонкиСтрокой = СтрСоединить(РезультатДанные.Колонки, ",");
	
	НачатьТранзакцию();
	
	Попытка
		
		Для индекс = 0 По ГраницаДанных Цикл
			
			Если индекс = ГраницаТранзакции Тогда
				ЗафиксироватьТранзакцию();
				НачатьТранзакцию();
				ГраницаТранзакции = ГраницаТранзакции + 1000;
			КонецЕсли;
			
			ТекущаяСтрокаДанных = РезультатДанные.Данные[индекс];
			
			СтруктураДанные = Новый Структура(КолонкиСтрокой);
			ЗаполнитьЗначенияСвойств(СтруктураДанные, ТекущаяСтрокаДанных);
			
			ПривестиСсылкиКИдентификаторамSimple(СтруктураДанные);
			
			// Автогенерация идентификатора "id" записи
			Если СтруктураДанные.Свойство("id") И 
				Не SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(СтруктураДанные.id) Тогда
				
				Если КлючиАвтоГенерацииID = Неопределено Тогда
					КлючиАвтоГенерацииID = КлючиАвтоГенерацииИдентификатора(СтруктураДанные.id, РезультатДанные.СлужебныеПоля);
				КонецЕсли;
				
				Если ПустаяСтрока(КлючиАвтоГенерацииID) Тогда
					СтруктураДанные.id = "";
				Иначе
					СлужебныеПоля = Новый Структура(КлючиАвтоГенерацииID);
					ЗаполнитьЗначенияСвойств(СлужебныеПоля, ТекущаяСтрокаДанных);
					СтруктураДанные.id = СформироватьИдентификаторПоСлужебнымПолям(СлужебныеПоля);
				КонецЕсли;
	
			КонецЕсли;
			
			НаборЗаписей = МенеджерТаблицы.СоздатьНаборЗаписей();
			
			Для Каждого ЭлементОтбора Из НаборЗаписей.Отбор Цикл
				ЭлементОтбора.Установить(СтруктураДанные[ЭлементОтбора.Имя]);
			КонецЦикла;
			
			Если Не ПараметрыЗаписи.УдалениеДанных Тогда
				
				// Если таблица интеграции ШаблоныЭтикеток, то переопределить шаблон "layout"
				Если Настройка.ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.ШаблоныЭтикеток И
					Не ПереопределитьШаблонЭтикеткиПередЗаписьюВТаблицу(СтруктураДанные) Тогда
					Продолжить;
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), СтруктураДанные);
				
			КонецЕсли;
			
			Если ПараметрыЗаписи.ОтключитьМеханизмРегистрацииОбъектов Тогда
				НаборЗаписей.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
			КонецЕсли;
			
			НаборЗаписей.Записать(Истина);
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Функция ПрефиксСлужебногоПоля()
	
	Возврат "SUI_СлужебноеПоле_";
	
КонецФункции

Процедура УстановитьСлужебныеПоля(НастройкаКомпоновки, ИмяОбъекта, ПараметрыСКД)
	
	СлужебныеПоля = Новый Массив();
	
	Если ЗначениеЗаполнено(ПараметрыСКД) Тогда
		
		Для Каждого ПараметрСКД Из ПараметрыСКД Цикл
			СлужебныеПоля.Добавить(ПараметрСКД.Ключ);
		КонецЦикла;
		
	Иначе
		СлужебныеПоля = МенеджерНастроек().ПараметрыСКДПоОбъектуКонфигурации(ИмяОбъекта);
	КонецЕсли;
	
	Для индекс = 0 По СлужебныеПоля.ВГраница() Цикл
		
		СлужебноеПоле = Новый ПолеКомпоновкиДанных(СлужебныеПоля[индекс]);
		ДоступноеПоле = НастройкаКомпоновки.Выбор.ДоступныеПоляВыбора.НайтиПоле(СлужебноеПоле);
		
		Если ДоступноеПоле <> Неопределено Тогда
			
			ПользовательскоеПоле = НастройкаКомпоновки.ПользовательскиеПоля.Элементы.Добавить(
				Тип("ПользовательскоеПолеВыборКомпоновкиДанных"));
			ПользовательскоеПоле.Заголовок = ПрефиксСлужебногоПоля() + СлужебныеПоля[индекс];
			ВариантПользовательскогоПоля = ПользовательскоеПоле.Варианты.Элементы.Добавить();
			ВариантПользовательскогоПоля.Значение = ДоступноеПоле.Поле;
			
			SUI_КомпоновкаДанныхКлиентСервер.ДобавитьВыбранноеПоле(НастройкаКомпоновки, 
				ПользовательскоеПоле.ПутьКДанным, ПользовательскоеПоле.Заголовок);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция СформироватьИдентификаторПоСлужебнымПолям(СлужебныеПоля)
	
	ПараметрыФункции = Новый Массив();
	Для Каждого СлужебноеПоле Из СлужебныеПоля Цикл
		ПараметрыФункции.Добавить("Параметры." + СлужебноеПоле.Ключ);
	КонецЦикла;
	
	Выражение = "SUI_ИнтеграцияВКонфигурацию.СформироватьИдентификатор(" + СтрСоединить(ПараметрыФункции, ",") + ")";
	
	Возврат ОбщегоНазначения.ВычислитьВБезопасномРежиме(Выражение, СлужебныеПоля);

КонецФункции

Функция ЭтоКлючГенерацииИдентификатора(Знач Значение)
	
	Значение = СокрЛП(ОбщегоНазначения.ОписаниеТипаСтрока(0).ПривестиЗначение(Значение));
	Возврат СтрНачинаетсяС(Значение, "SUI_AUTO_ID[") И СтрЗаканчиваетсяНа(Значение, "]");
	
КонецФункции

Функция КлючиАвтоГенерацииИдентификатора(Знач КлючиИзРезультата, СлужебныеКлючи)
	
	Поля = Неопределено;
	ИсключаемыеПоля = Неопределено;
	
	КлючиИзРезультата = СокрЛП(ОбщегоНазначения.ОписаниеТипаСтрока(0).ПривестиЗначение(КлючиИзРезультата));
	
	Если ЭтоКлючГенерацииИдентификатора(КлючиИзРезультата) Тогда
		
		РазрешенныеСимволы = "_," 
			+ SUI_СтроковыеФункцииКлиентСервер.АлфавитБуквыЛатинские() 
			+ SUI_СтроковыеФункцииКлиентСервер.АлфавитБуквыРусские()
			+ SUI_СтроковыеФункцииКлиентСервер.АлфавитЦифры();
			
		КлючиИзРезультата = СтрЗаменить(КлючиИзРезультата, "SUI_AUTO_ID[", "");
		КлючиИзРезультата = СтрЗаменить(КлючиИзРезультата, "]", "");
		КлючиИзРезультата = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(КлючиИзРезультата, ";", Истина, Истина);
		
		Для индекс = 0 По КлючиИзРезультата.ВГраница() Цикл
			
			Если Поля <> Неопределено И ИсключаемыеПоля <> Неопределено Тогда
				Прервать;
			КонецЕсли;
			
			Если СтрНачинаетсяС(КлючиИзРезультата[индекс], "fields=") Тогда
				
				ПоляСтрокой = SUI_СтроковыеФункцииКлиентСервер.ПривестиСтрокуКРазрешеннымСимволам(
					СтрЗаменить(КлючиИзРезультата[индекс], "fields=", ""), РазрешенныеСимволы);
					
				Поля = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПоляСтрокой, , Истина, Истина);
			
			ИначеЕсли СтрНачинаетсяС(КлючиИзРезультата[индекс], "exclude=") Тогда
				
				ИсключаемыеПоляСтрокой = SUI_СтроковыеФункцииКлиентСервер.ПривестиСтрокуКРазрешеннымСимволам(
					СтрЗаменить(КлючиИзРезультата[индекс], "exclude=", ""), РазрешенныеСимволы);
				
				ИсключаемыеПоля = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИсключаемыеПоляСтрокой, , Истина, Истина);
				
				Для Счетчик = 0 По ИсключаемыеПоля.ВГраница() Цикл
					ИсключаемыеПоля[Счетчик] = ПрефиксСлужебногоПоля() + ИсключаемыеПоля[Счетчик];
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;

	КонецЕсли;
	
	Если Поля = Неопределено Тогда
		Поля = Новый Массив();
	КонецЕсли;
	
	Если ИсключаемыеПоля = Неопределено Тогда
		ИсключаемыеПоля = Новый Массив();
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Поля, СлужебныеКлючи, Истина);
	
	Поля = ОбщегоНазначенияКлиентСервер.РазностьМассивов(Поля, ИсключаемыеПоля);
	
	Возврат СтрСоединить(Поля, ",");
	
КонецФункции

Функция ПереопределитьШаблонЭтикеткиПередЗаписьюВТаблицу(Данные)
	
	ЭтоZPL = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Данные, "isZPL", Ложь, Тип("Булево"));
	
	Данные.layout = SUI_ШаблоныЭтикеток.МакетВBase64(Данные.layout, ЭтоZPL);
	
	Если ЗначениеЗаполнено(Данные.layout) Тогда
		Данные.layout = Новый ХранилищеЗначения(Данные.layout, Новый СжатиеДанных(9));
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ТаблицыИнтеграцииИзПараметров(Параметры)
	
	ТаблицыИнтеграции = Новый СписокЗначений();
	
	ТипЗначенияСписокТаблиц = ТипЗнч(Параметры.СписокТаблиц);
	
	Если ТипЗначенияСписокТаблиц = Тип("СписокЗначений") Тогда
		
		Если Параметры.Свойство("ТолькоОтмеченные") И Параметры.ТолькоОтмеченные Тогда
				
			Для Каждого ТаблицаИнтеграции Из Параметры.СписокТаблиц Цикл
				Если ТаблицаИнтеграции.Пометка Тогда
					ТаблицыИнтеграции.Добавить(ТаблицаИнтеграции.Значение);
				КонецЕсли;	
			КонецЦикла;
		
		Иначе
			ТаблицыИнтеграции = Параметры.СписокТаблиц;
		КонецЕсли;

	ИначеЕсли ТипЗначенияСписокТаблиц = Тип("Массив") Или ТипЗначенияСписокТаблиц = Тип("ФиксированныйМассив") Тогда
		ТаблицыИнтеграции.ЗагрузитьЗначения(Параметры.СписокТаблиц);
	ИначеЕсли ТипЗначенияСписокТаблиц = Тип("ПеречислениеСсылка.SUI_ТаблицыИнтеграции") Тогда
		ТаблицыИнтеграции.Добавить(Параметры.СписокТаблиц);
	КонецЕсли;
	
	Возврат ТаблицыИнтеграции;
	
КонецФункции

#КонецОбласти
