
#Область ПрограммныйИнтерфейс

// Записать в таблицы.
// 
// Параметры:
//  Параметры - Структура - Параметры:
// * СписокТаблиц - СписокЗначений, Массив, ФиксированныйМассив, ПеречислениеСсылка.SUI_ТаблицыИнтеграции, Произвольный - Список таблиц интеграции
//  АдресРезультата - Неопределено - Адрес результата
//@skip-check doc-comment-collection-item-type
Процедура ЗаписатьВТаблицы(Параметры, АдресРезультата = Неопределено) Экспорт
	
	ТаблицыИнтеграции = Новый СписокЗначений();
	
	ТипЗначенияСписокТаблиц = ТипЗнч(Параметры.СписокТаблиц);
	
	Если ТипЗначенияСписокТаблиц = Тип("СписокЗначений") Тогда

		Если Параметры.Свойство("ТолькоОтмеченные") И Параметры.ТолькоОтмеченные Тогда
				
			Для Каждого ТаблицаИнтеграции Из Параметры.СписокТаблиц Цикл
				Если ТаблицаИнтеграции.Пометка Тогда
					ТаблицыИнтеграции.Добавить(ТаблицаИнтеграции.Значение);
				КонецЕсли;	
			КонецЦикла;
		
		Иначе
			ТаблицыИнтеграции = Параметры.СписокТаблиц;
		КонецЕсли;

	ИначеЕсли ТипЗначенияСписокТаблиц = Тип("Массив") Или ТипЗначенияСписокТаблиц = Тип("ФиксированныйМассив") Тогда
		ТаблицыИнтеграции.ЗагрузитьЗначения(Параметры.СписокТаблиц);
	ИначеЕсли ТипЗначенияСписокТаблиц = Тип("ПеречислениеСсылка.SUI_ТаблицыИнтеграции") Тогда
		ТаблицыИнтеграции.Добавить(Параметры.СписокТаблиц);
	КонецЕсли;
	
	// Пользователи ТСД
	НайденаяТаблицаПользователейТСД = ТаблицыИнтеграции.НайтиПоЗначению(Перечисления.SUI_ТаблицыИнтеграции.ПользователиТСД);
	Если НайденаяТаблицаПользователейТСД <> Неопределено Тогда
		РегистрацияИзмененийПользователейТСД();
		ТаблицыИнтеграции.Удалить(НайденаяТаблицаПользователейТСД);
	КонецЕсли;
	
	Если ТаблицыИнтеграции.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("ОчиститьТаблицу") И Параметры.ОчиститьТаблицу Тогда
		ОчиститьТаблицы(Параметры);
	КонецЕсли;
	
	ПараметрыЗаписи = ПараметрыЗаписиВТаблицу();

	Попытка
		
		Для Каждого ТаблицаИнтеграции Из ТаблицыИнтеграции Цикл
			
			ПараметрыЗаписи.ТаблицаИнтеграции = ТаблицаИнтеграции.Значение;
			
			ДлительныеОперации.СообщитьПрогресс(, СтрШаблон(НСтр("ru = 'Запись в таблицу ""%1""'"), ПараметрыЗаписи.ТаблицаИнтеграции));
			
			ЗаписатьДанныеВТаблицу(ПараметрыЗаписи);
			
		КонецЦикла;

	Исключение
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(НСтр("ru = 'Запись в таблицы'"), , 
			Метаданные.ОбщиеМодули.SUI_ИнтеграцияВКонфигурацию, , ИнформацияОбОшибке());
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Очистить таблицы.
// 
// Параметры:
//  Параметры - Структура - Параметры:
// * СписокТаблиц - СписокЗначений, Массив, ФиксированныйМассив, ПеречислениеСсылка.SUI_ТаблицыИнтеграции, Произвольный - Список таблиц интеграции
//  АдресРезультата - Неопределено - Адрес результата
//@skip-check doc-comment-collection-item-type
Процедура ОчиститьТаблицы(Параметры, АдресРезультата = Неопределено) Экспорт

	ТаблицыИнтеграции = Новый СписокЗначений();
	
	ТипЗначенияСписокТаблиц = ТипЗнч(Параметры.СписокТаблиц);
	
	Если ТипЗначенияСписокТаблиц = Тип("СписокЗначений") Тогда
		
		Если Параметры.Свойство("ТолькоОтмеченные") И Параметры.ТолькоОтмеченные Тогда
				
			Для Каждого ТаблицаИнтеграции Из Параметры.СписокТаблиц Цикл
				Если ТаблицаИнтеграции.Пометка Тогда
					ТаблицыИнтеграции.Добавить(ТаблицаИнтеграции.Значение);
				КонецЕсли;	
			КонецЦикла;
		
		Иначе
			ТаблицыИнтеграции = Параметры.СписокТаблиц;
		КонецЕсли;

	ИначеЕсли ТипЗначенияСписокТаблиц = Тип("Массив") Или ТипЗначенияСписокТаблиц = Тип("ФиксированныйМассив") Тогда
		ТаблицыИнтеграции.ЗагрузитьЗначения(Параметры.СписокТаблиц);
	ИначеЕсли ТипЗначенияСписокТаблиц = Тип("ПеречислениеСсылка.SUI_ТаблицыИнтеграции") Тогда
		ТаблицыИнтеграции.Добавить(Параметры.СписокТаблиц);
	КонецЕсли;

	// Пользователи ТСД
	НайденаяТаблицаПользователейТСД = ТаблицыИнтеграции.НайтиПоЗначению(Перечисления.SUI_ТаблицыИнтеграции.ПользователиТСД);
	Если НайденаяТаблицаПользователейТСД <> Неопределено Тогда
		РегистрацияИзмененийПользователейТСД(, Ложь);
		ТаблицыИнтеграции.Удалить(НайденаяТаблицаПользователейТСД);
	КонецЕсли;
	
	Если ТаблицыИнтеграции.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МобильныеУстройства = SUI_МобильныеУстройстваСервер.ВсеМобильныеУстройства(Истина, Ложь);
	
	Попытка
		
		Для Каждого ТаблицаИнтеграции Из ТаблицыИнтеграции Цикл
			
			ИмяТаблицыВКонфигурации = SUI_НастройкиМетаданныхСервер.ПолучитьИмяТаблицыВКонфигурации(ТаблицаИнтеграции.Значение);
			
			Если Не ЗначениеЗаполнено(ИмяТаблицыВКонфигурации) Тогда
				Продолжить;
			КонецЕсли;
			
			ДлительныеОперации.СообщитьПрогресс(, СтрШаблон(НСтр("ru = 'Очистка таблицы ""%1""'"), ТаблицаИнтеграции.Значение));

			МетаданныеТаблицыКонфигурации = Метаданные.НайтиПоПолномуИмени(ИмяТаблицыВКонфигурации);
			
			Если Метаданные.ПланыОбмена.SUI_МобильныеУстройства.Состав.Содержит(МетаданныеТаблицыКонфигурации) И
				МобильныеУстройства.Количество() > 0 Тогда

				Для Каждого МобильноеУстройство Из МобильныеУстройства Цикл
					ПланыОбмена.УдалитьРегистрациюИзменений(МобильноеУстройство, МетаданныеТаблицыКонфигурации);
				КонецЦикла;
				
			КонецЕсли;
			
			МенеджерОбъектаТаблицы = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(МетаданныеТаблицыКонфигурации.ПолноеИмя());
			
			НаборЗаписей = МенеджерОбъектаТаблицы.СоздатьНаборЗаписей();
			НаборЗаписей.ДополнительныеСвойства.Вставить("SUI_ОтключитьПодписку");
			НаборЗаписей.Записать(Истина);

		КонецЦикла;
	
	Исключение
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(НСтр("ru = 'Очистка таблиц'"), , 
			Метаданные.ОбщиеМодули.SUI_ИнтеграцияВКонфигурацию, , ИнформацияОбОшибке());
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

// Проверить БСП.
// 
// Возвращаемое значение:
//  Булево - Проверить БСП
Функция ПроверитьБСП() Экспорт
	
	Если Метаданные.ОбщиеМодули.Найти("СтандартныеПодсистемыСервер") = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПоддерживаемыеВерсии = Новый Массив();
	ПоддерживаемыеВерсии.Добавить("3.0");
	ПоддерживаемыеВерсии.Добавить("3.1");
	
	ВерсияБСП = СтандартныеПодсистемыСервер.ВерсияБиблиотеки();
	
	РазрядыВерсииБСП = СтрРазделить(ВерсияБСП, ".", Ложь);
	
	Если РазрядыВерсииБСП.Количество() < 2 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЧастьВерсииКПроверке = РазрядыВерсииБСП[0] + "." + РазрядыВерсииБСП[1];
	
	Возврат (ПоддерживаемыеВерсии.Найти(ЧастьВерсииКПроверке) <> Неопределено);
	
КонецФункции

Функция НайтиВТаблицеПоЗначению(Таблица, ИмяКолонки, Значение) Экспорт
	
	Перем Результат, ТекстСообщения;
	
	Если SUI_НастройкиМетаданныхСервер.ТаблицаИспользуется(Таблица) Тогда
		
		ИмяТаблицыВКонфигурации = SUI_НастройкиМетаданныхСервер.ПолучитьИмяТаблицыВКонфигурации(Таблица);
		
		Если ЗначениеЗаполнено(ИмяТаблицыВКонфигурации) Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ
				|	*
				|ИЗ
				|	" + ИмяТаблицыВКонфигурации + " КАК Таблица
				|ГДЕ
				|	Таблица." + ИмяКолонки + " = &" + ИмяКолонки;
			
			Запрос.УстановитьПараметр(ИмяКолонки, Значение);
			
			Результат = Запрос.Выполнить();
		
		Иначе
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Для таблицы ""%1"" не определена таблица конфигурации'"), Таблица);
		КонецЕсли;
		
	Иначе
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Таблица ""%1"" не используется'"), Таблица);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстСообщения) Тогда
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#Область ИдентификаторыSimple

// Получить идентификатор Simple по ссылке.
// 
// Параметры:
//  Ссылка - ЛюбаяСсылка - Ссылка объекта для получения идентификатора Simple
//  ОтключитьПроверку - Булево - Отключить проверку на тип ссылки и пустую ссылку.
// 
// Возвращаемое значение:
//  Неопределено, Строка - Идентификатор Simple по ссылке или Неопределено, если переменная Ссылка не является ссылкой объекта 
//	или не существует.
Функция ИдентификаторSimpleПоСсылке(Ссылка, ОтключитьПроверку = Ложь) Экспорт
	
	Идентификатор = "";
	
	Если Не ОтключитьПроверку Тогда
		
		Если Не SUI_ОбщегоНазначенияПереопределяемый.ЭтоСсылка(ТипЗнч(Ссылка)) Или 
			Не ОбщегоНазначения.СсылкаСуществует(Ссылка) Тогда
			Возврат Идентификатор;
		КонецЕсли;
		
	КонецЕсли;
	
	Идентификатор = ЗначениеВСтрокуВнутр(Ссылка);
	
	Если СтрНачинаетсяС(Идентификатор, "{""#"",") И Прав(Идентификатор, 1) = "}" Тогда
		
		Идентификатор = Сред(Идентификатор, 6);  
		Идентификатор = Сред(Идентификатор, 1, СтрНайти(Идентификатор, ",") - 1) + "-" + Сред(Идентификатор, СтрНайти(Идентификатор, ":") + 1);
		Идентификатор = Лев(Идентификатор, СтрДлина(Идентификатор) - 1);
		
		Если СтрДлина(Идентификатор) <> 69 Тогда
			Идентификатор = "";	
		КонецЕсли;
	
	Иначе
		Идентификатор = "";
	КонецЕсли;
	
	Возврат Идентификатор;
	
КонецФункции

// Получить ссылку объекта по идентификатору Simple.
// 
// Параметры:
//  Идентификатор - Строка - Идентификатор Simple
//  ОтключитьПроверку - Булево - Отключить проверку на тип ссылки и пустую ссылку.
// 
// Возвращаемое значение:
//  Неопределено, ЛюбаяСсылка - Ссылка объекта полученная по идентификатору Simple или Неопределено, если идентификатор
//	не является идентификатором Simple или полученный объект по идентификатору не является ссылочным типом или не существует.
Функция СсылкаПоИдентификаторуSimple(Знач Идентификатор, ОтключитьПроверку = Ложь) Экспорт
	
	Перем Ссылка;
	
	Если SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(Идентификатор) Тогда
		
		Идентификатор = НРег(Идентификатор);
		
		Попытка
			Ссылка = ЗначениеИзСтрокиВнутр("{""#""," + Лев(Идентификатор, 36) + ",1:" + Прав(Идентификатор, 32) + "}");
		Исключение
			Ссылка = Неопределено;
		КонецПопытки;
		
		Если Не ОтключитьПроверку Тогда
			
			Если Не SUI_ОбщегоНазначенияПереопределяемый.ЭтоСсылка(ТипЗнч(Ссылка)) Или 
				Не ОбщегоНазначения.СсылкаСуществует(Ссылка) Тогда
				Ссылка = Неопределено;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ссылка;
	
КонецФункции

// Привести ссылки к идентификаторам simple.
// 
// Параметры:
//  Данные - ЛюбаяСсылка, Структура, Соответствие, СписокЗначений, Массив из Структура - Данные
//  ИсключитьСвойства - Строка - Исключить свойства структуры или соответствия
//	ИсключитьПустыеИдентификаторы - Булево - Пустой идентификатор Simple как пустая строка
// 
// Возвращаемое значение:
//  Строка, Структура, Соответствие, СписокЗначений, Массив из Структура - Данные
//@skip-check doc-comment-collection-item-type
Функция ПривестиСсылкиКИдентификаторамSimple(Данные, ИсключитьСвойства = "", ИсключитьПустыеИдентификаторы = Истина) Экспорт 
	
	ТипДанных = ТипЗнч(Данные);
	ТипДанныхСтрокой = Строка(ТипДанных); // RS. Кучик
	
	Если ТипДанных = Тип("Массив") Тогда
		
		Для Индекс = 0 По Данные.ВГраница() Цикл
			ПривестиСсылкиКИдентификаторамSimple(Данные[Индекс], ИсключитьСвойства, ИсключитьПустыеИдентификаторы);
		КонецЦикла;
		
	ИначеЕсли ТипДанных = Тип("СписокЗначений") Тогда
		Данные.ЗагрузитьЗначения(ПривестиСсылкиКИдентификаторамSimple(
			Данные.ВыгрузитьЗначения(), ИсключитьСвойства, ИсключитьПустыеИдентификаторы));	
	ИначеЕсли ТипДанных = Тип("Структура") Или ТипДанных = Тип("Соответствие") Тогда
		
		ИсключаемыеСвойства = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИсключитьСвойства, ",", , Истина);
		
		Для Каждого КлючЗначение Из Данные Цикл
			
			Если ИсключаемыеСвойства.Найти(КлючЗначение.Ключ) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Значение = КлючЗначение.Значение;
			Данные.Вставить(КлючЗначение.Ключ, ПривестиСсылкиКИдентификаторамSimple(
				Значение, ИсключитьСвойства, ИсключитьПустыеИдентификаторы));
			
		КонецЦикла;
		
	ИначеЕсли ОбщегоНазначения.ЭтоСсылка(ТипДанных) Тогда
		
		Если ОбщегоНазначения.СсылкаСуществует(Данные) Или Не ИсключитьПустыеИдентификаторы Тогда
			Данные = ИдентификаторSimpleПоСсылке(Данные, Истина);
		Иначе
			Данные = "";
		КонецЕсли;
		
	// RS. Кучик
	ИначеЕсли ТипДанныхСтрокой = "Ячейка (Simple)" Тогда
		
		Если ОбщегоНазначения.СсылкаСуществует(Данные) Или Не ИсключитьПустыеИдентификаторы Тогда
			Данные = ИдентификаторSimpleПоСсылке(Данные, Истина);
		Иначе
			Данные = "";
		КонецЕсли;
		
	//~RS
	КонецЕсли;
	
	//@skip-check constructor-function-return-section
	Возврат Данные;
	
КонецФункции

// Восстановить ссылки идентификаторов simple.
// 
// Параметры:
//  Данные - Строка, Структура, Соответствие, СписокЗначений, Массив из Структура - Данные
//  ИсключитьСвойства - Строка - Исключить свойства
//  ПроверятьНаСсылку - Булево - Проверять на ссылочный тип и существование ссылки после восстановления
//	ЗначенияТолькоИдентификаторов - Булево - Оставить в структуре значения только идентификаторов
// 
// Возвращаемое значение:
//  Строка, Структура, Соответствие, СписокЗначений, Массив из Структура - Данные
//@skip-check doc-comment-collection-item-type
Функция ВосстановитьСсылкиИдентификаторовSimple(Данные, ИсключитьСвойства = "", ПроверятьНаСсылку = Истина,
	ЗначенияТолькоИдентификаторов = Ложь) Экспорт 
	
	ТипДанных = ТипЗнч(Данные);
	
	Если ТипДанных = Тип("Массив") Тогда
		
		Для Индекс = 0 По Данные.ВГраница() Цикл
			ВосстановитьСсылкиИдентификаторовSimple(Данные[Индекс], ИсключитьСвойства, ПроверятьНаСсылку, ЗначенияТолькоИдентификаторов);
		КонецЦикла;
		
	ИначеЕсли ТипДанных = Тип("СписокЗначений") Тогда
		Данные.ЗагрузитьЗначения(ВосстановитьСсылкиИдентификаторовSimple(
			Данные.ВыгрузитьЗначения(), ИсключитьСвойства, ПроверятьНаСсылку, ЗначенияТолькоИдентификаторов));
	ИначеЕсли ТипДанных = Тип("Структура") Или ТипДанных = Тип("Соответствие") Тогда
		
		ИсключаемыеСвойства = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИсключитьСвойства, ",", , Истина);
		
		Для Каждого КлючЗначение Из Данные Цикл
			
			Если ИсключаемыеСвойства.Найти(КлючЗначение.Ключ) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
		
			Значение = КлючЗначение.Значение;
			Данные.Вставить(КлючЗначение.Ключ, ВосстановитьСсылкиИдентификаторовSimple(
				Значение, ИсключитьСвойства, ПроверятьНаСсылку, ЗначенияТолькоИдентификаторов));
		
		КонецЦикла;
		
	ИначеЕсли ТипДанных = Тип("Строка") И SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(Данные) Тогда
		Данные = СсылкаПоИдентификаторуSimple(Данные, Не ПроверятьНаСсылку);
	КонецЕсли;
	
	//@skip-check constructor-function-return-section
	Возврат Данные;
	
КонецФункции

// Установить действие открытия идентификаторов.
// 
// Параметры:
//  Форма - Форма - Форма
//  ПрефиксЭлемента - Строка - Префикс элемента
//  Действие - Строка - Действие
Процедура УстановитьДействиеОткрытияИдентификаторов(Форма, ПрефиксЭлемента = "", Действие = "") Экспорт 
	
	Если ПустаяСтрока(Действие) Тогда
		Действие = "SUI_Переопределяемый_ОткрытиеИдентификатора";
	КонецЕсли;
	
	Для Каждого ЭлементФормы Из Форма.Элементы Цикл
		
		Если ТипЗнч(ЭлементФормы) <> Тип("ПолеФормы") Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЭлементФормы.Вид <> ВидПоляФормы.ПолеВвода Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЭлементФормы.КнопкаОткрытия <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПустаяСтрока(ЭлементФормы.ПутьКДанным) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ПустаяСтрока(ПрефиксЭлемента) Тогда
			
			Если Не СтрНачинаетсяС(ЭлементФормы.Имя, ПрефиксЭлемента) Тогда
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		
		мсвПутьКДанным = СтрРазделить(ЭлементФормы.ПутьКДанным, ".", Ложь);
		
		ДанныеЭлемента = Неопределено;
		Для Индекс = 0 По мсвПутьКДанным.ВГраница() Цикл
			
			Если Индекс = 0 Тогда
				ДанныеЭлемента = Форма[мсвПутьКДанным[Индекс]];
			Иначе 
				ДанныеЭлемента = ДанныеЭлемента[мсвПутьКДанным[Индекс]];
			КонецЕсли;
			
		КонецЦикла;

		Если ТипЗнч(ДанныеЭлемента) <> Тип("Строка") Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементФормы.КнопкаОткрытия = Истина;
		ЭлементФормы.УстановитьДействие("Открытие", Действие);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПодписокНаСобытия

Процедура SUI_ИнтеграцияВКонфигурациюСправочникиПриЗаписи(Источник, Отказ) Экспорт
	
	Если Отказ Или Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);
	
	// Пользователи ТСД
	Если Источник.Метаданные() = Метаданные.Справочники.SUI_ПользователиТСД Тогда
		РегистрацияИзмененийПользователейТСД(Источник, Не Источник.ПометкаУдаления);
	Иначе
		
		ПараметрыЗаписи = ПараметрыЗаписиВТаблицу(, Источник);
		ПараметрыЗаписи.РегистрацияИзменений = Не Источник.ДополнительныеСвойства.Свойство("ОтключитьМеханизмРегистрацииОбъектов");
		
		ЗаписатьДанныеВТаблицу(ПараметрыЗаписи);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура SUI_ИнтеграцияВКонфигурациюСправочникиПередУдалением(Источник, Отказ) Экспорт
	
	Если Отказ Или Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);

	// Пользователи ТСД
	Если Источник.Метаданные() = Метаданные.Справочники.SUI_ПользователиТСД Тогда
		РегистрацияИзмененийПользователейТСД(Источник, Ложь);
	Иначе
		
		ПараметрыЗаписи = ПараметрыЗаписиВТаблицу(, Источник);
		ПараметрыЗаписи.УдалениеДанных = Истина;
		
		ЗаписатьДанныеВТаблицу(ПараметрыЗаписи);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура SUI_ИнтеграцияВКонфигурациюРегистрыСведенийПередЗаписью(Источник, Отказ, Замещение) Экспорт
	
	Если Отказ Или Источник.ОбменДанными.Загрузка Или Источник.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если SUI_НастройкиМетаданныхСервер.ЭтоТаблицаИнтеграции(Источник.Метаданные().ПолноеИмя()) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗаписи = ПараметрыЗаписиВТаблицу(, Источник);
	ПараметрыЗаписи.УдалениеДанных = Истина;
	
	ЗаписатьДанныеВТаблицу(ПараметрыЗаписи);
	
КонецПроцедуры

Процедура SUI_ИнтеграцияВКонфигурациюРегистрыСведенийПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	Если Отказ Или Источник.ОбменДанными.Загрузка Или
		Источник.ДополнительныеСвойства.Свойство("SUI_ОтключитьПодписку") Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);

	Если SUI_НастройкиМетаданныхСервер.ЭтоТаблицаИнтеграции(Источник.Метаданные().ПолноеИмя()) Тогда
		РегистрацияИзмененийЗаписейТаблиц(Источник, (Источник.Количество() > 0));
	Иначе
		
		Если Источник.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		ПараметрыЗаписи = ПараметрыЗаписиВТаблицу(, Источник);
		
		Если Источник.ДополнительныеСвойства.Свойство("ОтключитьМеханизмРегистрацииОбъектов") Тогда
			ПараметрыЗаписи.РегистрацияИзменений = Ложь;
		Иначе
			ПараметрыЗаписи.РегистрацияИзменений = Истина;
		КонецЕсли;
		
		ЗаписатьДанныеВТаблицу(ПараметрыЗаписи);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура SUI_КонстантыИспользоватьТаблицуПриЗаписи(Источник, Отказ) Экспорт

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не Источник.ДополнительныеСвойства.Свойство("SUI_НеОчищатьТаблицу") Тогда
		
		ЭтаКонстанта = Константы[Метаданные.НайтиПоТипу(ТипЗнч(Источник)).Имя];
		
		ТаблицаИнтеграции = SUI_НастройкиМетаданныхСервер.ПолучитьТаблицуИнтеграцииПоКонстанте(ЭтаКонстанта);
		
		Если ТаблицаИнтеграции <> Неопределено Тогда
			ОчиститьТаблицы(Новый Структура("СписокТаблиц", ТаблицаИнтеграции));
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура РегистрацияИзмененийЗаписейТаблиц(Источник, ЗарегистрироватьИзменения = Истина)
	
	Если ЗарегистрироватьИзменения И Источник.ДополнительныеСвойства.Свойство("SUI_НеРегистрироватьИзменения") Тогда
		Возврат;
	КонецЕсли;
	
	Если SUI_МобильныеУстройстваПовтИсп.СоставПланаОбмена().Найти(Источник.Метаданные()) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВсеМобильныеУстройства = SUI_МобильныеУстройстваСервер.ВсеМобильныеУстройства();
	
	Если ВсеМобильныеУстройства.Количество() > 0 Тогда
		
		ОтборУстановлен = Ложь;
			
		Для Каждого ЭлементОтбора Из Источник.Отбор Цикл
			Если ЗначениеЗаполнено(ЭлементОтбора.Значение) Тогда
				ОтборУстановлен = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
			
		Если ЗарегистрироватьИзменения И ОтборУстановлен Тогда 
			ПланыОбмена.ЗарегистрироватьИзменения(ВсеМобильныеУстройства, Источник);
		ИначеЕсли ОтборУстановлен Тогда
			ПланыОбмена.УдалитьРегистрациюИзменений(ВсеМобильныеУстройства, Источник);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура РегистрацияИзмененийПользователейТСД(ПользовательТСДОбъект = Неопределено, Зарегистрировать = Истина)
	
	Если ПользовательТСДОбъект = Неопределено Тогда
		
		Для Каждого МобильноеУстройство Из SUI_МобильныеУстройстваСервер.ВсеМобильныеУстройства(Истина, Ложь) Цикл
			ПланыОбмена.УдалитьРегистрациюИзменений(МобильноеУстройство, Метаданные.Справочники.SUI_ПользователиТСД);
		КонецЦикла;
		
		Если Зарегистрировать Тогда
			Для Каждого МобильноеУстройство Из SUI_МобильныеУстройстваСервер.ВсеМобильныеУстройства() Цикл
				ПланыОбмена.ЗарегистрироватьИзменения(МобильноеУстройство, Метаданные.Справочники.SUI_ПользователиТСД);
			КонецЦикла;
		КонецЕсли;
		
	Иначе

		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	SUI_ПользователиТСДИзменения.Узел КАК Ссылка
			|ИЗ
			|	Справочник.SUI_ПользователиТСД.Изменения КАК SUI_ПользователиТСДИзменения
			|ГДЕ
			|	НЕ &ЗарегистрироватьИзменения
			|	И SUI_ПользователиТСДИзменения.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	SUI_МобильныеУстройства.Ссылка
			|ИЗ
			|	ПланОбмена.SUI_МобильныеУстройства КАК SUI_МобильныеУстройства
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.SUI_ПользователиТСД.Изменения КАК SUI_ПользователиТСДИзменения
			|		ПО SUI_ПользователиТСДИзменения.Узел = SUI_МобильныеУстройства.Ссылка
			|		И SUI_ПользователиТСДИзменения.Ссылка = &Ссылка
			|ГДЕ
			|	&ЗарегистрироватьИзменения
			|	И SUI_ПользователиТСДИзменения.Ссылка ЕСТЬ NULL
			|	И НЕ SUI_МобильныеУстройства.ЭтотУзел
			|	И НЕ SUI_МобильныеУстройства.ПометкаУдаления";
		
		Запрос.УстановитьПараметр("ЗарегистрироватьИзменения", Зарегистрировать);
		Запрос.УстановитьПараметр("Ссылка", ПользовательТСДОбъект.Ссылка);
		
		РезультатыЗапроса = Запрос.ВыполнитьПакет();
		
		Если Не РезультатыЗапроса[0].Пустой() Тогда
			ПланыОбмена.УдалитьРегистрациюИзменений(
				РезультатыЗапроса[0].Выгрузить().ВыгрузитьКолонку("Ссылка"), ПользовательТСДОбъект);
		КонецЕсли;
		
		Если Не РезультатыЗапроса[1].Пустой() Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(
				РезультатыЗапроса[1].Выгрузить().ВыгрузитьКолонку("Ссылка"), ПользовательТСДОбъект);
		КонецЕсли;

	КонецЕсли;
		
КонецПроцедуры

//@skip-check method-too-many-params
//@skip-check doc-comment-parameter-section
//@skip-check doc-comment-export-function-return-section
Функция СформироватьИдентификатор(Значение1, Значение2 = Неопределено, Значение3 = Неопределено, Значение4 = Неопределено,
	Значение5 = Неопределено, Значение6 = Неопределено, Значение7 = Неопределено, Значение8 = Неопределено, Значение9 = Неопределено) Экспорт
	
	ПереданныеЗначения = Новый Массив;
	ПереданныеЗначения.Добавить(Значение9);
	ПереданныеЗначения.Добавить(Значение8);
	ПереданныеЗначения.Добавить(Значение7);
	ПереданныеЗначения.Добавить(Значение6);
	ПереданныеЗначения.Добавить(Значение5);
	ПереданныеЗначения.Добавить(Значение4);
	ПереданныеЗначения.Добавить(Значение3);
	ПереданныеЗначения.Добавить(Значение2);
	ПереданныеЗначения.Добавить(Значение1);
	
	МассивЗначений = Новый Массив;
	
	Для индекс = 0 По ПереданныеЗначения.ВГраница() Цикл
		Если МассивЗначений.Количество() = 0 И ПереданныеЗначения[индекс] = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		МассивЗначений.Вставить(0, ПереданныеЗначения[индекс]);
	КонецЦикла;
	
	Если МассивЗначений.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Недопустимая операция'");
	ИначеЕсли МассивЗначений.Количество() = 1 И 
		SUI_ОбщегоНазначенияПереопределяемый.ЭтоСсылка(ТипЗнч(МассивЗначений[0])) Тогда
		Возврат ИдентификаторSimpleПоСсылке(МассивЗначений[0], Истина);
	Иначе
		Возврат НРег(ОбщегоНазначения.КонтрольнаяСуммаСтрокой(МассивЗначений, ХешФункция.SHA256));
	КонецЕсли;

КонецФункции

Функция МенеджерНастроекТаблиц()
	Возврат РегистрыСведений.SUI_НастройкиТаблицИнтеграции;
КонецФункции

Функция ИмяТаблицыИсточникаДанных(ИсточникДанных)
	
	Если ИсточникДанных = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ИсточникДанных.Метаданные().ПолноеИмя();
	
КонецФункции

Функция ПараметрыЗаписиВТаблицу(ТаблицаИнтеграции = Неопределено, ИсточникДанных = Неопределено)
	
	ПараметрыЗаписи = Новый Структура();
	
	ПараметрыЗаписи.Вставить("ТаблицаИнтеграции", 		ТаблицаИнтеграции);
	ПараметрыЗаписи.Вставить("ИсточникДанных", 			ИсточникДанных);
	ПараметрыЗаписи.Вставить("РегистрацияИзменений", 	Ложь);
	ПараметрыЗаписи.Вставить("УдалениеДанных", 			Ложь);
	ПараметрыЗаписи.Вставить("ПерезаписатьТаблицу", 	Ложь);
	
	Возврат ПараметрыЗаписи;
	
КонецФункции

Процедура ЗаписатьДанныеВТаблицу(ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.ТаблицаИнтеграции = Неопределено И ПараметрыЗаписи.ИсточникДанных = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИмяТаблицыИсточника = ИмяТаблицыИсточникаДанных(ПараметрыЗаписи.ИсточникДанных);

	ПараметрыНастроек = МенеджерНастроекТаблиц().ПараметрыПолученияНастроек(ПараметрыЗаписи.ТаблицаИнтеграции, ИмяТаблицыИсточника);
	
	Настройки = МенеджерНастроекТаблиц().ПолучитьНастройки(ПараметрыНастроек);
	
	Если Настройки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаНастройки Из Настройки Цикл
		ЗаписатьДанныеВТаблицуПоНастройке(ПараметрыЗаписи, СтрокаНастройки);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьДанныеВТаблицуПоНастройке(Знач ПараметрыЗаписи, СтрокаНастройки)

	Если ПараметрыЗаписи.ПерезаписатьТаблицу Тогда
		ОчиститьТаблицуИнтеграции(СтрокаНастройки.ТаблицаИнтеграции);
	КонецЕсли;
	
	ПараметрыВыгрузки = МенеджерНастроекТаблиц().ПараметрыВыгрузкиРезультата(СтрокаНастройки.СхемаКомпоновкиДанных, 
		СтрокаНастройки.НастройкиКомпоновкиДанных, ПараметрыЗаписи.ИсточникДанных);
	//@skip-check wrong-type-expression
	ПараметрыВыгрузки.СлужебныеПоля = МенеджерНастроекТаблиц().ПараметрыСКДПоОбъектуКонфигурации(СтрокаНастройки.ИмяОбъекта);
	
	ТаблицаРезультат = МенеджерНастроекТаблиц().ВыгрузитьРезультатПоНастройке(ПараметрыВыгрузки);
	
	Если ТаблицаРезультат.Количество() = 0 Тогда
		
		ТаблицаРезультат = ДанныеКУдалениюВТаблицеПоИсточнику(ПараметрыЗаписи, ПараметрыВыгрузки);
		
		Если ТаблицаРезультат <> Неопределено И ТаблицаРезультат.Количество() > 0 Тогда
			ПараметрыЗаписи.УдалениеДанных = Истина;
		Иначе
			Возврат;
		КонецЕсли;
		
	КонецЕсли;

	КолонкиТаблицы = Новый Массив();
	СлужебныеКолонкиТаблицы = Новый Массив();
	Для Каждого Колонка Из ТаблицаРезультат.Колонки Цикл
		Если СтрНачинаетсяС(Колонка.Имя, ПараметрыВыгрузки.ПрефиксСлужебногоПоля) Тогда
			СлужебныеКолонкиТаблицы.Добавить(Колонка.Имя);
		Иначе
			КолонкиТаблицы.Добавить(Колонка.Имя);
		КонецЕсли;
	КонецЦикла;
	КолонкиТаблицы = СтрСоединить(КолонкиТаблицы, ",");
	
	Если ПустаяСтрока(КолонкиТаблицы) Тогда
		//TODO: ВызватьИсключение;
		Возврат;
	КонецЕсли;
	
	МенеджерТаблицы = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(СтрокаНастройки.ИмяТаблицы);
	
	КлючиАвтоГенерацииID = Неопределено;
	
	Для Каждого СтрокаТаблицыРезультат Из ТаблицаРезультат Цикл
		
		СтруктураРезультат = Новый Структура(КолонкиТаблицы);
		ЗаполнитьЗначенияСвойств(СтруктураРезультат, СтрокаТаблицыРезультат);
		ПривестиСсылкиКИдентификаторамSimple(СтруктураРезультат);
		
		// Автогенерация идентификатора "id" записи
		Если СтруктураРезультат.Свойство("id") И 
			Не SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(СтруктураРезультат.id) Тогда
			
			Если КлючиАвтоГенерацииID = Неопределено Тогда
				КлючиАвтоГенерацииID = КлючиАвтоГенерацииИдентификатора(СтруктураРезультат.id, СлужебныеКолонкиТаблицы, 
					ПараметрыВыгрузки.ПрефиксСлужебногоПоля);
			КонецЕсли;
			
			Если КлючиАвтоГенерацииID <> Неопределено И Не ПустаяСтрока(КлючиАвтоГенерацииID) Тогда
				
				РеквизитыГенерацииИдентификатора = Новый Структура(КлючиАвтоГенерацииID);
				ЗаполнитьЗначенияСвойств(РеквизитыГенерацииИдентификатора, СтрокаТаблицыРезультат);
				
				СтруктураРезультат.id = СформироватьИдентификаторПоСлужебнымРеквизитам(РеквизитыГенерацииИдентификатора);
			
			Иначе
				СтруктураРезультат.id = "";
			КонецЕсли;

		КонецЕсли;
		
		Если Не ПараметрыЗаписи.УдалениеДанных Тогда
			
			// Если таблица интеграции ШаблоныЭтикеток, то переопределить шаблон "layout"
			Если СтрокаНастройки.ТаблицаИнтеграции = Перечисления.SUI_ТаблицыИнтеграции.ШаблоныЭтикеток Тогда
				
				Если Не ПереопределитьШаблонЭтикеткиПередЗаписьюВТаблицу(СтруктураРезультат) Тогда
					Продолжить;
				КонецЕсли;
			
			КонецЕсли;
			
		КонецЕсли;

		НаборЗаписей = МенеджерТаблицы.СоздатьНаборЗаписей();

		Для Каждого ЭлементОтбора Из НаборЗаписей.Отбор Цикл
			
			Если СтруктураРезультат.Свойство(ЭлементОтбора.Имя) Тогда
				ЭлементОтбора.Установить(СтруктураРезультат[ЭлементОтбора.Имя]);
			КонецЕсли;

		КонецЦикла;
		
		Если Не ПараметрыЗаписи.УдалениеДанных Тогда
			ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), СтруктураРезультат);
		КонецЕсли;
		
		Если Не ПараметрыЗаписи.РегистрацияИзменений И Не ПараметрыЗаписи.УдалениеДанных Тогда
			НаборЗаписей.ДополнительныеСвойства.Вставить("SUI_НеРегистрироватьИзменения");
		КонецЕсли;

		НаборЗаписей.Записать(Истина);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ЭтоКлючГенерацииИдентификатора(Знач Значение)
	Значение = СокрЛП(ОбщегоНазначения.ОписаниеТипаСтрока(0).ПривестиЗначение(Значение));
	Возврат СтрНачинаетсяС(Значение, "SUI_AUTO_ID[") И СтрЗаканчиваетсяНа(Значение, "]");
КонецФункции

Функция КлючиАвтоГенерацииИдентификатора(Знач КлючиИзРезультата, СлужебныеКлючи, ПрефиксСлужебныхКлючей)
	
	Поля = Неопределено;
	ИсключаемыеПоля = Неопределено;
	
	КлючиИзРезультата = СокрЛП(ОбщегоНазначения.ОписаниеТипаСтрока(0).ПривестиЗначение(КлючиИзРезультата));
	
	Если ЭтоКлючГенерацииИдентификатора(КлючиИзРезультата) Тогда
		
		РазрешенныеСимволы = "_," 
			+ SUI_СтроковыеФункцииКлиентСервер.АлфавитБуквыЛатинские() 
			+ SUI_СтроковыеФункцииКлиентСервер.АлфавитБуквыРусские()
			+ SUI_СтроковыеФункцииКлиентСервер.АлфавитЦифры();
			
		КлючиИзРезультата = СтрЗаменить(КлючиИзРезультата, "SUI_AUTO_ID[", "");
		КлючиИзРезультата = СтрЗаменить(КлючиИзРезультата, "]", "");
		КлючиИзРезультата = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(КлючиИзРезультата, ";", Истина, Истина);
		
		Для индекс = 0 По КлючиИзРезультата.ВГраница() Цикл
			
			Если Поля <> Неопределено И ИсключаемыеПоля <> Неопределено Тогда
				Прервать;
			КонецЕсли;
			
			Если СтрНачинаетсяС(КлючиИзРезультата[индекс], "fields=") Тогда
				
				ПоляСтрокой = SUI_СтроковыеФункцииКлиентСервер.ПривестиСтрокуКРазрешеннымСимволам(
					СтрЗаменить(КлючиИзРезультата[индекс], "fields=", ""), РазрешенныеСимволы);
					
				Поля = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПоляСтрокой, , Истина, Истина);
			
			ИначеЕсли СтрНачинаетсяС(КлючиИзРезультата[индекс], "exclude=") Тогда
				
				ИсключаемыеПоляСтрокой = SUI_СтроковыеФункцииКлиентСервер.ПривестиСтрокуКРазрешеннымСимволам(
					СтрЗаменить(КлючиИзРезультата[индекс], "exclude=", ""), РазрешенныеСимволы);
				
				ИсключаемыеПоля = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИсключаемыеПоляСтрокой, , Истина, Истина);
				
				Если Не ПустаяСтрока(ПрефиксСлужебныхКлючей) Тогда
		
					Для Счетчик = 0 По ИсключаемыеПоля.ВГраница() Цикл
						ИсключаемыеПоля[Счетчик] = ПрефиксСлужебныхКлючей + ИсключаемыеПоля[Счетчик];
					КонецЦикла;
		
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;

	КонецЕсли;
	
	Если Поля = Неопределено Тогда
		Поля = Новый Массив();
	КонецЕсли;
	
	Если ИсключаемыеПоля = Неопределено Тогда
		ИсключаемыеПоля = Новый Массив();
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Поля, СлужебныеКлючи, Истина);
	
	Поля = ОбщегоНазначенияКлиентСервер.РазностьМассивов(Поля, ИсключаемыеПоля);
	
	Возврат СтрСоединить(Поля, ",");
	
КонецФункции

Функция СформироватьИдентификаторПоСлужебнымРеквизитам(СлужебныеРеквизиты)
	
	ПараметрыФункции = Новый Массив();
	Для Каждого СлужебныйРеквизит Из СлужебныеРеквизиты Цикл
		ПараметрыФункции.Добавить("Параметры." + СлужебныйРеквизит.Ключ);
	КонецЦикла;
	
	Выражение = "SUI_ИнтеграцияВКонфигурацию.СформироватьИдентификатор(" + СтрСоединить(ПараметрыФункции, ",") + ")";
	
	Возврат ОбщегоНазначения.ВычислитьВБезопасномРежиме(Выражение, СлужебныеРеквизиты);

КонецФункции

Процедура ОчиститьТаблицуИнтеграции(ТаблицаИнтеграции)
	
	ИмяТаблицы = SUI_НастройкиМетаданныхСервер.ПолучитьИмяТаблицыВКонфигурации(ТаблицаИнтеграции);
	
	Если ИмяТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
		
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить(ИмяТаблицы);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
		Блокировка.Заблокировать();
		
		НаборЗаписей = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ИмяТаблицы).СоздатьНаборЗаписей();
		НаборЗаписей.Записать(Истина);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
		
КонецПроцедуры

Функция ДанныеКУдалениюВТаблицеПоИсточнику(ПараметрыЗаписи, Знач ПараметрыВыгрузки)
	
	Если ПараметрыЗаписи.ИсточникДанных = Неопределено Или 
		ПараметрыВыгрузки.НастройкиКомпоновкиДанных.Отбор.Элементы.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыВыгрузки.НастройкиКомпоновкиДанных.Отбор.Элементы.Очистить();
	
	Возврат МенеджерНастроекТаблиц().ВыгрузитьРезультатПоНастройке(ПараметрыВыгрузки);

КонецФункции

Функция ПереопределитьШаблонЭтикеткиПередЗаписьюВТаблицу(Данные)
	
	ЭтоZPL = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Данные, "isZPL", Ложь, Тип("Булево"));
			
	Данные.layout = SUI_ШаблоныЭтикеток.МакетВBase64(Данные.layout, ЭтоZPL);
	
	Если Не ЗначениеЗаполнено(Данные.layout) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Данные.layout = Новый ХранилищеЗначения(Данные.layout, Новый СжатиеДанных(9));
	
	Возврат Истина;
			
КонецФункции

#КонецОбласти
