#Область СлужебныеПроцедурыИФункции

#Область РасширяемыеПроцедурыИФункции

&Вместо("КэшФормы")
Функция SUI_КэшФормы(ИмяФормы, ИсточникиЧерезЗапятую, ЭтоФормаОбъекта)
	
	SUI_КэшФормы = ПродолжитьВызов(ИмяФормы, ИсточникиЧерезЗапятую, ЭтоФормаОбъекта);    
	
	Если SUI_Simple.Используется() Тогда
		SUI_КэшФормыДоументыОбмена(ИмяФормы, ИсточникиЧерезЗапятую, ЭтоФормаОбъекта, SUI_КэшФормы);
		SUI_ДобавитьКомандуИдентификаторСсылки(ИмяФормы, ИсточникиЧерезЗапятую, ЭтоФормаОбъекта, SUI_КэшФормы);
	КонецЕсли;

	Возврат SUI_КэшФормы;
	
КонецФункции

&Вместо("ВидыКоманд")
Функция SUI_ВидыКоманд()
	
	SUI_ВидыКоманд = ПродолжитьВызов();
	
	Если SUI_Simple.Используется() Тогда
		
		// Подменю Документы обмена
		SUI_НовыйВидКоманды = SUI_ВидыКоманд.Добавить();
		SUI_НовыйВидКоманды.ВидГруппыФормы = ВидГруппыФормы.Подменю;
		SUI_НовыйВидКоманды.Имя = SUI_ИдентификаторПодменюДокументыОбмена();
		SUI_НовыйВидКоманды.ИмяПодменю = SUI_НовыйВидКоманды.Имя;
		SUI_НовыйВидКоманды.Заголовок = SUI_SimpleКлиентСервер.Представление();
		SUI_НовыйВидКоманды.Картинка = БиблиотекаКартинок.SUI_ПодсистемаSimple;
		SUI_НовыйВидКоманды.Отображение = ОтображениеКнопки.КартинкаИТекст;
		SUI_НовыйВидКоманды.Порядок = 1000;
		
	КонецЕсли;
	
	Возврат SUI_ВидыКоманд;
	
КонецФункции

#КонецОбласти

Процедура SUI_КэшФормыДоументыОбмена(SUI_ИмяФормы, SUI_ИсточникиЧерезЗапятую, SUI_ЭтоФормаОбъекта, SUI_КэшФормы)
	
	// Это форма с документами
	Если Не SUI_ЭтоФормаДокументов(SUI_ИмяФормы, SUI_ИсточникиЧерезЗапятую, SUI_ЭтоФормаОбъекта) Тогда
		Возврат;
	КонецЕсли;

	SUI_ИдентификаторПодменю = SUI_ИдентификаторПодменюДокументыОбмена();
	
	// Кнопка: Выгрузить на ТСД
	SUI_ДополнительныеСвойства = Новый Структура;
	SUI_ДополнительныеСвойства.Вставить("МножественныйВыбор", Ложь);
	SUI_ДополнительныеСвойства.Вставить("Картинка", БиблиотекаКартинок.SUI_ВыгрузитьВТСД);
	SUI_ДобавитьКоманду(SUI_КэшФормы.Команды, SUI_ИдентификаторПодменю, НСтр("ru = 'Выгрузить'"),
		"SUI_ДокументыОбменаКлиент.ОткрытьВыгрузкуДокументаНаТСД", 1, SUI_ДополнительныеСвойства); 
	
	// Кнопка: Загрузить из ТСД 
	SUI_ДополнительныеСвойства = Новый Структура;
	SUI_ДополнительныеСвойства.Вставить("МножественныйВыбор", Ложь);
	SUI_ДополнительныеСвойства.Вставить("Картинка", БиблиотекаКартинок.ПоказатьДанные);
	SUI_ДобавитьКоманду(SUI_КэшФормы.Команды, SUI_ИдентификаторПодменю, НСтр("ru = 'Просмотр'"),
		"SUI_ДокументыОбменаКлиент.ОткрытьПросмотрДокументаИзТСД", 2, SUI_ДополнительныеСвойства);
		
	// Кнопка: Загрузить из ТСД 
	SUI_ДополнительныеСвойства = Новый Структура;
	SUI_ДополнительныеСвойства.Вставить("МножественныйВыбор", Ложь);
	SUI_ДополнительныеСвойства.Вставить("Картинка", БиблиотекаКартинок.SUI_ЗагрузитьИзТСД);
	SUI_ДобавитьКоманду(SUI_КэшФормы.Команды, SUI_ИдентификаторПодменю, НСтр("ru = 'Загрузить'"),
		"SUI_ДокументыОбменаКлиент.ОткрытьЗагрузкуДокументаИзТСД", 3, SUI_ДополнительныеСвойства);
	
	// Кнопка: Документ обмена 
	SUI_ДополнительныеСвойства = Новый Структура;
	SUI_ДополнительныеСвойства.Вставить("МножественныйВыбор", Ложь);
	SUI_ДополнительныеСвойства.Вставить("Картинка", БиблиотекаКартинок.SUI_Документ);
	SUI_ДобавитьКоманду(SUI_КэшФормы.Команды, SUI_ИдентификаторПодменю, НСтр("ru = 'Документ обмена'"),
		"SUI_ДокументыОбменаКлиент.ОткрытьДокументОбменаПоСсылке", 4, SUI_ДополнительныеСвойства);
		
	// Кнопка: Удалить ранее выгруженные данные 
	SUI_ДополнительныеСвойства = Новый Структура;
	SUI_ДополнительныеСвойства.Вставить("МножественныйВыбор", Истина);
	SUI_ДополнительныеСвойства.Вставить("Картинка", БиблиотекаКартинок.SUI_Удалить);
	SUI_ДобавитьКоманду(SUI_КэшФормы.Команды, SUI_ИдентификаторПодменю, НСтр("ru = 'Удалить выгруженные данные'"),
		"SUI_ДокументыОбменаКлиент.УдалитьРанееВыгруженныеДанные", 5, SUI_ДополнительныеСвойства);
	
	// Кнопка: Открыть Журнал регистрации 
	SUI_ДополнительныеСвойства = Новый Структура;
	SUI_ДополнительныеСвойства.Вставить("МножественныйВыбор", Истина);
	SUI_ДополнительныеСвойства.Вставить("Картинка", БиблиотекаКартинок.ЖурналРегистрации);
	SUI_ДобавитьКоманду(SUI_КэшФормы.Команды, SUI_ИдентификаторПодменю, НСтр("ru = 'Журнал регистрации'"),
		"SUI_ДокументыОбменаКлиент.ОткрытьЖурналРегистрации", 6, SUI_ДополнительныеСвойства);
	
КонецПроцедуры

Процедура SUI_ДобавитьКомандуИдентификаторСсылки(SUI_ИмяФормы, SUI_ИсточникиЧерезЗапятую, SUI_ЭтоФормаОбъекта, SUI_КэшФормы)
	
	Если Не SUI_ЭтоФормаСсылочногоОбъекта(SUI_ИмяФормы, SUI_ИсточникиЧерезЗапятую, SUI_ЭтоФормаОбъекта) Тогда
		Возврат;
	КонецЕсли;
	
	SUI_ИдентификаторПодменю = SUI_ИдентификаторПодменюДокументыОбмена();
	
	// Кнопка: Идентификатор Simple ссылки 
	SUI_ДополнительныеСвойства = Новый Структура;
	SUI_ДополнительныеСвойства.Вставить("МножественныйВыбор", Ложь);
	SUI_ДополнительныеСвойства.Вставить("Картинка", БиблиотекаКартинок.SUI_ТипИдентификатор);
	SUI_ДобавитьКоманду(SUI_КэшФормы.Команды, SUI_ИдентификаторПодменю, НСтр("ru = 'ID Simple'"),
		"SUI_ИнтеграцияВКонфигурациюКлиент.ПоказатьИдентификаторSimpleСсылки", 7, SUI_ДополнительныеСвойства);
	
КонецПроцедуры

Процедура SUI_ДобавитьКоманду(Команды, ИдентификаторПодменю, Представление, Обработчик, Порядок, ДополнительныеСвойства = Неопределено)
	
	SUI_НоваяКоманда = Команды.Добавить();
	SUI_НоваяКоманда.Порядок = Порядок;
	SUI_НоваяКоманда.Представление = Представление;
	SUI_НоваяКоманда.Вид = ИдентификаторПодменю;
	SUI_НоваяКоманда.МножественныйВыбор = Ложь;
	SUI_НоваяКоманда.РежимЗаписи = "Запись";
	SUI_НоваяКоманда.ИзменяетВыбранныеОбъекты = Ложь;
	SUI_НоваяКоманда.Обработчик = Обработчик;

	Если ДополнительныеСвойства <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(SUI_НоваяКоманда, ДополнительныеСвойства);
	КонецЕсли;
	
КонецПроцедуры

Функция SUI_ЭтоФормаДокументов(SUI_ИмяФормы, SUI_ИсточникиЧерезЗапятую, SUI_ЭтоФормаОбъекта)
	
	Если SUI_ЭтоФормаОбъекта Или (Не SUI_ЭтоФормаОбъекта И ПустаяСтрока(SUI_ИсточникиЧерезЗапятую)) Тогда
		SUI_МассивИсточников = SUI_ОбщегоНазначенияКлиентСервер.МассивЗначений(SUI_ИмяФормы);
	Иначе
		SUI_МассивИсточников = СтрРазделить(SUI_ИсточникиЧерезЗапятую, ",", Ложь);
	КонецЕсли;
	
	Для Каждого ПолноеИмяИсточника Из SUI_МассивИсточников Цикл	
			
		Если СтрНачинаетсяС(ПолноеИмяИсточника, "Документ.") Тогда
			Возврат Истина;
		КонецЕсли;	
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция SUI_ЭтоФормаСсылочногоОбъекта(SUI_ИмяФормы, SUI_ИсточникиЧерезЗапятую, SUI_ЭтоФормаОбъекта)
	
	Если SUI_ЭтоФормаОбъекта Или (Не SUI_ЭтоФормаОбъекта И ПустаяСтрока(SUI_ИсточникиЧерезЗапятую)) Тогда
		SUI_МассивИсточников = SUI_ОбщегоНазначенияКлиентСервер.МассивЗначений(SUI_ИмяФормы);
	Иначе
		SUI_МассивИсточников = СтрРазделить(SUI_ИсточникиЧерезЗапятую, ",", Ложь);
	КонецЕсли;
	
	Для Каждого ПолноеИмяИсточника Из SUI_МассивИсточников Цикл	
			
		Если СтрНачинаетсяС(ПолноеИмяИсточника, "Документ.") Или 
			СтрНачинаетсяС(ПолноеИмяИсточника, "Справочник.") Тогда
			Возврат Истина;
		КонецЕсли;	
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция SUI_ИдентификаторПодменюДокументыОбмена() 
	Возврат НСтр("ru = 'SUI_ПодменюДокументыОбмена'");
КонецФункции

#КонецОбласти
