#Область СлужебныеПроцедурыИФункции

#Область РасширяемыеПроцедурыИФункции

&Вместо("КэшФормы")
Функция SUI_КэшФормы(ИмяФормы, ИсточникиЧерезЗапятую, ЭтоФормаОбъекта)
	
	SUI_КэшФормы = ПродолжитьВызов(ИмяФормы, ИсточникиЧерезЗапятую, ЭтоФормаОбъекта);    
	
	Если SUI_Simple.Используется() Тогда
		SUI_КэшФормыДокументыОбмена(ИмяФормы, ИсточникиЧерезЗапятую, ЭтоФормаОбъекта, SUI_КэшФормы);
		SUI_ДобавитьКомандуИдентификаторСсылки(ИмяФормы, ИсточникиЧерезЗапятую, ЭтоФормаОбъекта, SUI_КэшФормы);
	КонецЕсли;

	Возврат SUI_КэшФормы;
	
КонецФункции

&Вместо("ВидыКоманд")
Функция SUI_ВидыКоманд()
	
	SUI_ВидыКоманд = ПродолжитьВызов();
	
	Если SUI_Simple.Используется() Тогда
		
		// Подменю Simple
		SUI_НовыйВидКоманды = SUI_ВидыКоманд.Добавить();
		SUI_НовыйВидКоманды.ВидГруппыФормы = ВидГруппыФормы.Подменю;
		SUI_НовыйВидКоманды.Имя = SUI_ИдентификаторПодменюSimple();
		SUI_НовыйВидКоманды.ИмяПодменю = SUI_НовыйВидКоманды.Имя;
		SUI_НовыйВидКоманды.Заголовок = SUI_SimpleКлиентСервер.Представление();
		SUI_НовыйВидКоманды.Картинка = БиблиотекаКартинок.SUI_ПодсистемаSimple;
		SUI_НовыйВидКоманды.Отображение = ОтображениеКнопки.КартинкаИТекст;
		SUI_НовыйВидКоманды.Порядок = 1000;
		
	КонецЕсли;
	
	Возврат SUI_ВидыКоманд;
	
КонецФункции

#КонецОбласти

Процедура SUI_КэшФормыДокументыОбмена(SUI_ИмяФормы, SUI_ИсточникиЧерезЗапятую, SUI_ЭтоФормаОбъекта, SUI_КэшФормы)
	
	// Это форма с документами
	Если Не SUI_ЭтоФормаДокументов(SUI_ИмяФормы, SUI_ИсточникиЧерезЗапятую, SUI_ЭтоФормаОбъекта) Тогда
		Возврат;
	КонецЕсли;
	
	// Кнопка: Выгрузить в документ обмена
	SUI_ДополнительныеСвойства = Новый Структура();
	SUI_ДополнительныеСвойства.Вставить("МножественныйВыбор", Ложь);
	SUI_ДополнительныеСвойства.Вставить("Картинка", БиблиотекаКартинок.SUI_ДокументОбменаВыгрузить);
	SUI_ДобавитьКоманду(SUI_КэшФормы.Команды, SUI_ИдентификаторПодменюSimple(), НСтр("ru = 'Выгрузить'"),
		"SUI_ДокументыОбменаКлиент.ВыгрузитьВДокументОбмена", 1, SUI_ДополнительныеСвойства);
	
	// Кнопка: Открыть документ обмена
	SUI_ДополнительныеСвойства = Новый Структура;
	SUI_ДополнительныеСвойства.Вставить("МножественныйВыбор", Ложь);
	SUI_ДополнительныеСвойства.Вставить("Картинка", БиблиотекаКартинок.SUI_ДокументОбмена);
	SUI_ДобавитьКоманду(SUI_КэшФормы.Команды, SUI_ИдентификаторПодменюSimple(), НСтр("ru = 'Открыть'"),
		"SUI_ДокументыОбменаКлиент.ОткрытьДокументОбмена", 2, SUI_ДополнительныеСвойства);
		
	// Кнопка: Предпросмотр результата
	SUI_ДополнительныеСвойства = Новый Структура;
	SUI_ДополнительныеСвойства.Вставить("МножественныйВыбор", Ложь);
	SUI_ДополнительныеСвойства.Вставить("Картинка", БиблиотекаКартинок.SUI_ДокументОбменаОткрыть);
	SUI_ДополнительныеСвойства.Вставить("ИзменяетВыбранныеОбъекты", Истина);
	SUI_ДобавитьКоманду(SUI_КэшФормы.Команды, SUI_ИдентификаторПодменюSimple(), НСтр("ru = 'Результат'"),
		"SUI_ДокументыОбменаКлиент.ОткрытьПросмотрРезультата", 3, SUI_ДополнительныеСвойства);
	
	// Кнопка: Загрузить из документа обмена
	SUI_ДополнительныеСвойства = Новый Структура;
	SUI_ДополнительныеСвойства.Вставить("МножественныйВыбор", Ложь);
	SUI_ДополнительныеСвойства.Вставить("Картинка", БиблиотекаКартинок.SUI_ДокументОбменаЗагрузить);
	SUI_ДобавитьКоманду(SUI_КэшФормы.Команды, SUI_ИдентификаторПодменюSimple(), НСтр("ru = 'Загрузить'"),
		"SUI_ДокументыОбменаКлиент.ЗагрузитьДокументОбмена", 4, SUI_ДополнительныеСвойства);
	
	// Кнопка: Удалить документ обмена
	SUI_ДополнительныеСвойства = Новый Структура;
	SUI_ДополнительныеСвойства.Вставить("МножественныйВыбор", Ложь);
	SUI_ДополнительныеСвойства.Вставить("Картинка", БиблиотекаКартинок.SUI_ДокументОбменаУдалить);
	SUI_ДобавитьКоманду(SUI_КэшФормы.Команды, SUI_ИдентификаторПодменюSimple(), НСтр("ru = 'Удалить'"),
		"SUI_ДокументыОбменаКлиент.УдалитьДокументОбмена", 5, SUI_ДополнительныеСвойства);
	
КонецПроцедуры

Процедура SUI_ДобавитьКомандуИдентификаторСсылки(SUI_ИмяФормы, SUI_ИсточникиЧерезЗапятую, SUI_ЭтоФормаОбъекта, SUI_КэшФормы)
	
	Если Не SUI_ЭтоФормаСсылочногоОбъекта(SUI_ИмяФормы, SUI_ИсточникиЧерезЗапятую, SUI_ЭтоФормаОбъекта) Тогда
		Возврат;
	КонецЕсли;
	
	SUI_ИдентификаторПодменю = SUI_ИдентификаторПодменюSimple();
	
	// Кнопка: Идентификатор Simple ссылки 
	SUI_ДополнительныеСвойства = Новый Структура;
	SUI_ДополнительныеСвойства.Вставить("МножественныйВыбор", Ложь);
	SUI_ДополнительныеСвойства.Вставить("Картинка", БиблиотекаКартинок.SUI_ТипИдентификатор);
	SUI_ДобавитьКоманду(SUI_КэшФормы.Команды, SUI_ИдентификаторПодменю, НСтр("ru = 'Идентификатор'"),
		"SUI_ИнтеграцияВКонфигурациюКлиент.ПоказатьИдентификаторSimpleСсылки", 7, SUI_ДополнительныеСвойства);
	
КонецПроцедуры

Процедура SUI_ДобавитьКоманду(Команды, ИдентификаторПодменю, Представление, Обработчик, Порядок, ДополнительныеСвойства = Неопределено)
	
	SUI_НоваяКоманда = Команды.Добавить();
	SUI_НоваяКоманда.Порядок = Порядок;
	SUI_НоваяКоманда.Представление = Представление;
	SUI_НоваяКоманда.Вид = ИдентификаторПодменю;
	SUI_НоваяКоманда.МножественныйВыбор = Ложь;
	SUI_НоваяКоманда.РежимЗаписи = "Запись";
	SUI_НоваяКоманда.ИзменяетВыбранныеОбъекты = Ложь;
	SUI_НоваяКоманда.Обработчик = Обработчик;
	
	Если ДополнительныеСвойства <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(SUI_НоваяКоманда, ДополнительныеСвойства);
	КонецЕсли;
	
КонецПроцедуры

Функция SUI_ЭтоФормаДокументов(SUI_ИмяФормы, SUI_ИсточникиЧерезЗапятую, SUI_ЭтоФормаОбъекта)
	
	Если SUI_ЭтоФормаОбъекта Или (Не SUI_ЭтоФормаОбъекта И ПустаяСтрока(SUI_ИсточникиЧерезЗапятую)) Тогда
		SUI_МассивИсточников = SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.МассивЗначений(SUI_ИмяФормы);
	Иначе
		SUI_МассивИсточников = СтрРазделить(SUI_ИсточникиЧерезЗапятую, ",", Ложь);
	КонецЕсли;
	
	Для Каждого ПолноеИмяИсточника Из SUI_МассивИсточников Цикл	
			
		Если СтрНачинаетсяС(ПолноеИмяИсточника, "Документ.") Тогда
			Возврат Истина;
		КонецЕсли;	
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция SUI_ЭтоФормаСсылочногоОбъекта(SUI_ИмяФормы, SUI_ИсточникиЧерезЗапятую, SUI_ЭтоФормаОбъекта)
	
	Если SUI_ЭтоФормаОбъекта Или (Не SUI_ЭтоФормаОбъекта И ПустаяСтрока(SUI_ИсточникиЧерезЗапятую)) Тогда
		SUI_МассивИсточников = SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.МассивЗначений(SUI_ИмяФормы);
	Иначе
		SUI_МассивИсточников = СтрРазделить(SUI_ИсточникиЧерезЗапятую, ",", Ложь);
	КонецЕсли;
	
	Для Каждого ПолноеИмяИсточника Из SUI_МассивИсточников Цикл	
			
		Если СтрНачинаетсяС(ПолноеИмяИсточника, "Документ.") Или 
			СтрНачинаетсяС(ПолноеИмяИсточника, "Справочник.") Тогда
			Возврат Истина;
		КонецЕсли;	
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция SUI_ИдентификаторПодменюSimple() 
	Возврат НСтр("ru = 'SUI_ПодменюSimple'");
КонецФункции

#КонецОбласти
