
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не SUI_ИнтеграцияВКонфигурациюВызовСервера.ИспользуетсяВариантОбменаОнлайн() Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Формирование QR кода для подключения мобильного приложения доступно только в варианте обмена онлайн.
			|Выберите вариант обмена онлайн в центре настроек.'"), , , , Отказ);
		Возврат;
	КонецЕсли;
	
	СтруктураURI = ОбщегоНазначенияКлиентСервер.СтруктураURI(SUI_SimpleВызовСервера.ПолучитьАдресПубликацииHTTPСервиса());
	
	Если Не ЗначениеЗаполнено(СтруктураURI.Схема) Или Не ЗначениеЗаполнено(СтруктураURI.ИмяСервера) Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Не заполнен адрес публикации информационной базы.
			|Заполните адрес публикации информационной базы в центре настроек.'"), , , , Отказ);
		Возврат;
	КонецЕсли;
	
	ПутьНаСервере = Сред(СтруктураURI.ПутьНаСервере, 1, СтрНайти(СтруктураURI.ПутьНаСервере, "/"));
	
	АдресHTTPСервиса1С = СтруктураURI.Схема + "://" + СтруктураURI.ИмяСервера + "/" + ПутьНаСервере + ?(Прав(ПутьНаСервере, 1) = "/", "hs", "/hs");
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьГиперссылкуВыбратьПользователя();
	СформироватьQRКодПодключенияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	УдалитьQRКод();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВыбратьПользователяНажатие(Элемент)

	ПараметрыВыбораПользователя = Новый Структура();
	ПараметрыВыбораПользователя.Вставить("Пользователь", ПользовательСервиса);
	ПараметрыВыбораПользователя.Вставить("Пароль", ПарольПользователяИБ);

	ОповещениеОЗавершении = Новый ОписаниеОповещения("ВыбратьПользователяЗавершение", ЭтотОбъект);

	ОткрытьФорму("ОбщаяФорма.SUI_АутентификацияВСервисе", ПараметрыВыбораПользователя, 
		ЭтотОбъект, УникальныйИдентификатор, , , ОповещениеОЗавершении);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОчиститьПользователя(Команда)

	ПользовательСервиса = Неопределено;
	ИмяПользователяИБ = "";
	ПарольПользователяИБ = "";
	
	ОбновитьГиперссылкуВыбратьПользователя();
	
	УдалитьQRКод();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыбратьПользователяЗавершение(ПараметрыПользователя, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(ПараметрыПользователя) Тогда
		Возврат;
	КонецЕсли;
	
	ПользовательСервиса = ПараметрыПользователя.Пользователь;
	ИмяПользователяИБ = ПараметрыПользователя.Имя;
	ПарольПользователяИБ = ПараметрыПользователя.Пароль;
	
	ОбновитьГиперссылкуВыбратьПользователя();
	
	УдалитьQRКод();
	
	СформироватьQRКодПодключенияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьГиперссылкуВыбратьПользователя()
	
	Если ЗначениеЗаполнено(ПользовательСервиса) И ЗначениеЗаполнено(ИмяПользователяИБ) Тогда
		Элементы.ГиперссылкаВыбратьПользователя.Заголовок = Строка(ПользовательСервиса);
		Элементы.ГиперссылкаВыбратьПользователя.ЦветТекста = WebЦвета.Васильковый;
	Иначе
		Элементы.ГиперссылкаВыбратьПользователя.Заголовок = НСтр("ru = '<выбрать пользователя>'");
		Элементы.ГиперссылкаВыбратьПользователя.ЦветТекста = WebЦвета.Красный;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьQRКодПодключенияНаСервере()

	Если ЗначениеЗаполнено(ПользовательСервиса) И
		ЗначениеЗаполнено(АдресHTTPСервиса1С) И
		ЗначениеЗаполнено(ИмяПользователяИБ) Тогда
		
		ДанныеДляПодключения = Новый Структура();
		
		ДанныеДляПодключения.Вставить("url", АдресHTTPСервиса1С);
		ДанныеДляПодключения.Вставить("user", ИмяПользователяИБ);
		ДанныеДляПодключения.Вставить("pass", ПарольПользователяИБ);
		ДанныеДляПодключения.Вставить("user_name", Строка(ПользовательСервиса));
		
		ДанныеДляПодключения = SUI_ОбщегоНазначенияКлиентСервер.ДанныеВСтрокуJSON(ДанныеДляПодключения);
		
		ДанныеQRКода = SUI_ГенерацияШтрихкода.ДанныеQRКода(ДанныеДляПодключения, 0, 190);
		
		QRКодПодключения = ПоместитьВоВременноеХранилище(ДанныеQRКода, УникальныйИдентификатор);

	Иначе
		
		Ошибки = Новый Массив();
		
		Если Не ЗначениеЗаполнено(АдресHTTPСервиса1С) Тогда
			Ошибки.Добавить(НСтр("ru = ' - не заполнен адрес публикации информационной базы;'"));
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПользовательСервиса) Или 
			Не ЗначениеЗаполнено(ИмяПользователяИБ) Тогда
			Ошибки.Добавить(НСтр("ru = ' - не выбран пользователь подключения;'"));
		КонецЕсли;
		
		Элементы.QRКодПодключения.ТекстНевыбраннойКартинки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Ошибка формирования QR кода.
			|%1'"), СтрСоединить(Ошибки))

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УдалитьQRКод()
	
	Если ЭтоАдресВременногоХранилища(QRКодПодключения) Тогда
		УдалитьИзВременногоХранилища(QRКодПодключения);
	КонецЕсли;
	
	QRКодПодключения = "";
	
КонецПроцедуры

#КонецОбласти
