
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекстЗапроса = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, 
		"Данные.ТекстЗапроса", "", Тип("Строка"));
	
	ВыполнятьВПакетномРежиме = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, 
		"Данные.ВыполнятьВПакетномРежиме", Ложь, Тип("Булево"));
		
	ПакетыРезультата.ЗагрузитьЗначения(SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, 
		"Данные.ПакетыРезультата", Новый Массив(), Тип("Массив")));

	Элементы.ГруппаНастройкаРезультатаЗапроса.Видимость = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры,
		"ОтображатьНастройкиРезультатаЗапроса", Истина, Тип("Булево"));

	// Описание запроса
	Элементы.НадписьОписаниеЗапроса.Заголовок = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры,
		"ОписаниеЗапроса", "", Тип("Строка"));
	Элементы.ГруппаОписаниеЗапроса.Видимость = Не ПустаяСтрока(Элементы.НадписьОписаниеЗапроса.Заголовок);
	
	// Описание временных таблиц
	ОписанияВТ = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры,
		"ОписаниеВременныхТаблиц", Новый Соответствие(), Тип("Соответствие"));
	Если ОписанияВТ.Количество() > 0 Тогда

		_ОписаниеВременныхТаблиц = РеквизитФормыВЗначение("ОписаниеВременныхТаблиц", Тип("ДеревоЗначений"));
		Для Каждого ОписаниеВТ Из ОписанияВТ Цикл
			
			СтрокаТаблица = _ОписаниеВременныхТаблиц.Строки.Добавить();
			СтрокаТаблица.Поле = ОписаниеВТ.Ключ;

			Для Каждого ОписаниеКолонкиВТ Из ОписаниеВТ.Значение Цикл
				
				СтрокаПоля = СтрокаТаблица.Строки.Добавить();
				СтрокаПоля.Поле = ОписаниеКолонкиВТ.Ключ;
				
				Если Не ЗначениеЗаполнено(ОписаниеКолонкиВТ.Значение) Тогда
					Продолжить;
				КонецЕсли;
				
				ОписанияТиповКолонок = Новый Массив();
				Для Каждого ТипКолонки Из ОписаниеКолонкиВТ.Значение.Тип.Типы() Цикл
					ОписанияТиповКолонок.Добавить(SUI_ОбщегоНазначения.СтроковоеПредставлениеТипа(ТипКолонки));
				КонецЦикла;
	
				СтрокаПоля.Тип = СтрСоединить(ОписанияТиповКолонок, ", ");
				СтрокаПоля.Описание = ОписаниеКолонкиВТ.Значение.Описание;

			КонецЦикла;
			
		КонецЦикла;
		
		ЗначениеВРеквизитФормы(_ОписаниеВременныхТаблиц, "ОписаниеВременныхТаблиц");
			
	КонецЕсли;
	
	Элементы.ГруппаОписаниеВременныхТаблиц.Видимость = (ОписаниеВременныхТаблиц.ПолучитьЭлементы().Количество() > 0);
		
	// Описание параметров
	_ОписаниеПараметров = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры,
		"ОписаниеПараметров", Новый Соответствие(), Тип("Соответствие"));
	Для Каждого ОписаниеПараметра Из _ОписаниеПараметров Цикл
		НоваяСтрокаОписаниеПараметров = ОписаниеПараметров.Добавить();
		НоваяСтрокаОписаниеПараметров.Параметр = ОписаниеПараметра.Ключ;
		Если ЗначениеЗаполнено(ОписаниеПараметра.Значение) Тогда
			НоваяСтрокаОписаниеПараметров.Тип = SUI_ОбщегоНазначения.СтроковоеПредставлениеТипа(ОписаниеПараметра.Значение.Тип);
			НоваяСтрокаОписаниеПараметров.Описание = ОписаниеПараметра.Значение.Описание;
		КонецЕсли;			
	КонецЦикла;
	Элементы.ГруппаОписаниеПараметров.Видимость = (ОписаниеПараметров.Количество() > 0);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПакетыРезультатаПриИзменении(Элемент)
	ПакетыРезультата.ЗагрузитьЗначения(SUI_ОбщегоНазначенияКлиентСервер.СвернутьМассив(ПакетыРезультата.ВыгрузитьЗначения()));
КонецПроцедуры

&НаКлиенте
Процедура НадписьОписаниеПараметровОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура НадписьОписаниеВременныхТаблицОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	Закрыть(СформироватьПараметрыЗакрытияКонструктора());
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКонструкторЗапроса(Команда)
	
	#Если МобильныйКлиент Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Работа конструктора запросов в мобильном клиенте не поддерживается.'"));
		Возврат;
	#Иначе
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ПослеЗакрытияКонструктораЗапроса", ЭтотОбъект);
		
		КонструкторЗапроса = Новый КонструкторЗапроса(СокрЛП(ТекстЗапроса));
		КонструкторЗапроса.Показать(ОповещениеОЗавершении);
		
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура УбратьПереносы(Команда)
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "|", "");
КонецПроцедуры

&НаКлиенте
Процедура Закомментировать(Команда)
	
	Перем ПерваяСтрока, ПерваяКолонка, ПоследняяСтрока, ПоследняяКолонка;
	
	Элемент = Элементы.ТекстЗапроса;
	Элемент.ПолучитьГраницыВыделения(ПерваяСтрока, ПерваяКолонка, ПоследняяСтрока, ПоследняяКолонка);
	
	ТекстДоИзменения = ТекстЗапроса;
	КоличествоСтрок = СтрЧислоСтрок(ТекстДоИзменения);
	ВыделенныйФрагмент = "";
	ДлинаПоследнейСтроки = 0;
	
	Если ПоследняяКолонка = 1 Тогда 
		ПоследняяСтрока = ПоследняяСтрока - 1;
	КонецЕсли;
	Если ПерваяСтрока >= ПоследняяСтрока И ПоследняяКолонка = 1 Тогда 
		ПоследняяКолонка = СтрДлина(СтрПолучитьСтроку(ТекстДоИзменения, ПерваяСтрока));
		ПоследняяСтрока = ПерваяСтрока;
	КонецЕсли;
	
	Для НомерСтроки = 1 По КоличествоСтрок Цикл
		Фрагмент = СтрПолучитьСтроку(ТекстДоИзменения, НомерСтроки);
		Если НомерСтроки >= ПерваяСтрока И НомерСтроки <= ПоследняяСтрока Тогда
			Если НомерСтроки = ПерваяСтрока Тогда 
				ВыделенныйФрагмент = ВыделенныйФрагмент + "//" + Фрагмент;
			Иначе
				ВыделенныйФрагмент = ВыделенныйФрагмент + Символы.ПС + "//" +Фрагмент;
			КонецЕсли;
			Если НомерСтроки = ПоследняяСтрока Тогда 
				ДлинаПоследнейСтроки = СтрДлина(Фрагмент) + 3;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ПоследняяКолонка = 1 Тогда 
		ПоследняяСтрока = ПоследняяСтрока + 1;
		ДлинаПоследнейСтроки = 1;
		ВыделенныйФрагмент =  ВыделенныйФрагмент + Символы.ПС;
	КонецЕсли;
	
	Элемент.УстановитьГраницыВыделения(ПерваяСтрока, 1, ПоследняяСтрока, ДлинаПоследнейСтроки);
	Элемент.ВыделенныйТекст = ВыделенныйФрагмент;
	Элемент.УстановитьГраницыВыделения(ПерваяСтрока, 1, ПоследняяСтрока, ДлинаПоследнейСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура Раскомментировать(Команда)
	
	Перем ПерваяСтрока, ПерваяКолонка, ПоследняяСтрока, ПоследняяКолонка;
	Элемент = Элементы.ТекстЗапроса;
	Элемент.ПолучитьГраницыВыделения(ПерваяСтрока, ПерваяКолонка, ПоследняяСтрока, ПоследняяКолонка);
	
	ТекстДоИзменения = ТекстЗапроса;
	КоличествоСтрок = СтрЧислоСтрок(ТекстДоИзменения);
	ВыделенныйФрагмент = "";
	ДлинаПоследнейСтроки = ПоследняяКолонка;
	
	Если ПоследняяКолонка = 1 Тогда
		ПоследняяСтрока = ПоследняяСтрока - 1;
	КонецЕсли;
	Если ПерваяСтрока >= ПоследняяСтрока И ПоследняяКолонка = 1 Тогда 
		ПоследняяКолонка = СтрДлина(СтрПолучитьСтроку(ТекстДоИзменения, ПерваяСтрока));
		ПоследняяСтрока = ПерваяСтрока;
	КонецЕсли;

	Для НомерСтроки = 1 По КоличествоСтрок Цикл
		Фрагмент = СтрПолучитьСтроку(ТекстДоИзменения, НомерСтроки);
		Если НомерСтроки >= ПерваяСтрока И НомерСтроки <= ПоследняяСтрока Тогда
			Если СтрНачинаетсяС(СокрЛ(Фрагмент), "//") Тогда
				Позиция = СтрНайти(Фрагмент, "//");
				Фрагмент = Лев(Фрагмент, Позиция - 1) + Сред(Фрагмент, Позиция + 2);
			КонецЕсли;
			Если НомерСтроки = ПерваяСтрока Тогда 
				ВыделенныйФрагмент = ВыделенныйФрагмент + Фрагмент;
			Иначе
				ВыделенныйФрагмент = ВыделенныйФрагмент + Символы.ПС + Фрагмент;
			КонецЕсли;
			Если НомерСтроки = ПоследняяСтрока Тогда 
				ДлинаПоследнейСтроки = СтрДлина(Фрагмент) + 3;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ПоследняяКолонка = 1 Тогда
		ПоследняяСтрока = ПоследняяСтрока + 1;
		ДлинаПоследнейСтроки = 1;
		ВыделенныйФрагмент =  ВыделенныйФрагмент + Символы.ПС;
	КонецЕсли;
	
	Элемент.УстановитьГраницыВыделения(ПерваяСтрока, 1, ПоследняяСтрока, ДлинаПоследнейСтроки);
	Элемент.ВыделенныйТекст = ВыделенныйФрагмент;
	Элемент.УстановитьГраницыВыделения(ПерваяСтрока, 1, ПоследняяСтрока, ДлинаПоследнейСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьЗапрос(Команда)
	ТекстЗапроса = "";
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция СформироватьПараметрыЗакрытияКонструктора()
	
	ДанныеКонструктора = SUI_КонструкторЗапросаКлиентСервер.ДанныеКонструктора();

	ДанныеКонструктора.ТекстЗапроса = ТекстЗапроса;
	ДанныеКонструктора.ВыполнятьВПакетномРежиме = ВыполнятьВПакетномРежиме;

	Если ВыполнятьВПакетномРежиме Тогда
		ДанныеКонструктора.ПакетыРезультата = ПакетыРезультата.ВыгрузитьЗначения();
	Иначе
		ДанныеКонструктора.ПакетыРезультата =  Новый Массив();
	КонецЕсли;
	
	Возврат Новый ФиксированнаяСтруктура(ДанныеКонструктора);
	
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияКонструктораЗапроса(ТекстЗапросаИзКонструктора, СтруктураПараметров) Экспорт
	
	Если ЗначениеЗаполнено(ТекстЗапросаИзКонструктора) Тогда
		ТекстЗапроса = ТекстЗапросаИзКонструктора;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
