
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получить данные конструктора запроса из шаблона этикетки.
// 
// Параметры:
//  ШаблонСсылка - СправочникСсылка.SUI_ШаблоныЭтикетокZPL - Ссылка шаблона этикетки
// 
// Возвращаемое значение:
//  Неопределено, Структура - Получить данные конструктора запроса см. SUI_КонструкторЗапросаКлиентСервер.ДанныеКонструктора
Функция ПолучитьДанныеКонструктораЗапроса(ШаблонСсылка) Экспорт
	
	Перем ДанныеКонструктора;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ШаблоныЭтикетокZPL.ВыполнятьЗапросВПакетномРежиме,
		|	ШаблоныЭтикетокZPL.ТекстЗапроса,
		|	ШаблоныЭтикетокZPL.ПакетыРезультатаЗапроса.(
		|		ИндексРезультата) КАК ПакетыРезультатаЗапроса
		|ИЗ
		|	Справочник.SUI_ШаблоныЭтикетокZPL КАК ШаблоныЭтикетокZPL
		|ГДЕ
		|	ШаблоныЭтикетокZPL.Ссылка = &ШаблонСсылка";
	
	Запрос.УстановитьПараметр("ШаблонСсылка", ШаблонСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Если Не ПустаяСтрока(Выборка.ТекстЗапроса) Тогда
			
			ДанныеКонструктора = SUI_КонструкторЗапросаКлиентСервер.ДанныеКонструктора();
			ДанныеКонструктора.ТекстЗапроса = Выборка.ТекстЗапроса;
			ДанныеКонструктора.ВыполнятьВПакетномРежиме = Выборка.ВыполнятьЗапросВПакетномРежиме;
			ДанныеКонструктора.ПакетыРезультата = Выборка.ПакетыРезультатаЗапроса.Выгрузить().ВыгрузитьКолонку("ИндексРезультата");
			
		КонецЕсли;
		
	КонецЕсли;
	
	//@skip-check constructor-function-return-section
	Возврат ДанныеКонструктора;
	
КонецФункции

#КонецОбласти

#КонецЕсли