
#Область ПрограммныйИнтерфейс

// Расширение используется.
// 
// Возвращаемое значение:
//  Булево - Используется
Функция Используется() Экспорт
	Возврат ПравоДоступа("Просмотр", Метаданные.Подсистемы.SUI_Simple);
КонецФункции

// Возвращает объект метаданных текущего расширения
// Возвращаемое значение:
//   Строка	- Объект метаданных текущего расширения
Функция ЭтоРасширение() Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Отбор = Новый Структура("Имя", SUI_SimpleКлиентСервер.ИмяРасширения());
	Расширения = РасширенияКонфигурации.Получить(Отбор);
	Если Расширения.Количество() = 1 Тогда
		Возврат Расширения[0];
	Иначе
		Возврат Неопределено;
	КонецЕсли;
		
КонецФункции

// Возвращает текущую версию расширения
// Возвращаемое значение:
//   Строка	- Текущая версия расширения
Функция Версия() Экспорт

	Расширение = ЭтоРасширение();
	
	Если Расширение = Неопределено Тогда
		Возврат "";
	Иначе
		Возврат Расширение.Версия;
	КонецЕсли;

КонецФункции

// Отключить расширение.
Процедура ОтключитьРасширение() Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Расширение = ЭтоРасширение();
	
	Попытка
		
		Если Расширение = Неопределено Тогда
			ВызватьИсключение СтрШаблон(НСтр("ru  = 'Расширение по имени %1 не найдено.'"), 
				SUI_SimpleКлиентСервер.ИмяРасширения());
		КонецЕсли;
	
		Расширение.Активно = Ложь;
		Расширение.Записать();
	
	Исключение
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Возникла исключительная ошибка при отключении расширения %1.
		|Подробнее: %2'"), SUI_SimpleКлиентСервер.Представление(), КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

// Роли расширения доступны.
// 
// Возвращаемое значение:
//  Булево - Роли расширения доступны
Функция РолиРасширенияДоступны() Экспорт
	Возврат Пользователи.РолиДоступны("SUI_РольОсновныеПрава", , Ложь);
КонецФункции

// Это полные права.
// 
// Параметры:
//  УчитыватьПривилегированныйРежим - Булево - Учитывать привилегированный режим
// 
// Возвращаемое значение:
//  Булево - Это полные права
Функция ЭтоПолныеПрава(УчитыватьПривилегированныйРежим = Истина) Экспорт
	Возврат Пользователи.РолиДоступны("ПолныеПрава", , УчитыватьПривилегированныйРежим);
КонецФункции

#Область УстаревшиеПроцедурыИФункции

// Устарела. Возвращает представление текущего расширения
// Возвращаемое значение:
//   Строка	- Представление расширения
Функция Представление() Экспорт
	Возврат SUI_SimpleКлиентСервер.Представление();
КонецФункции

#КонецОбласти

#КонецОбласти
