
#Область ПрограммныйИнтерфейс

Функция ПараметрыСтартаСеанса() Экспорт

	ПараметрыСтартаСеанса = Новый Структура();

	Если SUI_Simple.РолиРасширенияДоступны() Или SUI_Simple.ЭтоПолныеПрава(Ложь) Тогда
		ПараметрыСтартаСеанса.Вставить("ДобавленыПраваНаРасширение", Истина);
	Иначе
		ПараметрыСтартаСеанса.Вставить("ДобавленыПраваНаРасширение", Ложь);
	КонецЕсли;

	ПараметрыСтартаСеанса.Вставить("НомерСеанса", НомерСеансаИнформационнойБазы());
	
	SUI_ОбновлениеSimpleВызовСервера.ЗаполнитьПараметрыСтартаСеанса(ПараметрыСтартаСеанса);
	
	Возврат ПараметрыСтартаСеанса;
	
КонецФункции

Функция ПриНачалеРаботыСистемыПереопределяемый(_ПараметрЗапуска = "") Экспорт 
	
	сткРезультат = Новый Структура();
	сткРезультат.Вставить("ОткрытьМастерНастройки", Ложь);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не SUI_ИнтеграцияВКонфигурацию.ПроверитьБСП() Тогда
		
		Попытка
			
			SUI_Simple.ОтключитьРасширение();
			
			сткРезультат.Вставить("ЗавершениеРаботы", SUI_ОбщегоНазначенияКлиентСервер.ПараметрыЗавершенияРаботы());
			сткРезультат.ЗавершениеРаботы.ПерезапуститьПриЗавершении = Истина;
			сткРезультат.ЗавершениеРаботы.ТекстПредупреждения = СтрШаблон(
				НСтр("ru = 'Расширение %1 было автоматически отключено по причине отсутствия БСП.
				|Сеанс будет перезапущен.'"), SUI_SimpleКлиентСервер.Представление());

		Исключение
			SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(НСтр("ru = 'Начало работы'"), , 
				Метаданные.ОбщиеМодули.SUI_SimpleВызовСервера, , ИнформацияОбОшибке());
			ВызватьИсключение СтрШаблон(НСтр("ru = 'Использоваение расширение %1 невозможно по причине отсутствия БСП.
			|Отключите расширение в режиме Конфигуратора.
			|%2'"), SUI_SimpleКлиентСервер.Представление(), КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
		Возврат сткРезультат;
		
	КонецЕсли;
	
	Если Не сткРезультат.Свойство("ЗавершениеРаботы") Тогда

		Если СтрНайти(_ПараметрЗапуска, SUI_ОбновлениеSimpleКлиентСервер.ПараметрПропускаОбновления()) = 0 Тогда
			
			ТекВерсия = SUI_ОбновлениеSimple.ТекущаяВерсияКонфигурации();
			
			ПараметрЗапускаОбновления = SUI_ОбновлениеSimpleКлиентСервер.ПараметрЗапускаОбновления();

			Если СтрНайти(_ПараметрЗапуска, ПараметрЗапускаОбновления) > 0 Тогда
				// Пример: /RunUpdateSimple -1.0.0.1
				НачальныйНомерВерсии = Сред(_ПараметрЗапуска, 
					СтрНайти(_ПараметрЗапуска, ПараметрЗапускаОбновления) + СтрДлина(ПараметрЗапускаОбновления));
				
				Если СтрНачинаетсяС(НачальныйНомерВерсии, " -") Тогда
					НачальныйНомерВерсии = СокрЛП(Сред(НачальныйНомерВерсии, 3));
				Иначе
					НачальныйНомерВерсии = "";
				КонецЕсли;
	
				КонецСтрокиНачальногоНомераВерсии = СтрНайти(НачальныйНомерВерсии, " ");
				Если КонецСтрокиНачальногоНомераВерсии > 0 Тогда
					НачальныйНомерВерсии = СокрЛП(Лев(НачальныйНомерВерсии, КонецСтрокиНачальногоНомераВерсии));
				КонецЕсли;
	
				Если ПустаяСтрока(НачальныйНомерВерсии) Тогда
					сткРезультат.Вставить("НачатьОбновлениеИнформационнойБазыSimple");
				ИначеЕсли SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.СравнитьВерсии(ТекВерсия, НачальныйНомерВерсии) >= 0 Тогда
					сткРезультат.Вставить("НачатьОбновлениеИнформационнойБазыSimple", НачальныйНомерВерсии);
				КонецЕсли;
				
			Иначе
				
				ВерсияДанных = SUI_ОбновлениеSimple.ВерсияДанных();
				
				Если SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.СравнитьВерсии(ТекВерсия, ВерсияДанных) > 0 Тогда
					сткРезультат.Вставить("НачатьОбновлениеИнформационнойБазыSimple", ВерсияДанных);
				КонецЕсли;
				
			КонецЕсли;
		
		КонецЕсли;
		
		сткРезультат.ОткрытьМастерНастройки = ЗапускатьМастерНастроекПриНачалеРаботыСистемы();
		
	КонецЕсли;

	Возврат сткРезультат;
	
КонецФункции

Функция Используется() Экспорт
	Возврат SUI_Simple.Используется();
КонецФункции

// Возвращает текущую версию расширения
// Возвращаемое значение:
//   Строка	- Текущая версия расширения
Функция Версия() Экспорт
	Возврат SUI_Simple.Версия();
КонецФункции

Процедура УстановитьАдресПубликацииИнформационнойБазы(Адрес) Экспорт
	Константы.SUI_АдресПубликацииБазы.Установить(Адрес);
КонецПроцедуры

Функция ПолучитьАдресПубликацииИнформационнойБазы() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат Константы.SUI_АдресПубликацииБазы.Получить();
	
КонецФункции

Функция ПолныеПраваДоступны(УчитыватьПолныеПраваКонфигурации = Истина, УчитыватьПривилегированныйРежим = Истина) Экспорт
	Возврат SUI_Simple.ЭтоПолныеПрава(УчитыватьПривилегированныйРежим);
КонецФункции

Функция РолиРасширенияДоступны() Экспорт 
	Возврат SUI_Simple.РолиРасширенияДоступны();
КонецФункции

Функция ЗапускатьМастерНастроекПриНачалеРаботыСистемы(Значение = Неопределено) Экспорт
	
	Если Значение <> Неопределено Тогда
		УстановитьПривилегированныйРежим(Истина);
		Константы.SUI_НеЗапускатьМастерНастроекПриНачалеРаботы.Установить(
			Не SUI_ОбщегоНазначенияКлиентСервер.ОписаниеТипаБулево().ПривестиЗначение(Значение));
		Возврат Значение;
	Иначе
		Возврат Не ПолучитьФункциональнуюОпцию("SUI_НеЗапускатьМастерНастроекПриНачалеРаботы");
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ВыполнитьПроверкуСвязиПубликацииИБНаСервере(ДанныеАутентификации) Экспорт
	Возврат SUI_SimpleКлиентСервер.ВыполнитьПроверкуСвязиПубликацииИБ(ДанныеАутентификации);
КонецФункции

#КонецОбласти
