
#Область ПрограммныйИнтерфейс

Функция НормализоватьЗначениеШтрихкода(ТипАлгоритма, Алгоритм, Знач ЗначениеШтрихкода) Экспорт
	
	Если ТипАлгоритма = Перечисления.SUI_ТипыАлгоритмов.Simple Тогда
		ЗначениеШтрихкода = НормализоватьЗначениеШтрихкодаПоАлгоритмуSimple(ЗначениеШтрихкода);
	ИначеЕсли ЗначениеЗаполнено(Алгоритм) Тогда
		
		ПараметрыАлгоритма = Новый Массив();
		ПараметрыАлгоритма.Добавить(ЗначениеШтрихкода);
		ПараметрыАлгоритма = Обработки.SUI_РедакторКода.ВыполнитьКодЧерезМетодКонфигурации(
			"SUI_ШтрихкодыУпаковок.НормализоватьЗначениеШтрихкодаПоАлгоритму", Алгоритм, ПараметрыАлгоритма);
		ЗначениеШтрихкода = ПараметрыАлгоритма[ПараметрыАлгоритма.ВГраница()];
		
	Иначе
		ЗначениеШтрихкода = "";
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ОписаниеТипаСтрока(200).ПривестиЗначение(ЗначениеШтрихкода);
	
КонецФункции

Функция НормализоватьЗначениеШтрихкодаПоАлгоритмуSimple(ЗначениеШтрихкода) Экспорт
	
	РезультатРазбора = РазобратьЗначениеШтрихкода(ЗначениеШтрихкода);

	Если ЗначениеЗаполнено(РезультатРазбора) Тогда
		Возврат РезультатРазбора.НормализованныйКодМаркировки;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

Процедура НормализоватьЗначениеШтрихкодаПоАлгоритму(Алгоритм, ЗначениеШтрихкода) Экспорт
	
	Если ЗначениеЗаполнено(Алгоритм) Тогда
			
		Попытка
			УстановитьБезопасныйРежим(Истина);
			SUI_ОбщегоНазначения.ПередВыполнениемПроизвольногоАлгоритма();
			Выполнить(Алгоритм);
			УстановитьБезопасныйРежим(Ложь);
		Исключение
			ШаблонСообщения = НСтр("ru = 'Ошибка выполнения алгоритма нормализации значения штрихкода упаковки.
			|Проверьте алгоритм в настройках штрихкодов упаковок подсистемы %1.
			|
			|%2'");
			ВызватьИсключение СтрШаблон(ШаблонСообщения, SUI_SimpleКлиентСервер.Представление(), 
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	Иначе
		ЗначениеШтрихкода = "";
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьШтрихкодУпаковкиПоАлгоритму(Алгоритм, ШтрихкодУпаковки, Номенклатура, Характеристика, Упаковка, ЗначениеШтрихкода) Экспорт
	
	Если ЗначениеЗаполнено(Алгоритм) Тогда
		
		Попытка
			УстановитьБезопасныйРежим(Истина);
			SUI_ОбщегоНазначения.ПередВыполнениемПроизвольногоАлгоритма();
			Выполнить(Алгоритм);
			УстановитьБезопасныйРежим(Ложь);
		Исключение
			ШаблонСообщения = НСтр("ru = 'Ошибка выполнения алгоритма создания штрихкода упаковки.
			|Проверьте алгоритм в настройках штрихкодов упаковок подсистемы %1.
			|
			|%2'");
			ВызватьИсключение СтрШаблон(ШаблонСообщения, SUI_SimpleКлиентСервер.Представление(), 
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	Иначе
		ШтрихкодУпаковки = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РазобратьЗначениеШтрихкода(Штрихкод)
	
	Результат = Новый Структура();
	
	ДлинаШтрихкода = СтрДлина(Штрихкод);
	
	ШтрихкодСоСкобкой = СтрНачинаетсяС(Штрихкод, "(");
	
	Шаблоны = SUI_ШтрихкодыУпаковокПовтИсп.ПолучитьШаблоныКодовМаркировки();
	
	Для Каждого Шаблон Из Шаблоны Цикл 
		
		ОбрабатываемыйШтрихкод = Штрихкод;
		
		Результат.Вставить("КодМаркировки", "");
		Результат.Вставить("НормализованныйКодМаркировки", "");
			
		Если ШтрихкодСоСкобкой Тогда
			ПараметрыТекущегоШтрихкода = Шаблон.Значение.СоСкобкой;
		Иначе 
			ПараметрыТекущегоШтрихкода = Шаблон.Значение.БезСкобки;	
		КонецЕсли; 
		
		Если ДлинаШтрихкода = ПараметрыТекущегоШтрихкода.ДлинаКода Тогда
			ШаблонВыражениеШтрихкода = Шаблон.Значение.ШаблонКода;
		ИначеЕсли ДлинаШтрихкода = ПараметрыТекущегоШтрихкода.ДлинаПолногоКода Тогда
			ШаблонВыражениеШтрихкода = Шаблон.Значение.ШаблонКодаПолный;
		Иначе
			Продолжить;
		КонецЕсли;
		             
		Для Каждого ЧастьШаблона Из СтрРазделить(ШаблонВыражениеШтрихкода, "+", Ложь) Цикл 
			
			ТекущийРазделитель = ПараметрыТекущегоШтрихкода.СтруктураКода[ЧастьШаблона].Разделитель;
			ДлинаЧасти = ПараметрыТекущегоШтрихкода.СтруктураКода[ЧастьШаблона].Длина;
			
			Если ЗначениеЗаполнено(ТекущийРазделитель) И Не СтрНачинаетсяС(ОбрабатываемыйШтрихкод, ТекущийРазделитель) Тогда
				Прервать;				
			КонецЕсли;
			
			ЧастьШтрихкода = Сред(ОбрабатываемыйШтрихкод, СтрДлина(ТекущийРазделитель) + 1, ДлинаЧасти); 
			
			Если СтрДлина(ЧастьШтрихкода) <> ДлинаЧасти Или
				Не SUI_ШтрихкодыУпаковокКлиентСервер.ШтрихкодСоответствуетАлфавиту(ЧастьШтрихкода, 
					ПараметрыТекущегоШтрихкода.СтруктураКода[ЧастьШаблона].Алфавит) Тогда
				Прервать;
			КонецЕсли;
			
			Результат.НормализованныйКодМаркировки = Результат.НормализованныйКодМаркировки + Шаблон.Значение.СоСкобкой.СтруктураКода[ЧастьШаблона].Разделитель + ЧастьШтрихкода;
			Результат.КодМаркировки = Результат.КодМаркировки + Шаблон.Значение.БезСкобки.СтруктураКода[ЧастьШаблона].Разделитель + ЧастьШтрихкода;
				
			ОбрабатываемыйШтрихкод = Прав(ОбрабатываемыйШтрихкод, СтрДлина(ОбрабатываемыйШтрихкод) - СтрДлина(ЧастьШтрихкода) - СтрДлина(ТекущийРазделитель));
			
		КонецЦикла; 
		
		Если ЗначениеЗаполнено(ОбрабатываемыйШтрихкод) Тогда
			Результат = Новый Структура();
			Продолжить;			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Результат) Тогда   
			
			Результат.Вставить("ТипШтрихкода", Шаблон.Значение.ТипШтрихкода);
			Результат.Вставить("ВидУпаковки", Шаблон.Значение.ВидУпаковки);
			
			Если ШаблонВыражениеШтрихкода = Шаблон.Значение.ШаблонКодаПолный Тогда
				Результат.НормализованныйКодМаркировки = Лев(Результат.НормализованныйКодМаркировки, Шаблон.Значение.СоСкобкой.ДлинаКода);
				Результат.КодМаркировки = Лев(Результат.КодМаркировки, Шаблон.Значение.БезСкобки.ДлинаКода);
			КонецЕсли;
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не Результат.Свойство("КодМаркировки") Или Не ЗначениеЗаполнено(Результат.КодМаркировки) Или 
		Не Результат.Свойство("НормализованныйКодМаркировки") Или Не ЗначениеЗаполнено(Результат.НормализованныйКодМаркировки) Тогда
		Результат = Неопределено;	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
