
#Область ПрограммныйИнтерфейс

Функция НормализоватьЗначениеШтрихкода(ТипАлгоритма, Алгоритм, Знач ЗначениеШтрихкода) Экспорт
	
	Если ТипАлгоритма = Перечисления.SUI_ТипыАлгоритмов.Simple Тогда

		РезультатРазбора = РазобратьЗначениеШтрихкода(ЗначениеШтрихкода);

		Если ЗначениеЗаполнено(РезультатРазбора) Тогда
			ЗначениеШтрихкода = РезультатРазбора.НормализованныйКодМаркировки;
		Иначе
			ЗначениеШтрихкода = "";
		КонецЕсли;
		
	Иначе
		
		Если ЗначениеЗаполнено(Алгоритм) Тогда
			
			Попытка
				УстановитьБезопасныйРежим(Истина);
				Выполнить(Алгоритм);
			Исключение
				SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(SUI_ШтрихкодыУпаковокКлиентСервер.ИмяСобытия(), , 
					Метаданные.ОбщиеМодули.SUI_ШтрихкодыУпаковок, Алгоритм, ИнформацияОбОшибке());
				ВызватьИсключение СтрШаблон(НСтр("ru = 'При выполнении алгоритма ""Нормализации значения штрихкода упаковки"" возникла исключительная ошибка:
				|%1.
				|Проверьте алгоритм нормализации значения штрихкода упаковки в настройках подсистемы Simple.'"), 
				КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
			
		Иначе
			ЗначениеШтрихкода = "";
		КонецЕсли;

	КонецЕсли;
	
	Возврат ОбщегоНазначения.ОписаниеТипаСтрока(200).ПривестиЗначение(ЗначениеШтрихкода);
	
КонецФункции

Функция РазобратьЗначениеШтрихкода(Штрихкод) Экспорт
	
	Результат = Новый Структура();
	
	ДлинаШтрихкода = СтрДлина(Штрихкод);
	
	ШтрихкодСоСкобкой = СтрНачинаетсяС(Штрихкод, "(");
	
	Шаблоны = SUI_ШтрихкодыУпаковокПовтИсп.ПолучитьШаблоныКодовМаркировки();
	
	Для Каждого Шаблон Из Шаблоны Цикл 
		
		ОбрабатываемыйШтрихкод = Штрихкод;
		
		Результат.Вставить("КодМаркировки", "");
		Результат.Вставить("НормализованныйКодМаркировки", "");
			
		Если ШтрихкодСоСкобкой Тогда
			ПараметрыТекущегоШтрихкода = Шаблон.Значение.СоСкобкой;
		Иначе 
			ПараметрыТекущегоШтрихкода = Шаблон.Значение.БезСкобки;	
		КонецЕсли; 
		
		Если ДлинаШтрихкода = ПараметрыТекущегоШтрихкода.ДлинаКода Тогда
			ШаблонВыражениеШтрихкода = Шаблон.Значение.ШаблонКода;
		ИначеЕсли ДлинаШтрихкода = ПараметрыТекущегоШтрихкода.ДлинаПолногоКода Тогда
			ШаблонВыражениеШтрихкода = Шаблон.Значение.ШаблонКодаПолный;
		Иначе
			Продолжить;
		КонецЕсли;
		             
		Для Каждого ЧастьШаблона Из СтрРазделить(ШаблонВыражениеШтрихкода, "+", Ложь) Цикл 
			
			ТекущийРазделитель = ПараметрыТекущегоШтрихкода.СтруктураКода[ЧастьШаблона].Разделитель;
			ДлинаЧасти = ПараметрыТекущегоШтрихкода.СтруктураКода[ЧастьШаблона].Длина;
			
			Если ЗначениеЗаполнено(ТекущийРазделитель) И Не СтрНачинаетсяС(ОбрабатываемыйШтрихкод, ТекущийРазделитель) Тогда
				Прервать;				
			КонецЕсли;
			
			ЧастьШтрихкода = Сред(ОбрабатываемыйШтрихкод, СтрДлина(ТекущийРазделитель) + 1, ДлинаЧасти); 
			
			Если СтрДлина(ЧастьШтрихкода) <> ДлинаЧасти Или
				Не SUI_ШтрихкодыУпаковокКлиентСервер.ШтрихкодСоответствуетАлфавиту(ЧастьШтрихкода, 
					ПараметрыТекущегоШтрихкода.СтруктураКода[ЧастьШаблона].Алфавит) Тогда
				Прервать;
			КонецЕсли;
			
			Результат.НормализованныйКодМаркировки = Результат.НормализованныйКодМаркировки + Шаблон.Значение.СоСкобкой.СтруктураКода[ЧастьШаблона].Разделитель + ЧастьШтрихкода;
			Результат.КодМаркировки = Результат.КодМаркировки + Шаблон.Значение.БезСкобки.СтруктураКода[ЧастьШаблона].Разделитель + ЧастьШтрихкода;
				
			ОбрабатываемыйШтрихкод = Прав(ОбрабатываемыйШтрихкод, СтрДлина(ОбрабатываемыйШтрихкод) - СтрДлина(ЧастьШтрихкода) - СтрДлина(ТекущийРазделитель));
			
		КонецЦикла; 
		
		Если ЗначениеЗаполнено(ОбрабатываемыйШтрихкод) Тогда
			Результат = Новый Структура();
			Продолжить;			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Результат) Тогда   
			
			Результат.Вставить("ТипШтрихкода", Шаблон.Значение.ТипШтрихкода);
			Результат.Вставить("ВидУпаковки", Шаблон.Значение.ВидУпаковки);
			
			Если ШаблонВыражениеШтрихкода = Шаблон.Значение.ШаблонКодаПолный Тогда
				Результат.НормализованныйКодМаркировки = Лев(Результат.НормализованныйКодМаркировки, Шаблон.Значение.СоСкобкой.ДлинаКода);
				Результат.КодМаркировки = Лев(Результат.КодМаркировки, Шаблон.Значение.БезСкобки.ДлинаКода);
			КонецЕсли;
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не Результат.Свойство("КодМаркировки") Или Не ЗначениеЗаполнено(Результат.КодМаркировки) Или 
		Не Результат.Свойство("НормализованныйКодМаркировки") Или Не ЗначениеЗаполнено(Результат.НормализованныйКодМаркировки) Тогда
		Результат = Неопределено;	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СоздатьШтрихкодУпаковки(Алгоритм, Знач ШтрихкодУпаковки, Номенклатура, Характеристика, 
	Серия, Упаковка, ЗначениеШтрихкода, SSCC) Экспорт
	
	Если ЗначениеЗаполнено(Алгоритм) Тогда
		
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("id_marking_code","");
		СтруктураВозврата.Вставить("id_SSCC","");
		Попытка
			УстановитьБезопасныйРежим(Истина);
			Выполнить(Алгоритм);
		Исключение
			SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(SUI_ШтрихкодыУпаковокКлиентСервер.ИмяСобытия(), , 
				Метаданные.ОбщиеМодули.SUI_ШтрихкодыУпаковок, Алгоритм, ИнформацияОбОшибке());
			ВызватьИсключение СтрШаблон(НСтр("ru = 'При выполнении алгоритма ""Создания штрихкода упаковки"" возникла исключительная ошибка:
			|%1.
			|Проверьте алгоритм создания штрихкода упаковки в настройках подсистемы Simple.'"), 
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
		Возврат СтруктураВозврата;
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
