
#Область ПрограммныйИнтерфейс

// Нормализовать значение штрихкода.
// 
// Параметры:
//  Алгоритм - Строка - Алгоритм нормализации значения штрихкода
//  ЗначениеШтрихкода - Строка - Значение штрихкода к нормализации
// 
// Возвращаемое значение:
//  Строка - Нормализованное значение штрихкода
Функция НормализоватьЗначениеШтрихкода(Знач Алгоритм, ЗначениеШтрихкода) Экспорт
	
	НормализованноеЗначениеШтрихкода = "";
	
	Если ПустаяСтрока(Алгоритм) Тогда

		РезультатРазбора = РазобратьЗначениеШтрихкода(ЗначениеШтрихкода);
		Если ЗначениеЗаполнено(РезультатРазбора) Тогда
			НормализованноеЗначениеШтрихкода = РезультатРазбора.НормализованныйКодМаркировки;
		КонецЕсли;
		
	Иначе
		
		ПараметрыМетода = Новый Массив();
		ПараметрыМетода.Добавить(ЗначениеШтрихкода);
		
		ПараметрыМетода = Обработки.SUI_РедакторКода.ВыполнитьКодЧерезМетодКонфигурации(
			"SUI_ШтрихкодыУпаковок.НормализоватьШтрихкодУпаковкиПоАлгоритму", Алгоритм, ПараметрыМетода, Истина);
		
		НормализованноеЗначениеШтрихкода = ПараметрыМетода[ПараметрыМетода.ВГраница()];
		
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ОписаниеТипаСтрока(200).ПривестиЗначение(НормализованноеЗначениеШтрихкода);
	
КонецФункции

#КонецОбласти

//@skip-check method-too-many-params
#Область СлужебныйПрограммныйИнтерфейс

Процедура НормализоватьШтрихкодУпаковкиПоАлгоритму(Алгоритм, ЗначениеШтрихкода) Экспорт
	
	Попытка
		УстановитьБезопасныйРежим(Истина);
		Выполнить(Алгоритм);
	Исключение
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(SUI_ШтрихкодыУпаковокКлиентСервер.ИмяСобытия(), , 
			Метаданные.ОбщиеМодули.SUI_ШтрихкодыУпаковок, Алгоритм, ИнформацияОбОшибке());
		ВызватьИсключение СтрШаблон(
		НСтр("ru = 'При выполнении алгоритма ""Нормализация значения штрихкода упаковки"" возникла ошибка:
		|%1.
		|Проверьте алгоритм ""Нормализация значения штрихкода упаковки"" в настройках подсистемы %2.'"), 
		ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()), SUI_SimpleКлиентСервер.Представление());
	КонецПопытки;
	
КонецПроцедуры

Функция РазобратьЗначениеШтрихкода(Штрихкод) Экспорт
	
	Результат = Новый Структура();
	
	ДлинаШтрихкода = СтрДлина(Штрихкод);
	
	ШтрихкодСоСкобкой = СтрНачинаетсяС(Штрихкод, "(");
	
	Шаблоны = SUI_ШтрихкодыУпаковокПовтИсп.ПолучитьШаблоныКодовМаркировки();
	
	Для Каждого Шаблон Из Шаблоны Цикл 
		
		ОбрабатываемыйШтрихкод = Штрихкод;
		
		Результат.Вставить("КодМаркировки", "");
		Результат.Вставить("НормализованныйКодМаркировки", "");
			
		Если ШтрихкодСоСкобкой Тогда
			ПараметрыТекущегоШтрихкода = Шаблон.Значение.СоСкобкой;
		Иначе 
			ПараметрыТекущегоШтрихкода = Шаблон.Значение.БезСкобки;	
		КонецЕсли; 
		
		Если ДлинаШтрихкода = ПараметрыТекущегоШтрихкода.ДлинаКода Тогда
			ШаблонВыражениеШтрихкода = Шаблон.Значение.ШаблонКода;
		ИначеЕсли ДлинаШтрихкода = ПараметрыТекущегоШтрихкода.ДлинаПолногоКода Тогда
			ШаблонВыражениеШтрихкода = Шаблон.Значение.ШаблонКодаПолный;
		Иначе
			Продолжить;
		КонецЕсли;
		             
		Для Каждого ЧастьШаблона Из СтрРазделить(ШаблонВыражениеШтрихкода, "+", Ложь) Цикл 
			
			ТекущийРазделитель = ПараметрыТекущегоШтрихкода.СтруктураКода[ЧастьШаблона].Разделитель;
			ДлинаЧасти = ПараметрыТекущегоШтрихкода.СтруктураКода[ЧастьШаблона].Длина;
			
			Если ЗначениеЗаполнено(ТекущийРазделитель) И Не СтрНачинаетсяС(ОбрабатываемыйШтрихкод, ТекущийРазделитель) Тогда
				Прервать;				
			КонецЕсли;
			
			ЧастьШтрихкода = Сред(ОбрабатываемыйШтрихкод, СтрДлина(ТекущийРазделитель) + 1, ДлинаЧасти); 
			
			Если СтрДлина(ЧастьШтрихкода) <> ДлинаЧасти Или
				Не SUI_ШтрихкодыУпаковокКлиентСервер.ШтрихкодСоответствуетАлфавиту(ЧастьШтрихкода, 
					ПараметрыТекущегоШтрихкода.СтруктураКода[ЧастьШаблона].Алфавит) Тогда
				Прервать;
			КонецЕсли;
			
			Результат.НормализованныйКодМаркировки = Результат.НормализованныйКодМаркировки + Шаблон.Значение.СоСкобкой.СтруктураКода[ЧастьШаблона].Разделитель + ЧастьШтрихкода;
			Результат.КодМаркировки = Результат.КодМаркировки + Шаблон.Значение.БезСкобки.СтруктураКода[ЧастьШаблона].Разделитель + ЧастьШтрихкода;
				
			ОбрабатываемыйШтрихкод = Прав(ОбрабатываемыйШтрихкод, СтрДлина(ОбрабатываемыйШтрихкод) - СтрДлина(ЧастьШтрихкода) - СтрДлина(ТекущийРазделитель));
			
		КонецЦикла; 
		
		Если ЗначениеЗаполнено(ОбрабатываемыйШтрихкод) Тогда
			Результат = Новый Структура();
			Продолжить;			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Результат) Тогда   
			
			Результат.Вставить("ТипШтрихкода", Шаблон.Значение.ТипШтрихкода);
			Результат.Вставить("ВидУпаковки", Шаблон.Значение.ВидУпаковки);
			
			Если ШаблонВыражениеШтрихкода = Шаблон.Значение.ШаблонКодаПолный Тогда
				Результат.НормализованныйКодМаркировки = Лев(Результат.НормализованныйКодМаркировки, Шаблон.Значение.СоСкобкой.ДлинаКода);
				Результат.КодМаркировки = Лев(Результат.КодМаркировки, Шаблон.Значение.БезСкобки.ДлинаКода);
			КонецЕсли;
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не Результат.Свойство("КодМаркировки") Или Не ЗначениеЗаполнено(Результат.КодМаркировки) Или 
		Не Результат.Свойство("НормализованныйКодМаркировки") Или Не ЗначениеЗаполнено(Результат.НормализованныйКодМаркировки) Тогда
		Результат = Неопределено;	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура СоздатьШтрихкодУпаковки(Алгоритм, ЗначениеШтрихкода, ЗначениеШтрихкодаТранспортнойУпаковки, 
	Номенклатура, Характеристика, Серия, Упаковка, Ячейка, ШтрихкодУпаковки, ШтрихкодТранспортнойУпаковки) Экспорт
	
	Если ЗначениеЗаполнено(Алгоритм) Тогда
		
		Попытка
			УстановитьБезопасныйРежим(Истина);
			Выполнить(Алгоритм);
		Исключение
			SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(SUI_ШтрихкодыУпаковокКлиентСервер.ИмяСобытия(), , 
				Метаданные.ОбщиеМодули.SUI_ШтрихкодыУпаковок, Алгоритм, ИнформацияОбОшибке());
			ВызватьИсключение СтрШаблон(
			НСтр("ru = 'При выполнении алгоритма ""Создание штрихкода упаковки"" возникла ошибка:
			|%1.
			|Проверьте алгоритм ""Создание штрихкода упаковки"" в настройках подсистемы %2.'"), 
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()), SUI_SimpleКлиентСервер.Представление());
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
