
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если Отказ Или ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ДатаОбновленияЗаписи = ТекущаяДатаСеанса();
	ПолноеИмяМетаданных = Метаданные().ПолноеИмя();
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		// Проверить SID
		SUI_ОбщегоНазначенияКлиентСервер.Проверить(СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(Запись.sid),
			СтрШаблон(НСтр("ru = 'Служебный идентификатор строки (%1) не является идентификатором'"), Запись.sid),
			ПолноеИмяМетаданных);
			
		// Проверить SID документа
		SUI_ОбщегоНазначенияКлиентСервер.Проверить(
			СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(Запись.sid_doc),
			СтрШаблон(НСтр("ru = 'Служебный идентификатор документа (%1) не является идентификатором'"), Запись.sid_doc),
			ПолноеИмяМетаданных);
			
		// Проверить ID номенклатуры
		SUI_ОбщегоНазначенияКлиентСервер.Проверить(
			SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(Запись.id_good),
			СтрШаблон(НСтр("ru = 'Идентификатор номенклатуры (%1) не является идентификатором Simple'"), Запись.id_good),
			ПолноеИмяМетаданных);
			
		// Проверить Тип таблицы
		SUI_ОбщегоНазначенияКлиентСервер.Проверить(
			(Запись.ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары Или
			Запись.ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор Или
			Запись.ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение),
			СтрШаблон(НСтр("ru = 'Не верный тип таблицы (%1)'"), Запись.id_good),
			ПолноеИмяМетаданных);
		
		// Проверить ID характеристики
		Если Не SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(Запись.id_properties) Тогда
			Запись.id_properties = "";
		КонецЕсли;
		
		// Проверить ID серии
		Если Не SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(Запись.id_series) Тогда
			Запись.id_series = "";
		КонецЕсли;
		
		// Проверить ID ячейки
		Если Не SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(Запись.id_cell) Тогда
			Запись.id_cell = "";
		КонецЕсли;
		
		// Проверить ID упаковки
		Если Не SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(Запись.id_unit) Тогда
			Запись.id_unit = "";
		КонецЕсли;
		
		// Проверить ID виды цены
		Если Не SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(Запись.id_price) Тогда
			Запись.id_price = "";
		КонецЕсли;

		// Проверить значение Ввод серий
		Если Запись.use_series > 1 Тогда
			Запись.use_series = 1;
		КонецЕсли;
		
		// Обновить значение Дата обновления
		Если Не ДополнительныеСвойства.Свойство("НеОбновлятьМеткуВремени") Тогда
			Запись.ДатаОбновления = ДатаОбновленияЗаписи;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
