
#Область ПрограммныйИнтерфейс

Функция ЗаписатьВТаблицы(ПараметрыОперации, ИдентификаторФормы = Неопределено) Экспорт

	ПараметрыВыполненияПроцедуры = SUI_ДлительныеОперацииПереопределяемый.ПараметрыВыполненияПроцедуры(ИдентификаторФормы);
	Возврат SUI_ДлительныеОперацииПереопределяемый.ВыполнитьПроцедуру(ПараметрыВыполненияПроцедуры, 
		"SUI_ИнтеграцияВКонфигурацию.ЗаписатьВТаблицы", ПараметрыОперации);
	
КонецФункции

Функция ОчиститьТаблицы(ПараметрыОперации, ИдентификаторФормы = Неопределено) Экспорт
	
	ПараметрыВыполненияПроцедуры = SUI_ДлительныеОперацииПереопределяемый.ПараметрыВыполненияПроцедуры(ИдентификаторФормы);
	Возврат SUI_ДлительныеОперацииПереопределяемый.ВыполнитьПроцедуру(ПараметрыВыполненияПроцедуры, 
		"SUI_ИнтеграцияВКонфигурацию.ОчиститьТаблицы", ПараметрыОперации);
	
КонецФункции

#Область ИдентификаторыSimple

// Получить идентификатор Simple по ссылке.
// 
// Параметры:
//  Ссылка - ЛюбаяСсылка - см. SUI_ИнтеграцияВКонфигурацию.ИдентификаторSimpleПоСсылке
// 
// Возвращаемое значение:
//  Неопределено, Строка - см. SUI_ИнтеграцияВКонфигурацию.ИдентификаторSimpleПоСсылке
Функция ИдентификаторSimpleПоСсылке(Ссылка) Экспорт
	Возврат SUI_ИнтеграцияВКонфигурацию.ИдентификаторSimpleПоСсылке(Ссылка);
КонецФункции

// Получить ссылку объекта по идентификатору Simple.
// 
// Параметры:
//  Идентификатор - Строка - см. SUI_ИнтеграцияВКонфигурацию.СсылкаПоИдентификаторуSimple
// 
// Возвращаемое значение:
//  Неопределено, ЛюбаяСсылка - см. SUI_ИнтеграцияВКонфигурацию.СсылкаПоИдентификаторуSimple
Функция СсылкаПоИдентификаторуSimple(Идентификатор) Экспорт
	Возврат SUI_ИнтеграцияВКонфигурацию.СсылкаПоИдентификаторуSimple(Идентификатор);
КонецФункции

#КонецОбласти

#Область ВариантыОбмена

Функция ИспользуетсяВариантОбменаОнлайн() Экспорт
	Возврат ПолучитьФункциональнуюОпцию("SUI_ОнлайнОбмен");	
КонецФункции

Функция ИспользуетсяВариантОбменаОфлайн() Экспорт
	Возврат ПолучитьФункциональнуюОпцию("SUI_ОфлайнОбмен");	
КонецФункции

Функция ПолучитьТекущийВариантОбмена() Экспорт
	Возврат Константы.SUI_ИспользуемыйВариантОбмена.Получить();	
КонецФункции

#КонецОбласти

#КонецОбласти
