
#Область ОписаниеПеременных

&НаКлиенте
Перем ОбновитьИнтерфейс;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьИДоступность();
	
	// Картинка QR код приложения
	ДанныеQRКода = SUI_ГенерацияШтрихкода.ДанныеQRКода(SUI_SimpleКлиентСервер.АдресAPKМобильногоПриложения(), 0, 130);
	КартинкаQRКодПриложения = ПоместитьВоВременноеХранилище(ДанныеQRКода, УникальныйИдентификатор);
	
	ИспользоватьРедакторJSON = Обработки.SUI_РедакторJSON.ПолучитьПризнакИспользованияРедактораJSON();
	ИспользоватьРедакторКодаBSL = Обработки.SUI_РедакторКода.ПолучитьПризнакИспользованияРедактораКодаBSL();
	ПроверкаОбновленийПриСтарте = Обработки.SUI_ОбновлениеSimple.ПолучитьПризнакПроверкиОбновленийПриСтарте();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(КартинкаQRКодПриложения) Тогда
		УдалитьИзВременногоХранилища(КартинкаQRКодПриложения);
	КонецЕсли;
	
	ОбновитьИнтерфейсПрограммы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаборКонстантSUI_ИспользуемыйВариантОбменаПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура SUI_АдресПубликацииБазыПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура SUI_АдресПубликацииБазыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПодключитьОбработчикОжидания("АдресПубликацииБазыНачалоВыбораПродолжение", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура SUI_ЗамещатьВПотокеШтрихкодовПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура SUI_РегистрироватьИзмененияПослеЗагрузкиДокументаИзМУПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура SUI_ЛогированиеHTTPЗапросовПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура SUI_ИспользоватьЗапросыАвторизацииМУПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура SUI_ХранениеЛоговHTTPЗапросовВДняхПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура SUI_УстановкаПредварительныхВерсийПриИзменении(Элемент)
	
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь);
	
	SUI_ПараметрыПриложения.Вставить("УстановкаПредварительныхВерсий", 
		НаборКонстант["SUI_УстановкаПредварительныхВерсий"]);
	
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаПриложенияНажатие(Элемент)
	ПерейтиПоНавигационнойСсылке(SUI_SimpleКлиентСервер.АдресAPKМобильногоПриложения());
КонецПроцедуры

&НаКлиенте
Процедура SUI_КоличествоЗаданийВПотокеОчередиЗаданийПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура SUI_ТаймаутПроверкиСвязиПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура SUI_ТаймаутВыгрузкиДанныхПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура SUI_ПроверятьСвязьСПользователямиПриОткрытииРабочегоМестаПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура SUI_СоздаватьШтрихкодыИзТСДПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура SUI_НастройкаДокументаПеремещенияЗапасовПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура SUI_ХранениеСообщенийМобильныхУстройствВДняхПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура SUI_ХранениеОбработанныхДокументовОбменаПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура SUI_ОткрыватьВыгрузкуДокументовОфлайнПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура SUI_ИспользоватьДополнительныеРеквизитыТаблицПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьРедакторJSONПриИзменении(Элемент)
	
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьРедакторКодаBSLПриИзменении(Элемент)
	
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаОбновленийПриСтартеПриИзменении(Элемент)
	
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь);
	
	SUI_ПараметрыПриложения.Вставить("ПроверкаОбновленийПриСтарте", ПроверкаОбновленийПриСтарте);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьНастройкиПодсистемы(Команда)
	ОткрытьФорму("Обработка.SUI_НастройкаМетаданных.Форма", , ЭтотОбъект, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРабочееМестоОператораОбмена(Команда)
	
	ОткрытьФорму("Обработка.SUI_РабочееМестоОператораОбмена.Форма", , ЭтотОбъект, УникальныйИдентификатор);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникМобильныеУстройства(Команда)
	ОткрытьФорму("ПланОбмена.SUI_МобильныеУстройства.ФормаСписка", , ЭтотОбъект, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникНастройкиДокументов(Команда)
	ОткрытьФорму("Справочник.SUI_НастройкиДокументов.ФормаСписка", , ЭтотОбъект, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЦентрОбновлений(Команда)
	ОткрытьФорму("Обработка.SUI_ОбновлениеSimple.Форма", , ЭтотОбъект, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьQRКодПодключенияМУ(Команда)
	ОткрытьФорму("ОбщаяФорма.SUI_QRКодДляПодключенияМобильногоПриложения", , ЭтотОбъект, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаСвязиПубликацииИБ(Команда)
	ОчиститьСообщения();
	SUI_SimpleКлиент.ВыполнитьПроверкуСвязиПубликацииИБ(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРегламентныеЗадания(Команда)
	SUI_РегламентныеЗаданияКлиент.ОткрытьРегламентныеЗадания(, ЭтотОбъект, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗапросыАвторизацииМУ(Команда)
	ОткрытьФорму("РегистрСведений.SUI_ЗапросыАвторизацииМобильныхУстройств.ФормаСписка", , 
		ЭтотОбъект, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗаписиЛогированияHTTPЗапросов(Команда)
	ОткрытьФорму("РегистрСведений.SUI_ЛогированиеHTTPЗапросов.ФормаСписка", , 
		ЭтотОбъект, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАлгоритмПолученияШтрихкодаДокумента(Команда)
	
	ПредопределенныйКод = "Штрихкод = ШтрихкодированиеПечатныхФорм.ЧисловойКодПоСсылке(ДокументСсылка);";
	ПараметрыОткрытияРедактора = SUI_РедакторКодаКлиент.ПараметрыОткрытия(
		НаборКонстант.SUI_АлгоритмПолученияШтрихкодаДокумента, ПредопределенныйКод);
	
	ПараметрыОткрытияРедактора.ЗапретРедактированияПриОткрытии = Не Модифицированность;
	ПараметрыОткрытияРедактора.Заголовок = НСтр("ru = 'Получение штрихкода документа'");
	ПараметрыОткрытияРедактора.Описание = СтроковыеФункцииКлиент.ФорматированнаяСтрока(
		НСтр("ru = 'Алгоритм получения штрихкода документа.
		|<span style=""font:ВажнаяНадписьШрифт"">
		|Результат выполнения алгоритма необходимо присвоить переменной <b>Штрихкод</b>.'"));
	
	// Описание переменных: ДокументСсылка
	SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(
		ПараметрыОткрытияРедактора.ПользовательскиеОбъекты, 
		"ДокументСсылка", 
		НСтр("ru = 'Ссылка документа'"),
		"ДокументСсылка");
	
	// Описание переменных: ДокументСсылка
	SUI_РедакторКодаКлиентСервер.ДобавитьПользовательскийОбъект(
		ПараметрыОткрытияРедактора.ПользовательскиеОбъекты, 
		"Штрихкод", 
		НСтр("ru = 'Результат выполнения алгоритма'"),
		Тип("Строка"));
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОткрытьАлгоритмПолученияШтрихкодаДокументаЗавершение", 
		ЭтотОбъект);
	SUI_РедакторКодаКлиент.ОткрытьРедактор(ПараметрыОткрытияРедактора, ОповещениеОЗавершении, ЭтотОбъект, , 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкуРазмераПакетаДанных(Команда)
	ОткрытьФорму("ОбщаяФорма.SUI_РазмерПакетаДанных", , ЭтотОбъект, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСрокХраненияРезультатовОбработкиВходящихСообщенийОбмена(Команда)
	ОткрытьФорму("ОбщаяФорма.SUI_СрокХраненияРезультатовОбработкиВходящихСообщенийОбмена", , ЭтотОбъект, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПараметрыЛогированияHTTPСервиса(Команда)
	
	ОткрытьФорму("РегистрСведений.SUI_ПараметрыЛогированияHTTPСервиса.ФормаСписка", , ЭтотОбъект, 
		УникальныйИдентификатор, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизита(Элемент, ОбновлятьИнтерфейс = Истина)
	
	ПриИзмененииРеквизитаСервер(Элемент.Имя);
	ОбновитьПовторноИспользуемыеЗначения();
	
	Если ОбновлятьИнтерфейс Тогда
		ОбновитьИнтерфейс = Истина;
		ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 2, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнтерфейсПрограммы()
	
	Если ОбновитьИнтерфейс = Истина Тогда
		ОбновитьИнтерфейс = Ложь;
		SUI_ОбщегоНазначенияКлиент.ОбновитьИнтерфейсПрограммы();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииРеквизитаСервер(ИмяЭлемента)
	
	РеквизитПутьКДанным = Элементы[ИмяЭлемента].ПутьКДанным;
	СохранитьЗначениеРеквизита(РеквизитПутьКДанным);
	УстановитьВидимостьИДоступность();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьЗначениеРеквизита(РеквизитПутьКДанным)
	
	Если РеквизитПутьКДанным = "ИспользоватьРедакторJSON" Тогда
		Обработки.SUI_РедакторJSON.СохранитьПризнакИспользованияРедактораJSON(ЭтотОбъект[РеквизитПутьКДанным]);
	ИначеЕсли РеквизитПутьКДанным = "ИспользоватьРедакторКодаBSL" Тогда
		Обработки.SUI_РедакторКода.СохранитьПризнакИспользованияРедактораКодаBSL(ЭтотОбъект[РеквизитПутьКДанным]);
	ИначеЕсли РеквизитПутьКДанным = "ПроверкаОбновленийПриСтарте" Тогда
		Обработки.SUI_ОбновлениеSimple.УстановитьПризнакПроверкиОбновленийПриСтарте(ЭтотОбъект[РеквизитПутьКДанным]);
	ИначеЕсли Не ПустаяСтрока(РеквизитПутьКДанным) Тогда
		
		ЧастиИмени = СтрРазделить(РеквизитПутьКДанным, ".");
		
		Если ЧастиИмени.Количество() = 2 Тогда
			КонстантаИмя = ЧастиИмени[1];
			КонстантаЗначение = НаборКонстант[КонстантаИмя];
		ИначеЕсли ЧастиИмени.Количество() = 1 И НРег(Лев(РеквизитПутьКДанным, 9)) = НРег("Константа") Тогда
			КонстантаИмя = Сред(РеквизитПутьКДанным, 10);
			КонстантаЗначение = ЭтотОбъект[РеквизитПутьКДанным];
		Иначе
			Возврат;
		КонецЕсли;
		
		Если Константы[КонстантаИмя].Получить() <> КонстантаЗначение Тогда
			Константы[КонстантаИмя].Установить(КонстантаЗначение);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьИДоступность(РеквизитПутьКДанным = "")
	
	Элементы.ГруппаНастройки.Видимость = ЗначениеЗаполнено(НаборКонстант.SUI_ИспользуемыйВариантОбмена);
	
	Элементы.ПроверкаСвязиПубликацииИБ.Доступность 	= ЗначениеЗаполнено(НаборКонстант.SUI_АдресПубликацииБазы);
	Элементы.ГруппаЛогированиеПараметры.Доступность = НаборКонстант.SUI_ЛогированиеHTTPЗапросов;
	
	// Проверка варианта обмена на Онлайн
	Если НаборКонстант.SUI_ИспользуемыйВариантОбмена = Перечисления.SUI_ВариантОбмена.Онлайн Тогда
		Элементы.ГруппаНастройкиОнлайнОбмена.Видимость 	= Истина;  
		Элементы.ГруппаМобильныеКлиентыЗапросыАвторизации.Видимость 	= Истина;
		Элементы.ГруппаНастройкаПеремещенияЗапасов.Видимость 	= Истина;
		Элементы.ПоказатьQRКодПодключенияМУ.Видимость 	= Истина; 
		Элементы.НастройкиОбменаОфлайн.Видимость 	= Ложь;
	Иначе
		Элементы.ГруппаНастройкиОнлайнОбмена.Видимость 	= Ложь; 
		Элементы.ГруппаМобильныеКлиентыЗапросыАвторизации.Видимость 	= Ложь;
		Элементы.ГруппаНастройкаПеремещенияЗапасов.Видимость 	= Ложь;
		Элементы.ПоказатьQRКодПодключенияМУ.Видимость 	= Ложь;
		Элементы.НастройкиОбменаОфлайн.Видимость 	= Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура АдресПубликацииБазыНачалоВыбораПродолжение()
	
	Если ОбщегоНазначенияКлиент.КлиентПодключенЧерезВебСервер() Тогда
		АдресПубликацииБазыНачалоВыбораПродолжениеНаСервере("SUI_АдресПубликацииБазы", СтрокаСоединенияИнформационнойБазы());
		Подключаемый_ПриИзмененииРеквизита(Элементы["SUI_АдресПубликацииБазы"], Ложь);
	Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'Не удалось автоматически заполнить поле, т.к. клиентское приложение не подключено через веб-сервер.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура АдресПубликацииБазыНачалоВыбораПродолжениеНаСервере(ИмяРеквизита, СтрокаСоединения)
	
	ПараметрыСоединения = СтроковыеФункцииКлиентСервер.ПараметрыИзСтроки(СтрокаСоединения);
	Если ПараметрыСоединения.Свойство("WS") Тогда
		НаборКонстант[ИмяРеквизита] = ПараметрыСоединения.WS;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАлгоритмПолученияШтрихкодаДокументаЗавершение(Алгоритм, Контекст) Экспорт
	
	Если Алгоритм = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НаборКонстант.SUI_АлгоритмПолученияШтрихкодаДокумента = Алгоритм;
	
	СохранитьЗначениеРеквизита("НаборКонстант.SUI_АлгоритмПолученияШтрихкодаДокумента");
	
КонецПроцедуры

#КонецОбласти
