
#Область ПрограммныйИнтерфейс

Функция ПолучитьСообщениеДляМобильногоУстройства(МобильноеУстройство, ВПривилегированномРежиме = Ложь) Экспорт
	
	// Оценка производительности
	ОценкаПроизводительности_НачалоЗамера = SUI_ОценкаПроизводительности.НачатьЗамерВремени();
	ОценкаПроизводительности_ВесЗамера = 0;
	ОценкаПроизводительности_КлючеваяОперация = "ПолучитьСообщениеДляМобильногоУстройства";
	
	Если ВПривилегированномРежиме И Не ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	ДанныеВозврата = Новый Структура();
	ДанныеВозврата.Вставить("Данные", SUI_ПакетыДанныхКлиентСервер.ПустойПакет(SUI_ПакетыДанныхКлиентСервер.ФорматПакета_НетДанных()));
	ДанныеВозврата.Вставить("ОстатокПакетов", 0);
	
	ДанныеСообщения = РегистрыСведений.SUI_СообщенияОбменаДанными.ПолучитьПервоеСообщениеПоПолучателю(МобильноеУстройство);
	
	Если ДанныеСообщения <> Неопределено Тогда
		
		ОценкаПроизводительности_ВесЗамера = 1;
		
		НачатьТранзакцию();
		
		Попытка
			
			// Собрать сообщение пакет JSON, если вид данных сообщения = Значение
			Если ДанныеСообщения.ВидДанных = Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.Значение Тогда
				
				ПараметрыСборки = SUI_ПакетыДанных.ПараметрыСборкиСообщенийПакетаДанныхИзКоллекции(ДанныеСообщения.Данные);
				ЗаполнитьЗначенияСвойств(ПараметрыСборки, ДанныеСообщения);
				ПараметрыСборки.ВидДанных = Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.JSON;
				
				// Собрать в JSON
				Пакеты = SUI_ПакетыДанных.СобратьСообщениеПакетаДанныхИзКоллекции(ПараметрыСборки);
				
				ОбщегоНазначенияКлиентСервер.Проверить(Пакеты.Количество() > 0,
					НСтр("ru = 'Не удалось собрать пакет данных'"));
				
				ДанныеВозврата.Данные = Пакеты[0];
				
				// Записать остатки пакетов
				Для индекс = 1 По Пакеты.ВГраница() Цикл
					РегистрыСведений.SUI_СообщенияОбменаДанными.Создать(ПараметрыСборки.Отправитель, 
						ПараметрыСборки.Получатель, Пакеты[индекс], ПараметрыСборки.Приоритет, ПараметрыСборки.ВидДанных,
						Новый Структура("МеткаВремени, ДатаЗаписи, Сворачивать", ДанныеСообщения.МеткаВремени+1, ДанныеСообщения.ДатаЗаписи, Ложь));
				КонецЦикла;
				
			Иначе
				ДанныеВозврата.Данные = ДанныеСообщения.Данные;
			КонецЕсли;
			
			// Удалить полученное сообщение
			РегистрыСведений.SUI_СообщенияОбменаДанными.Удалить(ДанныеСообщения.ID, ДанныеСообщения.Отправитель, ДанныеСообщения.Получатель);
			
			// Заполнить остаток сообщений
			ДанныеВозврата.ОстатокПакетов = РегистрыСведений.SUI_СообщенияОбменаДанными
				.ПолучитьКоличествоСообщенийПоМобильнымУстройствам(, ДанныеСообщения.Получатель);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			SUI_ОценкаПроизводительности.ЗакончитьЗамерВремени(
				ОценкаПроизводительности_КлючеваяОперация, 
				ОценкаПроизводительности_НачалоЗамера, 
				ОценкаПроизводительности_ВесЗамера, 
				ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()), 
				Истина);
			ВызватьИсключение;
		КонецПопытки;
		
	КонецЕсли;
	
	// Оценка производительности
	Если ОценкаПроизводительности_ВесЗамера > 0 Тогда
		SUI_ОценкаПроизводительности.ЗакончитьЗамерВремени(ОценкаПроизводительности_КлючеваяОперация, 
			ОценкаПроизводительности_НачалоЗамера, ОценкаПроизводительности_ВесЗамера);
	КонецЕсли;
	
	Возврат ДанныеВозврата;
	
КонецФункции

// Сжать строку.
// 
// Параметры:
//  Строка - Строка - Строка для сжатия
// 
// Возвращаемое значение:
//  Произвольный - Сжатая строка
Функция СжатьСтроку(Строка) Экспорт
	
	Результат = Неопределено;
	
	Если Не ПустаяСтрока(ОбщегоНазначения.ОписаниеТипаСтрока(0).ПривестиЗначение(Строка)) Тогда
		Результат = XMLСтрока(Новый ХранилищеЗначения(Строка, Новый СжатиеДанных(9)));
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ОписаниеТипаСтрока(0).ПривестиЗначение(Результат);
	
КонецФункции

// Восстановить сжатую строку.
// 
// Параметры:
//  Строка - Строка - Строка сжатая функцией см. SUI_СообщенияОбменаДанными.СжатьСтроку
// 
// Возвращаемое значение:
//  Произвольный - Восстановленая строка
Функция ВосстановитьСжатуюСтроку(Строка) Экспорт
	
	Результат = Неопределено;
	
	Если Не ПустаяСтрока(ОбщегоНазначения.ОписаниеТипаСтрока(0).ПривестиЗначение(Строка)) Тогда
		Результат = XMLЗначение(Тип("ХранилищеЗначения"), Строка).Получить();
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ОписаниеТипаСтрока(0).ПривестиЗначение(Результат);
	
КонецФункции

#Область СообщенияОперации

// Дополнительные параметры сообщения операции.
// 
// Возвращаемое значение:
//  Структура - Дополнительные параметры сообщения операции:
// * ВТранзакции - Булево - Выполнять операцию в транзакции
// * Наименование - Строка - Наименование операции
Функция ДополнительныеПараметрыСообщенияОперации() Экспорт
	
	ДополнительныеПараметры = Новый Структура();
	
	ДополнительныеПараметры.Вставить("ВТранзакции", Ложь);
	ДополнительныеПараметры.Вставить("Наименование", "");
	
	Возврат ДополнительныеПараметры;
	
КонецФункции

// Создать сообщение операции.
// 
// Параметры:
//  Отправитель - ПланОбменаСсылка.SUI_МобильныеУстройства - Отправитель
//  Получатель - ПланОбменаСсылка.SUI_МобильныеУстройства - Получатель
//  ИмяМетода - Строка - Имя метода операции
//  ПараметрыМетода - Массив из Произвольный, Неопределено - Массив параметров метода операции
//  ДополнительныеПараметрыСообщенияОперации - Структура, Неопределено - Дополнительные параметры сообщения операции см. SUI_СообщенияОбменаДанными.ДополнительныеПараметрыСообщенияОперации
// 
// Возвращаемое значение:
//  Неопределено, Строка - Создать сообщение операции
Функция СоздатьСообщениеОперации(Отправитель, Получатель, Знач ИмяМетода, ПараметрыМетода, ДополнительныеПараметрыСообщенияОперации = Неопределено) Экспорт
	
	ИмяМетода = SUI_СтроковыеФункцииКлиентСервер.ПривестиСтрокуКРазрешеннымСимволам(
		ОбщегоНазначения.ОписаниеТипаСтрока(0).ПривестиЗначение(ИмяМетода),
		SUI_СтроковыеФункцииКлиентСервер.АлфавитБуквыЛатинские()
			+ SUI_СтроковыеФункцииКлиентСервер.АлфавитБуквыРусские()
			+ SUI_СтроковыеФункцииКлиентСервер.АлфавитЦифры()
			+ "_.");
	
	// Проверка имени метода на корректность.
	МассивЗначенийИмяМетода = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИмяМетода, ".", Истина, Истина);
	ОбщегоНазначенияКлиентСервер.Проверить(
		МассивЗначенийИмяМетода.Количество() = 2 Или МассивЗначенийИмяМетода.Количество() = 3, 
		НСтр("ru = 'Некорректное значение параметра ИмяМетода (%1)'"),
		"SUI_СообщенияОбменаДанными.СоздатьСообщениеОперации");
	
	ДанныеСообщения = ПодготовитьСообщениеОперации(ИмяМетода, ПараметрыМетода, ДополнительныеПараметрыСообщенияОперации);
	
	ДополнительныеДанныеСообщения = Новый Структура();
	ДополнительныеДанныеСообщения.Вставить("Сворачивать", Ложь);
	
	Возврат РегистрыСведений.SUI_СообщенияОбменаДанными.Создать(Отправитель, Получатель, ДанныеСообщения, , , ДополнительныеДанныеСообщения);
	
КонецФункции

Функция ЭтоСообщениеОперации(Знач СообщениеОперации) Экспорт
	
	ОписаниеТипаСтруктура = Новый ОписаниеТипов("Структура");
	СообщениеОперации = ОписаниеТипаСтруктура.ПривестиЗначение(СообщениеОперации);
	
	Возврат СообщениеОперации.Свойство("Операция")
		И СообщениеОперации.Свойство("Наименование")
		И СообщениеОперации.Свойство("ВТранзакции")
		И СообщениеОперации.Свойство("ЭтоСообщениеОперации")
		И СообщениеОперации.ЭтоСообщениеОперации;
	
КонецФункции

Функция ПредставлениеСодержимогоСообщенияОперации(СообщениеОперации) Экспорт
	
	ПредставлениеСодержимого = Новый Структура();
	ПредставлениеСодержимого.Вставить("Наименование", SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		СообщениеОперации, "Наименование", "", Тип("Строка")));
	ПредставлениеСодержимого.Вставить("ВТранзакции", SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		СообщениеОперации, "ВТранзакции", Ложь, Тип("Булево")));
	
	Операция = ДанныеОперацииИзСообщенияОперации(СообщениеОперации);
	
	ПредставлениеОперации = Новый Структура();
	ПредставлениеОперации.Вставить("ИмяМетода", Операция.ИмяМетода);
	ПредставлениеОперации.Вставить("Параметры", Новый Массив());
	
	Для индекс = 0 По Операция.Параметры.ВГраница() Цикл
		
		ПредставлениеТипаПараметра = "";
		
		ТипПараметра = ТипЗнч(Операция.Параметры[индекс]);
		
		Если ТипПараметра = Тип("Неопределено") Тогда
			ПредставлениеТипаПараметра = "Неопределено";
		Иначе
			
			МетаданныеПараметра = Метаданные.НайтипоТипу(ТипПараметра);
			Если МетаданныеПараметра = Неопределено Тогда
				ПредставлениеТипаПараметра = ТипПараметра;
			Иначе
				ПредставлениеТипаПараметра = МетаданныеПараметра.ПолноеИмя();
			КонецЕсли;
			
		КонецЕсли;
		
		ПредставлениеОперации.Параметры.Добавить(СтрШаблон("Параметр%1 (Тип: %2)", индекс+1, ПредставлениеТипаПараметра));
		
	КонецЦикла;
	
	ПредставлениеСодержимого.Вставить("Операция", ПредставлениеОперации);
	
	Возврат ДанныеСообщенияВJSON(ПредставлениеСодержимого);
	
КонецФункции

#КонецОбласти

#Область JSON

Функция ДанныеСообщенияВJSON(ДанныеСообщения) Экспорт
	
	ТипЗначения = ТипЗнч(ДанныеСообщения);
	
	Если ТипЗначения = Тип("Массив") Или ТипЗначения = Тип("ФиксированныйМассив") Или
		ТипЗначения = Тип("Структура") Или ТипЗначения = Тип("ФиксированнаяСтруктура") Или
		ТипЗначения = Тип("Соответствие") Или ТипЗначения = Тип("ФиксированноеСоответствие") Тогда
		
		ЗаписьJSON = Новый ЗаписьJSON();
		ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(, Символы.Таб);
		ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
		ЗаписатьJSON(ЗаписьJSON, ДанныеСообщения, , 
			"ПреобразованиеДанныхJSON", SUI_СообщенияОбменаДанными);
		
		Возврат ЗаписьJSON.Закрыть();
		
	ИначеЕсли ТипЗначения = Тип("Строка") И 
		(СтрНачинаетсяС(ДанныеСообщения, "[") Или СтрНачинаетсяС(ДанныеСообщения, "{")) И 
		(СтрЗаканчиваетсяНа(ДанныеСообщения, "]") Или СтрЗаканчиваетсяНа(ДанныеСообщения, "}")) Тогда
		Возврат ДанныеСообщения;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ДанныеСообщенияИзJSON(Знач ДанныеСообщения) Экспорт
	
	ДанныеСообщения = ОбщегоНазначения.ОписаниеТипаСтрока(0).ПривестиЗначение(ДанныеСообщения);
	
	Если (СтрНачинаетсяС(ДанныеСообщения, "[") Или СтрНачинаетсяС(ДанныеСообщения, "{")) И
		(СтрЗаканчиваетсяНа(ДанныеСообщения, "]") Или СтрЗаканчиваетсяНа(ДанныеСообщения, "}")) Тогда
		
		ЧтениеJSON = Новый ЧтениеJSON();
		ЧтениеJSON.УстановитьСтроку(ДанныеСообщения);
		Возврат ПрочитатьJSON(ЧтениеJSON, Истина, , ФорматДатыJSON.ISO);
	
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриДобавленииРегламентныхЗаданийПодсистемы(РегламентныеЗаданияПодсистемы) Экспорт
	
	// ВыполнитьОбработкуСообщенийОбменаДанными
	РегламентноеЗаданиеПодсистемы = РегламентныеЗаданияПодсистемы.Добавить();
	РегламентноеЗаданиеПодсистемы.Ключ = SUI_СообщенияОбменаДаннымиКлиентСервер.КлючиРегламентныхЗаданий()
		.ВыполнитьОбработкуСообщенийОбменаДанными;
	РегламентноеЗаданиеПодсистемы.Наименование = НСтр("ru = 'Simple: Обработка сообщений обмена'");
	РегламентноеЗаданиеПодсистемы.ИмяМетода = "SUI_СообщенияОбменаДанными.ВыполнитьОбработкуСообщенийОбменаДанными";
	РегламентноеЗаданиеПодсистемы.КоличествоПовторовПриАварийномЗавершении = 1;
	РегламентноеЗаданиеПодсистемы.ИнтервалПовтораПриАварийномЗавершении = 10;
	РегламентноеЗаданиеПодсистемы.Расписание.ПериодПовтораДней = 1;
	РегламентноеЗаданиеПодсистемы.Расписание.ПериодПовтораВТечениеДня = 60;
	
	// ВыполнитьСверткуСообщенийОбменаДанными
	РегламентноеЗаданиеПодсистемы = РегламентныеЗаданияПодсистемы.Добавить();
	РегламентноеЗаданиеПодсистемы.Ключ = SUI_СообщенияОбменаДаннымиКлиентСервер.КлючиРегламентныхЗаданий()
		.ВыполнитьСверткуСообщенийОбменаДанными;
	РегламентноеЗаданиеПодсистемы.Наименование = НСтр("ru = 'Simple: Свертка сообщений обмена'");
	РегламентноеЗаданиеПодсистемы.ИмяМетода = "SUI_СообщенияОбменаДанными.ВыполнитьСверткуСообщенийОбменаДанными";
	РегламентноеЗаданиеПодсистемы.КоличествоПовторовПриАварийномЗавершении = 1;
	РегламентноеЗаданиеПодсистемы.ИнтервалПовтораПриАварийномЗавершении = 10;
	РегламентноеЗаданиеПодсистемы.Расписание.ПериодПовтораДней = 1;
	РегламентноеЗаданиеПодсистемы.Расписание.ПериодПовтораВТечениеДня = 60;
	
КонецПроцедуры

Функция ПреобразованиеДанныхJSON(Свойство, Значение, ДополнительныеПараметры, Отказ) Экспорт
	
	ТипЗначения = ТипЗнч(Значение);
	Если ТипЗначения = Тип("Null") Или ТипЗначения = Тип("Неопределено") Тогда
		Возврат Неопределено;
	ИначеЕсли ТипЗначения <> Тип("Строка") И ТипЗначения <> Тип("Число") И 
		ТипЗначения <> Тип("Булево") И ТипЗначения <> Тип("Дата") И
		ТипЗначения <> Тип("Массив") И ТипЗначения <> Тип("ФиксированныйМассив") И
		ТипЗначения <> Тип("Соответствие") И ТипЗначения <> Тип("ФиксированноеСоответствие") И
		ТипЗначения <> Тип("Структура") И ТипЗначения <> Тип("ФиксированнаяСтруктура") Тогда
		Возврат Строка(Значение);
	КонецЕсли;
	
КонецФункции

Процедура ВыполнитьОбработкуСообщенийОбменаДанными() Экспорт
	
	// Обработать входящие сообщения
	ОбработатьВходящиеСообщения();
	
	// Обработать исходящие сообщения
	СформироватьИсходящиеСообщения();
	
КонецПроцедуры

Процедура ВыполнитьСверткуСообщенийОбменаДанными() Экспорт
	
	// Оценка производительности
	ОценкаПроизводительности_НачалоЗамера = SUI_ОценкаПроизводительности.НачатьЗамерВремени();
	ОценкаПроизводительности_ВесЗамера = 0;
	ОценкаПроизводительности_КлючеваяОперация = "ВыполнитьЗаданиеСформироватьПакетыДанныхСообщений";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СтатистикаСообщенийОбмена.МобильноеУстройство КАК МобильноеУстройство,
		|	СтатистикаСообщенийОбмена.Приоритет КАК Приоритет
		|ИЗ
		|	(ВЫБРАТЬ
		|		СообщенияОбменаДанными.Получатель КАК МобильноеУстройство,
		|		СообщенияОбменаДанными.Приоритет КАК Приоритет,
		|		КОЛИЧЕСТВО(СообщенияОбменаДанными.ID) КАК КоличествоСообщений
		|	ИЗ
		|		РегистрСведений.SUI_СообщенияОбменаДанными КАК СообщенияОбменаДанными
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.SUI_СостоянияМобильныхУстройств КАК СостоянияМобильныхУстройств
		|			ПО СообщенияОбменаДанными.Получатель = СостоянияМобильныхУстройств.МобильноеУстройство
		|	ГДЕ
		|		СообщенияОбменаДанными.Сворачивать
		|		И СообщенияОбменаДанными.ВидДанных = ЗНАЧЕНИЕ(Перечисление.SUI_ВидыДанныхСообщенийОбменаДанными.Значение)
		|		И СообщенияОбменаДанными.Отправитель.ЭтотУзел
		|		И ВЫБОР
		|			КОГДА СостоянияМобильныхУстройств.Состояние ЕСТЬ NULL
		|			ИЛИ СостоянияМобильныхУстройств.Состояние В (&СостоянияМобильныхУстройствДляСвертки)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|	СГРУППИРОВАТЬ ПО
		|		СообщенияОбменаДанными.Получатель,
		|		СообщенияОбменаДанными.Приоритет) КАК СтатистикаСообщенийОбмена
		|ГДЕ
		|	СтатистикаСообщенийОбмена.КоличествоСообщений > 1";
	
	Запрос.УстановитьПараметр("СостоянияМобильныхУстройствДляСвертки", СостоянияМобильныхУстройствДляСвертки());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		// Оценка производительности
		ОценкаПроизводительности_ВесЗамера = Выборка.Количество();
		
		Пока Выборка.Следующий() Цикл
			
			НачатьТранзакцию();
			
			Попытка
				
				Блокировка = Новый БлокировкаДанных();
				ЭлементБлокировки = Блокировка.Добавить("ПланОбмена.SUI_МобильныеУстройства");
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
				ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.МобильноеУстройство);
				Блокировка.Заблокировать();
				
				// Свернуть сообщения
				//@skip-check query-in-loop
				СвернутьСообщенияОбменаДанными(
					Новый Структура("МобильноеУстройство, Приоритет", Выборка.МобильноеУстройство, Выборка.Приоритет), 
					Неопределено);
				
				ЗафиксироватьТранзакцию();
				
			Исключение
				ОтменитьТранзакцию();
				SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(НСтр("ru = 'Свертка сообщений'")), , 
					Метаданные.ОбщиеМодули.SUI_СообщенияОбменаДанными, Выборка.МобильноеУстройство, ИнформацияОбОшибке());
				SUI_ОценкаПроизводительности.ЗакончитьЗамерВремени(
					ОценкаПроизводительности_КлючеваяОперация, 
					ОценкаПроизводительности_НачалоЗамера, 
					ОценкаПроизводительности_ВесЗамера, 
					ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()), 
					Истина);
				ВызватьИсключение;
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Оценка производительности
	Если ОценкаПроизводительности_ВесЗамера > 0 Тогда
		SUI_ОценкаПроизводительности.ЗакончитьЗамерВремени(ОценкаПроизводительности_КлючеваяОперация, 
			ОценкаПроизводительности_НачалоЗамера, ОценкаПроизводительности_ВесЗамера);
	КонецЕсли;
	
КонецПроцедуры

Процедура СвернутьСообщенияОбменаДанными(Параметры, АдресРезультата) Экспорт
	
	МаксимальныйРазмерПакета = SUI_ПакетыДанных.РазмерПакетаДанных();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 2
		|	SUI_СообщенияОбменаДанными.ID КАК ID,
		|	SUI_СообщенияОбменаДанными.Отправитель КАК Отправитель,
		|	SUI_СообщенияОбменаДанными.Получатель КАК Получатель,
		|	SUI_СообщенияОбменаДанными.Данные КАК Данные,
		|	SUI_СообщенияОбменаДанными.ВидДанных КАК ВидДанных,
		|	SUI_СообщенияОбменаДанными.ДатаЗаписи КАК ДатаЗаписи,
		|	SUI_СообщенияОбменаДанными.МеткаВремени КАК МеткаВремени,
		|	SUI_СообщенияОбменаДанными.Приоритет КАК Приоритет,
		|	SUI_СообщенияОбменаДанными.Сворачивать КАК Сворачивать
		|ИЗ
		|	(ВЫБРАТЬ
		|		СообщенияОбменаДанными.Получатель КАК МобильноеУстройство,
		|		СообщенияОбменаДанными.Приоритет КАК Приоритет,
		|		КОЛИЧЕСТВО(СообщенияОбменаДанными.ID) КАК КоличествоСообщений
		|	ИЗ
		|		РегистрСведений.SUI_СообщенияОбменаДанными КАК СообщенияОбменаДанными
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.SUI_СостоянияМобильныхУстройств КАК СостоянияМобильныхУстройств
		|			ПО СообщенияОбменаДанными.Получатель = СостоянияМобильныхУстройств.МобильноеУстройство
		|	ГДЕ
		|		СообщенияОбменаДанными.Сворачивать
		|		И СообщенияОбменаДанными.ВидДанных = ЗНАЧЕНИЕ(Перечисление.SUI_ВидыДанныхСообщенийОбменаДанными.Значение)
		|		И СообщенияОбменаДанными.Отправитель.ЭтотУзел
		|		И СообщенияОбменаДанными.Получатель = &МобильноеУстройство
		|		И СообщенияОбменаДанными.Приоритет = &Приоритет
		|		И ВЫБОР
		|			КОГДА СостоянияМобильныхУстройств.Состояние ЕСТЬ NULL
		|			ИЛИ СостоянияМобильныхУстройств.Состояние В (&СостоянияМобильныхУстройствДляСвертки)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|	СГРУППИРОВАТЬ ПО
		|		СообщенияОбменаДанными.Получатель,
		|		СообщенияОбменаДанными.Приоритет) КАК СтатистикаСообщенийОбмена
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.SUI_СообщенияОбменаДанными КАК SUI_СообщенияОбменаДанными
		|		ПО (СтатистикаСообщенийОбмена.КоличествоСообщений > 1
		|		И SUI_СообщенияОбменаДанными.Отправитель.ЭтотУзел
		|		И СтатистикаСообщенийОбмена.МобильноеУстройство = SUI_СообщенияОбменаДанными.Получатель
		|		И СтатистикаСообщенийОбмена.Приоритет = SUI_СообщенияОбменаДанными.Приоритет
		|		И SUI_СообщенияОбменаДанными.Сворачивать
		|		И SUI_СообщенияОбменаДанными.ВидДанных = ЗНАЧЕНИЕ(Перечисление.SUI_ВидыДанныхСообщенийОбменаДанными.Значение))
		|
		|УПОРЯДОЧИТЬ ПО
		|	МеткаВремени";
	
	Запрос.УстановитьПараметр("СостоянияМобильныхУстройствДляСвертки", СостоянияМобильныхУстройствДляСвертки());
	Запрос.УстановитьПараметр("МобильноеУстройство", Параметры.МобильноеУстройство);
	Запрос.УстановитьПараметр("Приоритет", Параметры.Приоритет);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		Пока Не РезультатЗапроса.Пустой() Цикл
			
			Блокировка = Новый БлокировкаДанных();
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.SUI_СообщенияОбменаДанными");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ID", "ID");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Отправитель", "Отправитель");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Получатель", "Получатель");
			Блокировка.Заблокировать();
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Если Выборка.Количество() <> 2 Тогда
				Прервать;
			КонецЕсли;
			
			// Сообщение Источник
			Выборка.Следующий();
			ДанныеСообщенияИсточник = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Выборка);
			ДанныеСообщенияИсточник.Данные = ДанныеСообщенияИсточник.Данные.Получить();
			
			// Сообщение Приемник
			Выборка.Следующий();
			ДанныеСообщенияПриемник = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Выборка);
			ДанныеСообщенияПриемник.Данные = ДанныеСообщенияПриемник.Данные.Получить();
			
			// Свернуть коллекции
			SUI_ПакетыДанных.СвернутьКоллекцииДанных(ДанныеСообщенияИсточник.Данные, ДанныеСообщенияПриемник.Данные);
			
			// Подсчитать размер данных
			РазмерДанных = 0;
			Для Каждого ПриемникДанныеКлючЗначение Из ДанныеСообщенияПриемник.Данные Цикл
				
				Если ПриемникДанныеКлючЗначение.Ключ <> SUI_ПакетыДанныхКлиентСервер.КлючТаблицы_Сообщения()Тогда
				
					РазмерДанных = РазмерДанных + ПриемникДанныеКлючЗначение.Значение.Данные.Количество();
					Если РазмерДанных >= МаксимальныйРазмерПакета Тогда
						Прервать;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Пакеты = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Неопределено);
			
			// Если размер данных превысил максимальный
			Если РазмерДанных >= МаксимальныйРазмерПакета Тогда
				
				ДанныеСообщенияПриемник.ВидДанных = Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.JSON;
				ДанныеСообщенияПриемник.Сворачивать = Ложь;
				
				ПараметрыСборки = SUI_ПакетыДанных.ПараметрыСборкиСообщенийПакетаДанныхИзКоллекции(ДанныеСообщенияПриемник.Данные);
				ЗаполнитьЗначенияСвойств(ПараметрыСборки, ДанныеСообщенияПриемник);
				
				// Собрать пакеты в JSON
				Пакеты = SUI_ПакетыДанных.СобратьСообщениеПакетаДанныхИзКоллекции(ПараметрыСборки);
				
				ОбщегоНазначенияКлиентСервер.Проверить(Пакеты.Количество() > 0,
					НСтр("ru = 'Не удалось собрать пакет данных'"));
				
				ДанныеСообщенияПриемник.Данные = Пакеты[0];
				
			КонецЕсли;
			
			ДополнительныеПараметрыЗаписи = Новый Структура("МеткаВремени, ДатаЗаписи, Сворачивать");
			ЗаполнитьЗначенияСвойств(ДополнительныеПараметрыЗаписи, ДанныеСообщенияПриемник);
			
			// Обновить данные сообщения Приемник
			Если РегистрыСведений.SUI_СообщенияОбменаДанными.ОбновитьСообщение(ДанныеСообщенияПриемник.ID, ДанныеСообщенияПриемник) Тогда
				
				// Удалить сообщение Источник
				РегистрыСведений.SUI_СообщенияОбменаДанными.Удалить(ДанныеСообщенияИсточник.ID, 
					ДанныеСообщенияИсточник.Отправитель, ДанныеСообщенияИсточник.Получатель);
				
				// Записать остатки пакетов
				Для индекс = 1 По Пакеты.ВГраница() Цикл
					
					ДополнительныеПараметрыЗаписи.МеткаВремени = ДополнительныеПараметрыЗаписи.МеткаВремени+1;
					
					РегистрыСведений.SUI_СообщенияОбменаДанными.Создать(ПараметрыСборки.Отправитель, 
						ПараметрыСборки.Получатель, Пакеты[индекс], ПараметрыСборки.Приоритет, ПараметрыСборки.ВидДанных,
						ДополнительныеПараметрыЗаписи);
					
				КонецЦикла;
				
			КонецЕсли;
			
			//@skip-check query-in-loop
			РезультатЗапроса = Запрос.Выполнить();
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура ВыполнитьСообщениеОперацию(СообщениеОперации, АдресРезультата) Экспорт
	
	ОбщегоНазначенияКлиентСервер.Проверить(ЭтоСообщениеОперации(СообщениеОперации),
		НСтр("ru = 'Метод SUI_СообщенияОбменаДанными.ВыполнитьСообщениеОперацию доступен только для сообщений операций'"));
	
	ВТранзакции = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СообщениеОперации, "ВТранзакции", Ложь, Тип("Булево"));
	
	Если ВТранзакции Тогда
		НачатьТранзакцию();
	КонецЕсли;
	
	Попытка
		
		Операция = ДанныеОперацииИзСообщенияОперации(СообщениеОперации);
		ОбщегоНазначения.ВыполнитьМетодКонфигурации(Операция.ИмяМетода, Операция.Параметры);
		
		Если ВТранзакции И ТранзакцияАктивна() Тогда
			ЗафиксироватьТранзакцию();
		КонецЕсли;
		
	Исключение
		Если ВТранзакции И ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(НСтр("ru = 'Выполнить сообщение операцию'")), , 
			Метаданные.ОбщиеМодули.SUI_СообщенияОбменаДанными, , ИнформацияОбОшибке());
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИмяСобытия(ВложенноеСобытие = "") Экспорт
	Возврат НСтр("ru = 'Пакеты данных'") + ?(ПустаяСтрока(ВложенноеСобытие), "", ". " + ВложенноеСобытие);
КонецФункции

Функция СостоянияМобильныхУстройствДляСвертки()
	
	Возврат SUI_ОбщегоНазначенияКлиентСервер.МассивЗначений(
		Перечисления.SUI_СостоянияМобильныхУстройств.Выгружено,
		Перечисления.SUI_СостоянияМобильныхУстройств.ТребуетсяПолучитьДанные,
		Перечисления.SUI_СостоянияМобильныхУстройств.Ошибка);
	
КонецФункции

#Область ВходящиеСообщения

Процедура ОбработатьВходящиеСообщения()
	
	// Удалить устаревшие результаты
	ВыполнитьОчисткуУстаревшихРезультатовСообщенийОбменаДанными();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 100
		|	SUI_СообщенияОбменаДанными.ID,
		|	SUI_СообщенияОбменаДанными.Отправитель,
		|	SUI_СообщенияОбменаДанными.Получатель,
		|	SUI_СообщенияОбменаДанными.Данные,
		|	SUI_СообщенияОбменаДанными.ВидДанных
		|ИЗ
		|	РегистрСведений.SUI_СообщенияОбменаДанными КАК SUI_СообщенияОбменаДанными
		|ГДЕ
		|	SUI_СообщенияОбменаДанными.Отправитель <> &ЭтотУзел
		|	И SUI_СообщенияОбменаДанными.Получатель = &ЭтотУзел
		|
		|УПОРЯДОЧИТЬ ПО
		|	SUI_СообщенияОбменаДанными.Приоритет УБЫВ,
		|	SUI_СообщенияОбменаДанными.МеткаВремени";
	
	Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена.SUI_МобильныеУстройства.ЭтотУзел());
	
	Попытка
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			
			Пока Не РезультатЗапроса.Пустой() Цикл
				
				Выборка = РезультатЗапроса.Выбрать();
				
				Пока Выборка.Следующий() Цикл
					
					РезультатОбработки = РегистрыСведений.SUI_РезультатыОбработкиВходящихСообщенийОбменаДанными.СтруктураРезультатаОбработки(Выборка.ID);
					
					ДанныеСообщения = Выборка.Данные.Получить();
					Если Выборка.ВидДанных = Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.JSON Тогда
						ДанныеСообщения = ДанныеСообщенияИзJSON(ДанныеСообщения);
					КонецЕсли;
					
					Если ЭтоСообщениеОперации(ДанныеСообщения) Тогда
						ОбработатьОперациюСообщенияОбмена(ДанныеСообщения, РезультатОбработки);
					КонецЕсли;
					
					РегистрыСведений.SUI_РезультатыОбработкиВходящихСообщенийОбменаДанными.Зафиксировать(РезультатОбработки);
					
				КонецЦикла;
				
				//@skip-check query-in-loop
				РезультатЗапроса = Запрос.Выполнить();
				
			КонецЦикла;
			
		КонецЕсли;
		
	Исключение
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(НСтр("ru = 'Обработка входящих сообщений'")), , 
			Метаданные.ОбщиеМодули.SUI_СообщенияОбменаДанными, , ИнформацияОбОшибке());
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура ОбработатьОперациюСообщенияОбмена(ДанныеОперации, РезультатОбработки)
	
	ДанныеОперации.Операция = ДанныеОперацииИзСообщенияОперации(ДанныеОперации);
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияВФоне();
	ПараметрыВыполненияВФоне.НаименованиеФоновогоЗадания = СтрШаблон(
			НСтр("ru = '%1: Обработка сообщения обмена данными (%2)'"), SUI_SimpleКлиентСервер.Представление(), ДанныеОперации.Наименование);
	ПараметрыВыполненияВФоне.ОжидатьЗавершение = Неопределено;
	ПараметрыВыполненияВФоне.ЗапуститьВФоне = Ложь;
	ПараметрыВыполненияВФоне.ЗапуститьНеВФоне = Ложь;
	ПараметрыВыполненияВФоне.ПрерватьВыполнениеЕслиОшибка = Истина;
	ПараметрыВыполненияВФоне.АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор());
	
	Результат = ДлительныеОперации.ВыполнитьВФоне("SUI_СообщенияОбменаДанными.ВыполнитьСообщениеОперацию", 
		ДанныеОперации, ПараметрыВыполненияВФоне);
	
	ЗаполнитьЗначенияСвойств(РезультатОбработки, Результат, , "Сообщения");
	
	Если ЗначениеЗаполнено(Результат.Сообщения) Тогда
		
		Для индекс = 0 По Результат.Сообщения.ВГраница() Цикл
			РезультатОбработки.Сообщения.Добавить(Результат.Сообщения[индекс].Текст);
		КонецЦикла;
		
	Иначе
		
		Для Каждого Сообщение Из ПолучитьСообщенияПользователю(Истина) Цикл
			РезультатОбработки.Сообщения.Добавить(Сообщение.Текст);
		КонецЦикла;
		
	КонецЕсли;
	
	РезультатОбработки.Обработано = (РезультатОбработки.Статус <> "Выполняется");
	
	Если ЭтоАдресВременногоХранилища(Результат.АдресРезультата) Тогда
		УдалитьИзВременногоХранилища(Результат.АдресРезультата);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьОчисткуУстаревшихРезультатовСообщенийОбменаДанными()
	
	РезультатЗапроса = РегистрыСведений.SUI_РезультатыОбработкиВходящихСообщенийОбменаДанными.ПолучитьРезультатЗапросаУстаревшихРезультатов();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияВФоне();
		ПараметрыВыполненияВФоне.КлючФоновогоЗадания = "40fb9573-52d8-4485-8aef-b9eb71f4d63a";
		ПараметрыВыполненияВФоне.НаименованиеФоновогоЗадания = СтрШаблон(
			НСтр("ru = '%1: Удаление устаревших результатов обработки сообщений обмена данными'"), SUI_SimpleКлиентСервер.Представление());
		ПараметрыВыполненияВФоне.АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор());
		
		ДлительныеОперации.ВыполнитьВФоне(
			"РегистрыСведений.SUI_РезультатыОбработкиВходящихСообщенийОбменаДанными.ВыполнитьОчисткуУстаревшихРезультатов", 
			Неопределено, ПараметрыВыполненияВФоне);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ИсходящиеСообщения

Процедура СформироватьИсходящиеСообщения()
	
	СостоянияЗапросаПолнойВыгрузки = РегистрыСведений.SUI_СостоянияМобильныхУстройств.СостоянияМобильныхУстройств(
		Новый Структура("Состояние", Перечисления.SUI_СостоянияМобильныхУстройств.ЗапросПолнойВыгрузки), Истина);
	
	// Запустить в фоне формирование сообщений пакетов данных полной выгрузки
	Если Не СостоянияЗапросаПолнойВыгрузки.Пустой() Тогда
		
		ПараметрыВыполнения 							= ДлительныеОперации.ПараметрыВыполненияВФоне();
		ПараметрыВыполнения.КлючФоновогоЗадания 		= Новый УникальныйИдентификатор("33c30293-95a3-402d-9b80-621bade9ed03");
		ПараметрыВыполнения.НаименованиеФоновогоЗадания = СтрШаблон(НСтр("ru = '%1: Выполнение полной выгрузки'"), SUI_SimpleКлиентСервер.Представление());
		ПараметрыВыполнения.ОжидатьЗавершение 			= 0;
		ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
		ПараметрыВыполнения.СРасширениямиБазыДанных 	= Истина;
		
		ДлительныеОперации.ВыполнитьВФоне("SUI_ПакетыДанных.ВыполнитьЗаданиеСформироватьПакетыДанныхСообщений", 
			Новый Структура("ЭтоПолнаяВыгрузка", Истина), ПараметрыВыполнения);
		
	КонецЕсли;
	
	// Выполнить формирование сообщений пакетов данных по изменениям
	SUI_ПакетыДанных.ВыполнитьЗаданиеСформироватьПакетыДанныхСообщений(Неопределено, Неопределено);

КонецПроцедуры

#КонецОбласти

#Область СообщенияОперации

Функция ПодготовитьСообщениеОперации(ИмяМетода, ПараметрыМетода, ДополнительныеПараметры = Неопределено)
	
	СообщениеОперации = Новый Структура();
	СообщениеОперации.Вставить("ЭтоСообщениеОперации", Истина);
	СообщениеОперации.Вставить("Наименование", SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ДополнительныеПараметры, "Наименование", ИмяМетода, Тип("Строка")));
	СообщениеОперации.Вставить("ВТранзакции", SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ДополнительныеПараметры, "ВТранзакции", Ложь, Тип("Булево")));
	
	ОписаниеТипаМассив = Новый ОписаниеТипов("Массив");
	
	ДанныеОперации = Новый Структура();
	ДанныеОперации.Вставить("ИмяМетода", ИмяМетода);
	ДанныеОперации.Вставить("Параметры", ОписаниеТипаМассив.ПривестиЗначение(ПараметрыМетода));
	
	СообщениеОперации.Вставить("Операция", Новый ХранилищеЗначения(ДанныеОперации, Новый СжатиеДанных(9)));
	
	Если ПустаяСтрока(СообщениеОперации.Наименование) Тогда
		СообщениеОперации.Наименование = ДанныеОперации.ИмяМетода;
	КонецЕсли;
	
	Возврат СообщениеОперации;
	
КонецФункции

Функция ДанныеОперацииИзСообщенияОперации(СообщениеОперации)
	
	Операция = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СообщениеОперации, "Операция");
	
	Если ТипЗнч(Операция) = Тип("ХранилищеЗначения") Тогда
		Операция = Операция.Получить();
	КонецЕсли;
	
	ОписаниеТипаСтруктура = Новый ОписаниеТипов("Структура");
	Операция = ОписаниеТипаСтруктура.ПривестиЗначение(Операция);
			
	ДанныеОперации = Новый Структура();
	ДанныеОперации.Вставить("ИмяМетода", SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Операция, "ИмяМетода", "", Тип("Строка")));
	ДанныеОперации.Вставить("Параметры", SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Операция, "Параметры", Новый Массив(), Тип("Массив")));
	
	Возврат ДанныеОперации;
	
КонецФункции

#КонецОбласти

#КонецОбласти
