
#Область ПрограммныйИнтерфейс

Функция ПолучитьСообщениеДляМобильногоУстройства(МобильноеУстройство, ВПривилегированномРежиме = Ложь) Экспорт
	
	// Оценка производительности
	ОценкаПроизводительности_НачалоЗамера = SUI_ОценкаПроизводительности.НачатьЗамерВремени();
	ОценкаПроизводительности_ВесЗамера = 0;
	ОценкаПроизводительности_КлючеваяОперация = "ПолучитьСообщениеДляМобильногоУстройства";
	
	Если ВПривилегированномРежиме И Не ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	ДанныеВозврата = Новый Структура();
	ДанныеВозврата.Вставить("Данные", SUI_ПакетыДанныхКлиентСервер.ПустойПакет(SUI_ПакетыДанныхКлиентСервер.ФорматПакета_НетДанных()));
	ДанныеВозврата.Вставить("ОстатокПакетов", 0);
	
	ДанныеСообщения = РегистрыСведений.SUI_СообщенияОбменаДанными.ПолучитьПервоеСообщениеПоПолучателю(МобильноеУстройство);
	
	Если ДанныеСообщения <> Неопределено Тогда
		
		ОценкаПроизводительности_ВесЗамера = 1;
		
		НачатьТранзакцию();
		
		Попытка
			
			// Собрать сообщение пакет JSON, если вид данных сообщения = Значение
			Если ДанныеСообщения.ВидДанных = Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.Значение Тогда
				
				ПараметрыСборки = SUI_ПакетыДанных.ПараметрыСборкиСообщенийПакетаДанныхИзКоллекции(ДанныеСообщения.Данные);
				ЗаполнитьЗначенияСвойств(ПараметрыСборки, ДанныеСообщения);
				ПараметрыСборки.ВидДанных = Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.JSON;
				
				// Собрать в JSON
				Пакеты = SUI_ПакетыДанных.СобратьСообщениеПакетаДанныхИзКоллекции(ПараметрыСборки);
				
				SUI_ОбщегоНазначенияКлиентСервер.Проверить(Пакеты.Количество() > 0,
					НСтр("ru = 'Не удалось собрать пакет данных'"));
				
				ДанныеВозврата.Данные = Пакеты[0];
				
				// Записать остатки пакетов
				Для индекс = 1 По Пакеты.ВГраница() Цикл
					РегистрыСведений.SUI_СообщенияОбменаДанными.Создать(ПараметрыСборки.Отправитель, 
						ПараметрыСборки.Получатель, Пакеты[индекс], ПараметрыСборки.Приоритет, ПараметрыСборки.ВидДанных,
						Новый Структура("МеткаВремени, ДатаЗаписи, Сворачивать", ДанныеСообщения.МеткаВремени+1, ДанныеСообщения.ДатаЗаписи, Ложь));
				КонецЦикла;
				
			Иначе
				ДанныеВозврата.Данные = ДанныеСообщения.Данные;
			КонецЕсли;
			
			// Удалить полученное сообщение
			РегистрыСведений.SUI_СообщенияОбменаДанными.Удалить(ДанныеСообщения.ID, ДанныеСообщения.Отправитель, ДанныеСообщения.Получатель);
			
			// Заполнить остаток сообщений
			ДанныеВозврата.ОстатокПакетов = РегистрыСведений.SUI_СообщенияОбменаДанными
				.ПолучитьКоличествоСообщенийПоМобильнымУстройствам(, ДанныеСообщения.Получатель);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			SUI_ОценкаПроизводительности.ЗакончитьЗамерВремени(
				ОценкаПроизводительности_КлючеваяОперация, 
				ОценкаПроизводительности_НачалоЗамера, 
				ОценкаПроизводительности_ВесЗамера, 
				ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()), 
				Истина);
			ВызватьИсключение;
		КонецПопытки;
		
	КонецЕсли;
	
	// Оценка производительности
	Если ОценкаПроизводительности_ВесЗамера > 0 Тогда
		SUI_ОценкаПроизводительности.ЗакончитьЗамерВремени(ОценкаПроизводительности_КлючеваяОперация, 
			ОценкаПроизводительности_НачалоЗамера, ОценкаПроизводительности_ВесЗамера);
	КонецЕсли;
	
	Возврат ДанныеВозврата;
	
КонецФункции

// Создать входящие сообщение обмена данными.
// 
// Параметры:
//  Отправитель - ПланОбменаСсылка.SUI_МобильныеУстройства - Отправитель сообщения
//  Обработчик - Строка - Имя экспортируемой процедуры (обработчика) входящего сообщения
//  Параметры - Массив из Произвольный - Массив параметров экспортируемой процедуры (обработчика) входящего сообщения
//  Ключи - Строка, Массив из Строка - Ключи сообщения
// 
// Возвращаемое значение:
//  Строка - Идентификатор созданного входящего сообщения обмена данными
Функция СоздатьВходящиеСообщениеОбменаДанными(Отправитель, Обработчик, Параметры, Ключи = Неопределено) Экспорт
	
	ДанныеСообщения = Новый Структура();
	ДанныеСообщения.Вставить("Обработчик", Обработчик);
	ДанныеСообщения.Вставить("Параметры", Параметры);
	
	ДополнительныеДанныеСообщения = Новый Структура();
	ДополнительныеДанныеСообщения.Вставить("Сворачивать", Ложь);
	
	Если Ключи <> Неопределено Тогда
		ДополнительныеДанныеСообщения.Вставить("Ключи", Ключи);
	КонецЕсли;
	
	Получатель = ПланыОбмена.SUI_МобильныеУстройства.ЭтотУзел();
	
	Возврат РегистрыСведений.SUI_СообщенияОбменаДанными.Создать(Отправитель, Получатель, ДанныеСообщения, , , ДополнительныеДанныеСообщения);
	
КонецФункции

// Открыть сообщение для повторной обработки.
// 
// Параметры:
//  КлючЗаписи - РегистрСведенийКлючЗаписи.SUI_СообщенияОбменаДанными - Ключ записи регистра сведений SUI_СообщенияОбменаДанными
// 
// Возвращаемое значение:
//  Булево - Результат открытия сообщения
Функция ОткрытьСообщениеДляПовторнойОбработки(КлючЗаписи) Экспорт
	
	Результат = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СообщенияОбменаДанными.Обработано
		|ИЗ
		|	РегистрСведений.SUI_СообщенияОбменаДанными КАК СообщенияОбменаДанными
		|ГДЕ
		|	СообщенияОбменаДанными.ID = &Идентификатор
		|	И СообщенияОбменаДанными.Отправитель = &Отправитель
		|	И СообщенияОбменаДанными.Получатель = &Получатель
		|	И СообщенияОбменаДанными.Обработано <> ДАТАВРЕМЯ(1, 1, 1)
		|	И НЕ СообщенияОбменаДанными.Отправитель.ЭтотУзел
		|	И СообщенияОбменаДанными.Получатель.ЭтотУзел";
	
	Запрос.УстановитьПараметр("Идентификатор", КлючЗаписи.ID);
	Запрос.УстановитьПараметр("Отправитель", КлючЗаписи.Отправитель);
	Запрос.УстановитьПараметр("Получатель", КлючЗаписи.Получатель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ТекстСообщения = НСтр("ru = 'Для сообщения обмена с идентификатором ""%1"" не требуется открытие для повторной обработки!'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, КлючЗаписи.ID);
		SUI_ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	Иначе
		
		ДанныеКОбновлению = Новый Структура();
		ДанныеКОбновлению.Вставить("Обработано");
		
		Результат = РегистрыСведений.SUI_СообщенияОбменаДанными.ОбновитьСообщение(КлючЗаписи, ДанныеКОбновлению);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#Область JSON

Функция ДанныеСообщенияВJSON(ДанныеСообщения) Экспорт
	
	ТипЗначения = ТипЗнч(ДанныеСообщения);
	
	Если ТипЗначения = Тип("Массив") Или ТипЗначения = Тип("ФиксированныйМассив") Или
		ТипЗначения = Тип("Структура") Или ТипЗначения = Тип("ФиксированнаяСтруктура") Или
		ТипЗначения = Тип("Соответствие") Или ТипЗначения = Тип("ФиксированноеСоответствие") Тогда
		
		ЗаписьJSON = Новый ЗаписьJSON();
		ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(, Символы.Таб);
		ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
		ЗаписатьJSON(ЗаписьJSON, ДанныеСообщения, , 
			"ПреобразованиеДанныхJSON", SUI_СообщенияОбменаДанными);
		
		Возврат ЗаписьJSON.Закрыть();
		
	ИначеЕсли ТипЗначения = Тип("Строка") И 
		(СтрНачинаетсяС(ДанныеСообщения, "[") Или СтрНачинаетсяС(ДанныеСообщения, "{")) И 
		(СтрЗаканчиваетсяНа(ДанныеСообщения, "]") Или СтрЗаканчиваетсяНа(ДанныеСообщения, "}")) Тогда
		Возврат ДанныеСообщения;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ДанныеСообщенияИзJSON(Знач ДанныеСообщения) Экспорт
	
	ДанныеСообщения = SUI_ОбщегоНазначения.ОписаниеТипаСтрока(0).ПривестиЗначение(ДанныеСообщения);
	
	Если (СтрНачинаетсяС(ДанныеСообщения, "[") Или СтрНачинаетсяС(ДанныеСообщения, "{")) И
		(СтрЗаканчиваетсяНа(ДанныеСообщения, "]") Или СтрЗаканчиваетсяНа(ДанныеСообщения, "}")) Тогда
		
		ЧтениеJSON = Новый ЧтениеJSON();
		ЧтениеJSON.УстановитьСтроку(ДанныеСообщения);
		Возврат ПрочитатьJSON(ЧтениеJSON, Истина, , ФорматДатыJSON.ISO);
	
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриДобавленииРегламентныхЗаданийПодсистемы(РегламентныеЗаданияПодсистемы) Экспорт
	
	// ВыполнитьОбработкуСообщенийОбменаДанными
	РегламентноеЗаданиеПодсистемы = РегламентныеЗаданияПодсистемы.Добавить();
	РегламентноеЗаданиеПодсистемы.Ключ = SUI_СообщенияОбменаДаннымиКлиентСервер.КлючиРегламентныхЗаданий()
		.ВыполнитьОбработкуСообщенийОбменаДанными;
	РегламентноеЗаданиеПодсистемы.Наименование = НСтр("ru = 'Simple: Обработка сообщений обмена'");
	РегламентноеЗаданиеПодсистемы.ИмяМетода = "SUI_СообщенияОбменаДанными.ВыполнитьОбработкуСообщенийОбменаДанными";
	РегламентноеЗаданиеПодсистемы.КоличествоПовторовПриАварийномЗавершении = 1;
	РегламентноеЗаданиеПодсистемы.ИнтервалПовтораПриАварийномЗавершении = 10;
	РегламентноеЗаданиеПодсистемы.Расписание.ПериодПовтораДней = 1;
	РегламентноеЗаданиеПодсистемы.Расписание.ПериодПовтораВТечениеДня = 60;
	
	// ВыполнитьСверткуСообщенийОбменаДанными
	РегламентноеЗаданиеПодсистемы = РегламентныеЗаданияПодсистемы.Добавить();
	РегламентноеЗаданиеПодсистемы.Ключ = SUI_СообщенияОбменаДаннымиКлиентСервер.КлючиРегламентныхЗаданий()
		.ВыполнитьСверткуСообщенийОбменаДанными;
	РегламентноеЗаданиеПодсистемы.Наименование = НСтр("ru = 'Simple: Свертка сообщений обмена'");
	РегламентноеЗаданиеПодсистемы.ИмяМетода = "SUI_СообщенияОбменаДанными.ВыполнитьСверткуСообщенийОбменаДанными";
	РегламентноеЗаданиеПодсистемы.КоличествоПовторовПриАварийномЗавершении = 1;
	РегламентноеЗаданиеПодсистемы.ИнтервалПовтораПриАварийномЗавершении = 10;
	РегламентноеЗаданиеПодсистемы.Расписание.ПериодПовтораДней = 1;
	РегламентноеЗаданиеПодсистемы.Расписание.ПериодПовтораВТечениеДня = 60;
	
КонецПроцедуры

Функция ПреобразованиеДанныхJSON(Свойство, Значение, ДополнительныеПараметры, Отказ) Экспорт
	
	ТипЗначения = ТипЗнч(Значение);
	Если ТипЗначения = Тип("Null") Или ТипЗначения = Тип("Неопределено") Тогда
		Возврат Неопределено;
	ИначеЕсли ТипЗначения <> Тип("Строка") И ТипЗначения <> Тип("Число") И 
		ТипЗначения <> Тип("Булево") И ТипЗначения <> Тип("Дата") И
		ТипЗначения <> Тип("Массив") И ТипЗначения <> Тип("ФиксированныйМассив") И
		ТипЗначения <> Тип("Соответствие") И ТипЗначения <> Тип("ФиксированноеСоответствие") И
		ТипЗначения <> Тип("Структура") И ТипЗначения <> Тип("ФиксированнаяСтруктура") Тогда
		Возврат Строка(Значение);
	КонецЕсли;
	
КонецФункции

Процедура ВыполнитьОбработкуСообщенийОбменаДанными() Экспорт
	
	// Обработать входящие сообщения
	ОбработатьВходящиеСообщения();
	
	// Обработать исходящие сообщения
	СформироватьИсходящиеСообщения();
	
КонецПроцедуры

Процедура ВыполнитьСверткуСообщенийОбменаДанными() Экспорт
	
	// Оценка производительности
	ОценкаПроизводительности_НачалоЗамера = SUI_ОценкаПроизводительности.НачатьЗамерВремени();
	ОценкаПроизводительности_ВесЗамера = 0;
	ОценкаПроизводительности_КлючеваяОперация = "ВыполнитьЗаданиеСформироватьПакетыДанныхСообщений";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СтатистикаСообщенийОбмена.МобильноеУстройство КАК МобильноеУстройство,
		|	СтатистикаСообщенийОбмена.Приоритет КАК Приоритет
		|ИЗ
		|	(ВЫБРАТЬ
		|		СообщенияОбменаДанными.Получатель КАК МобильноеУстройство,
		|		СообщенияОбменаДанными.Приоритет КАК Приоритет,
		|		КОЛИЧЕСТВО(СообщенияОбменаДанными.ID) КАК КоличествоСообщений
		|	ИЗ
		|		РегистрСведений.SUI_СообщенияОбменаДанными КАК СообщенияОбменаДанными
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.SUI_СостоянияМобильныхУстройств КАК СостоянияМобильныхУстройств
		|			ПО СообщенияОбменаДанными.Получатель = СостоянияМобильныхУстройств.МобильноеУстройство
		|	ГДЕ
		|		СообщенияОбменаДанными.Сворачивать
		|		И СообщенияОбменаДанными.ВидДанных = ЗНАЧЕНИЕ(Перечисление.SUI_ВидыДанныхСообщенийОбменаДанными.Значение)
		|		И СообщенияОбменаДанными.Отправитель.ЭтотУзел
		|		И ВЫБОР
		|			КОГДА СостоянияМобильныхУстройств.Состояние ЕСТЬ NULL
		|			ИЛИ СостоянияМобильныхУстройств.Состояние В (&СостоянияМобильныхУстройствДляСвертки)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|	СГРУППИРОВАТЬ ПО
		|		СообщенияОбменаДанными.Получатель,
		|		СообщенияОбменаДанными.Приоритет) КАК СтатистикаСообщенийОбмена
		|ГДЕ
		|	СтатистикаСообщенийОбмена.КоличествоСообщений > 1";
	
	Запрос.УстановитьПараметр("СостоянияМобильныхУстройствДляСвертки", СостоянияМобильныхУстройствДляСвертки());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		// Оценка производительности
		ОценкаПроизводительности_ВесЗамера = Выборка.Количество();
		
		Пока Выборка.Следующий() Цикл
			
			НачатьТранзакцию();
			
			Попытка
				
				Блокировка = Новый БлокировкаДанных();
				ЭлементБлокировки = Блокировка.Добавить("ПланОбмена.SUI_МобильныеУстройства");
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
				ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.МобильноеУстройство);
				Блокировка.Заблокировать();
				
				// Свернуть сообщения
				//@skip-check query-in-loop
				СвернутьСообщенияОбменаДанными(
					Новый Структура("МобильноеУстройство, Приоритет", Выборка.МобильноеУстройство, Выборка.Приоритет), 
					Неопределено);
				
				ЗафиксироватьТранзакцию();
				
			Исключение
				ОтменитьТранзакцию();
				SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(НСтр("ru = 'Свертка сообщений'")), , 
					Метаданные.ОбщиеМодули.SUI_СообщенияОбменаДанными, Выборка.МобильноеУстройство, ИнформацияОбОшибке());
				SUI_ОценкаПроизводительности.ЗакончитьЗамерВремени(
					ОценкаПроизводительности_КлючеваяОперация, 
					ОценкаПроизводительности_НачалоЗамера, 
					ОценкаПроизводительности_ВесЗамера, 
					ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()), 
					Истина);
				ВызватьИсключение;
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Оценка производительности
	Если ОценкаПроизводительности_ВесЗамера > 0 Тогда
		SUI_ОценкаПроизводительности.ЗакончитьЗамерВремени(ОценкаПроизводительности_КлючеваяОперация, 
			ОценкаПроизводительности_НачалоЗамера, ОценкаПроизводительности_ВесЗамера);
	КонецЕсли;
	
КонецПроцедуры

Процедура СвернутьСообщенияОбменаДанными(Параметры, АдресРезультата) Экспорт
	
	МаксимальныйРазмерПакета = SUI_ПакетыДанных.РазмерПакетаДанных();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 2
		|	SUI_СообщенияОбменаДанными.ID КАК ID,
		|	SUI_СообщенияОбменаДанными.Отправитель КАК Отправитель,
		|	SUI_СообщенияОбменаДанными.Получатель КАК Получатель,
		|	SUI_СообщенияОбменаДанными.Данные КАК Данные,
		|	SUI_СообщенияОбменаДанными.ВидДанных КАК ВидДанных,
		|	SUI_СообщенияОбменаДанными.ДатаЗаписи КАК ДатаЗаписи,
		|	SUI_СообщенияОбменаДанными.МеткаВремени КАК МеткаВремени,
		|	SUI_СообщенияОбменаДанными.Приоритет КАК Приоритет,
		|	SUI_СообщенияОбменаДанными.Сворачивать КАК Сворачивать
		|ИЗ
		|	(ВЫБРАТЬ
		|		СообщенияОбменаДанными.Получатель КАК МобильноеУстройство,
		|		СообщенияОбменаДанными.Приоритет КАК Приоритет,
		|		КОЛИЧЕСТВО(СообщенияОбменаДанными.ID) КАК КоличествоСообщений
		|	ИЗ
		|		РегистрСведений.SUI_СообщенияОбменаДанными КАК СообщенияОбменаДанными
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.SUI_СостоянияМобильныхУстройств КАК СостоянияМобильныхУстройств
		|			ПО СообщенияОбменаДанными.Получатель = СостоянияМобильныхУстройств.МобильноеУстройство
		|	ГДЕ
		|		СообщенияОбменаДанными.Сворачивать
		|		И СообщенияОбменаДанными.ВидДанных = ЗНАЧЕНИЕ(Перечисление.SUI_ВидыДанныхСообщенийОбменаДанными.Значение)
		|		И СообщенияОбменаДанными.Отправитель.ЭтотУзел
		|		И СообщенияОбменаДанными.Получатель = &МобильноеУстройство
		|		И СообщенияОбменаДанными.Приоритет = &Приоритет
		|		И ВЫБОР
		|			КОГДА СостоянияМобильныхУстройств.Состояние ЕСТЬ NULL
		|			ИЛИ СостоянияМобильныхУстройств.Состояние В (&СостоянияМобильныхУстройствДляСвертки)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|	СГРУППИРОВАТЬ ПО
		|		СообщенияОбменаДанными.Получатель,
		|		СообщенияОбменаДанными.Приоритет) КАК СтатистикаСообщенийОбмена
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.SUI_СообщенияОбменаДанными КАК SUI_СообщенияОбменаДанными
		|		ПО (СтатистикаСообщенийОбмена.КоличествоСообщений > 1
		|		И SUI_СообщенияОбменаДанными.Отправитель.ЭтотУзел
		|		И СтатистикаСообщенийОбмена.МобильноеУстройство = SUI_СообщенияОбменаДанными.Получатель
		|		И СтатистикаСообщенийОбмена.Приоритет = SUI_СообщенияОбменаДанными.Приоритет
		|		И SUI_СообщенияОбменаДанными.Сворачивать
		|		И SUI_СообщенияОбменаДанными.ВидДанных = ЗНАЧЕНИЕ(Перечисление.SUI_ВидыДанныхСообщенийОбменаДанными.Значение))
		|
		|УПОРЯДОЧИТЬ ПО
		|	МеткаВремени";
	
	Запрос.УстановитьПараметр("СостоянияМобильныхУстройствДляСвертки", СостоянияМобильныхУстройствДляСвертки());
	Запрос.УстановитьПараметр("МобильноеУстройство", Параметры.МобильноеУстройство);
	Запрос.УстановитьПараметр("Приоритет", Параметры.Приоритет);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		Пока Не РезультатЗапроса.Пустой() Цикл
			
			Блокировка = Новый БлокировкаДанных();
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.SUI_СообщенияОбменаДанными");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ID", "ID");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Отправитель", "Отправитель");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Получатель", "Получатель");
			Блокировка.Заблокировать();
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Если Выборка.Количество() <> 2 Тогда
				Прервать;
			КонецЕсли;
			
			// Сообщение Источник
			Выборка.Следующий();
			ДанныеСообщенияИсточник = SUI_ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Выборка);
			ДанныеСообщенияИсточник.Данные = ДанныеСообщенияИсточник.Данные.Получить();
			
			// Сообщение Приемник
			Выборка.Следующий();
			ДанныеСообщенияПриемник = SUI_ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Выборка);
			ДанныеСообщенияПриемник.Данные = ДанныеСообщенияПриемник.Данные.Получить();
			
			// Свернуть коллекции
			SUI_ПакетыДанных.СвернутьКоллекцииДанных(ДанныеСообщенияИсточник.Данные, ДанныеСообщенияПриемник.Данные);
			
			// Подсчитать размер данных
			РазмерДанных = 0;
			Для Каждого ПриемникДанныеКлючЗначение Из ДанныеСообщенияПриемник.Данные Цикл
				
				Если ПриемникДанныеКлючЗначение.Ключ <> SUI_ПакетыДанныхКлиентСервер.КлючТаблицы_Сообщения()Тогда
				
					РазмерДанных = РазмерДанных + ПриемникДанныеКлючЗначение.Значение.Данные.Количество();
					Если РазмерДанных >= МаксимальныйРазмерПакета Тогда
						Прервать;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Пакеты = SUI_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Неопределено);
			
			// Если размер данных превысил максимальный
			Если РазмерДанных >= МаксимальныйРазмерПакета Тогда
				
				ДанныеСообщенияПриемник.ВидДанных = Перечисления.SUI_ВидыДанныхСообщенийОбменаДанными.JSON;
				ДанныеСообщенияПриемник.Сворачивать = Ложь;
				
				ПараметрыСборки = SUI_ПакетыДанных.ПараметрыСборкиСообщенийПакетаДанныхИзКоллекции(ДанныеСообщенияПриемник.Данные);
				ЗаполнитьЗначенияСвойств(ПараметрыСборки, ДанныеСообщенияПриемник);
				
				// Собрать пакеты в JSON
				Пакеты = SUI_ПакетыДанных.СобратьСообщениеПакетаДанныхИзКоллекции(ПараметрыСборки);
				
				SUI_ОбщегоНазначенияКлиентСервер.Проверить(Пакеты.Количество() > 0,
					НСтр("ru = 'Не удалось собрать пакет данных'"));
				
				ДанныеСообщенияПриемник.Данные = Пакеты[0];
				
			КонецЕсли;
			
			ДополнительныеПараметрыЗаписи = Новый Структура("МеткаВремени, ДатаЗаписи, Сворачивать");
			ЗаполнитьЗначенияСвойств(ДополнительныеПараметрыЗаписи, ДанныеСообщенияПриемник);
			
			// Обновить данные сообщения Приемник
			Если РегистрыСведений.SUI_СообщенияОбменаДанными.ОбновитьСообщение(ДанныеСообщенияПриемник.ID, ДанныеСообщенияПриемник) Тогда
				
				// Удалить сообщение Источник
				РегистрыСведений.SUI_СообщенияОбменаДанными.Удалить(ДанныеСообщенияИсточник.ID, 
					ДанныеСообщенияИсточник.Отправитель, ДанныеСообщенияИсточник.Получатель);
				
				// Записать остатки пакетов
				Для индекс = 1 По Пакеты.ВГраница() Цикл
					
					ДополнительныеПараметрыЗаписи.МеткаВремени = ДополнительныеПараметрыЗаписи.МеткаВремени+1;
					
					РегистрыСведений.SUI_СообщенияОбменаДанными.Создать(ПараметрыСборки.Отправитель, 
						ПараметрыСборки.Получатель, Пакеты[индекс], ПараметрыСборки.Приоритет, ПараметрыСборки.ВидДанных,
						ДополнительныеПараметрыЗаписи);
					
				КонецЦикла;
				
			КонецЕсли;
			
			//@skip-check query-in-loop
			РезультатЗапроса = Запрос.Выполнить();
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИмяСобытия(ВложенноеСобытие = "") Экспорт
	Возврат НСтр("ru = 'Сообщения обмена данными'") + ?(ПустаяСтрока(ВложенноеСобытие), "", ". " + ВложенноеСобытие);
КонецФункции

Функция СостоянияМобильныхУстройствДляСвертки()
	
	Возврат SUI_ОбщегоНазначенияКлиентСервер.МассивЗначений(
		Перечисления.SUI_СостоянияМобильныхУстройств.Выгружено,
		Перечисления.SUI_СостоянияМобильныхУстройств.ТребуетсяПолучитьДанные,
		Перечисления.SUI_СостоянияМобильныхУстройств.Ошибка);
	
КонецФункции

#Область ВходящиеСообщения

Процедура УдалитьОбработанныеВходящиеСообщения(СрокХранения)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	СообщенияОбменаДанными.ID,
		|	СообщенияОбменаДанными.Отправитель,
		|	СообщенияОбменаДанными.Получатель
		|ИЗ
		|	РегистрСведений.SUI_СообщенияОбменаДанными КАК СообщенияОбменаДанными
		|ГДЕ
		|	СообщенияОбменаДанными.ВидДанных = ЗНАЧЕНИЕ(Перечисление.SUI_ВидыДанныхСообщенийОбменаДанными.Значение)
		|	И СообщенияОбменаДанными.Обработано <> ДАТАВРЕМЯ(1, 1, 1)
		|	И СообщенияОбменаДанными.Обработано < &ДатаОбработкиКонец
		|	И НЕ СообщенияОбменаДанными.Отправитель.ЭтотУзел
		|	И СообщенияОбменаДанными.Получатель.ЭтотУзел
		|
		|УПОРЯДОЧИТЬ ПО
		|	СообщенияОбменаДанными.Приоритет УБЫВ,
		|	СообщенияОбменаДанными.МеткаВремени";
	
	Запрос.УстановитьПараметр("ДатаОбработкиКонец", ТекущаяДатаСеанса() - СрокХранения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Пока Не РезультатЗапроса.Пустой() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.SUI_СообщенияОбменаДанными");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ID", "ID");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Отправитель", "Отправитель");
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Получатель", "Получатель");
			Блокировка.Заблокировать();
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				НаборЗаписей = РегистрыСведений.SUI_СообщенияОбменаДанными.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.ID.Установить(Выборка.ID);
				НаборЗаписей.Отбор.Отправитель.Установить(Выборка.Отправитель);
				НаборЗаписей.Отбор.Получатель.Установить(Выборка.Получатель);
				
				НаборЗаписей.ОбменДанными.Загрузка = Истина;
				НаборЗаписей.Записать(Истина);
				
			КонецЦикла;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			Ошибка = ИнформацияОбОшибке();
			SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(), , , , Ошибка);
			ТекстОшибки = НСтр("ru = 'Ошибка удаления устаревших результатов обработки сообщений обмена данными!'");
			ВызватьИсключение(ТекстОшибки,,,, Ошибка)
		КонецПопытки;
		
		//@skip-check query-in-loop
		РезультатЗапроса = Запрос.Выполнить();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьВходящиеСообщения()
	
	СрокХранения = 60 * 60 * 24 * ПолучитьФункциональнуюОпцию("SUI_СрокХраненияРезультатовОбработкиВходящихСообщенийОбмена");
	СрокХранения = SUI_ОбщегоНазначения.ОписаниеТипаЧисло(6, , ДопустимыйЗнак.Неотрицательный).ПривестиЗначение(СрокХранения);
	
	УдалитьОбработанныеВходящиеСообщения(СрокХранения);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 100
		|	СообщенияОбменаДанными.ID,
		|	СообщенияОбменаДанными.Отправитель,
		|	СообщенияОбменаДанными.Получатель,
		|	СообщенияОбменаДанными.Данные
		|ИЗ
		|	РегистрСведений.SUI_СообщенияОбменаДанными КАК СообщенияОбменаДанными
		|ГДЕ
		|	СообщенияОбменаДанными.ВидДанных = ЗНАЧЕНИЕ(Перечисление.SUI_ВидыДанныхСообщенийОбменаДанными.Значение)
		|	И СообщенияОбменаДанными.Обработано = ДАТАВРЕМЯ(1, 1, 1)
		|	И НЕ СообщенияОбменаДанными.Отправитель.ЭтотУзел
		|	И СообщенияОбменаДанными.Получатель.ЭтотУзел
		|
		|УПОРЯДОЧИТЬ ПО
		|	СообщенияОбменаДанными.Приоритет УБЫВ,
		|	СообщенияОбменаДанными.МеткаВремени";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Пока Не РезультатЗапроса.Пустой() Цикл
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ДанныеОбработки = Новый Структура();
			ДанныеОбработки.Вставить("Обработано");
			ДанныеОбработки.Вставить("СообщенияОбработки");
			ДанныеОбработки.Вставить("ОшибкаОбработки");
			
			Попытка
				ПолучитьСообщенияПользователю(Истина);
				ОбработатьДанныеВходящегоСообщения(Выборка.Данные.Получить());
			Исключение
				ДанныеОбработки.ОшибкаОбработки = ИнформацияОбОшибке();
				SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(ИмяСобытия(), , , , ДанныеОбработки.ОшибкаОбработки);
			КонецПопытки;
			
			ДанныеОбработки.СообщенияОбработки = ПолучитьСообщенияПользователю(Истина);
			ДанныеОбработки.Обработано = ТекущаяДатаСеанса();
			
			Если СрокХранения = 0 Тогда
				РегистрыСведений.SUI_СообщенияОбменаДанными.Удалить(Выборка.ID, Выборка.Отправитель, Выборка.Получатель);
			Иначе
				РегистрыСведений.SUI_СообщенияОбменаДанными.ОбновитьСообщение(Выборка.ID, ДанныеОбработки);
			КонецЕсли;
			
		КонецЦикла;
		
		//@skip-check query-in-loop
		РезультатЗапроса = Запрос.Выполнить();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьДанныеВходящегоСообщения(ДанныеСообщения)
	
	ИмяМетода = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеСообщения, 
		"Обработчик", "", Тип("Строка"));
	
	Если ПустаяСтрока(ИмяМетода) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыМетода = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеСообщения, 
		"Параметры", Новый Массив(), Тип("Массив"));
	
	Попытка
		ОбщегоНазначения.ВыполнитьМетодКонфигурации(ИмяМетода, ПараметрыМетода);
	Исключение
		ВызватьИсключение(НСтр("ru = 'Ошибка обработки данных входящего сообщения обмена данными!'"), , , , ИнформацияОбОшибке());
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область ИсходящиеСообщения

Процедура СформироватьИсходящиеСообщения()
	
	СостоянияЗапросаПолнойВыгрузки = РегистрыСведений.SUI_СостоянияМобильныхУстройств.СостоянияМобильныхУстройств(
		Новый Структура("Состояние", Перечисления.SUI_СостоянияМобильныхУстройств.ЗапросПолнойВыгрузки), Истина);
	
	// Запустить в фоне формирование сообщений пакетов данных полной выгрузки
	Если Не СостоянияЗапросаПолнойВыгрузки.Пустой() Тогда
		
		ПараметрыВыполнения 							= ДлительныеОперации.ПараметрыВыполненияВФоне();
		ПараметрыВыполнения.КлючФоновогоЗадания 		= Новый УникальныйИдентификатор("33c30293-95a3-402d-9b80-621bade9ed03");
		ПараметрыВыполнения.НаименованиеФоновогоЗадания = СтрШаблон(НСтр("ru = '%1: Выполнение полной выгрузки'"), SUI_SimpleКлиентСервер.Представление());
		ПараметрыВыполнения.ОжидатьЗавершение 			= 0;
		ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
		ПараметрыВыполнения.СРасширениямиБазыДанных 	= Истина;
		
		ДлительныеОперации.ВыполнитьВФоне("SUI_ПакетыДанных.ВыполнитьЗаданиеСформироватьПакетыДанныхСообщений", 
			Новый Структура("ЭтоПолнаяВыгрузка", Истина), ПараметрыВыполнения);
		
	КонецЕсли;
	
	// Выполнить формирование сообщений пакетов данных по изменениям
	SUI_ПакетыДанных.ВыполнитьЗаданиеСформироватьПакетыДанныхСообщений(Неопределено, Неопределено);

КонецПроцедуры

#КонецОбласти

#КонецОбласти
